// ==UserScript==
// @name        楼主你玩贴吧开心吗？
// @namespace   荆棘的思念
// @description 一个让楼主玩贴吧格外开心的工具 OwO
// @include     *tieba.baidu.com/p/*pn=0*
// @include     *tieba.baidu.com/*error*
// @version     2.3
// @grant       none
// @downloadURL https://update.greasyfork.org/scripts/10010/%E6%A5%BC%E4%B8%BB%E4%BD%A0%E7%8E%A9%E8%B4%B4%E5%90%A7%E5%BC%80%E5%BF%83%E5%90%97%EF%BC%9F.user.js
// @updateURL https://update.greasyfork.org/scripts/10010/%E6%A5%BC%E4%B8%BB%E4%BD%A0%E7%8E%A9%E8%B4%B4%E5%90%A7%E5%BC%80%E5%BF%83%E5%90%97%EF%BC%9F.meta.js
// ==/UserScript==
var chicken_soup_list = [
  '我以为小鸟飞不过沧海，是以为小鸟没有飞过沧海的勇气，十年以后我才发现，不是小鸟飞不过去，而是沧海的那一头，早已没有了等待……',
  '你走的那天，我决定不掉泪，迎着风撑着眼帘用力不眨眼……',
  '多谢你的绝情，让我学会死心……',
  '带著一根烟.浪迹天涯……',
  '木头对火说:“抱我”!火拥抱了木头`木头微笑着化为灰烬!火哭了!泪水熄灭了自己……当木头爱上烈火注定会被烧伤……',
  '当眼泪流下来，才知道，分开也是另一种明白。',
  '我真的爱你，闭上眼，以为我能忘记，但流下的眼泪，却没有骗到自己……',
  '回家的路上我哭了，眼泪再一次崩溃孓.无能为力这样走着，再也不敢骄傲奢求了。我还能够说些什么，我还能够做些什么？我好希望你会听见，因为爱你我让你走了……',
  '不要轻易说爱，许下的承诺就是欠下的债！',
  '是我的终究是我的`我终归是你的一个过客`你始终不爱我`注定我和你就是什么都不会发生`注定`注定只是注定`不管我怎么跨越不管我怎么想靠近你`你还是会离开我的`我好想你`好想好想你`好想好想见你',
  '脸上的快乐，别人看得到。心里的痛又有谁能感觉到.',
  '分手后不可以做朋友,因为彼此伤害过.不可以做敌人.因为彼此深爱过,所以我们变成了最熟悉的陌生人.',
  '有的人与人之间的相遇就像是流星,瞬间迸发出令人羡慕的火花,却注定只是匆匆而过.',
  '时间会慢慢沉淀，有些人会在你心底慢慢模糊。学会放手，你的幸福需要自己的成全。?',
  '我能感觉到你的心痛，你有你说不出的无奈...但是你做出一副无所谓的样子，你越是这样我就越难受`',
  '有些的时候，正是为了爱才悄悄躲开.躲开的是身影，躲不开的却是那份默默的情怀。',
  '爱到分才显珍贵，很多人都不懂珍惜拥有.只到失去才看到，其实那最熟悉的才是最珍贵的.',
  '有时，爱也是种伤害.残忍的人，选择伤害别人，善良的人，选择伤害自己.',
  '你走了，带着我全部的爱走了，只是一句分手.我忍着眼泪看着你的背影，好想最后在抱你一次，好想在对你说一次“我爱你”',
  '淋过雨的空气，疲倦了的伤心，我记忆里的童话已经慢慢的融化.',
  '既然爱，为什么不说出口，有些东西失去了，就在也回不来了！',
  '相爱是种感觉，当这种感觉已经不在时，我却还在勉强自己，这叫责任！分手是种勇气！当这种勇气已经不在时，我却还在鼓励自己，这叫悲壮！-',
  '人生不止，寂寞不已。寂寞人生爱无休，寂寞是爱永远的主题.我和我的影子独处.它说它有悄悄话想跟我说.它说它很想念你^原来`我和我的影子`都在想你`',
  '在完美的彼岸刚刚上演了一场悲剧，所有的血与泪在枯萎的荆棘蕴育出一个花蕾，它将经历轮回的七场雷雨，然后绽放在潮湿的空气中……',
  '鱼上钩了，那是因为鱼爱上了渔夫，它愿用生命来博渔夫一笑……',
  '喜欢在你身上留下属於我的印记，却不曾记起你从未属於过我……如果有一天，不再喜欢你了，我的生活会不会又像从前那样堕落，颓废…我不想再要那样的生活，所以，在我还没有放弃你之前，请你,至少要喜欢上我……',
  '其实我一直在你身边守候,等你靠在我肩上诉说,会不会有那么一天,你的温柔都属于我,我不会再让你难过,让你的泪再流!',
  '你当我是个风筝,要不把我放了,要不然收好带回家,别用一条看不见的情思拴着我,让我心伤.',
  '窗外下着雪，泡一杯咖啡，握到它凉了，才知道又想起了你。我的期待你如何才能明白！',
  '第一次哭是因为你不在，第一次笑是因为遇到你，第一次笑着流泪是因为不能拥有你！',
  '岁月就象一条河，左岸是无法忘却的回忆，右岸是值得把握的青春年华，中间飞快流淌的，是年轻隐隐的伤感。世间有许多美好的东西，但真正属于自己的却并不多。看庭前花开花落，荣辱不惊，望天上云卷云舒，去留无意。在这个纷绕的世俗世界里，能够学会用一颗平常的心去对待周围的一切，也是一种境界。',
  '我们的生活有太多无奈，我们无法改变，也无力去改变，更糟的是，我们失去了改变的想法……',
  '看庭前花开花落，荣辱不惊，望天上云卷云舒，去留无意。',
  '在这个纷绕的世俗世界里，能够学会用一颗平常的心去对待周围的一切，也是一种境界。',
  '人生最遗憾的,莫过于,轻易地放弃了不该放弃的,固执地,坚持了不该坚持的……',
  '简单安静的生活其实不幸福`所以我只拥抱刹那`绵延持久的感觉根本不快乐`所以我只信仰瞬间``',
  '有些失去是注定的,有些缘分是永远不会有结果的.爱一个人不一定会拥有,拥有一个人就一定要好好去爱她……',
  '心已死,泪也干,不堪回首魂亦牵.梦惊醒,不了情,往事如烟挥不去.亦虚亦实,亦爱亦恨,叶落无声花自残.只道是,寻寻觅觅,冷冷清清,凄凄惨惨戚戚;却无奈,天长地久有时尽,此恨绵绵无绝期.',
  '世界上没有任何东西可以永恒。如果它流动，它就流走；如果它存著，它就干涸；如果它生长，它就慢慢凋零。',
  '一个做女人的痛苦:当她和她所爱的男人有了肉体关系以后，她就很自然地把这种关系视为一种永远，但男人却可以不同，他们可能只会觉得那是生存方式的又一种演绎。正如书上说的：男女之间，在没有婚姻的承诺前，还是保持简单的关系为好，否则，真的没有岁月可以回头.',
  '如果，不幸福，如果，不快乐，那就放手吧；如果，舍不得、放不下，那就痛苦吧。',
  '人生短短几十年，不要给自己留下了什么遗憾，想笑就笑，想哭就哭，该爱的时候就去爱，无谓压抑自己。人生的苦闷有二，一是欲望没有被满足，二是它得到了满足。',
  '所谓花心，就是有了爱情和面包，还想吃蛋糕的心情；所谓外遇，就是潜出围城，跌入陷阱；所谓浪漫，就是帮老婆买包心菜时，还会顺手带回一支玫瑰花；所谓厨房，就是结婚时红地毯通向的正前方……',
  '不敢说出口,因为我胆小,因为如果你拒绝,我以后就不能够再见到你了,宁愿默默的爱着你,不能让你知道,直到,直到你投进别人的环抱!',
  '一个人想事好想找个人来陪。一个人失去了自己。不知还有没有要在追的可望。',
  '这个世界就这么不完美。你想得到些什么就不得不失去些什么。',
  '恋爱，在感情上，当你想征服对方的时候，实际上已经在一定程度上被对方征服了。首先是对方对你的吸引，然后才是你征服对方的欲望。',
  '我放下了尊严，放下了个性，放下了固执，都只是因为放不下你。',
  '如果爱上，就不要轻易放过机会。莽撞，可能使你后悔一阵子；怯懦，却可能使你后悔一辈子。',
  '没有经历过爱情的人生是不完整的，没有经历过痛苦的爱情是不深刻的。爱情使人生丰富，痛苦使爱情升华。',
];

chicken_soup_list.get = function(){
  return this[parseInt((Math.random()*1000+1)%this.length)-1];
};

console.log('script strat!');
$(document).ready(function () {
  var $ = window.jQuery;
  $('html, body').animate({
    scrollTop: $(document).height()
  }, 1000);
  setTimeout(function () {
    setTimeout(function () {
      if (/error/.test(location.href))
        location.href = document.referrer;
      else
        location.reload();
    }, 3000);
    var x = $('#ueditor_replace');
    var input = x.children('p');
    var submit = $('a.poster_submit');
    input.html((location.hash.substr(1) + ' ' || '')+ chicken_soup_list.get());
    submit.click();
  }, 10000);
});

