// ==UserScript==
// @name        Superfluous
// @description Removes superfluous news
// @namespace   lainscripts_scissors
// @include     http://ru.reuters.com/*
// @version     1.0
// @grant       none
// @downloadURL https://update.greasyfork.org/scripts/16797/Superfluous.user.js
// @updateURL https://update.greasyfork.org/scripts/16797/Superfluous.meta.js
// ==/UserScript==

var a = document.querySelectorAll('.standalone.headlineMed');
var words = /РФ|Азербайджан*|Кремл*|ЦБР|Рубл*|Северстал*|рубл*| р |Росси*|Норникел*|Росимуществ*|Sukhoi|Роснефт*|РТС|Газпром*|Туркмени*|Киргизи*|Путин*|Казахстан*|Украин*|Лукойл*|Самотлор*|Казахск*|российск*|Магнит*|X5|Лент*|ВТБ|Почт*|Алрос*|Ютэйр*|Молдави*|Грузи*|Югр*|Глобэкс*|Связь-банк*|Мираторг*|Ростех*|E.ON|Полюс Золот*|ВЭБ*|Сбербанк*|Московск*|Русская аквакультур*|Полиметалл*|Трансконтейнер*|Казмунайгаз*|Казкоммерцбанк*|Русгидр*|РАО|ЛСР|ПИК*|Шереметьев*|Евраз*|Белорусси*|Укрсоцбанк*|Росстандарт*|Порошенко|Уралкали*|Армени*|ОМК|ИФК|Red Wings|Аэрофлот*|Новатэк*|россиян*|РЖД|Ямал*|АФК|Баку|Мосбирж*|Фосагр*|Мечел*|Медведев*|Лукашенк*|КНДР*|ИГИЛ*|Русагр*|Киев*|Донбас*|Таджикистан*|Русал*|СНГ|Владивосток*|Бастрыкин*|Автоваз*|Еврохим*|Сторчак*|Минск*|36,6|А5|Казатомпром*|Мать и дитя|Назарбаев*|Домодедов*|Узбекистан*|СССР|Алма-Ат*|Юнимилк*|Детский мир|Башнефт*|Тинькофф|S7|Внешпромбанк*|Крым*|украинск*|ТМК*|Астан*|Юлмарт*|Автоваз*|Савченк*|Enel Russia|Халык-Банк*|Юникредит*|Home Credit|Казтрансойл*|Черкизов*|Металлоинвест*|Мегафон*|Су-155|O1 Group|Уралсиб*|ФУТБОЛ|Набиуллин*|Эталон*|Банк Санкт|банка Санкт|Сахалин*|Голодец|Топилин*|Окей|НЛМК|М.Видео|Беларуськали*|МДМ-банк*|РусГидр*|Ozon.ru|АБР|Сибур*|Росатом*|Global Ports|ММК|Альфа-банк*|НМТП|ФСК|Россет*|Банк Возрождени*|МОЭСК*|Евросибэнерго|Иркутскэнерго|Транснефт*|Систем*|Детск*|Дворкович*|ММВБ|ЦКАД*|ЧТПЗ|Таджикск*|Росстат*|Эльдорад*|Росинтер*|Силы Сибир*|Татнефт*|РД КМГ|KAZ Minerals|Возрождени*|Петропавловск*|Сечин*/;
for (var i=0;i<a.length;i++) if (words.test(a[i].innerHTML))
    a[i].parentNode.removeChild(a[i]);