// ==UserScript==
// @name           Virtonomica: Sale-envd
// @version        1.08
// @namespace      http://virtonomic*.*/*/main/unit/view/*/sale
// @description    Установка цены на производстве по ставке ЕНВД
// @include        *virtonomic*.*/*/main/unit/view/*/sale*
// @include        *virtonomic*.*/*/main/geo/regionENVD/*
// @downloadURL https://update.greasyfork.org/scripts/18108/Virtonomica%3A%20Sale-envd.user.js
// @updateURL https://update.greasyfork.org/scripts/18108/Virtonomica%3A%20Sale-envd.meta.js
// ==/UserScript==

var run = function() {
	var win = (typeof unsafeWindow != 'undefined' ? unsafeWindow : top.window);

	$ = win.$;

	var url = window.location.href;
	if (url.indexOf("regionENVD") != -1) { // сохраняем новые товары
		if (typeof(localStorage) !== "undefined") { // поддерживается хранилище
			$('table.list>tbody>tr').each(function() {
				if ($(this).hasClass("odd") || $(this).hasClass("even")) {
					$('td:contains("%")', this).each(function() {
						var aaa = $(this).prev();
						var name = aaa.prop("textContent");
						var envd = $(this).prop('textContent').slice(0,-2);
						localStorage.setItem("saved ENVD " + name, envd);
					});
				}
			});
		}
	} else if (!(/(?:Склад)/.test($('div[class*="officePlace"]').prop('textContent')))) { // если не склад
		//arr_envd - массив ставок ЕНВД, при изменении сохранять в Unicode
		var arr_envd={
"Краковская колбаса":15,"VAZ 2106":100,"Обувь Abibas":20,"Lambardy":5,"Virtonomica Times":15,"ПБП ":5,'ПБП "Минутка"':5,"Девяточка":100,"Малиновый пиджак":20,"Могучая Мышь":20,"Сигареты Друг":20,
"Алмазы":100,"Бокситы":100,"Глина":100,"Древесина":30,"Железная руда":100,"Золото":100,"Кремний":100,"Марганец":100,"Медный колчедан":100,"Нефть":100,"Полиметаллическая руда":100,"Природные минералы":100,"Титановая руда":100,"Уголь":100,"Хром":100,
"LED":20,"Авиадвигатель":10,"Авиашасси":10,"Авионика":10,"Автозапчасти":20,"Алюминий":20,"Бумага":5,"Двигатель":15,"Зеркальный лист":20,"Интерьер самолета":10,"Кожа":5,"Комплектующие":20,"Корпус яхты":15,"Косметическое масло":20,"Краска":5,"Литий":10,"Литий-ионный аккумулятор":15,"Медь":20,"Микропроцессор":20,"Натуральные лекарственные компоненты":20,"Оснащение яхты":15,"Отходы хлопчатника":10,"Парфюмерная эссенция":20,"Пластмасса":10,"Резина":10,"Рыболовная сеть":10,"Сверхлёгкий алюминиевый сплав":20,"Светочувствительная матрица":20,"Секция фюзеляжа":10,"Синтетическая ткань":5,"Синтетические лекарственные компоненты":20,"Сталь":10,"Стекло":20,"Термоэлемент":15,"Титан":20,"Ткань":20,"Углепластик":10,"Химикаты":20,"Хлопковая ткань":20,"Хлопковое волокно":10,"Цинк":10,"Шерсть":20,"Электронные компоненты":20,"Электропривод":15,"Элементы авиакрыла":10,"Элементы авиаоперения":10,"Этанол":20,
"Воск":10,"Вощина":10,"Зерно":10,"Какао":10,"Картофель":10,"Комбикорм":10,"Кормовые культуры":10,"Кофе":10,"Кукуруза":5,"Маточное молочко":20,"Молоко":15,"Мясо":20,"Мёд":10,"Оливки":10,"Подсолнечник":15,"Помидоры":5,"Рыбная мука":10,"Сахар":10,"Табак":5,"Фрукты":5,"Хлопок":10,"Цветы и эфиромасличные культуры":5,"Чайный лист":5,"Яйца":15,
"Бурбон":10,"Джем":10,"Зеленый чай":10,"Кисель":10,"Колбасные изделия":15,"Кондитерские изделия":15,"Консервированная кукуруза":15,"Консервированные оливки":15,"Консервы":15,"Конфеты":10,"Красная икра":20,"Кукурузная мука":10,"Кукурузные хлопья":5,"Ликер":10,"Макаронные изделия":5,"Масло":10,"Молочные продукты":10,"Мороженое":15,"Мука":10,"Натуральный кофе":20,"Оливковое масло":20,"Печень трески":15,"Пиво":10,"Продукты быстрого приготовления":5,"Прохладительные напитки":10,"Пуэр":50,"Растворимый кофе":5,"Рыбные деликатесы":20,"Рыбные консервы":15,"Сок":10,"Соусы":5,"Специи":5,"Спиртные напитки":10,"Сыр":10,"Сыр фета":10,"Фри":10,"Фруктовый чай":10,"Хлеб":10,"Черная икра":50,"Черный чай":10,"Чипсы":5,"Шоколад":10,"Энергетические напитки":10,
"GPS-навигаторы":20,"LED-телевизоры":50,"USB-флэш-накопитель":20,"Автомобиль":100,"Автомобильное сиденье":15,"Автомобильные багажники":20,"Автомобильные диски":20,"Автосигнализация":20,"Антифриз":20,"Аудиотехника":50,"Бейсболка":20,"Бижутерия":20,"Бриллианты":30,"Бронзовый декор":30,"Бытовая химия":20,"Велосипед":20,"Верхняя одежда":20,"Внедорожник":100,"Водный скутер":30,"Газонокосилка":20,"Гриль для дачи":20,"Деловая одежда":20,"Детская коляска":20,"Детская кроватка":5,"Детское питание":15,"Джинсы":20,"Душевые кабинки":5,"Жемчужные украшения":50,"Заварочный чайник":20,"Зеркало":20,"Зонт":20,"Игровые консоли":50,"Игрушки":20,"Канцтовары":20,"Керамическая посуда":20,"Книги":15,"Кованая садовая мебель":30,"Ковер":20,"Кожгалантерея":20,"Компьютер":30,"Компьютерные аксессуары":20,"Кондиционер":50,"Консервированный корм для животных":15,"Косметика":15,"Кофе-машина":50,"Кузовные запчасти":20,"Кухонная мебель":20,"Кухонные плиты":50,"Мебель":20,"Мобильный телефон":20,"Моторное масло":20,"Мотоцикл":30,"Нижнее белье":20,"Носки":10,"Ноутбук":30,"Обувь":20,"Одежда":20,"Одежда для малышей":20,"Одеяло":20,"Омыватель стекол":20,"Парфюмерия":20,"Планшет":30,"Подарки и Сувениры":20,"Подгузники":10,"Полотенце":20,"Пончо":20,"Посуда":20,"Посудомоечные машины":50,"Пресса":15,"Принтер":30,"Пылесос":50,"Радионяня":10,"Развивающие игрушки":20,"Садовый декор":20,"Садовый инвентарь":20,"Сантехника":20,"Сапоги":20,"Светильник":20,"Светодиодная лампа":15,"Седан":100,"Сигареты":20,"Сигары":10,"Сковородки":20,"Смартфон":20,"Сомбреро":20,"Спальная мебель":20,"Спорт-кар":100,"Спортинвентарь":20,"Стиральные машины":50,"Столовое и постельное бельё":20,"Сумки и портфели":20,"Сухой корм для животных":15,"Телевизоры":50,"Товары для творчества":20,"Тренажер":20,"Утюг":20,"Фен":20,"Фототехника":20,"Холодильники":50,"Цифровая видеокамера":20,"Цифровой фотоаппарат":20,"Чайник":20,"Часы":30,"Чистящие средства":20,"Шины":20,"Электроинструмент":20,"Электромобиль":100,"Элемент питания":15,"Ювелирные украшения":50,
"Гормональные препараты":10,"Косметические маски":20,"Лекарственные травы":20,"Медицинский антисептик":10,"Медицинский инструментарий":20,"Никотиновый пластырь":15,"Природные лекарства":20,"Рыбий жир":20,"Синтетические лекарства":10,"Спортивное питание":10,"Средства гигиены":20,"Электронный тонометр":20,
"IT-оборудование":30,"Автозаправочное оборудование":30,"Авторемонтное оборудование":30,"Гелиостат":30,"Горно-шахтное оборудование":30,"Интерьер дошкольных учреждений":30,"Коммуникационное оборудование":30,"Мазутный энергоблок":30,"Медицинское оборудование":30,"Мусороприёмное оборудование":30,"Мусоросжигательный энергоблок":30,"Парикмахерское оборудование":30,"Паровая турбина":30,"Паровой котёл":30,"Пилорама":30,"Прибор":30,"Ресторанное оборудование":30,"Рыболовецкий траулер":30,"Серверная платформа":30,"Система очистки дымовых газов":30,"Солнечный энергоблок":30,"Станок":30,"Теплообменное оборудование":30,"Топливное оборудование":30,"Топливораздаточная колонка":30,"Трактор":30,"Угольная мельница":30,"Угольный энергоблок":30,"Узкофюзеляжный самолет":10,
"Жемчуг":100,"Крабы":20,"Лосось":20,"Осетр":10,"Промысловая рыба":20,"Треска":20,"Устрицы":20,
"Домашняя птица":20,"Коровы":20,"Овцы":20,"Пчёлы":20,"Свиньи":20,
"Арт декор":30,"Интерьер яхты":100,"Шагрень":15,"Яхта":100,
"Бензин Нормаль-80":100,"Бензин Премиум-95":100,"Бензин Регуляр-92":100,"Дизельное топливо":100,"Мазут":100
		};
		$('table.grid>tbody>tr:gt(0)').each(function() {
			var imgObj = $('img[src*="products"]', this);
			var altt=imgObj.attr('alt');
			var curEnvd = arr_envd[altt];
			if (typeof(localStorage) !== "undefined") {
				var EnvdFromStorage = localStorage.getItem("saved ENVD " + altt);
				if (EnvdFromStorage != null) {
					curEnvd = parseInt(EnvdFromStorage);
				}
			}
			if (curEnvd == null) {
				return;
			}
			var str1 = $('td.nowrap td:contains("Себестоимость")',this).next().prop('textContent');
			var sbst = (str1.slice(0, 1) == "$" ? str1 : $('td[align*="right"] td:contains("Себестоимость")',this).next().prop('textContent')).replace(/[^\d\.]/g,'');
			var btn = $('<td><button id="btn1"></button></td>');
			btn.insertBefore($('input.money[name*="[price]"]',this));
			$('button#btn1',this).prop('textContent',"ЕНВД " + curEnvd).click(function() {
				var price = (sbst*(1+curEnvd/100));
				btn.next().attr('value', price.toFixed(2));
				if (price < 0.01) {
					$('option:contains("Не продавать")', btn.parent().next()).prop('selected', true);
				} else {
					$('option:contains("Только своей компании")', btn.parent().next()).prop('selected', true);
				}
				$('input[value="Сохранить изменения"]').click();
				return false;
			});
		});
	}
}

// Хак, что бы получить полноценный доступ к DOM >:]
var script = document.createElement("script");
script.textContent = '(' + run.toString() + ')();';
document.documentElement.appendChild(script);
