// ==UserScript==
// @name         Fate/Grand Order @wiki 【FGO】 translate
// @namespace    https://greasyfork.org/zh-CN/scripts/27379-fate-grand-order-wiki-fgo-translate
// @version      2.4.1.20180404
// @icon         https://lh3.googleusercontent.com/TSst6F-PkOtThWjeSOS-12_vQv6X7ybf1LZNecS4SALYmNoaUavtwlpVKL3UyZWQfg
// @description  Fate/Grand Order @wiki 【FGO】 文本替换式翻译
// @author       AgLandy
// @include      /^https?:\/\/(www9\.atwiki\.jp\/f_go|appmedia\.jp\/fategrandorder|grand_order\.wicurio\.com).*/
// @match        https://docs.google.com/spreadsheets/d/1*
// @match        https://docs.google.com/spreadsheets/d/e/2PACX-1vS*
// @grant        none
// @require      http://cdn.bootcss.com/lazysizes/4.0.0-rc4/lazysizes.min.js
// @downloadURL https://update.greasyfork.org/scripts/27379/FateGrand%20Order%20%40wiki%20%E3%80%90FGO%E3%80%91%20translate.user.js
// @updateURL https://update.greasyfork.org/scripts/27379/FateGrand%20Order%20%40wiki%20%E3%80%90FGO%E3%80%91%20translate.meta.js
// ==/UserScript==

/*
如有问题请到这里 “ http://bbs.ngacn.cc/read.php?tid=11000111 ” 反馈
*/

(function(){

    if(typeof jQuery == 'undefined'){
        let s = document.createElement('script');
        s.type = 'text/javascript';
        s.src = 'https://cdn.bootcss.com/jquery/3.2.1/jquery.min.js';
        s.onload = s.onreadystatechange = function(){
            if(!this.readyState || 'loaded' === this.readyState || 'complete' === this.readyState){
                main(jQuery.noConflict());
                this.onload = this.onreadystatechange = null;
            }
        };
        document.head.appendChild(s);
    }
    else
        main(jQuery);

    function main($){

        if(!window.atwikiTransToCN)
            atwikiTransToCN = {};
        let aT = atwikiTransToCN;

        //  ↓  翻译数据

        aT.data = {

            //综合
            "開催中":"进行中",
            "復刻":"复刻",
            "トップページ":"首页",
            "情報まとめページ":"情报摘要页面",
            "よくある質問":"常见问题",
            "メニュー":"菜单",
            "初心者ガイド":"新手指南",
            "イベント":"活动",
            "キャンペーン":"事件",
            "イベント情報":"活动情报",
            "キャンペーン情報":"事件情报",
            "ピックアップ召喚":"推荐召唤",
            "ピックアップ召喚とは":"推荐召唤是什么",
            "ピックアップの区分け":"推荐召唤的分类",
            "ピックアップ":"PickUp",
            "期間限定サーヴァント一覧":"限时登场从者一览",
            "男性サーヴァント":"男性从者",
            "女性サーヴァント":"女性从者",
            "クエスト":"关卡",
            "クエストクリア":"任务通关",
            "メインシナリオ":"主线剧情",
            "シナリオ":"剧情",
            "シナリオクエスト":"剧情任务",
            "ストーリー":"Story",
            "メインクエスト":"主线任务",
            "メインクエスト一覧":"主线任务一览",
            "まとめ":"摘要",
            "フリークエスト":"Free本",
            "フリー":"Free",
            "フリークエスト一覧":"Free本一览",
            "ドロップアイテム":"掉落物品",
            "ドロップまとめ":"掉落摘要",
            "ドロップ":"掉落",
            "エネミードロップ":"敌方掉落",
            "サーヴァントクエスト":"从者任务",
            "魔術礼装クエスト":"魔术礼装任务",
            "常設":"常驻",
            "期間限定":"限时",
            "体験クエスト":"体验任务",
            "記念クエスト":"纪念任务",
            "サーヴァント強化クエスト":"从者强化任务",
            "スキル":"技能",
            "スキル強化":"技能强化",
            "スキル強化素材":"技能强化素材",
            "スキル名":"技能名称",
            "スキル効果":"技能效果",
            "ランク":"阶级",
            "種別":"种类",
            "効果":"效果",
            "ボイス":"语音",
            "宝具強化":"宝具强化",
            "宝具レベル依存効果":"宝具等级提升效果",
            "オーバーチャージ効果":"OverCharge提升效果",
            "オーバーチャージ":"OverCharge",
            "聖晶石":"圣晶石",
            "報酬":"报酬",
            "報酬内容":"报酬内容",
            "ハンティングクエスト":"狩猎任务",
            "ハント":"狩猎",
            "曜日クエスト":"日常任务",
            "曜日別クエスト一覧":"日别任务一览",
            "修練場":"修炼场",
            "月曜":"周一(月)",
            "火曜":"周二(火)",
            "水曜":"周三(水)",
            "木曜":"周四(木)",
            "金曜":"周五(金)",
            "土曜":"周六(土)",
            "日曜":"周日(日)",
            "弓の修練場":"弓之修炼场",
            "槍の修練場":"枪之修炼场",
            "狂の修練場":"狂之修炼场",
            "騎の修練場":"骑之修炼场",
            "術の修練場":"术之修炼场",
            "殺の修練場":"杀之修炼场",
            "剣の修練場":"剑之修炼场",
            "種火集め":"搜集种火",
            "殺編":"杀篇",
            "騎編":"骑篇",
            "術編":"术篇",
            "ランダム編":"随机篇",
            "宝物庫の扉を開け":"打开宝物库之门",
            "過去の曜日クエスト一覧":"旧版日常任务一览",
            "経験値カード":"狗粮",
            "クエスト内容":"任务内容",
            "サーヴァント":"从者",
            "番号順 一覧":"编号顺序一览",
            "番号順":"编号顺序",
            "クラス別 分類表":"职阶分类表",
            "霊基再臨":"灵基再临",
            "霊基再臨回数":"灵基再临回数",
            "霊基":"灵基",
            "霊基再臨素材":"灵基再临素材",
            "聖杯転臨":"圣杯转临",
            "サーヴァントスキル":"从者技能",
            "性能比較":"性能比较",
            "強化素材":"强化素材",
            "保有スキル":"持有技能",
            "クラススキル":"职阶技能",
            "クラス":"职阶",
            "強化":"强化",
            "隠しステータス":"隐藏属性",
            "ステータス":"属性",
            "プロフィール":"资料",
            "イラストレーター":"画师",
            "声優":"声优",
            "キャラクター詳細":"角色详情",
            "パラメーター":"参数",
            "設定":"设定",
            "アンロック条件":"解锁条件",
            "絆レベルを":"羁绊等级达到",
            "にすると開放":"级时开放",
            "セリフ一覧":"台词一览",
            "召喚":"召唤",
            "レベルアップ":"升级",
            "開始":"开始",
            "宝具カード":"宝具卡",
            "アタック":"攻击",
            "エクストラアタック":"Extra Attack",
            "戦闘不能":"无法战斗",
            "勝利":"胜利",
            "会話":"对话",
            "好きなこと":"喜欢的东西",
            "嫌いなこと":"讨厌的东西",
            "聖杯について":"关于圣杯",
            "イベント開催中":"活动举行中",
            "データ":"数据",
            "絆礼装":"羁绊礼装",
            "マスター":"御主",
            "エネミー":"敌人",
            "エネミーデータ":"敌方数据",
            "サポート":"support",
            "サポートNPC":"助战NPC",
            "クリア":"Clear",
            "コインチョコ集め":"硬币巧克力收集",
            "コインチョコ":"硬币巧克力",
            "チョコサーヴァント":"巧克力从者",
            "シャドウサーヴァント":"影从者",
            "模擬サーヴァント":"模拟从者",
            "アイテム":"物品",
            "アイテム一覧":"素材一览",
            "マスターミッション":"御主任务",
            "ミッション":"任务",
            "ミッション攻略情報":"任务攻略情报",
            "スタッフ":"Staff",
            "セリフまとめ":"台词汇总",
            "サウンドプレイヤー":"音乐鉴赏",
            "アップデート履歴":"更新历史记录",
            "コメントログ":"评论记录",
            "基本情報":"基本信息",
            "配信日":"发行日期",
            "ジャンル":"类型",
            "開発元":"开发组",
            "運営元":"运营组",
            "対応端末":"支持终端",
            "価格":"价格",
            "無料":"免费",
            "一部課金コンテンツあり":"<del><b> 大量 </b></del>部分氪金内容",
            "公式サイト":"官方网站",
            "公式タグ":"官方tag",
            "公式ツイート":"官方twitter",
            "ログインボーナス":"登录奖励",
            "連続":"连续",
            "リセマラ":"刷初始",
            "戦闘":"战斗",
            "フレンド":"friend",
            "フレンドポイント":"友情点",
            "フレンドポイント召喚":"友情点召唤",
            "はじめに":"介绍",
            "システム":"系统",
            "チェイン":"Chain",
            "バスターチェイン":"Buster Chain",
            "アーツチェイン":"Arts Chain",
            "クイックチェイン":"Quick Chain",
            "チェインボーナス":"Chain Bonus",
            "ボーナス":"Bonus",
            "スター":"Star",
            "クリティカル":"Critical",
            "オーバーキル":"Overkill",
            "令呪":"令咒",
            "おすすめ":"推荐",
            "イベント一覧":"活动一览",
            "イベント名":"活动名称",
            "イベント情報まとめ":"活动情报摘要",
            "イベント概要":"活动概要",
            "イベントアイテム":"活动物品",
            "イベントアイテム・報酬":"活动物品・奖励",
            "イベント報酬":"活动奖励",
            "報酬アイテム":"奖励物品",
            "イベント限定報酬":"活动限定奖励",
            "イベント報酬サーヴァント":"活动奖励从者",
            "イベント限定サーヴァント":"活动限定从者",
            "イベント限定アイテム":"活动限定物品",
            "イベント交換アイテム":"活动兑换物品",
            "イベントポイント":"活动点数",
            "イベント期間限定":"活动限定",
            "イベントに効果のあるサーヴァント・礼装まとめ":"活动倍卡英灵・礼装摘要",
            "ポイント":"点数",
            "ダメージポイント":"伤害点数",
            "バレンタイン":"情人节",
            "クリスマス":"圣诞节",
            "マイルーム":"个人空间",
            "プレゼント抽選ラインナップ":"礼品奖池内容",
            "チャレンジ":"挑战",
            "チャレンジクエスト":"挑战任务",
            "レイド":"袭击",
            "パーティー":"Party",
            "パーティ":"Party",
            "ゲリラ":"游击",
            "ミネラルウォーター":"矿泉水",
            "ストロベリーアイス":"草莓冰淇淋",
            "黒猫フィギュア":"黑猫模型",
            "カルデアゲート":"迦勒底之门",
            "エネミー配置まとめ":"敌人配置摘要",
            "クラス構成":"职阶构成",
            "対象クラス":"对应职阶",
            "コメント":"评论",
            "その他":"其他",
            "クエスト名":"任务名称",
            "クリックで表示":"点击查看",
            "表示するにはここをクリック":"点击这里查看",
            "別ページにジャンプ":"跳转到另一个页面",
            "一覧":"一览",
            "成長タイプ":"成长类型",
            "備考":"备注",
            "概念礼装一覧":"概念礼装一览",
            "レア度":"稀有度",
            "限界突破":"突破极限",
            "マスターレベル":"御主等级",
            "マスタースキル":"御主技能",
            "マスタースキル解説・考察":"御主技能说明・查看",
            "共通ステータス":"通用属性",
            "出現クエスト":"出场关卡",
            "対象サーヴァント":"对应从者",
            "レアプリズム交換 ":"金方块兑换",
            "レベル上限":"等级上限",
            "現在のレベル":"当前等级",
            "目標のレベル":"目标等级",
            "現在レベル":"当前等级",
            "目標レベル":"目标等级",
            "レベル":"Level",
            "セイントグラフ":"圣肖像",
            "バトルキャラ":"战斗形象",
            "幕間の物語":"幕间物语",
            "成長タイプと成長率":"成长类型和成长率",
            "強化用素材の獲得EXP":"狗粮获得的经验",
            "別のクラス":"不同职阶",
            "同じクラス":"相同职阶",
            "必要経験値":"必要经验值",
            "経験値テーブル":"经验值表",
            "コマンドカード":"指令卡",
            "バスターカード":"Buster卡",
            "バスター":"Buster",
            "アーツカード":"Arts卡",
            "アーツ":"Arts",
            "クイックカード":"Quick卡",
            "クイック":"Quick",
            "カード":"卡",
            "カードバフ":"卡Buff",
            "ダメージ補正":"伤害补正",
            "ダメージ":"伤害",
            "ダメージバフ":"伤害Buff",
            "バフ":"Buff",
            "デバフ":"Debuff",
            "ダメージアップ":"伤害提升",
            "ダメージダウン":"伤害降低",
            "Class補正":"职阶补正",
            "Class相性":"职阶克制",
            "Servant相性":"从者属性克制",
            "サーヴァント・エネミー特性一覧":"从者克敌特性一览",
            "エネミー特性一覧":"敌方特性一览",
            "各種計算式":"各种计算公式",
            "通常攻撃ダメージ":"普通攻击伤害",
            "宝具ダメージ":"宝具伤害",
            "通常＆宝具ダメージ(修正案: ver1.12計算式)":"普攻＆宝具伤害(修正案: ver1.12计算公式)",
            "攻撃時NP獲得量":"攻击时NP获得量",
            "被ダメージ時NP獲得量":"被伤害时NP获得量",
            "攻撃時スター発生率":"攻击时暴击星发生率",
            "1st/Extraボーナス":"首卡/Ex卡奖励",
            "該当エネミー":"对应的敌人",
            "特攻サーヴァント":"特攻从者",
            "デメリット":"负面效果",
            "レアリティ":"稀有度",
            "エイプリルフール":"愚人节",
            "ショップ":"商店",
            "ゲーム":"游戏",
            "お知らせ":"通知",
            "リセット":"重置",
            "チュートリアル":"教程",

            //技能效果
            "アップ":"提升",
            "ダウン":"下降",
            "チャージ":"Charge",
            "ランダム":"随机",
            "ヒット":"Hit",
            "スキルチャージ":"技能CD",
            "味方強化":"已方强化",
            "ダメージプラス":"伤害附加",
            "ダメージカット":"伤害减免",
            "ガッツ":"<font title='战续'>毅力</font>",
            "ターゲット":"目标",
            "無敵":"无敌",
            "無敵貫通":"无敌贯通",
            "行動不能":"无法行动",
            "魅了":"魅惑",
            "スタン":"晕眩",
            "やけど":"灼烧",
            "呪い":"诅咒",
            "強化無効":"强化无效",
            "効果なし":"无效果",

            //持有技能名称
            "今は脆き雪花の壁":"现为脆弱的雪花之壁",
            "誉れ堅き雪花の壁":"荣光坚毅的雪花之壁",
            "時に煙る白亜の壁":"时为朦胧的白垩之壁",
            "奮い断つ決意の盾":"决意奋起之盾",
            "カリスマ":"领袖气质",
            "直感":"直觉",
            "花の旅路":"花之旅途",
            "頭痛持ち":"头痛宿疾",
            "皇帝特権":"皇帝特权",
            "三度、落陽を迎えても":"纵使三度迎来落日",
            "黄金律":"黄金律",
            "仕切り直し":"重整旗鼓",
            "竜殺し":"屠龙",
            "軍略":"军略",
            "扇動":"煽动",
            "天性の肉体":"天性的肉体",
            "星の紋章":"星之纹章",
            "プレラーティの激励":"普雷拉蒂的激励",
            "自己暗示":"自我暗示",
            "麗しの風貌":"秀丽风情",
            "鷹の瞳":"鹰之瞳",
            "魔術":"魔术",
            "コレクター":"收藏家",
            "バビロンの蔵":"巴比伦的宝藏",
            "破壊工作":"破坏工作",
            "皐月の王":"五月之王",
            "アルカディア越え":"越过阿卡迪亚",
            "追い込みの美学":"逐追的美学",
            "カリュドーン狩り":"卡吕冬狩猎",
            "魅惑の美声":"魅惑的美声",
            "女神のきまぐれ":"女神的反复无常",
            "頑健":"健硕",
            "弓矢作成":"箭矢制作",
            "戦闘続行":"战斗续行",
            "矢避けの加護":"避矢之加护",
            "嗜虐のカリスマ":"嗜虐的魅力",
            "拷問技術":"拷问技术",
            "怨霊調伏":"怨灵调伏",
            "仁王立ち":"仁王立姿",
            "白紙の勧進帳":"白纸的劝进帐",
            "ルーン魔術":"卢恩魔术",
            "獣殺し":"弑兽",
            "殿の矜持":"殿军的矜持",
            "戦士の雄叫び":"战士的雄叫",
            "七つの丘":"七丘",
            "守護騎士":"守护骑士",
            "殉教者の魂":"殉教者之魂",
            "嵐の航海者":"暴风雨的航海家",
            "海賊の誉れ":"海盗的尊严",
            "紳士的な愛":"绅士的爱",
            "女神への誓い":"向女神起誓",
            "アンドラスタの加護":"安德拉斯特的加护",
            "天狗の兵法":"天狗的兵法",
            "燕の早業":"燕之迅捷",
            "紅顔の美少年":"红颜美少年",
            "覇王の兆し":"霸王的征兆",
            "麗しの姫君":"秀丽贵夫人",
            "神の恩寵":"神之恩宠",
            "信仰の加護":"信仰的加护",
            "奇蹟":"奇迹",
            "聖女の誓い":"圣女之誓",
            "金羊の皮":"金羊毛",
            "キルケーの教え":"喀耳刻的教诲",
            "精神汚染":"精神污染",
            "芸術審美":"艺术审美",
            "深淵の邪視":"深渊的邪视",
            "人間観察":"人类观察",
            "高速詠唱":"高速咏唱",
            "無辜の怪物":"无辜的怪物",
            "エンチャント":"魔力附加",
            "自己保存":"自我保存",
            "国王一座":"国王剧团",
            "呪術":"咒术",
            "道化の大笑":"小丑的大笑",
            "音楽神の加護":"音乐之神的护佑",
            "偽":"伪",
            "小さな夜の曲":"小夜曲",
            "鑑識眼":"鉴识眼",
            "軍師の忠言":"军师的忠言",
            "軍師の指揮":"军师的指挥",
            "原初のルーン":"原初之卢恩",
            "宗和の心得":"宗和的心得",
            "投擲（短刀）":"投掷(短刀)",
            "自己改造":"自我改造",
            "風除けの加護":"避风的加护",
            "プランニング":"计划",
            "傍若無人":"旁若无人",
            "処刑人":"刽子手",
            "医術":"医术",
            "諜報":"谍报",
            "フェロモン":"费洛蒙",
            "ダブルクロス":"背叛者",
            "鮮血の湯浴み":"鲜血浴",
            "無窮の武練":"无穷的武练",
            "精霊の加護":"精灵的加护",
            "反骨の相":"反骨之相",
            "乱世の梟雄":"乱世枭雄",
            "被虐の誉れ":"受虐的荣誉",
            "不屈の意志":"不屈的意志",
            "剣の凱旋":"剑之凯旋",
            "動物会話":"动物会话",
            "鮮血の伝承":"鲜血的传承",
            "天性の魔":"天性之魔",
            "深淵のラブリュス":"深渊双刃斧",
            "加虐体質":"嗜虐体质",
            "在りし日の栄光":"曾经的荣光",
            "変化":"变化",
            "ストーキング":"跟踪",
            "焔色の接吻":"焰色接吻",
            "支援呪術":"支援咒术",
            "血啜の獣斧":"嗜血兽斧",
            "啓示":"启示",
            "真名看破":"真名识破",
            "神明裁決":"神明裁决",
            "女神の寵愛":"女神的宠爱",
            "移り気への楔":"移情别恋之楔",
            "かぼちゃ":"南瓜",
            "出演続行":"演出续行",
            "狐の嫁入り":"狐之婚嫁",
            "神の加護":"神的护佑",
            "治癒の竪琴":"治愈的竖琴",
            "友誼の証明":"友谊的证明",
            "星の開拓者":"星之开拓者",
            "射撃":"射击",
            "コンビネーション":"配合",
            "うたかたの恋":"泡影之恋",
            "縮地":"缩地",
            "戦略":"战略",
            "天下布武":"天下布武",
            "魔境の智慧":"魔境的智慧",
            "神殺し":"弑神",
            "愛の黒子":"爱之黑痣",
            "騎士の武略":"骑士的武略",
            "聖者の贈り物":"圣者的礼物",
            "一方その頃":"与此同时",
            "霧夜の殺人":"雾夜的凶杀",
            "情報抹消":"情报抹消",
            "外科手術":"外科手术",
            "不貞隠しの兜":"隐藏不贞的头盔",
            "ガルバニズム":"流电学",
            "天賦の叡智":"天赋的睿智",
            "最果ての加護":"止镜的加护",
            "エレメンタル":"元素精灵",
            "賢者の石":"贤者之石",
            "一意専心":"专心一意",
            "機関の鎧":"机械铠甲",
            "オーバーロード":"过载",
            "恐慌の声":"恐慌之声",
            "虚ろなる生者の嘆き":"虚无生者的叹息",
            "授かりの英雄":"天授的英雄",
            "貧者の見識":"贫者的见识",
            "無冠の武芸":"无冠的武艺",
            "支援砲撃":"支援炮击",
            "セイバーの星":"Saber之星",
            "銀河流星剣":"银河流星剑",
            "麗":"丽",
            "女難の美":"祸水红颜",
            "英雄の介添":"英雄的陪侍",
            "ベルセルク":"狂战士",
            "天に星を":"予天以星",
            "地に花を":"予地以花",
            "人に愛を":"予人以爱",
            "直死の魔眼":"直死之魔眼",
            "雲耀":"云耀",
            "陰陽魚":"阴阳鱼",
            "洗礼詠唱":"洗礼咏唱",
            "触れれば転倒！":"一碰就倒！",
            "理性蒸発":"理性蒸发",
            "鋼鉄の決意":"钢铁的决意",
            "窮地の智慧":"困境的智慧",
            "鋼の看護":"钢之看护",
            "天使の叫び":"天使的吼叫",
            "精霊の狂騒":"精灵的狂躁",
            "女王の躾":"女王的教育",
            "魔力同調":"魔力同调",
            "マハトマ":"伟大之魂",
            "未知への探求":"探求未知",
            "武の祝福":"武之祝福",
            "離別の呪い":"离别的诅咒",
            "中国武術":"中国武术",
            "六合大槍":"六合大枪",
            "圏境":"圈境",
            "絶招":"绝招",
            "大量生産":"大量生产",
            "血塗れの悪魔":"血染的恶魔",
            "シャーマニズム":"萨满教",
            "守護の獣":"守护兽",
            "クイックドロウ":"快速拔枪",
            "竜の魔女":"龙之魔女",
            "うたかたの夢":"泡影之梦",
            "右歯噛咬":"右齿啮咬",
            "左歯噛咬":"左齿啮咬",
            "死滅願望":"死灭愿望",
            "雷の征服者":"雷之征服者",
            "聖杯の寵愛":"圣杯的宠爱",
            "スケープゴート":"替罪羊",
            "蔵知の司書":"藏知之司书",
            "専科百般":"精通百科",
            "戦闘撤退":"战斗撤退",
            "献身の覚悟":"献身的觉悟",
            "自然の嬰児":"自然的婴儿",
            "魔術医療":"魔术医疗",
            "果実の酒気":"果实的酒气",
            "鬼種の魔":"鬼种之魔",
            "高速読経":"高速诵经",
            "妖惹の紅顔":"诱妖红颜",
            "三蔵の教え":"三藏的教诲",
            "神秘殺し":"神秘杀手",
            "忍術":"忍术",
            "風声鶴唳":"风声鹤唳",
            "太陽神の加護":"太阳神的加护",
            "エジプト魔術":"埃及魔术",
            "天空神の寵愛":"天空神的宠爱",
            "湖の騎士":"湖上骑士",
            "祝福されぬ生誕":"不被祝福的诞生",
            "騎士王への諫言":"致骑士王的谏言",
            "聖者の数字":"圣者的数字",
            "ベルシラックの帯":"柏希雷克腰带",
            "静寂の舞踏":"静寂舞步",
            "龍神の加護":"龙神的加护",
            "無尽俵":"无尽米袋",
            "沈着冷静":"沉着冷静",
            "守護の誓約":"守护的誓约",
            "ビーチフラワー":"沙滩之花",
            "真夏の呪術":"盛夏咒术",
            "女神変生":"女神变生",
            "サマー・スプラッシュ！":"夏日水花飞溅！",
            "海の家の加護":"海之家的佑护",
            "向日葵のきらめき":"向日葵的光辉",
            "トレジャーハント":"财宝搜寻",
            "セルリアンライド":"蔚蓝骑乘",
            "ロデオフリップ":"Rodeo Flip",
            "終わらぬ夏":"永不结束的夏日",
            "ビーチクライシス":"沙滩危机",
            "真夏のあやまち":"盛夏的错误",
            "情熱の炎夏":"热情的炎夏",
            "水浴転身":"水浴转身",
            "恋の追跡者":"恋之追踪者",
            "水辺の聖女":"水边圣女",
            "ヤコブの手足":"雅各布的追随者",
            "愉快型魔術礼装":"愉快型魔术礼装",
            "あやしい薬":"可疑的药",
            "キス魔":"吻魔",
            "勇者大原則":"勇者大原则",
            "勇気":"勇气",
            "真紅の勇者伝説":"绯红勇者传说",
            "女神の加護":"女神的加护",
            "自己変革":"自我变革",
            "美の顕現":"美之显现",
            "輝ける大王冠":"闪耀的大王冠",
            "変容":"变容",
            "気配感知":"气息感知",
            "完全なる形":"完全之形",
            "善神の智慧":"善神智慧",
            "自由なる闘争":"自由的斗争",
            "王の帰還":"王之回归",
            "魔杖の支配者":"魔杖支配者",
            "彼方への想い":"心念远方",
            "変転の魔":"变转之魔",
            "ジャガー・パンチ":"豹之拳",
            "ジャガー・キック":"豹之踢",
            "ジャガー・アイ":"豹之眼",
            "夢幻のカリスマ":"梦幻魅力",
            "幻術":"幻术",
            "英雄作成":"英雄塑造",
            "第五勢":"第五势",
            "無空":"无空",
            "晩鐘":"晚钟",
            "黒餡子":"巧克力",
            "刹那無影剣":"刹那无影剑",
            "王の見えざる手":"王之看不见的手",

            //职阶技能名称
            "対魔力":"对魔力",
            "単独行動":"单独行动",
            "女神の神核":"女神的神核",
            "陣地作成":"阵地建造",
            "気配遮断":"气息遮断",
            "コスモリアクター":"宇宙反应器",
            "単独顕現":"单独显现",
            "根源接続":"根源接续",
            "復讐者":"复仇者",
            "忘却補正":"忘却补正",
            "自己回復":"自我回复",
            "サーフィン":"冲浪",
            "無限の魔力供給":"无限的魔力供给",
            "ダブルクラス":"双重职阶",
            "境界にて":"立于境界",
            "オルトリアクター":"Alter莉雅反应炉",

            //宝具
            "仮想宝具 疑似展開／人理の礎":"假想宝具 拟似展开／人理之础",
            "ロード・カルデアス":"Lord Chaldeas",
            "いまは遙か理想の城":"已然遥远的理想之城",
            "ロード・キャメロット":"Lord Camelot",
            "約束された勝利の剣":"誓约胜利之剑",
            "エクスカリバー":"Excalibur",
            "エクスカリバー・モルガン":"Excalibur Morgan",
            "勝利すべき黄金の剣":"必胜黄金之剑",
            "カリバーン":"Caliburn",
            "童女謳う華の帝政":"童女讴歌的荣华帝政",
            "ラウス・セント・クラウディウス":"Laus Saint Claudius",
            "幻想大剣・天魔失墜":"幻想大剑・天魔失坠",
            "バルムンク":"Balmung",
            "黄の死":"黄之死",
            "クロケア・モース":"Crocea Mors",
            "軍神の剣":"军神之剑",
            "フォトン・レイ":"Photon Ray",
            "神聖たる旗に集いて吼えよ":"集结于圣旗之下怒吼吧",
            "セイント・ウォーオーダー":"Saint War Order",
            "百合の花咲く豪華絢爛":"百合花开豪华绚烂",
            "フルール・ド・リス":"Fleur de Lys",
            "無限の剣製":"无限剑制",
            "アンリミテッドブレイドワークス":"Unlimited Blade Works",
            "天地乖離す開闢の星":"天地乖离开辟之星",
            "エヌマ・エリシュ":"Enuma Elish",
            "祈りの弓":"祈祷之弓",
            "イー・バウ":"Yew Bow",
            "訴状の矢文":"诉状箭书",
            "ポイボス・カタストロフェ":"Phoebus Catastrophe",
            "女神の視線":"女神的视线",
            "アイ・オブ・ザ・エウリュアレ":"Eye of the Euryale",
            "ステラ":"Stella",
            "刺し穿つ死棘の槍":"穿刺死棘之枪",
            "ゲイ・ボルク":"Gae Bolg",
            "鮮血魔嬢":"鲜血魔女",
            "バートリ・エルジェーベト":"Bathory Erzsebet",
            "五百羅漢補陀落渡海":"五百罗汉补陀落渡海",
            "ごひゃくらかんふだらくとかい":"Gohyaku Rakan Fudarakutokai",
            "穿ちの朱槍":"贯穿之朱枪",
            "炎門の守護者":"炎门守护者",
            "テルモピュライ・エノモタイア":"Thermopylae Enomotia",
            "すべては我が槍に通ずる":"吾枪通达万物",
            "マグナ・ウォルイッセ・マグヌム":"Magna Voluisse Magnum",
            "騎英の手綱":"骑英之缰绳",
            "ベルレフォーン":"Bellerophon",
            "力屠る祝福の剣":"刚力屠戮祝福之剑",
            "アスカロン":"Ascalon",
            "アン女王の復讐":"安妮女王之复仇",
            "クイーンアンズ・リベンジ":"Queen Anne's Revenge",
            "約束されざる守護の車輪":"无以誓约守护之车轮",
            "チャリオット・オブ・ブディカ":"Chariot of Boudica",
            "壇ノ浦・八艘跳":"坛之浦・八艘跳",
            "だんのうら・はっそうとび":"Dan-no-ura Hasso Tobi",
            "始まりの蹂躙制覇":"初始的蹂躏制霸",
            "ブケファラス":"Bucephalus",
            "百合の王冠に栄光あれ":"愿百合王冠荣光永在",
            "ギロチン・ブレイカー":"Guillotine Breaker",
            "愛知らぬ哀しき竜よ":"不识爱的悲哀之龙啊",
            "タラスク":"Tarasque",
            "破戒すべき全ての符":"万符必应破戒",
            "ルールブレイカー":"Rule Breaker",
            "プレラーティーズ・スペルブック":"Prelati's Spellbook",
            "貴方のための物語":"为你撰写的故事",
            "メルヒェン・マイネスレーベンス":"Marchen Meines Lebens",
            "開演の刻は来たれり":"开演之刻已至",
            "此処に万雷の喝采を":"此处应有雷鸣般的喝彩",
            "ファースト・フォリオ":"First Folio",
            "微睡む爆弾":"浅眠炸弹",
            "チクタク・ボム":"Ticktock Bomb",
            "死神のための葬送曲":"献给死神的安魂曲",
            "レクイエム・フォー・デス":"Requiem for Death",
            "石兵八陣":"石兵八阵",
            "かえらずのじん":"Kaerazu no Jin",
            "灼き尽くす炎の檻":"燃烧殆尽的炎笼",
            "ウィッカーマン":"Wicker Man",
            "燕返し":"燕返",
            "つばめがえし":"Tsubame Gaeshi",
            "ザバーニーヤ":"Zabaniya",
            "女神の微笑":"女神的微笑",
            "スマイル・オブ・ザ・ステンノ":"Smile of the Stheno",
            "不還匕首":"不归匕首",
            "ただ、あやめるのみ":"只为刺杀而存",
            "死は明日への希望なり":"死亡将为明日的希望",
            "ラモール・エスポワール":"L'amour Espoir",
            "地獄にこそ響け我が愛の唄":"吾之情歌只在地狱回响",
            "クリスティーヌ・クリスティーヌ":"Christine,Christine",
            "陽の眼を持つ女":"拥有阳眼之女",
            //        "マタ・ハリ":"Mata Hari",  //与玛塔・哈丽的从者名重复
            "幻想の鉄処女":"幻想铁处女",
            "ファントム・メイデン":"Phantom Maiden",
            "射殺す百頭":"射杀百头",
            "ナインライブズ":"Nine Lives",
            "騎士は徒手にて死せず":"骑士不徒手而亡",
            "ナイト・オブ・オーナー":"Knight of Honor",
            "軍神五兵":"军神五兵",
            "ゴッドフォース":"God Force",
            "疵獣の咆吼":"伤兽的咆吼",
            "クライング・ウォーモンガー":"Crying Warmonger",
            "黄金衝撃":"黄金冲击",
            "ゴールデンスパーク":"Golden Spark",
            "血塗れ王鬼":"血染的王鬼",
            "カズィクル・ベイ":"Kazikli Bey",
            "万古不易の迷宮":"万古不变的迷宫",
            "ケイオス・ラビュリントス":"Chaos Labyrinthos",
            "我が心を喰らえ、月の光":"吞噬吾心吧，月光",
            "フルクティクルス・ディアーナ":"Flucticulus Diana",
            "不死の一万騎兵":"不死的万名骑兵",
            "アタナトイ・テン・サウザンド":"Athanaton Ten Thousand",
            "転身火生三昧":"转身火生三昧",
            "てんしんかしょうざんまい":"Tenshin Kasho Zanmai",
            "血塗れの戴冠式":"血染的加冕仪式",
            "ブラッドバス・クラウン":"Bloodbath Crown",
            "燦々日光午睡宮酒池肉林":"璀灿日光午睡宫酒池肉林",
            "さんさんにっこう":"Sansan Nikko",
            "ひるやすみしゅちにくりん":"Hiruyasumi Shuchi Nikurin",
            "我が神はここにありて":"吾主在此",
            "リュミノジテ・エテルネッル":"Luminosite Eternelle",
            "月女神の愛矢恋矢":"月女神的爱箭恋矢",
            "トライスター・アモーレ・ミオ":"Tri-star Amore Mio",
            "鮮血特上魔嬢":"鲜血极致魔女",
            "バートリ・ハロウィン・エルジェーベト":"Bathory Halloween Erzsebet",
            "水天日光天照八野鎮石":"水天日光天照八野镇石",
            "すいてんにっこう":"Suiten Nikko",
            "あまてらすやのしずいし":"Amaterasu Yano Shizu-Ishi",
            "五つの石":"五块石头",
            "ハメシュ・ アヴァニム":"Hamesh Avanim",
            "不毀の極槍":"不毁的极枪",
            "ドゥリンダナ":"Durindana",
            "黄金鹿と嵐の夜":"黄金鹿与暴风夜",
            "ゴールデン・ワイルドハント":"Golden Wild Hunt",
            "比翼にして連理":"比翼连理",
            "カリビアン・フリーバード":"Caribbean Free Bird",
            "修補すべき全ての疵":"万疵必应修补",
            "ペインブレイカー":"Pain Breaker",
            "無明三段突き":"无明三段突",
            "むみょうさんだんづき":"Mumyo Sandan Zuki",
            "さんだんうち":"三段击",
            "貫き穿つ死翔の槍":"贯穿死翔之枪",
            "ゲイ・ボルク・オルタナティブ":"Gae Bolg Alternative",
            "破魔の紅薔薇、必滅の黄薔薇":"破魔的红蔷薇、必灭的黄蔷薇",
            "ゲイ・ジャルグ＆ゲイ・ボウ":"Gae Dearg & Gae Buidhe",
            "虹霓剣":"虹霓剑",
            "カラドボルグ":"Caladbolg",
            "誰かの為の物語":"献给某人的故事",
            //        "ナーサリー・ライム":"Nursery Rhyme",  //与童谣的从者名重复
            "解体聖母":"解体圣母",
            "マリア・ザ・リッパー":"Maria the Ripper",
            "我が麗しき父への叛逆":"对吾华丽父王的叛逆",
            "クラレント・ブラッドアーサー":"Clarent Blood Arthur",
            "人類神話・雷電降臨":"人类神话・雷电降临",
            "システム・ケラウノス":"System Keraunos",
            "最果てにて輝ける槍":"闪耀于终焉之枪",
            "ロンゴミニアド":"Rhongomyniad",
            "元素使いの魔剣":"元素使的魔剑",
            "ソード・オブ・パラケルスス":"Sword of Paracelsus",
            "絢爛なりし灰燼世界":"绚烂的灰烬世界",
            "ディメンジョン・オブ・スチーム":"Dimension of Steam",
            "密やかなる罪の遊戯":"隐秘的罪之游戏",
            "デンジャラス・ゲーム":"Dangerous Game",
            "磔刑の雷樹":"磔刑之雷树",
            "ブラステッド・ツリー":"Blasted Tree",
            "破壊神の手翳":"破坏神之手影",
            "パーシュパタ":"Pashupata",
            "日輪よ、死に随え":"日轮啊，顺从死亡",
            "ヴァサヴィ・シャクティ":"Vasavi Shakti",
            "無銘勝利剣":"无铭胜利剑",
            "ひみつかりばー":"Himitsu Calibur",
            "無敗の紫靫草":"无败紫靫草",
            "マク・ア・ルイン":"Mac an Luin",
            "死がふたりを分断つまで":"直至死亡拆散两人",
            "ブリュンヒルデ・ロマンシア":"Brynhild Romantia",
            "源流闘争":"源流斗争",
            "グレンデル・バスター":"Grendel Buster",
            "星馳せる終幕の薔薇":"星辰驰骋的终幕蔷薇",
            "ファクス・カエレスティス":"Fax Caelestis",
            "無垢識・空の境界":"无垢识・空之境界",
            "むくしき・からのきょうかい":"Mukushiki Kara no Kyokai",
            "唯識・直死の魔眼":"唯识・直死之魔眼",
            "ゆいしき・ちょくしのまがん":"Yuishiki Chokushi no Magan",
            "双腕・零次集束":"双腕・零次集束",
            "ツインアーム・ビッグクランチ":"Twin Arm - Big Crunch",
            "この世ならざる幻馬":"非世间所存之幻马",
            "ヒポグリフ":"Hippogriff",
            "王の財宝":"王之财宝",
            "ゲート・オブ・バビロン":"Gate of Babylon",
            "虎よ、煌々と燃え盛れ":"虎啊，煌煌燎燃",
            "アンフェル・シャトー・ディフ":"Enfer Chateau d'If",
            "我はすべて毒あるもの、害あるものを絶つ":"我将根绝一切毒物，一切害物",
            "ナイチンゲール・プレッジ":"Nightingale Pledge",
            "噛み砕く死牙の獣":"死牙之兽的噬碎",
            "クリード・コインヘン":"Curruid Coinchenn",
            "愛しき私の鉄戦車":"我心爱的钢铁战车",
            "チャリオット・マイ・ラブ":"Chariot My Love",
            "サナト・クマラ":"Sanat Kumara",
            "羅刹を穿つ不滅":"穿透罗刹之不灭",
            "ブラフマーストラ":"Brahmastra",
            "神槍无二打":"神枪无二打",
            "しんそうにのうちいらず":"Shinsou Nino Uchi Irazu",
            "ワールド・フェイス・ドミネーション":"World Faith Domination",
            "大地を創りし者":"大地的创造者",
            "ツァゴ・デジ・ナレヤ":"Tsago Degi Naleya",
            "壊音の霹靂":"坏音霹雳",
            "サンダラー":"Thunderer",
            "吼え立てよ、我が憤怒":"咆哮吧，吾之愤怒",
            "ラ・グロンドメント・デュ・ヘイン":"Le Grondement Du Haine",
            "偽り写し記す万象":"万象之伪誊抄",
            "ヴェルグ・アヴェスター":"Verg Avesta",
            "王の軍勢":"王之军势",
            "アイオニオン・ヘタイロイ":"Ionioi Hetairoi",
            "時のある間に薔薇を摘め":"花开堪折直须折",
            "クロノス・ローズ":"Khronos Rose",
            "白き聖杯よ、謳え":"白之圣杯啊，咏唱吧",
            "ソング・オブ・グレイル":"Song of Grail",
            "せんしばんこう・しんぺんきどく":"Senshibankou Shinpenkidoku",
            "五行山・釈迦如来掌":"五行山・释迦如来掌",
            "ごぎょうさん・しゃかにょらいしょう":"Gogyousan Shakanyoraishou",
            "牛王招雷・天網恢々":"牛王招雷・天网恢恢",
            "ごおうしょうらい・てんもうかいかい":"Gooushourai Tenmoukaikai",
            "ゴールデンドライブ・グッドナイト":"Golden Drive Goodnight",
            "羅生門大怨起":"罗生门大怨起",
            "らしょうもんだいえんぎ":"Rashoumon Daiengi",
            "不滅の混沌旅団":"不灭的混沌旅团",
            "イモータル・カオス・ブリゲイド":"Immortal Chaos Brigade",
            "光輝の大複合神殿":"光辉之大复合神殿",
            "ラムセウム・テンティリス":"Ramesseum Tentyris",
            "冥鏡宝典":"冥镜宝典",
            "アンプゥ・ネブ・タ・ジェセル":"Anpu Neb Ta Djeser",
            "縛鎖全断・過重湖光":"缚锁全断・过重湖光",
            "アロンダイト・オーバーロード":"Aroundight Overload",
            "痛哭の幻奏":"痛哭幻奏",
            "フェイルノート":"Failnaught",
            "転輪する勝利の剣":"轮转胜利之剑",
            "エクスカリバー・ガラティーン":"Excalibur Galatine",
            "八幡祈願・大妖射貫":"八幡祈愿・大妖射贯",
            "なむはちまんだいぼさつ・このやにかごを":"Namuhachimandaibosatsu Konoyanikagowo",
            "剣を摂れ、銀色の腕":"紧握其剑，银之臂",
            "スイッチオン・アガートラム":"Switch On Agateram",
            "万能の人":"万能之人",
            "ウォモ・ウニヴェルサーレ":"Uomo Universale",
            "常夏日光・日除傘寵愛一神":"常夏日光・遮阳伞宠爱一神",
            "とこなつにっこう・ひよけがさちょうあいいっしん":"Tokonatsunikko Hiyokegasachouaiisshin",
            "陽光煌めく勝利の剣":"阳光璀璨胜利之剑",
            "エクスカリバー・ヴィヴィアン":"Excalibur Vivian",
            "愛すべき輝きは永遠に":"吾爱辉煌永恒长驻",
            "クリスタル・ドレス":"Crystal Dress",
            "カリビアン・フリーバード・アクト２":"Caribbean Free Bird Act2",
            "逆巻く波濤を制する王様気分！":"掌控翻涌波涛王者心境！",
            "プリドゥエン・チューブライディング":"Prydwen Tube Riding",
            "蹴り穿つ死翔の槍":"蹴穿死翔之枪",
            "道成寺鐘百八式火竜薙":"道成寺钟百八式火龙薙",
            "どうじょうじかねひゃくはちしきかりゅうなぎ":"Doujyoujikane Hyakuhachishikikaryunagi",
            "荒れ狂う哀しき竜よ":"狂暴的悲哀之龙啊",
            "多元重奏飽和砲撃":"多元重奏饱和炮击",
            "クウィンテットフォイア":"Quintett Feuer",
            "鶴翼三連":"鹤翼三连",
            "かくよくさんれん":"Kakuyoku Sanren",
            "鮮血竜巻魔嬢":"鲜血龙卷魔女",
            "バートリ・ブレイブ・エルジェーベト":"Bathory Brave Erzsebet",
            "暁の時を終える蛇よ、此処に":"终结破晓之蛇啊，降临此处",
            "ウラエウス・アストラペ":"Uraeus Astrape",
            "優雅に歌え、かの聖誕を":"优雅歌唱吧，为那圣诞",
            "ラ・グラスフィーユ・ノエル":"La Grace Fille Noel",
            "山脈震撼す明星の薪":"山脉震撼明星之薪",
            "アンガルタ・キガルシュ":"An Gal Ta Kigal She",
            "人よ、神を繋ぎとめよう":"世人啊，冀以锁系神明",
            "炎、神をも灼き尽くせ":"炽焰，亦焚尽神灵",
            "シウ・コアトル":"Xiuhcoatl",
            "王の号砲":"王之号炮",
            "メラム・ディンギル":"Melammu Dingir",
            "女神の抱擁":"女神的拥抱",
            "カレス・オブ・ザ・メドゥーサ":"Caress of the Medusa",
            "強制封印・万魔神殿":"强制封印・万魔神殿",
            "パンデモニウム・ケトゥス":"Pandemonium Cetus",
            "逃れ得ぬ死の鉤爪":"无可逃脱死亡钩爪",
            "グレート・デス・クロー":"Great Death Claw",
            "永久に閉ざされた理想郷":"永世隔绝的理想乡",
            "ガーデン・オブ・アヴァロン":"Garden of Avalon",
            "六道五輪・倶利伽羅天象":"六道五轮・俱利伽罗天象",
            "りくどうごりん・くりからてんしょう":"Rikudougorin Kurikaratenshou",
            "アズライール":"Azrael",
            "黒竜双剋勝利剣":"黑龙双克胜利剑",
            "クロス・カリバー":"Cross Calibur",

            //特攻范围
            "天または地の力を持つサーヴァント":"天或地阵营从者",
            "特性/〔天または地の力を持つサーヴァント（擬似サーヴァント、デミ・サーヴァントは除く）〕":"特性/〔天或地阵营从者（拟似从者、半从者除外）〕",
            "エヌマ特攻無効":"EA特攻无效",
            "人間":"人类",
            "悪":"恶",
            "ローマ":"罗马",
            "竜":"龙",
            "猛獣":"野兽",
            "死霊":"死灵",
            "悪魔":"恶魔",
            "騎乗":"骑乘",
            "アーサー":"亚瑟",
            "アルトリア顔":"阿尔托莉雅脸",
            "愛する者":"所爱之人",
            "ギリシャ":"希腊",

            //素材名称
            "英雄の証":"英雄之证",
            "竜の牙":"龙之牙",
            "虚影の塵":"虚影之尘",
            "虚栄の塵":"虚影之尘",
            "愚者の鎖":"愚者之锁",
            "万死の毒針":"万死的毒针",
            "魔術髄液":"魔术髓液",
            "世界樹の種":"世界树之种",
            "ゴーストランタン":"鬼魂提灯",
            "八連双晶":"八连双晶",
            "蛇の宝玉":"蛇之宝玉",
            "鳳凰の羽根":"凤凰羽毛",
            "無間の歯車":"无间齿轮",
            "禁断の頁":"禁断书页",
            "ホムンクルスベビー":"人工生命体幼体",
            "隕蹄鉄":"陨蹄铁",
            "大騎士勲章":"大骑士勋章",
            "追憶の貝殻":"追忆的贝壳",
            "竜の逆鱗":"龙之逆鳞",
            "混沌の爪":"混沌之爪",
            "蛮神の心臓":"蛮神心脏",
            "精霊根":"精灵根",
            "戦馬の幼角":"战马的幼角",
            "血の涙石":"血之泪石",
            "黒獣脂":"黑兽脂",
            "封魔のランプ":"封魔之灯",
            "智慧のスカラベ":"智慧之圣甲虫像",
            "原初の産毛":"起源的胎毛",
            "呪獣胆石":"咒兽胆石",
            "伝承結晶":"传承结晶",
            "ピース":"银棋",
            "セイバーピース":"剑阶银棋",
            "アーチャーピース":"弓阶银棋",
            "ランサーピース":"枪阶银棋",
            "ライダーピース":"骑阶银棋",
            "キャスターピース":"术阶银棋",
            "アサシンピース":"杀阶银棋",
            "バーサーカーピース":"狂阶银棋",
            "モニュ":"金像",
            "モニュメント":"金像",
            "セイバーモニュメント":"剑阶金像",
            "アーチャーモニュメント":"弓阶金像",
            "ランサーモニュメント":"枪阶金像",
            "ライダーモニュメント":"骑阶金像",
            "キャスターモニュメント":"术阶金像",
            "アサシンモニュメント":"杀阶金像",
            "バーサーカーモニュメント":"狂阶金像",
            "剣ピース":"剑阶银棋",
            "弓ピース":"弓阶银棋",
            "槍ピース":"枪阶银棋",
            "騎ピース":"骑阶银棋",
            "術ピース":"术阶银棋",
            "殺ピース":"杀阶银棋",
            "狂ピース":"狂阶银棋",
            "剣モニュメント":"剑阶金像",
            "弓モニュメント":"弓阶金像",
            "槍モニュメント":"枪阶金像",
            "騎モニュメント":"骑阶金像",
            "術モニュメント":"术阶金像",
            "殺モニュメント":"杀阶金像",
            "狂モニュメント":"狂阶金像",
            "剣の輝石":"剑之辉石",
            "弓の輝石":"弓之辉石",
            "槍の輝石":"枪之辉石",
            "騎の輝石":"骑之辉石",
            "術の輝石":"术之辉石",
            "殺の輝石":"杀之辉石",
            "狂の輝石":"狂之辉石",
            "剣の魔石":"剑之魔石",
            "弓の魔石":"弓之魔石",
            "槍の魔石":"枪之魔石",
            "騎の魔石":"骑之魔石",
            "術の魔石":"术之魔石",
            "殺の魔石":"杀之魔石",
            "狂の魔石":"狂之魔石",
            "剣の秘石":"剑之秘石",
            "弓の秘石":"弓之秘石",
            "槍の秘石":"枪之秘石",
            "騎の秘石":"骑之秘石",
            "術の秘石":"术之秘石",
            "殺の秘石":"杀之秘石",
            "狂の秘石":"狂之秘石",
            "叡智の種火":"睿智的种火",
            "叡智の灯火":"睿智的灯火",
            "叡智の大火":"睿智的大火",
            "叡智の猛火":"睿智的猛火",
            "フォウ":"芙芙",
            "ﾌｫｳ":"芙芙",
            "マナプリズム":"<font title='魔力棱镜'>绿方块</font>",
            "レアプリズム":"<font title='稀有魔力棱镜'>金方块</font>",

            //节奏榜
            "ランキング":"排名",
            "聖杯転臨おすすめ鯖ランキング":"圣杯转临推荐排名",
            "聖杯転臨おすすめサーヴァント/100レベル編":"圣杯转临推荐从者/100级版",
            "100レベル聖杯転臨のおすすめランキング":"100级圣杯转临推荐排名",
            "聖杯転臨おすすめサーヴァント/90レベル編":"圣杯转临推荐从者/90级版",
            "90レベル聖杯転臨のおすすめランキング":"90级圣杯转临推荐排名",
            "星5最強ランキング":"5星最强排名",
            "星5サーヴァント最強ランキング":"5星从者最强排名",
            "星4最強ランキング":"4星最强排名",
            "星4サーヴァント最強ランキング":"4星从者最强排名",

            //效率剧场
            "FateGOアイテム効率劇場":"FateGO素材效率剧场",
            "各シート概要":"各表单概要",
            "リンク":"Link",
            "高効率クエBest":"高效率关卡Best",
            "高効率クエストBest":"高效率关卡Best",
            "アイテム別":"按素材",
            "像1+ﾗ凸2":"<div id=xxwc class=xxwc onmouseenter='enter(event);' onmouseleave='leave();'><div id=xxwc1 class=xxwc1plus2>1</div><div id=xxwcleft class=xxwctop>肖</div><div id=xxwcleft class=xxwcbottom>像</div><div id=xxwcplus2 class=xxwc1plus2>+2</div><div id=xxwcright class=xxwctop>满破</div><div id=xxwcright class=xxwcbottom>午餐</div></div>",
            "1個あたり":"每件",
            "1周あたり":"每轮",
            "1APあたり":"每AP",
            "ドロップ率":"掉落率",
            "サンプル数":"样本数",
            "限凸モナリザ":"满破蒙娜丽莎",
            "副産物比較":"副产物比较",
            "AP効率表":"AP效率表",
            "未凸1":"未满<br>破1",
            "凸1":"满破1",
            "凸2":"满破2",
            "像1+凸1":"肖像1+<br>满破1",
            "像2+凸1":"肖像2+<br>满破1",
            "像1+凸2":"肖像1+<br>满破2",
            "礼装なし":"没有礼装",
            "ドロップ率表":"掉落率表",
            "1周あたりのドロップ率（％）":"每轮掉落率（％）",
            "絆ポイント効率表":"羁绊效率表",

            //魔术礼装
            "魔術礼装":"魔术礼装",
            "カルデア":"迦勒底",
            "カルデア戦闘服":"迦勒底战斗服",
            "魔術協会制服":"魔术协会制服",
            "アトラス院制服":"阿特拉斯院制服",
            "アニバーサリー・ブロンド":"金色庆典",
            "ロイヤルブランド":"王室品牌",
            "ブリリアントサマー":"明亮夏日",
            "月の海の記憶":"月之海的记忆",

            //职阶名称
            "エクストラクラス":"特殊职阶",
            "エクストラ":"Extra",
            "剣":"剑",
            "槍":"枪",
            "騎":"骑",
            "術":"术",
            "殺":"杀",
            "讐":"仇",
            "獣":"兽",
            "冠術":"冠术",
            "シールダー":"Shielder",
            "セイバー":"Saber",
            "アーチャー":"Archer",
            "ランサー":"Lancer",
            "ライダー":"Rider",
            "キャスター":"Caster",
            "アサシン":"Assassin",
            "バーサーカー":"Berserker",
            "ルーラー":"Ruler",
            "アヴェンジャー":"Avenger",
            "ムーンキャンサー":"Moon Cancer",
            "アルターエゴ":"Alter Ego",
            "フォーリナー":"Foreigner",
            "シャドウセイバー":"影Saber",
            "シャドウアーチャー":"影Archer",
            "シャドウランサー":"影Lancer",
            "シャドウライダー":"影Rider",
            "シャドウキャスター":"影Caster",
            "シャドウアサシン":"影Assassin",
            "シャドウバーサーカー":"影Berserker",
            "バーサーク・セイバー":"狂化Saber",
            "バーサーク・アーチャー":"狂化Archer",
            "バーサーク・ランサー":"狂化Lancer",
            "バーサーク・ライダー":"狂化Rider",
            "バーサーク・キャスター":"狂化Caster",
            "バーサーク・アサシン":"狂化Assassin",
            "オルタ":"Alter",
            "リリィ":"Lily",
            "プロトタイプ":"Prototype",
            "プロト":"Proto",
            "ハロウィン":"万圣节",
            "サンタ":"圣诞",
            "サンタオルタ":"圣诞Alter",
            "ブライド":"Bride",
            "ブレイブ":"勇者",

            //从者
            "マシュ":"玛修",
            "キリエライト":"基列莱特",
            "アルトリア":"阿尔托莉雅",
            "ペンドラゴン":"潘德拉贡",
            "水着アルトリア":"泳装阿尔托莉雅",
            "青王":"蓝毛",
            "黒王":"黑无毛",
            "青セイバー":"蓝Saber",
            "赤セイバー":"红Saber",
            "ネロ":"尼禄",
            "クラウディウス":"克劳狄乌斯",
            "ネロブライド":"尼禄花嫁",
            "ジークフリート":"齐格飞",
            "ガイウス":"盖乌斯",
            "ユリウス":"尤利乌斯",
            "カエサル":"恺撒",
            "アルテラ":"阿蒂拉",
            "ジル":"吉尔",
            "シュヴァリエ・デオン":"骑士迪昂",
            "デオン":"迪昂",
            "エミヤ":"卫宫",
            "ギルガメッシュ":"吉尔伽美什",
            "ロビンフッド":"罗宾汉",
            "アタランテ":"阿塔兰忒",
            "エウリュアレ":"尤瑞艾莉",
            "アーラシュ":"阿拉什",
            "クー":"库",
            "フーリン":"丘林",
            "クーフーリン":"库丘林",
            "エリザベート":"伊丽莎白",
            "バートリー":"巴托里",
            "エリザ":"伊丽莎白",
            "ハロウィンエリザベート":"万圣节伊丽莎白",
            "武蔵坊弁慶":"武藏坊弁庆",
            "弁慶":"弁庆",
            "レオニダス一世":"列奥尼达斯一世",
            "レオニダス":"列奥尼达斯",
            "ロムルス":"罗穆路斯",
            "メドゥーサ":"美杜莎",
            "ゲオルギウス":"乔尔乔斯",
            "エドワード":"爱德华",
            "ティーチ":"蒂奇",
            "ブーディカ":"布狄卡",
            "アレキサンダー":"亚历山大",
            "マリー":"玛丽",
            "水着マリー":"泳装玛丽",
            "アントワネット":"安托瓦内特",
            "マルタ":"玛尔达",
            "水着マルタ":"泳装玛尔达",
            "メディア":"美狄亚",
            "ハンス":"汉斯",
            "クリスチャン":"克里斯蒂安",
            "アンデルセン":"安徒生",
            "ウィリアム":"威廉",
            "シェイクスピア":"莎士比亚",
            "メフィストフェレス":"梅菲斯托费勒斯",
            "メフィスト":"梅菲斯托",
            "ヴォルフガング":"沃尔夫冈",
            "アマデウス":"阿马德乌斯",
            "モーツァルト":"莫扎特",
            "諸葛孔明":"诸葛孔明",
            "エルメロイ":"埃尔梅罗",
            "佐々木小次郎":"佐佐木小次郎",
            "呪腕のハサン":"咒腕哈桑",
            "ハサン":"哈桑",
            "ステンノ":"斯忒诺",
            "荊軻":"荆轲",
            "サンソン":"桑松",
            "ファントム":"剧院魅影",
            "マタ":"玛塔",
            "ハリ":"哈丽",
            "カーミラ":"卡米拉",
            "ヘラクレス":"赫拉克勒斯",
            "ランスロット":"兰斯洛特",
            "セイバーランスロット":"Saber兰斯洛特",
            "呂布奉先":"吕布奉先",
            "呂布":"吕布",
            "スパルタクス":"斯巴达克斯",
            "坂田金時":"坂田金时",
            "ヴラド":"弗拉德",
            "アステリオス":"阿斯忒里俄斯",
            "カリギュラ":"卡利古拉",
            "ダレイオス":"大流士",
            "清姫":"清姬",
            "水着清姫":"泳装清姬",
            "エイリーク":"埃里克",
            "ブラッドアクス":"血斧",
            "タマモキャット":"玉藻猫",
            "ジャンヌダルクオルタサンタリリィ":"贞德・Alter・Santa・Lily",
            "ジャンヌオルタサンタリリィ":"贞德・Alter・Santa・Lily",
            "ジャンヌ":"贞德",
            "オリオン":"俄里翁",
            "玉藻の前":"玉藻前",
            "水着玉藻の前":"泳装玉藻前",
            "ダビデ":"大卫",
            "ヘクトール":"赫克托耳",
            "フランシス":"弗朗西斯",
            "ドレイク":"德雷克",
            "アン":"安妮",
            "ボニー":"伯妮",
            "メアリー":"玛莉",
            "リード":"瑞德",
            "アンメアリー":"双子",
            "アン＆メアリー":"双子",
            "アンメア":"双子",
            "水着アンメアリー":"泳装双子",
            "沖田総司":"冲田总司",
            "織田信長":"织田信长",
            "スカサハ":"斯卡哈",
            "水着スカサハ":"泳装斯卡哈",
            "ディルムッド":"迪尔姆德",
            "オディナ":"奥迪那",
            "フェルグス":"弗格斯",
            "マック":"马克",
            "ロイ":"罗伊",
            "ナーサリー・ライム":"童谣",
            "ナーサリー":"童谣",
            "ジャック・ザ・リッパー":"开膛手杰克",
            "ジャック":"杰克",
            "モードレッド":"莫德雷德",
            "水着モードレッド":"泳装莫德雷德",
            "ニコラ":"尼古拉",
            "二コラ":"尼古拉",
            "テスラ":"特斯拉",
            "ヴァン":"冯",
            "ホーエンハイム":"霍恩海姆",
            "パラケルスス":"帕拉塞尔苏斯",
            "チャールズ":"查尔斯",
            "バベッジ":"巴贝奇",
            "ヘンリー":"亨利",
            "ジキル":"杰基尔",
            "ハイド":"海德",
            "ジキル＆ハイド":"杰基尔&海德",
            "フランケンシュタイン":"弗兰肯斯坦",
            "フラン":"弗兰",
            "アルジュナ":"阿周那",
            "カルナ":"迦尔纳",
            "謎のヒロインX":"谜之女主角X",
            "謎のヒロインＸ":"谜之女主角Ｘ",
            "ヒロイン":"女主角",
            "フィン":"芬恩",
            "マックール":"麦克库尔",
            "ブリュンヒルデ":"布伦希尔德",
            "ベオウルフ":"贝奥武夫",
            "両儀式":"两仪式",
            "アストルフォ":"阿斯托尔福",
            "子ギル":"幼吉尔",
            "巌窟王":"岩窟王",
            "エドモン":"爱德蒙",
            "ダンテス":"唐泰斯",
            "ナイチンゲール":"南丁格尔",
            "女王メイヴ":"女王梅芙",
            "メイヴ":"梅芙",
            "エレナ":"海伦娜",
            "ブラヴァツキー":"布拉瓦茨基",
            "ラーマ":"罗摩",
            "神槍 李書文":"神枪 李书文",
            "李書文":"李书文",
            "トーマス":"托马斯",
            "エジソン":"爱迪生",
            "ジェロニモ":"杰罗尼莫",
            "ビリー・ザ・キッド":"比利小子",
            "ビリー":"比利",
            "アンリマユ":"安哥拉曼纽",
            "イスカンダル":"伊斯坎达尔",
            "百貌のハサン":"百貌哈桑",
            "百の貌のハサン":"百貌哈桑",
            "アイリスフィール":"爱丽丝菲尔",
            "天の衣":"天之衣",
            "アイリ":"爱丽",
            "酒呑童子":"酒吞童子",
            "玄奘三蔵":"玄奘三藏",
            "源頼光":"源赖光",
            "風魔小太郎":"风魔小太郎",
            "オジマンディアス":"奥兹曼迪亚斯",
            "オジマン":"奥兹曼",
            "ニトクリス":"尼托克丽丝",
            "トリスタン":"崔斯坦",
            "ガウェイン":"高文",
            "静謐のハサン":"静谧哈桑",
            "俵藤太":"表藤太",
            "ベディヴィエール":"贝狄威尔",
            "ベディ":"贝蒂",
            "レオナルド":"莱昂纳多",
            "ダ・ヴィンチちゃん":"达・芬奇亲",
            "ダヴィンチちゃん":"达・芬奇亲",
            "イリヤスフィール":"伊莉雅丝菲尔",
            "フォン":"冯",
            "アインツベルン":"爱因兹贝伦",
            "イリヤ":"伊莉雅",
            "クロエ":"克洛伊",
            "クレオパトラ":"克利奥帕特拉",
            "イシュタル":"伊什塔尔",
            "エルキドゥ":"恩奇都",
            "ケツァル・コアトル":"羽蛇神",
            "ケツァルコアトル":"羽蛇神",
            "ケツァル":"<font title='羽蛇神'>魁札尔</font>",
            "コアトル":"科亚特尔",
            "ゴルゴーン":"戈耳工",
            "ジャガーマン":"豹人",
            "マーリン":"梅林",
            "宮本武蔵":"宫本武藏",
            "ティアマト":"提亚马特",
            "ゲーティア":"盖提亚",
            "ソロモン":"所罗门",
            "山の翁":"山中老人",
            "キングハサン":"王哈桑",
            "ジェームズ":"詹姆斯",
            "モリアーティ":"莫里亚蒂",
            "ヘシアン・ロボ":"狼王",
            "土方歳三":"土方岁三",
            "茶々":"茶茶",
            "プロトアーサー":"旧剑",
            "メルトリリス":"Meltlilith",
            "パッションリップ":"Passionlip",
            "鈴鹿御前":"铃鹿御前",
            "殺生院キアラ":"杀生院祈荒",
            "ビースト":"Beast",
            "シェヘラザード":"山鲁佐德",
            "ペンテシレイア":"彭忒西勒亚",
            "エルドラド":"黄金城",
            "クリストファー":"克里斯托弗",
            "コロンブス":"哥伦布",
            "レジスタンス":"反叛军",
            "シャーロック":"夏洛克",
            "ホームズ":"福尔摩斯",
            "ポール":"保罗",
            "バニヤン":"班扬",
            "パールヴァティー":"雪山神女",
            "インフェルノ":"Inferno",
            "パライソ":"Paraiso",
            "宝蔵院胤舜":"宝藏院胤舜",
            "柳生但馬守宗矩":"柳生但马守宗矩",
            "加藤段蔵":"加藤段藏",
            "刑部姫":"刑部姬",
            "メカエリチャン":"机械伊丽酱",
            "メカエリチャンⅡ号機":"机械伊丽酱Ⅱ号机",
            "キルケー":"喀耳刻",
            "シバの女王":"示巴女王",
            "ミドラーシュ":"米德拉什",
            "アビゲイル":"阿比盖尔",
            "ウィリアムズ":"威廉姆斯",
            "エレシュキガル":"埃列什基伽勒",
            "アルテラ・ザ・サン〔タ〕":"阿蒂拉・the・Sun〔诞〕",
            "サンタアルテラ":"圣诞阿蒂拉",
            "葛飾北斎":"葛饰北斋",
            "セミラミス":"赛米拉米斯",
            "アナスタシア":"阿纳斯塔西娅",
            "アヴィケブロン":"阿维斯布隆",
            "アントニオ":"安东尼奥",
            "サリエリ":"萨列里",
            "ナーサリー☆ライム":"童☆谣",
            "メディカル":"治愈系",
            "マハトマ♀エレナ":"伟大之魂♀海伦娜",
            "コナハト":"康诺特",
            "ファースト・レディ":"First Lady",
            "テスタメント":"圣约",

            //概念礼装
            "頑強":"顽强",
            "瞑想":"冥想",
            "技巧":"技巧",
            "先制":"先制",
            "破壊":"破坏",
            "閃光":"闪光",
            "好機":"良机",
            "豊穣":"丰收",
            "集中":"集中",
            "天啓":"天启",
            "アゾット剣":"Azoth剑",
            "偽臣の書":"伪臣之书",
            "青の黒鍵":"青之黑键",
            "緑の黒鍵":"绿之黑键",
            "赤の黒鍵":"赤之黑键",
            "凛のペンダント":"凛的吊坠",
            "魔導書":"魔导书",
            "龍脈":"龙脉",
            "魔術鉱石":"魔术矿石",
            "竜種":"龙种",
            "鋼の鍛錬":"钢之锻炼",
            "原始呪術":"原始咒术",
            "投影魔術":"投影魔术",
            "ガンド":"Gandr",
            "緑の破音":"绿之破音",
            "宝石魔術・対影":"宝石魔术・对影",
            "優雅たれ":"秉持优雅",
            "虚数魔術":"虚数魔术",
            "天の晩餐":"天之晚餐",
            "天使の詩":"天使之诗",
            "フォーマルクラフト":"元素转换",
            "イマジナリ・アラウンド":"虚数环",
            "リミテッド／ゼロオーバー":"限制/零毁",
            "カレイドスコープ":"万华镜（宝石翁）",
            "ヘブンズ・フィール":"天之杯",
            "旅の始まり":"旅途的开始",
            "葦の海":"芦苇海",
            "封印指定 執行者":"封印指定 执行者",
            "マグダラの聖骸布":"抹大拉的圣骸布",
            "プリズマコスモス":"宇宙棱镜",
            "不夜の薔薇":"不夜蔷薇",
            "ムーンセル・オートマトン":"Mooncell Automaton",
            "ムーニー・ジュエル":"月光宝石",
            "月女神の沐浴":"月女神之沐浴",
            "ムーンライト・フェスト":"月光祝典",
            "ルーンストーン":"符文石",
            "一の太刀":"一之太刀",
            "黒の聖杯":"黑之圣杯",
            "ジャック・オー・ランタン":"南瓜杰克",
            "トリック・オア・トリート":"不给糖就捣蛋",
            "ハロウィン・アレンジメント":"万圣节筹备",
            "ハロウィン・プリンセス":"万圣节公主",
            "ハロウィン・プチデビル":"万圣节小恶魔",
            "メイド・イン・ハロウィン":"万圣节女仆",
            "そして船は征く":"扬帆远航",
            "コードキャスト":"指令咏唱",
            "月の勝利者":"月之胜利者",
            "もう一つの結末":"另一个结局",
            "Fate ぐだぐだオーダー":"唠叨指定",
            "打ち上げオーダー！":"庆功Order！",
            "ぐだお":"唠叨哦",
            "ぐだぐだ看板娘":"唠唠叨叨看板娘",
            "概念礼装EXPカード":"概念礼装EXP卡",
            "おき太":"冲太",
            "ノッブ":"信",
            "魔猪":"魔猪",
            "騎士の矜持":"骑士的矜持",
            "2030年の欠片":"2030年的碎片",
            "雷光のトナカイ君":"雷光之驯鹿",
            "聖者の行進":"圣者的行进",
            "プレゼント・フォー・マイマスター":"献给我的御主的礼物",
            "ホーリーナイト・サイン":"圣夜之印",
            "時計塔":"时钟塔",
            "死霊魔術":"死灵魔术",
            "目覚めた意志":"觉醒的意志",
            "五百年の妄執":"五百年的执着",
            "2016年の平穏":"2016年的平稳",
            "ヒロイック・ニューイヤー":"主人公的新年",
            "ジャングルの掟":"雨林规则",
            "グランド・ニューイヤー":"Grand New Year",
            "モナ・リザ":"蒙娜丽莎",
            "ハッピー×3・オーダー":"Happy×3 Order",
            "ピュアリー・ブルーム":"纯洁绽放",
            "アルトリアの星":"阿尔托莉雅之星",
            "正射必中":"正射必中",
            "みこっと！花嫁修業":"巫女狐！新娘修炼",
            "紅蓮なり影の国":"化为红莲的影之国",
            "謎の物質":"秘之物质",
            "柳洞寺":"柳洞寺",
            "魔力計":"魔力计",
            "愛の霊薬":"爱之灵药",
            "シュトルヒリッター":"白鹳骑士",
            "阿蘭若":"阿兰若",
            "モータード・キュイラッシェ":"摩托・装甲骑兵",
            "ライオンのぬいぐるみ":"狮子玩偶",
            "ルーの光輪":"鲁格的光环",
            "聖者の依代":"圣者凭依之躯",
            "千年黄金樹":"千年黄金树",
            "涙のバレンタイン道場":"泪之情人节道场",
            "キッチン☆パティシエール":"厨房☆糕点师",
            "ストリート・チョコメイド":"街头巧克力女仆",
            "メルティ・スイートハート":"甜蜜之心",
            "カルデアスタンダード":"迦勒底标准样式",
            "クラウンセイバー":"剑之冠",
            "クラウンセイバー・モルガン":"剑之冠Morgan版",
            "牧場のチョコ":"牧场巧克力",
            "皇帝チョコ":"皇帝巧克力",
            "エンローバーフォトン":"光子巧克力条",
            "マキシム・ド・シュヴァリエ":"骑士格调",
            "ヴィクトリーローズ":"胜利玫瑰",
            "八つ橋チョコ":"八桥巧克力",
            "ストロベリーサンダークランチチョコ":"草莓雷光巧克力脆脆棒",
            "ストロベリーサンダークランチョコ":"草莓雷光巧克力脆脆棒",
            "五月の風":"五月之风",
            "アップル・アロー・チョコ":"苹果箭巧克力",
            "へびチョコ（てきとう）":"蛇巧克力（敷衍）",
            "タスケテ":"救命",
            "是非もないチョコ":"无对错巧克力",
            "たこたこメイデン":"章鱼章鱼少女",
            "ビター・ピッチブラック":"苦味漆黑",
            "ワールドエンド・ホワイト":"终焉之白",
            "氷の叡智チョコ":"冰之睿智巧克力",
            "ブランドチョコ":"品牌巧克力",
            "名刀薄緑チョコ風味":"名刀薄绿巧克力风味",
            "王家の白馬":"王家的白马",
            "手作りクッキーと物体Ｘ":"手工饼干与物体X",
            "ジョッキボンボン":"酒杯酒心巧克力",
            "トレジャー・チョコレート":"宝藏巧克力",
            "クリスマスの思い出":"圣诞节的回忆",
            "メリー☆メリー":"快乐☆快乐",
            "カボチャメイデン":"南瓜少女",
            "ショコラ・ジュエル":"巧克力珠宝",
            "重箱洋菓子九重巡り":"重箱西洋点心九重装",
            "パウダー・シュガー・スノー・テイル":"糖霜粉雪传奇",
            "へびチョコ（愛を込めて）":"蛇巧克力（倾注了爱）",
            "ドスチョコ・ビター":"苦味匕首巧克力",
            "ジャワより愛をこめて":"来自爪哇的爱",
            "ブラッドルビー・チョコレート":"血腥红宝石巧克力",
            "おかあさんへ":"献给妈妈",
            "ドゥ・スタリオンチョコ":"金色神驹巧克力",
            "リボン付清姫":"扎丝带的清姬",
            "ワンダフル・ライフ":"美妙人生",
            "ヘキサゴン・チョコボルト":"六角巧克力螺母",
            "st.オルレアン":"圣奥尔良",
            "首切りバニー2016":"斩首兔女郎2016",
            "老成の翁":"老成之翁",
            "冠位人形師":"冠位人偶师",
            "三重結界":"三重结界",
            "拳舞は鮮やかに":"艳丽拳舞",
            "歪曲の魔眼":"歪曲魔眼",
            "夏の未来視":"夏日未来视",
            "リフレイン":"循环",
            "スプリンター":"短跑选手",
            "リピート・マジック":"重复魔术",
            "キス・ユア・ハンド":"吻君之手",
            "センセイとボク":"老师与我",
            "ヴァーサス":"对决",
            "月下の四匹":"月下四影",
            "グラスフル・スイートタイム":"甜美眼镜时光",
            "サロン・ド・マリー":"玛丽沙龙",
            "プリンス・オブ・スレイヤー":"屠龙王子",
            "ノイジー・オブセッション":"喧嚣沉迷",
            "Last Encore":"Last Encore",
            "［Heaven’s Feel］":"[Heaven's Feel]",
            "理想の王聖":"理想的王圣",
            "レコードホルダー":"纪录保持者",
            "波濤の獣":"波涛之兽",
            "パーソナルトレーニング":"个人训练",
            "カルデアの顕学":"迦勒底的学者",
            "カルデアを導く乙女":"引导迦勒底的少女",
            "慈悲無き者":"无慈悲者",
            "毒蛇一芸":"毒蛇一艺",
            "死の芸術":"死之艺术",
            "柔らかな慈愛":"柔软的慈爱",
            "月霊髄液":"月灵髓液",
            "恋知らぬ令嬢":"情窦未开的千金",
            "セルフ・ギアス・スクロール":"自我束缚卷轴",
            "目醒め前":"觉醒之前",
            "至るべき場所":"应至之地",
            "星の王冠":"星之王冠",
            "王の遺物":"王之遗物",
            "串刺し公の凱旋":"穿刺公的凯旋",
            "天の啓示":"天之启示",
            "竜の記憶":"龙之记忆",
            "赤原猟兵":"赤原猎兵",
            "雪の城":"雪之城",
            "森なりし聖":"为林之圣",
            "灼熱の抱擁":"灼热的拥抱",
            "価値無き宝":"无价之宝",
            "永劫の孤独":"永劫孤独",
            "王妃の贈り物":"王妃的赠礼",
            "エリクサー":"不死灵药",
            "わたしの首飾り":"我的项链",
            "彼のくれた杖":"他赐予的杖",
            "アイアン・メイデン":"铁处女",
            "ネコエプロン":"猫咪围裙",
            "勝利の渇き":"对胜利的渴望",
            "親愛なる君へ":"献给亲爱的你",
            "聖なる献身":"神圣的献身",
            "遮那王流離譚":"遮那王流离谭",
            "ゴールデン捕鯉魚図":"黄金捕鲤图",
            "狐の夜の夢":"狐狸的夜之梦",
            "恋談火焔行":"恋谈火焰行",
            "勧進帳読み上げ":"朗读劝进账",
            "王律鍵":"王律之键",
            "ゴールデングラス":"黄金眼镜",
            "万雷の喝采":"雷鸣般的喝彩",
            "ラインの黄金":"莱茵的黄金",
            "女神のきらめき":"女神的闪耀",
            "花の船出":"花之启航",
            "契約の箱":"约柜",
            "バビロンへの扉":"通往巴比伦之门",
            "血を啜る斧":"嗜血之斧",
            "叛逆せよ":"叛逆吧",
            "Go West!!":"Go West!!",
            "英雄風采 三英傑":"英雄风采 三英杰",
            "三昧真火":"三昧真火",
            "三色兼備":"三色兼备",
            "トライスターベルト":"三星腰带",
            "黄金の舵":"黄金船舵",
            "黒騎士の兜":"黑骑士的头盔",
            "黄金のリンゴ":"黄金苹果",
            "カボチャの聖杯":"南瓜圣杯",
            "回転式火縄銃":"回转式火绳枪",
            "ラムレイ二号":"拉姆瑞二号",
            "心を留めるもの":"维系心之物",
            "山中の天":"山中之天",
            "風雲仙姫":"风云仙姬",
            "九首牛魔羅王":"九首牛魔罗王",
            "パーソナル・レッスン":"单人教学",
            "ブロンズリンク・マニピュレーター":"Bronze-Link Manipulators",
            "アトゴウラ":"四枝之浅滩",
            "過ぎ去りし夢":"逝去之梦",
            "激辛麻婆豆腐":"特辣麻婆豆腐",
            "宝石剣ゼルレッチ":"宝石剑泽尔里奇",
            "たまも倶楽部":"玉藻俱乐部",
            "覚悟の鉢金":"觉悟的护额",
            "キャリコ・ジャック":"棉布杰克",
            "魔境に臨みて":"面临魔境",
            "預言の星":"预言之星",
            "ヘカテの錫杖":"赫卡忒的锡杖",
            "カタチのない島":"无形之岛",
            "賢者の樽":"贤者的桶",
            "シャイタンの腕":"撒但之腕",
            "アリアドネの糸":"阿里阿德涅之线",
            "花より団子":"舍华求实",
            "忠犬待ったなし":"忠犬蓄势待发",
            "秘剣・雉子返し":"秘剑・雉鸡返",
            "ゴールデン相撲～岩場所～":"黄金相扑～岩场～",
            "月の湯治":"月之疗养温泉",
            "起源弾":"起源弹",
            "援護射撃":"援护射击",
            "カムランの戦い":"卡姆兰之战",
            "私は誰だ？":"我是谁？",
            "霧夜の倫敦":"雾夜伦敦",
            "ワンダーランド":"仙境",
            "顔の無い王":"无貌之王",
            "薄緑":"薄绿",
            "九賓の礼":"九宾之礼",
            "方天画戟":"方天画戟",
            "残せるもの":"留存之物",
            "熱き門":"炙热之门",
            "ハイドン・セット":"海顿四重奏",
            "アニバーサリー・ヒロインズ":"女主角众周年庆",
            "足どりは軽やかに":"脚步轻盈",
            "王の相伴":"王之相伴",
            "ゴールドフィッシュ・スクーピング":"捞金鱼",
            "ファイヤーフラワー":"火焰之花",
            "雷電の手":"雷电之手",
            "貧者の一灯":"贫者一灯",
            "人間への道程":"成为人类的旅途",
            "黒の兜":"漆黑头盔",
            "ガリア戦記":"高卢战记",
            "罗马":"罗马",
            "五条大橋の邂逅":"五条大桥的邂逅",
            "穢れし死の仮面":"肮脏的死之假面",
            "すごく便利":"超方便",
            "パイレーツ・パーティー！":"海盗派对！",
            "サマータイム・ミストレス":"夏日女主人",
            "トワイライト・メモリー":"黄昏回忆",
            "シャイニー・ゴッデス":"闪耀女神",
            "ナイツ・オブ・マリーンズ":"海军骑士",
            "カルデア・ライフセーバーズ":"迦勒底救生员",
            "ミートウォーズ":"烤肉大战",
            "虚影の塵風かき氷":"虚影之尘风刨冰",
            "殲滅リスト":"歼灭名单",
            "消えざる炎":"不会消失的火焰",
            "月桂樹の指輪":"月桂树的戒指",
            "最後の戦い":"最后的战斗",
            "智慧の魚":"智慧之鱼",
            "寄生爆弾蟲":"寄生爆弹虫",
            "勇士の滾り":"勇士的翻腾",
            "忌まわしきは我が人生":"我的人生即不吉",
            "愛、此処にはなく":"爱、不在此处",
            "蒼玉の魔法少女":"苍玉之魔法少女",
            "見敵必殺":"见敌必杀",
            "ずんがずんが！":"ZUNGA ZUNGA！",
            "カレイドルビー":"万华红宝石",
            "カレイドサファイア":"万华蓝宝石",
            "マジカルルビー":"魔法红宝石",
            "無我識 心空妙有":"无我识 心空妙有",
            "天草四郎陣中旗":"天草四郎阵中旗",
            "シャトー・ディフ":"伊夫堡",
            "無限のパンケーキ":"无限的薄煎饼",
            "赤いジャンパー":"红色套衫",
            "友からの手紙":"来自朋友的信",
            "クランの猛犬":"氏族的猛犬",
            "英雄の武装":"英雄的武装",
            "誉れを此処に":"荣誉至此",
            "原初のレギオン":"起源的军团",
            "月に吼える":"对月咆哮",
            "白薔薇の姫":"白蔷薇姬",
            "ジョイント・リサイタル":"联合演唱会",
            "カルデア・ランチタイム":"迦勒底午餐时光",
            "ランチタイム":"午餐时光",
            "フラガラック":"佛拉格拉克",
            "天の逆月":"天之逆月",
            "ヒュドラ・ダガー":"许德拉匕首",
            "不撓不屈":"不屈不挠",
            "たった一人の戦争":"只有一人的战争",
            "聖なる泉":"圣泉",
            "不滅なる刃":"不灭之刀",
            "隠された女神":"被隐藏的女神",
            "文明の灯火":"文明的灯火",
            "技量、神域に達する":"能力、已达神域",
            "騎士の誓い":"骑士的誓约",
            "真・階差機関":"真・差分机",
            "デンジャラス・ビースト":"危险野兽",
            "月夜の魔女":"月夜魔女",
            "ロマニ・アーキマン伯爵の歓待":"罗玛尼・阿其曼伯爵的款待",
            "勇者エリちゃんの冒険":"勇者小伊丽的冒险",
            "ウィザード＆プリースト":"法师＆牧师",
            "マタ・ハリの酒場":"玛塔・哈丽的酒吧",
            "焔刑の地獄":"火刑的地狱",
            "ゴルディアスの結び目":"戈耳迪之结",
            "白竜":"白龙",
            "陽の差さぬ此処へ":"向没有阳光的此处",
            "黄金律の発露":"黄金律的表现",
            "この大地の精霊":"这个大地的精灵",
            "銃を拝見":"请让我瞻仰一下你的枪",
            "百人蔵書":"百人藏书",
            "最後の欠片":"最后的碎片",
            "Fate/EXTELLA":"Fate/EXTELLA",
            "神便鬼毒酒":"神便鬼毒酒",
            "童子切安綱":"童子切安纲",
            "ラムセウム":"拉美西姆",
            "骨刀（無銘）":"骨刀（无铭）",
            "ゴールデンベアー号":"黄金小熊号",
            "グリンガレット":"格林格雷特",
            "ただ一度の嘘":"唯一一次谎言",
            "行使されざる王権":"未被行使的王权",
            "鬼の面":"鬼面",
            "炊けども尽きぬ":"炊之不尽",
            "王の馬":"王之马",
            "万能の智、根底の知":"万能之智，根底之知",
            "サンセット・ビーチ":"日落・海滩",
            "湖の乙女":"湖之少女",
            "夏の思い出":"夏日的回忆",
            "ただいま入浴中！":"现在正在入浴中！",
            "プリドゥエン":"Prydwen",
            "砂浜ラブレター（恐怖）":"沙滩情书（恐怖）",
            "失われた右腕":"失去的右臂",
            "存在の証明":"存在的证明",
            "静穏なひと時":"安静平稳之刻",
            "聖夜の読書":"圣夜的阅读",
            "聖者の招待":"圣者的招待",
            "聖夜の晩餐":"圣夜晚餐",
            "チャンピオンカップ":"冠军奖杯",
            "夢幻召喚（インストール）":"梦幻召唤（Install）",
            "運命の蛇":"命运之蛇",
            "ホーリー・ナックル":"Holly・Knuckle",
            "最低限のたしなみ":"最低限度的兴致",
            "痛覚共有":"痛觉共有",
            "地の底の信仰":"处于地底的信仰",
            "ハロウィンへの招待状":"万圣节的邀请函",
            "First Order":"First Order",
            "魔性菩薩":"魔性菩萨",
            "ルームガーダー":"私室警备员",
            "ミラクル求道者":"奇迹求道者",
            "七頭の戦鎚シタ":"七头的战槌杖",
            "フワワの花":"芬巴巴之花",
            "ピエドラ・デル・ソル":"太阳之石",
            "海への扉":"通向大海的门",
            "天命の粘土板":"天命的粘土板",
            "クリューサーオール":"克律萨俄耳",
            "ありえざる明日":"不可能的明日",
            "原初の火":"原初之火",
            "最果ての塔":"最遥远之塔",
            "ファースト・サンライズ":"朝日初升",
            "射初の一矢":"射初一矢",
            "カッコーの巣の上で":"飞跃疯人巢",
            "チアーズ・トゥ・2017":"为2017喝彩",
            "空の仏":"空之佛",
            "幽谷の淵":"幽谷之渊",
            "固有結界":"固有结界",
            "若返りの霊薬":"返老还童的灵药",
            "謎の仮面群":"谜之面具群",
            "キュート・オランジェット":"可爱柑橘巧克力",
            "ショコラティエ":"巧克力手艺人",
            "チョコ・エンゼル":"巧克力天使",
            "ビター・ブラック":"苦味之黑",
            "ブレスフル・タイム":"美妙时光",
            "勝者の余裕":"胜利者的从容",
            "スイート・クリスタル":"甜蜜水晶",
            "フォンダン・オ・ショコラ":"熔岩巧克力蛋糕",
            "黒騎士くん":"黑骑士",
            "高級和菓子":"高级和式点心",
            "特製お団子":"特制的团子",
            "君もドラゴンセット":"你也是龙的套装",
            "ささやかな愉しみを、君と":"与你分享小小的快乐",
            "バナナ（ハヌマーン贈呈）":"香蕉（哈努曼赠）",
            "いと気高き希望の花よ":"圣洁高贵的希望之花啊",
            "お肌の味方":"肌肤的伙伴",
            "でんせつのオーブチョコ":"传说的宝珠巧克力",
            "カエサル式ケーナ":"凯撒式晚餐",
            "ジャンヌファンクラブセット":"贞德粉丝俱乐部集套",
            "部屋はもう取ってあるんだが":"房间已经准备好了",
            "シルバーボックス":"银制罐盒（Silver Box）",
            "ラピス・ラズリの腕飾り":"青金的手链",
            "こんぼう（バーベキュー味）":"俄里翁棒（烤肉味）",
            "交流式ライトニングクッキー":"交流式雷电饼干",
            "カルナへの一矢":"射向迦尔纳的一箭",
            "ブルースカイ・ヴァニラMt.":"蓝天香草Mt.",
            "ジュエルカット・スターズ":"群星切片宝石",
            "今から間に合う家事セット":"现在开始还来得及家务套装",
            "～ベスト・オブ・トリスタン～":"崔斯坦精选集（Best Of Tristan）",
            "ありきたりチョコ（？）":"普通巧克力（？）",
            "お返しはキスで":"回礼就用吻吧",
            "名も知れぬ記念銀貨":"无名的纪念银币",
            "アビシャグに捧ぐ愛":"向亚比煞献上的爱",
            "わくわくざぶーん優待チケット":"心跳不已的水上乐园招待券",
            "シルバーバレット":"银制子弹",
            "究極の美味に至るまで":"直到成为究极的美味",
            "ひよこ豆のペーストと…":"鹰嘴豆泥与…",
            "落陽のピアス":"落日的耳环",
            "ワールドエンド・キャッスル":"世界尽头的城堡（World End Castle）",
            "チョコレートドライバー":"巧克力螺丝起子酒",
            "白い花":"白花",
            "赤い花":"红花",
            "DHA":"DHA",
            "鉄観音茶（？）":"铁观音茶（？）",
            "なんのへんてつもないちょこ":"平淡无奇的巧克力",
            "謝肉祭":"狂欢节",
            "ハートチョコ・ビタービタービター":"心形巧克力Bitter Bitter Bitter",
            "たまごチョコ":"蛋形巧克力",
            "ルーン石のチョコ":"卢恩石的巧克力",
            "1999年の残滓":"1999年的残渣",
            "パックス・ロマーナ":"罗马的和平（Pax Romana）",
            "トロイの木馬（手の平サイズ）":"特洛伊木马（手心的大小）",
            "感謝の白薔薇":"感谢的白蔷薇",
            "カカオの実":"可可树果实",
            "白紙の勧進帳（弁慶サイン付）":"白纸的劝进帐（附弁庆签名）",
            "アイアン・マシュマロ":"铁制棉花糖（Iron Marshmallow）",
            "メイヴちゃん印のハニーチョコ":"梅芙酱印章的蜂蜜巧克力",
            "勇者の杯":"勇者之杯",
            "スフィンクス・アウラード":"斯芬克斯的幼崽",
            "自由なるカカワトル":"自由的热可可",
            "ヒポグリフぬいぐるみ（1/1）":"骏鹰玩偶（1/1）",
            "ラビット・キュート・チョコ":"可爱兔子状巧克力（Rabbit cute choco）",
            "ライダーベルト・レプリカ":"骑手腰带・复刻版（Rider Belt Replica）",
            "Sサンダークランチチョコスティック":"S草莓巧克力卷（S Sander crunch chocostick）",
            "読みかけのイーリアス":"正读到半的伊利亚斯",
            "ベイヤードのたてがみ":"用作礼物的鬃毛",
            "秘密で秘蔵で秘宝アルバム":"秘密、秘藏、秘宝的相册",
            "葉巻とワイン":"雪茄与红酒",
            "蟠桃のコンポート":"蟠桃糖水",
            "バステニャンX号":"贝斯特喵X号",
            "完璧なるチョッコラート":"完美无缺的Cioccolato",
            "手作り愛情チョコ":"亲手做的爱情巧克力",
            "フォウくんマペット":"芙芙玩偶",
            "UFO":"UFO",
            "直流式グレイトフルクッキー":"直流式Greatful饼干",
            "ママのとっておき":"妈妈的秘藏",
            "ナイルの恵み":"尼罗河的恩赐",
            "モンブラン・オ・ショコラ":"Mont-blanc au chocolat",
            "ユーフラテスの夕べ":"幼发拉底的傍晚",
            "じるクン人形":"吉尔君玩偶",
            "ちくたくくん":"嘀嗒嘀嗒君",
            "ドルイドの杖":"德鲁伊之杖",
            "いつか見た幻":"似曾相识的幻象",
            "すべての源は、数":"一切的根源，数",
            "ジェロニモ式モカシン":"杰罗尼莫式莫卡辛鞋",
            "青い鳥のようなマウス":"青鸟形状的鼠标",
            "155番目のソネット":"第155首十四行诗",
            "おもちゃのピアノ":"玩具小钢琴",
            "ネクタール・ボンボン":"甘露酒心巧克力",
            "アル・ブクール":"Al-Bukhur",
            "紅白のチョコ":"红白的巧克力",
            "弾丸と銃":"子弹与枪",
            "ビターテイスト・サマー":"夏日苦味",
            "スーパーナイルフラワーズ":"Super Nile flowers",
            "手作りライスボール":"手制饭团",
            "百個入りチョコ袋":"百粒袋装巧克力",
            "銘菓風魔まんじゅう":"名点风魔馒头",
            "ブラック・ブラック・キス":"Black Black Kiss",
            "万能布ハッサン":"万能布哈桑",
            "サンソンの栄養チョコドリンク":"桑松的营养巧克力饮料",
            "ホワイト・デスマスク":"纯白死者假面",
            "名月":"名月",
            "ゴールデン・ゴールド・セット":"黄金组合（Golden Gold Set）",
            "救急キット":"急救包",
            "ミニクーちゃん":"迷你库酱",
            "極上源氏柏餅":"极品源氏柏饼",
            "謎のホットココアX":"谜之热可可X",
            "猪のかぶりもの":"野猪头饰",
            "何者かの宝剣":"未晓其主的宝剑",
            "瑞典火竜炭火焼サーロイン":"碳烤瑞典火龙上腰肉",
            "あまいもの":"甜食",
            "祝いの飾り":"庆典装饰",
            "ピール・ガウガメラ":"高加米拉战象",
            "シー・ウァレス・ウァレオ":"Si Vales Valeo",
            "妻からの礼状":"来自妻子的谢函",
            "叛逆への第一歩":"通向叛逆的第一步",
            "ラビリンスマップ":"迷宫地图",
            "教会式手作りクッキー":"教会式自制饼干",
            "聖女の安らぎ":"圣女的安稳",
            "淹れ立てのコーヒー":"现泡的咖啡",
            "自爆大爆発チョコ":"自爆大爆发巧克力",
            "たまごチョコ（複数）":"蛋形巧克力（复数）",
            "悪魔のバンダナ":"恶魔的印花巾",
            "フリーランサー":"Freelancer",
            "小惑星の力学":"小行星动力学",
            "干将・莫耶（拳銃）":"干将・莫邪（手枪）",
            "彼方の荒野":"遥远的荒野",
            "百八魔星":"一百零八魔星",
            "熱砂の語らい":"热沙的话语",
            "探偵ヱドモン～春先旅情編～":"侦探埃德蒙～早春旅情篇～",
            "アズ・ユー・ウィッシュ":"如您所愿（As you wish）",
            "カフェ・キャメロット":"卡米洛特咖啡馆",
            "アウトレイジ":"非法行为（Outrage）",
            "オペレーション・フィオナ":"费奥南作战",
            "キャトルフィーユ":"四叶的苜蓿（Qatre Feuilles）",
            "ネヴァーランド":"永无乡（Never land）",
            "ラ・シエスタ":"午睡时光（La Siesta）",
            "ガーデン":"庭园",
            "第六天魔王":"第六天魔王",
            "日輪の城":"日轮之城",
            "壬生狼":"壬生狼",
            "春風遊歩道":"春风游步道",
            "社交界の華":"社交界之花",
            "ぐだぐだ明治維新":"咕哒咕哒明治维新",
            "ぐだぐだウェルカム":"欢迎来到咕哒咕哒（Gudaguda Welcome）",
            "誓いの羽織":"誓言的羽织",
            "小豆のお手玉":"纳入小豆的布袋",
            "我らが征くは星の大海":"我等的征途是星辰大海",
            "いつかの夏":"那时盛夏",
            "月の海の生徒会":"月之海的学生会",
            "始まりの予感":"开始的预感",
            "ザ・ケージ":"笼中鸟",
            "BBショット！":"BB出击！",
            "輝くばかりの":"无尽闪耀之物",
            "目を逸らさずに":"不再逃避",
            "路傍の夢":"天魔之春修行",
            "天魔の春修行":"路旁之梦",
            "揺籃の夢":"摇篮之梦",
            "瓦礫の聖堂":"瓦砾的圣堂",
            "まるごしシンジ君":"手偶慎二君",
            "幻想種":"幻想种",
            "シャフリヤール王の閨":"山鲁亚尔王的寝宫",
            "洛陽の宮殿":"洛阳的宫殿",
            "戦神の軍帯":"战神的军带",
            "ニーニャ号":"尼尼亚号",
            "カルデア・アニバーサリー":"迦勒底周年纪念",
            "アフタヌーン・パーティー":"午间宴会",
            "スターライト・フェスト":"星光盛宴",
            "マンガで分かる！FGO":"从漫画了解FGO！",
            "フロンティア":"新天地",
            "自慢の一挺":"自豪的一把",
            "サマー・リトル":"稚嫩炎夏",
            "ホワイト・クルージング":"白砂巡航",
            "シュガー・バケーション":"甜蜜假期",
            "シーサイド・ラグジュアリー":"奢华海滨",
            "虹の海の黄金劇場":"虹之海的黄金剧场",
            "万能包帯":"万能包带",
            "太陽からの賜り物":"太阳所赠之物",
            "女神の優勝カップ":"女神的优胜奖杯",
            "真夏のひと時":"盛夏时光",
            "キング・ジョーカー・ジャック":"King Joker Jack",
            "カルデア・ビーチバレー":"迦勒底沙滩排球",
            "ダイブ・トゥ・ブルー":"Dive to Blue",
            "選定のモップ":"选定之拖把",
            "ニャーフ！":"NYARF！",
            "京極":"京极",
            "プリズマ☆イリヤ 雪下の誓い":"魔法少女☆伊莉雅 雪下的誓言",
            "バトル・オリンピア":"决战 奥林匹亚",
            "チア・フォー・マスター":"Cheer For Master",
            "フード・コロシアム":"美食角斗场",
            "マッスル・キャバリエ":"肌肉骑士",  //664
            "英霊肖像":"英灵肖像",
            "英霊正装":"英灵正装",
            "チョコレート":"巧克力",
            "チョコ":"巧克力",
            "チョコレート＆お返し":"巧克力回礼",
            "絆礼装第":"羁绊礼装第",
            "弾":"弹",

            //地名
            "エリア":"区域",
            "屋敷跡":"宅邸残迹",
            "爆心地":"爆炸中心地",
            "大橋":"大桥",
            "燃え盛る森":"熊熊燃烧的森林",
            "オルレアン":"奥尔良",
            "ドンレミ":"栋雷米",
            "ヴォークルール":"沃库勒尔",
            "ラ・シャリテ":"拉沙里泰",
            "ジュラ":"汝拉",
            "リヨン":"里昂",
            "マルセイユ":"马赛",
            "ディエール":"蒂耶尔",
            "ティエール":"蒂耶尔",
            "ボルドー":"波尔多",
            "パリ":"巴黎",
            "セプテム":"七丘之城",
            "エトナ火山":"埃特纳火山",
            "アッビア街道":"亚壁街道",
            "フロレンティア":"佛罗伦萨",
            "メディオラヌム":"梅迪奥兰",
            "ゲルマニア":"日耳曼尼亚",
            "黒い森":"黑森林",
            "マッシリア":"玛西格利亚",
            "ブリタニア":"不列颠尼亚",
            "ガリア":"高卢",
            "形ある島":"有形之岛",
            "連合首都":"联军首都",
            "オケアノス":"俄刻阿诺斯",
            "王の住まう島":"王者的居岛",
            "地図に記された島":"地图上标记的岛",
            "潮目の海":"潮眼之海",
            "翼竜の島":"翼龙之岛",
            "カルデラの島":"火山臼之岛",
            "嵐の海域":"暴风雨海域",
            "静かな入り江":"寂静的入海口",
            "隠された島":"隐藏之岛",
            "豊かな海":"丰硕之海",
            "ロンドン":"伦敦",
            "オールドストリート":"旧街",
            "ホワイトチャペル":"白色教堂",
            "シティ・オブ・ロンドン":"伦敦城",
            "クラーケンウェル":"克勒肯维尔",
            "サザーク":"萨瑟克",
            "ソーホー":"苏活区",
            "リージェントパーク":"摄政公园",
            "ウェストミンスター":"威斯敏斯特",
            "ハイドパーク":"海德公园",
            "北米":"北美",
            "イ・プルーリバス・ウナム":"合众为一",
            "ブラックヒルズ":"布拉克山",
            "リバートン":"里弗顿",
            "デンバー":"丹佛",
            "デミング":"德明",
            "ラボック":"拉伯克",
            "ダラス":"达拉斯",
            "アレクサンドリア":"亚历山德里亚",
            "アルカトラズ":"阿尔卡特拉斯岛",
            "デモイン":"得梅因",
            "カーニー":"卡尼",
            "モントゴメリー":"蒙哥马利",
            "シャーロット":"夏洛特",
            "ワシントン":"华盛顿",
            "シカゴ":"芝加哥",
            "キャメロット":"卡美洛",
            "砂嵐の砂漠":"沙尘暴的沙漠",
            "明けの砂丘":"黎明的沙丘",
            "死の荒野":"死之荒野",
            "山裾":"山麓",
            "東の村":"东之村",
            "西の村":"西之村",
            "西の村跡":"西之村遗迹",
            "抜け道":"近道",
            "砦裏":"要塞内",
            "円卓の砦":"圆桌要塞",
            "晩鐘廟":"晚钟庙",
            "アトラス院":"阿特拉斯院",
            "隠れ村":"隐秘之村",
            "聖都正門":"圣都正门",
            "聖都市街":"圣都市街",
            "無の大地":"无之大地",
            "バビロニア":"巴比伦尼亚",
            "廃都バビロン":"废都巴比伦",
            "北の高台":"北之高台",
            "黒い杉の森":"黑色杉木林",
            "ウルク市街":"乌鲁克市内",
            "ジグラット":"神塔",
            "大使館":"大使馆",
            "湿原":"湿地",
            "ウル":"乌尔",
            "エリドゥ":"埃里都",
            "観測所":"观测所",
            "葦の原":"芦苇原",
            "クタ":"库撒",
            "ニップル":"尼普尔",
            "エビフ山":"艾比夫山",
            "鮮血神殿":"鲜血神殿",
            "ペルシア湾":"波斯湾",
            "天の丘":"天之丘",
            "アガルタ":"雅戈泰",
            "下総国":"下总国",
            "セイレム":"塞勒姆",

            //敌人
            "フランス兵":"法国士兵",
            "ケルト兵":"凯尔特士兵",
            "ケルト兵長":"凯尔特士兵长",
            "海賊":"海盗",
            "海賊頭":"海盗首领",
            "ドルイド":"德鲁伊",
            "アマゾネス":"亚马逊人",
            "アマゾネスリーダー":"亚马逊队长",
            "アマゾネスクィーン":"亚马逊女王",
            "スケルトン":"<font title='或 骸骨兵'>骷髅兵</font>",
            "竜牙兵":"龙牙兵",
            "スケルトンキング":"骸骨之王",
            "ゾンビ":"僵尸",
            "古代兵ゾンビ":"古代兵僵尸",
            "フランス兵ゾンビ":"法国士兵僵尸",
            "海賊ゾンビ":"海盗僵尸",
            "ゴースト":"鬼魂",
            "テラーゴースト":"恐怖鬼魂",
            "エンシェントゴースト":"古代鬼魂",
            "ヒュージゴースト":"巨大鬼魂",
            "オートマタ":"自动人偶",
            "キリングドール":"杀戮人偶",
            "オールドギア":"陈旧装置",
            "ヘルタースケルター":"混沌机械兵",
            "機械化歩兵":"机械化步兵",
            "機械式ゴーレム":"机械式魔偶",
            "ゴーレム":"魔偶",
            "ストーンゴーレム":"石魔偶",
            "アイアンゴーレム":"金属魔偶",
            "クリスタルゴーレム":"水晶魔偶",
            "ツインスチールゴーレム":"双子钢铁魔偶",
            "スペルブック":"咒语书",
            "サンダーブック":"雷电咒书",
            "ファイアブック":"火焰咒书",
            "ウィンドブック":"疾风咒书",
            "アイスブック":"冰雪咒书",
            "グリモア":"魔导书",
            "ホムンクルス":"人工生命体",
            "プロトホムンクルス":"原始人工生命体",
            "ラミア":"蛇女",
            "ナーガ":"那伽",
            "ナーガラージャ":"那伽王",
            "ケンタウロス":"半人马",
            "ケンタウロスナイト":"半人马骑士",
            "ケンタウロスパラディン":"半人马圣骑士",
            "ウェアウルフ":"狼人",
            "ウェアジャガー":"豹人",
            "ゴブリン":"哥布林",
            "キメラ":"奇美拉",
            "ホワイトキメラ":"白色奇美拉",
            "ワイバーン":"双足飞龙",
            "ワイバーンドレッド":"恐惧飞龙",
            "ワイバーンエビル":"恶魔飞龙",
            "ワイバーンオリジン":"原始飞龙",
            "ワイバーンテンペスト":"风暴双足飞龙",
            "ドラゴン":"龙",
            "グレートドラゴン":"巨龙",
            "ファヴニール":"法夫纳",
            "デーモン":"恶魔",
            "グレーターデーモン":"上级恶魔",
            "アークデーモン":"高等恶魔",
            "ソウルイーター":"噬魂者",
            "スプリガン":"守护者",
            "ブロンズスプリガン":"青铜守护者",
            "バイコーン":"双角兽",
            "ゲイザー":"凝视者",
            "スフィンクス":"斯芬克斯",
            "マリカスフィンクス":"母斯芬克斯",
            "イフリータ":"伊夫利塔",
            "心を失った者":"失心之人",
            "心を失った咎者":"失心罪人",
            "アグラヴェインの猟犬":"阿格规文的猎犬",
            "ロイヤルガード":"皇家护卫",
            "女神ロンゴミニアド":"女神伦戈米尼亚德",
            "ドクヤドカリ":"毒寄居蟹",
            "オオヤドカリ":"大寄居蟹",
            "センネンヤドカリ":"千年寄居蟹",
            "ウリディンム":"乌利迪姆",
            "ウシュムガル":"乌修穆迦尔",
            "バシュム":"巴修穆",
            "ムシュフシュ":"穆修胡休",
            "アブスの腕":"阿勃祖之腕",
            "イシュタルガード":"伊什塔尔护卫",
            "神々の遺産":"诸神的遗产",
            "ウルク兵スパルタン":"乌鲁克士兵斯巴达",
            "ガルラ霊":"迦鲁拉灵",
            "ムシュマッヘ":"穆修玛夫",
            "ウガル":"乌伽尔",
            "怒りのエビフ霊":"愤怒的艾比夫灵",
            "怒りのスーパーエビフ霊":"愤怒的超级艾比夫灵",
            "ルチャドール":"摔跤手",
            "ラフム":"拉赫穆",

            specialData:[
                [/([\u30a1-\u30fa\u30fc-\u30ff\u31f0-\u31ff\uff66-\uff9f])オルタ($|[^\u30a1-\u30fa\u30fc-\u30ff\u31f0-\u31ff\uff66-\uff9f])/g, '$1 Alter$2'],
                [/([\u30a1-\u30fa\u30fc-\u30ff\u31f0-\u31ff\uff66-\uff9f])リリィ($|[^\u30a1-\u30fa\u30fc-\u30ff\u31f0-\u31ff\uff66-\uff9f])/g, '$1 Lily$2'],
                [/ジャンヌ[・･·\s]?ダルク/g, '贞德'],
                [/シャルル(?:.?アンリ)?([・･·\s]?)サンソン/g, '夏尔$1亨利$1桑松'],
                [/ファントム(☆)?(?:[・･·\s]?オブ)?(?:[☆・･·\s]?ジ)?[☆・･·\s]?オペラ/g, '剧$1院$1魅$1影'],
                [/ダ([・･·\s]?)ヴィンチ/g, '达$1芬奇'],
                [/ジル([☆・･·\s])?ド(?:[☆・･·\s])?レェ/g, '吉尔$1德$1雷'],
                [/([\u30a1-\u30fa\u30fc-\u30ff\u31f0-\u31ff\u4e00-\u9fff\uf900-\ufaff\uff66-\uff9f]\s*)(?:x|ｘ)(\s*\d+)(\D?)/g, '$1×$2$3'],
                [/毎ターン/g, '每回合'],
                [/状態/g, '&#13;状态'],
            ]
        };

        //  ↓  词条统计

        (function(){
            let longestEntry = "";
            for(let i = 0; i < Object.keys(aT.data).length; i++){
                if(longestEntry.length < Object.keys(aT.data)[i].length)
                    longestEntry = Object.keys(aT.data)[i];
            }
            console.log("\n翻译数据中的词条个数为：\n" + Object.keys(aT.data).length + "\n\n最长词条为：\n" + longestEntry + "\n\n其长度为：\n" + longestEntry.length + "\n");
        })();


        //  ↓  新增样式

        function addStyle(st){
            $('<style type="text/css" />').html(st).appendTo('head');
        }


        //  ↓  新增脚本

        function addScript(sc){
            $('<script type="text/javascript" />').html(sc).appendTo('head');
        }


        //  ↓  正则表达式

        var regExpC = [/[A-Za-z\uff21-\uff3a\uff41-\uff5a]/,  //1.英文
                       /[\u3041-\u306d\u306f-\u309f\u3005\u4e00-\u9fff\uf900-\ufaff]/,  //2.日文平假名（不含“の”） + 汉字
                       /[\u30a1-\u30fa\u30fc-\u30ff\u31f0-\u31ff\uff66-\uff9f]/,  //4.日文片假名（不含点）
                       /[・･·]/,  //8
                       /の/,  //16
                      ];


        //  ↓  特殊处理函数相关

        var sD = aT.data.specialData;
        var regS = '';
        for(let i = 0; i < sD.length; i++)
            regS += sD[i][0];
        regS = new RegExp(regS.replace(/^\//, '(').replace(/\/g?\//g, '|').replace(/\/g?$/, ')'));

        function specialTrans(t){
            while(regS.test(t)){
                for(let i = 0; i < sD.length; i++){
                    t = t.replace(sD[i][0], sD[i][1]);
                }
            }
            return t;
        }


        //  ↓  字符判断函数

        function tIdentify(t){
            var tmp = [];
            for(let i = 0; i < t.length; i++){
                for(var j = 0; j < regExpC.length; j++){
                    if(regExpC[j].test(t.charAt(i)))
                        break;
                }
                tmp[i] = [t.charAt(i), Math.pow(2, j)];
            }
            return tmp;
        }


        //  ↓  拆词级别

        var splitLevel = ['a[i][1] + a[i-1][1] < 33',
                          'a[i][1] == a[i-1][1] || (a[i][1] + a[i-1][1]) == 12 || (a[i][1] + a[i-1][1]) == 18',
                          'a[i][1] == a[i-1][1]',
                         ];


        //  ↓  拆词函数

        function splitText(t, l){
            var a = tIdentify(t);
            var tmp = [a[0][0]];
            for(let i = 1; i < a.length; i++)
                if(eval(splitLevel[l]))
                    tmp.push(a[i][0]);
                else
                    tmp.push('⋗ꕷꮲꮮꮖꭲ⋖' + a[i][0]);
            return tmp.join('').split('⋗ꕷꮲꮮꮖꭲ⋖');
        }


        //  ↓  拆词后查找翻译

        function findTransW(t, l){
            if(l >= splitLevel.length)
                return t;
            var tmp = splitText(t, l);
            var tmpf;
            for(let i = 0; i < tmp.length; i++){
                tmpf = tmp[i];
                while(/([^・･·]+)[･·]/.test(tmpf))
                    tmpf = tmpf.replace(/([^・･·]+)[･·]/, '$1・');
                tmp[i] = aT.data[tmpf] ? /・/.test(aT.data[tmpf]) ? aT.data[tmpf].replace(/・/g, tmp[i].match(/[・･·]/)[0]) : aT.data[tmpf] : findTransW(tmp[i], l + 1);
            }
            return tmp.join('');
        }


        //  ↓  查找翻译

        function findTrans(t){

            if(!t)
                return null;

            var tmpC = t.trim();  //去掉字符串开头和结尾的空格（主要是为了去掉回车和制表符）

            if(!tmpC)
                return t;

            var tmpS = t.match(/^\s*/)[0], tmpE = t.match(/\s*$/)[0];

            if(aT.data[tmpC])  //直接查找翻译
                return tmpS + aT.data[tmpC] + tmpE;

            var tmp = tmpC.replace(/</g, '&#60;');  //将原文中的 < 转码以防翻译后的文本被误识为标签

            tmp = specialTrans(tmp);  //筛选需要特殊处理的词并做预处理

            tmp = findTransW(tmp, 0);  //尝试拆分文字和符号

            if(tmp == tmpC)
                return t;
            else
                return tmpS + tmp + tmpE;

        }


        //  ↓  遍历 TreeWalker 并翻译

        function transTW(tw){
            while(node = tw.nextNode()){
                if(node.title)
                    node.title = findTrans(node.title);
                if(node.nodeType == 3 && /[\u3041-\u30fa\u30fc-\u30ff\u31f0-\u31ff\u4e00-\u9fff\uf900-\ufaff\uff66-\uff9f]/.test(node.nodeValue)){
                    var t = node;
                    $(t).before(findTrans(t.nodeValue));
                    node = tw.previousNode();
                    $(t).remove();
                }
                if($(node).attr('data-itemicon'))
                    node.dataset.itemicon = findTrans(node.dataset.itemicon);
            }
        }


        //  ↓  localStorage 测试

        function testStorage(s){
            if(!!s){
                try{
                    s.testkey = 'testvalue';
                    s.removeItem('testkey');
                    return true;
                }
                catch(e){
                    return false;
                }
            }
            else
                return false;
        }


        //  ↓  @wiki 增加还原日文切换按钮和回到顶部按钮（触发翻译函数也整合至此）

        if(/Fate\/Grand Order @wiki 【FGO】/.test($("title")[0].text)){
            setTimeout(function(){

                var st, sc;

                st = ".btt, div.transBTN{visibility:hidden;opacity:0;width:37px;border:2px solid #4682b4;color:#4682b4;text-align:center;position:fixed;right:60px;bottom:90px;z-index:99999999;font-weight:bold;text-decoration:none;background-color:#fff;cursor:pointer;" +
                    "transition:all 0.5s ease-in-out;-o-transition:all 0.5s ease-in-out;-moz-transition:all 0.5s ease-in-out;-webkit-transition:all 0.5s ease-in-out;-ms-transition:all 0.5s ease-in-out;-webkit-user-select:none;-moz-user-select:none;-ms-user-select:none;user-select:none;}" +
                    " .btt:hover, .transBTN:hover{background-color:#4682b4;color:#fff;} .btnSwitch{visibility:visible;opacity:1;}" +
                    " .originalHTML, .transHTML{visibility:hidden;position:absolute;top:0} div.showSwitch{visibility:visible;position:static}";  //回到顶部按钮用 visibility 控制显示/隐藏是因为直接用 display 控制的话没有渐变效果；主体翻译部分用 visibility 是为了页内 id 链接跳到正确位置

                addStyle(st);

                $('#left-ads, #ads, .ads').remove();  //去广告

                (function checkLazy(i){
                    var j = i ? i : 1;
                    if($('img.lazy[style*="opacity"]').length && j < 10)
                        if($('img.lazy[style*="opacity"]').css('opacity') != 1)
                            setTimeout(function(){checkLazy(j + 1);}, 150);
                        else
                            go();
                    else
                        go();
                })();  //若有加载中的 lazyload 图片则尝试等待加载完成再执行后续操作

                function go(){

                    let a = ['#header', '#menubar', '#wikibody'];
                    for(let i in a){
                        let c = $(a[i]).children(),
                            d = $('<div style="position:relative" />').appendTo(a[i]);  //为方便定位，在主体翻译部分外层加了个容器
                        $('<div class="originalHTML" />').append(c.clone(true)).appendTo(d);
                        $('<div class="transHTML" />').append(c).appendTo(d);
                    }  //备份可能被翻译的日文原文

                    let items = $('.item, .item2');
                    items = items.slice(0, items.length / 2);
                    items.each(function(){
                        regEvent(this, ItemIconCallback);
                    });  //为部分素材图标重新绑定丢失的鼠标悬停事件

                    //  ↓  修改展开/收起型按钮的事件

                    aT.k = $('[href^="javaScript:onClick=ex"]').parent().nextAll('script').html().match(/key = '([^']+)/)[1];
                    aT.f = {
                        idFunc: function(id){
                            let t = $('#' + id + ':not(:empty)');
                            if(t.css('display') == 'none'){
                                if(/treeMenu/.test(id) && aT.k)
                                    document.cookie = aT.k + "=open; path=/f_go/; expires=Tue, 31-Dec-2030 23:59:59; ";
                                t.css('display', 'block');
                            }
                            else{
                                if(/treeMenu/.test(id) && aT.k)
                                    document.cookie = aT.k + "=close; path=/f_go/; expires=Tue, 31-Dec-2030 23:59:59; ";
                                t.css('display', 'none');
                            }
                        }  //基于 id 触发按钮的自定义函数
                    };

                    $('[href^="javaScript:onClick="]').each(function(i, b){  //获取函数名的关键字为 plugin_openclose 、 exMenu 等基于 id 触发的按钮
                        b.href = 'javaScript:onClick=atwikiTransToCN.f.idFunc' + b.href.slice(b.href.search(/\(/));  //用自定义函数名替换原函数名
                    });

                    let sync = [
                        ' td.atwiki_plugin_region_button',
                        ' a[href="#"]:contains("▼表示/非表示")',
                        ' div.gallery > div.gallery_btn > div',
                    ];  //通过自身绑定事件实现功能的按钮的选择器

                    for(let m in a)
                        for(let n in sync){
                            let t = $(a[m] + sync[n]);
                            for(let i = 0; i < t.length; i++)
                                $(t[i]).attr('sync-index', i);  //为按钮添加序号标识
                            t.bind('click.sync', function(){
                                if(aT.clickMark)
                                    aT.clickMark = 0;
                                else{
                                    aT.clickMark = 1;
                                    $(t[(parseInt($(this).attr('sync-index')) + t.length / 2) % t.length]).triggerHandler('click');
                                }
                            });  //为按钮添加同步点击事件
                        }

                    //  ↑  修改展开/收起型按钮的事件

                    st = '.lazyload, .lazyloading{opacity: 0;} .lazyloaded {opacity: 1;transition: opacity 400ms;}';

                    addStyle(st);

                    $('img.lazy').addClass('lazyload').each(function(i, img){
                        if(!$(img).attr('data-src'))
                            $(img).attr('data-src', $(img).attr('data-original'));
                        $(img).attr('data-expand', 300);
                    });  //用 lazysizes 替代原 lazyload

                    $('#wikibody').append('<div class="btt"><div style="height:13px;">\u23F6</div><div style="height:24px">TOP</div></div><div class="transBTN" style="right:99px;visibility:visible;opacity:1;height:37px;line-height:36px;font-size:16px"></div>');  //增加还原日文切换按钮和回到顶部按钮

                    $('.btt').click(function(){
                        $('html, body').animate({scrollTop: 0}, 300, 'linear');
                    });  //回到顶部事件

                    $(document).scroll(function(){
                        if ($(window).scrollTop() > 500)
                            $('.btt').addClass('btnSwitch');
                        else
                            $('.btt').removeClass('btnSwitch');
                    });  //回到顶部按钮显示/隐藏事件

                    $('.transBTN').click(function(){
                        if(testStorage(window.localStorage)){
                            if(localStorage.atwikiTransSwitch == 'c'){
                                localStorage.atwikiTransSwitch = 'j';
                                $('.originalHTML').addClass('showSwitch');
                                $('.transHTML').removeClass('showSwitch');
                                $('.transBTN').html('日');
                            }
                            else{
                                localStorage.atwikiTransSwitch = 'c';
                                $('.transHTML').addClass('showSwitch');
                                $('.originalHTML').removeClass('showSwitch');
                                $('.transBTN').html('中');
                            }
                        }
                        else{
                            alert("抱歉！您的浏览器不支持此功能...");
                            return;
                        }
                    });  //还原日文切换事件

                    if(testStorage(window.localStorage)){
                        if(!localStorage.atwikiTransSwitch){
                            localStorage.atwikiTransSwitch = 'c';
                            $('.transHTML').addClass('showSwitch');
                            $('.transBTN').html('中');
                        }
                        else{
                            if(localStorage.atwikiTransSwitch == 'c'){
                                $('.transHTML').addClass('showSwitch');
                                $('.transBTN').html('中');
                            }
                            else{
                                $('.originalHTML').addClass('showSwitch');
                                $('.transBTN').html('日');
                            }
                        }
                    }
                    else{
                        $('.transBTN').html('中');
                        $('.transHTML').addClass('showSwitch');
                    }  //切换状态初始化

                    let twFilter = function(node){
                        if($(node).hasClass("originalHTML") || node.tagName == "SCRIPT")
                            return NodeFilter.FILTER_REJECT;
                        else
                            return NodeFilter.FILTER_ACCEPT;
                    };
                    let elTW = document.createTreeWalker(document.getElementById('atwiki-jp-bg2'), NodeFilter.SHOW_Element, twFilter, false);  //声明变量 elTW 并赋值：创建 TreeWalker （根节点为 document.getElementById('atwiki-jp-bg2') ，搜索元素节点，过滤为 twFilter ，不需要扩展实体引用）
                    transTW(elTW);  //执行翻译
                    $('title').html(findTrans($('title').html()));

                    if($('div#fouSlider')[0]){
                        let fSp = $('div#fouSlider').parent();
                        for(let i = 0; i < fSp.length; i++)
                            $(fSp[i]).attr('sync-index', i);
                        StatusCalc.replaceAll = function(parent, growId, rareId, hpBaseId, hpMaxId, atkBaseId, atkMaxId, classNameId, fouId){
                            growId = (growId !== undefined) ? growId : 'grow';
                            rareId = (rareId !== undefined) ? rareId : 'rare';
                            hpBaseId = (hpBaseId !== undefined) ? hpBaseId : 'hpbase';
                            hpMaxId = (hpMaxId !== undefined) ? hpMaxId : 'hpmax';
                            atkBaseId = (atkBaseId !== undefined) ? atkBaseId : 'atkbase';
                            atkMaxId = (atkMaxId !== undefined) ? atkMaxId : 'atkmax';
                            classNameId = (classNameId !== undefined) ? classNameId : 'classname';
                            fouId = (fouId !== undefined) ? fouId : 'fou';
                            var self = this;
                            var multi_num = /grow(\d*)/.test(growId) && RegExp.$1 || "";

                            let p = $(parent).closest('[class*="HTML"]').parent(),
                                o = p.length ? p.find('.originalHTML') : $('body'),
                                t = p.find('.transHTML'),
                                fS = $('div#fouSlider'),
                                i;
                            for(i = 0; i < fS.length; i++)
                                if($(fS[i]).parent().attr('sync-index') == $(parent).attr('sync-index'))
                                    break;

                            var grow = o.find('span#'+growId).text().trim();
                            var rare = o.find('span#'+rareId).text().trim();
                            var hpBase = o.find('span#'+hpBaseId).text().trim();
                            var hpMax = o.find('span#'+hpMaxId).text().trim();
                            var atkBase= o.find('span#'+atkBaseId).text().trim();
                            var atkMax = o.find('span#'+atkMaxId).text().trim();
                            var className = o.find('span#'+classNameId).text().trim();

                            if(!aT.fou)
                                aT.fou = 0;
                            let fou1 = o.find('input#'+fouId),
                                fou2 = t.find('input#'+fouId),
                                fou3 = parseInt(fou1.val() || 0),
                                fou4 = p.length ? parseInt(fou2.val() || 0) : fou3,
                                fou = fou3 == aT.fou ? fou4 : fou3;
                            fou1.val(fou);
                            fou2.val(fou);
                            aT.fou = fou;

                            if (grow == "" || rare == "" || hpBase == "" || hpMax == "" || atkBase == "" || atkMax == "" || className == "")
                                return;

                            // ◆該当する数値に&spanclass(calcATKas8fix)のように繋げて書く
                            // calcHP|calcATK|calcSUM|calcHEAD|calcANY : HEADとANYはこのメソッドでは使用しないが、HEADは"Lv.100"のようなHEAD行出力、ANYはなにもせずテーブル調整のみ
                            // as8|lv90 : テーブル整理機能付きのasX as0=初期MaxLV, as1-4=霊基再臨MaxLv, as5-8=聖杯再臨MaxLv(10刻み), 又は 計算だけの lvXX
                            // fix|tr : fix=クラス補正する(省略可), tr=行消し用

                            $('span[class^="calc"]', p.length ? p.find('div#fouSlider').parent('[sync-index="' + i + '"],[sync-index="' + (i + fS.length / 2) % fS.length + '"]') : parent).each(function() {
                                if (multi_num.length > 0 && (!parent || parent.attr('class') != ('csub'+multi_num)))
                                    return true;

                                var prm = ($(this).attr('class') || '').match(/^(calc(?:HP|ATK|SUM|HEAD|ANY))((?:as|lv)\d+)(fix)?$/), prm = [RegExp.$1, RegExp.$2, RegExp.$3];
                                if (prm[2] == 'init') {
                                    return true;
                                }
                                // 列調整等の場合計算はしない
                                if (prm[0] != 'calcHP' && prm[0] != 'calcATK' && prm[0] != 'calcSUM') {
                                    return true;
                                }
                                var func = prm[0] == 'calcHP' ? self.calcHP : self.calcATK;
                                var level = prm[1].substring(2);
                                // 再臨段階のMAXレベルを取得する

                                var ascount = prm[1];
                                if (ascount.indexOf('as') != -1) {
                                    ascount = parseInt(ascount.substring(2));
                                    if (isNaN(ascount))
                                        return true;
                                    level = self.getAscensionMaxLevel(rare, ascount-1);
                                }
                                if (isNaN(parseInt(level)) || level > 100)
                                    return true;
                                var stat = 0;
                                if (prm[0] == 'calcHP' || prm[0] == 'calcSUM')
                                    stat += self.calcHP(level, grow, rare, hpBase, hpMax, fou);
                                if (prm[0] == 'calcATK' || prm[0] == 'calcSUM')
                                    stat += self.calcATK(level, grow, rare, atkBase, atkMax, fou, (prm[2] == 'fix' ? className : ""));
                                $(this).text(stat);
                                // フォウ君強化ありならスタイル変更

                                if (fou > 0) {
                                    $(this).css({
                                        "font-weight": "bold",
                                    });
                                } else {
                                    $(this).css({
                                        "font-weight": "normal",
                                    });
                                }
                            });
                        };  //修改原芙芙模拟器相关函数
                    }
                }

            },200);  //为“更新履歴”处设置的小延时，可根据自身情况调整。
        }


        //  ↓  素材效率剧场相关

        if(/効率劇場/.test($("title")[0].text))
            (function(){
                let elTW = document.createTreeWalker(document.body, NodeFilter.SHOW_Element, null, false);
                transTW(elTW);

                let st = "div#xxwc{border-collapse:collapse;padding:0;margin:0;background-color:#073763;position:relative} .xxwc1plus2{padding-top:5px;height:18px;width:12px} #xxwcplus2{position:absolute;top:0px;left:19px}" +
                    " #xxwcleft{position:absolute; left:8px} #xxwcright{position:absolute; left:30px} .xxwctop{top:-2px; height:15px; -webkit-transform: scale(0.75); -o-transform: scale(1)}" +
                    " .xxwcbottom{top:8px; height:15px; -webkit-transform: scale(0.75); -o-transform: scale(1)}  #xxwcMouseOver{position:absolute;-webkit-user-select: none;-moz-user-select: none;-ms-user-select: none;user-select: none;cursor:default}" +
                    " #innerDiv{width:170px;margin:10px;background-color:#fff;border:1px solid #073763;color:#073763;font-family:serif;line-height:24px;text-align:center;opacity:0.95}" +
                    " a.xxwc{text-decoration:none;color:#073763;cursor:pointer} a.xxwc:hover:before, a.xxwc:hover:after{color:#073763}" +
                    " a.xxwc:before{content:'\\5b';color:#bbb;transition:all 400ms;-o-transition:all 400ms;-moz-transition:all 400ms;-webkit-transition:all 400ms;}" +
                    " a.xxwc:after{content:'\\5d';color:#bbb;transition:all 400ms;-o-transition:all 400ms;-moz-transition:all 400ms;-webkit-transition:all 400ms;}";

                addStyle(st);

                let sc = "var xxwcTimeout;function hideM(){document.getElementById('xxwcMouseOver').style.display='none'} function enter(event){if(xxwcTimeout)clearTimeout(xxwcTimeout);if(document.getElementById('xxwcMouseOver').style.display=='none')" +
                    "{var x,y;x=event.target.getBoundingClientRect().left;y=event.target.getBoundingClientRect().top;if(y>window.innerHeight-130){y-=95;if(5>x)x=-4;else if(x>window.innerWidth-80)x=window.innerWidth-208;" +
                    "else if(x>window.innerWidth-300)x-=128;else x-=10}else{if(5>x){x+=45;y-=10}else if(x>window.innerWidth-80){x-=185;y-=10}else{y+=15;if(x>window.innerWidth-300)x-=128;else x-=10}}" +
                    "document.getElementById('xxwcMouseOver').style.left=x+'px';document.getElementById('xxwcMouseOver').style.top=y+'px';document.getElementById('xxwcMouseOver').style.display='block'}}function leave(){xxwcTimeout=setTimeout('hideM()',400)}";

                addScript(sc);

                $('.xxwc').parent().attr('style', 'margin:0;padding:0;');

                if(!$('#xxwcMouseOver').length)/*创建提示页*/{
                    let xM = "<div id='innerDiv'><div class='xxwcM'>1张 <a class='xxwc' href='http://fgowiki.com/guide/equipdetail/99' target='_blank' onclick='hideM()'>英灵肖像</a></div><div style='line-height:9px' align='center'>+</div>";
                    xM += "<div class='xxwcM'>2张 &#x2726;满破&#x2726; <a class='xxwc' href='http://fgowiki.com/guide/equipdetail/330' target='_blank' onclick='hideM()'>午餐时光</a></div><div class='xxwcM'>（1张自己 + 1张支援）</div></div>";
                    $('body').append('<div id=xxwcMouseOver onmouseenter="enter(event);" onmouseleave="leave();" style="display:none">' + xM + '</div>');
                }

                let pics = [], i = 0, index, t, tr, tmp;

                elTW.currentNode = elTW.root;  //使 TreeWalker 的当前指向回到根节点

                while(node = elTW.nextNode()){
                    if(i != -1 && node.nodeValue != "諸注意"){
                        if(node.rowSpan == 5 && node.previousSibling.tagName == "TH"){
                            pics[i] = node.innerHTML;
                            i++;
                        }
                    }
                    else{
                        i = -1;
                        if(node.nodeValue == '証' && $(node).parent().next().html() == '骨'){
                            index = $(node).parent().index();
                            if(index < 5){
                                t = index;
                                tr = node.parentNode.parentNode;
                                while(tr.childNodes[t].innerText != "剑"){
                                    tr.childNodes[t].setAttribute("style", "padding:0;");
                                    $(tr.childNodes[t]).append( pics[t-index].replace(/.+url\((\/\/images.+no_expand=1).+/, '<div style="height:39px"><img style="width:36px" src="$1"></div>') );
                                    t++;
                                }
                            }
                        }
                    }
                }
            })();


        if(/(appmedia|wicurio)/.test(window.location.href)){
            let elTW = document.createTreeWalker(document.body, NodeFilter.SHOW_Element, null, false);
            transTW(elTW);
        }

    }

})();









