// ==UserScript==
// @name        marketShareHelper
// @namespace   virtonomica
// @version     1.04
// @grant       GM_getValue
// @grant       GM_setValue
// @include        http*://*virtonomic*.*/*/main/unit/view/*/supply
// @include        http*://*virtonomic*.*/*/main/unit/view/*/trading_hall
// @require        http://ajax.googleapis.com/ajax/libs/jquery/1.3/jquery.min.js
// @author  chippa
// @description marketShareHelper description
// @downloadURL https://update.greasyfork.org/scripts/28510/marketShareHelper.user.js
// @updateURL https://update.greasyfork.org/scripts/28510/marketShareHelper.meta.js
// ==/UserScript==

// getter

$(document).ready(function()
{
  var currentRealm = $('a[href*="by_trade_at_cities"]').attr("href").split("\/")[3];
  var shopId = window.location.href.split("\/")[7];
//	console.log(currentRealm);
    var CityList = {
        'Агуаскальентес':'/422607/422609/422626',
'Адлер':'/2931/2945/423510',
'Акапулько':'/422607/422609/422632',
'Актау':'/7060/7065/7087',
'Актобе':'/7060/7065/7084',
'Акюрейри':'/423475/423476/423480',
'Алмалык':'/310392/310393/423031',
'Алматы':'/7060/7063/7076',
'Алмере':'/359837/359838/359845',
'Амстердам':'/359837/359838/359839',
'Ангрен':'/310392/310393/423508',
'Андижан':'/310392/310393/310397',
'Апатиты':'/2931/331858/423533',
'Архангельск':'/2931/331858/331860',
'Астана':'/7060/7062/7073',
'Астрахань':'/2931/2945/423564',
'Атырау':'/7060/7065/7086',
'Афины':'/422043/422044/422046',
'Байконур':'/7060/7063/7081',
'Баку':'/3054/3055/3056',
'Баркисимето':'/375142/375143/375147',
'Барселона (Ve)':'/375142/375143/375151',
'Баямо':'/422187/422188/422942',
'Белая Церковь':'/3010/3011/422996',
'Белен':'/423837/423840/423854',
'Белу-Оризонти':'/423837/423841/423848',
'Берген':'/335165/335166/335168',
'Берлин':'/15905/3042/3043',
'Берум':'/335165/335166/335171',
'Бирмингем':'/15904/15916/15936',
'Биробиджан':'/2931/2961/366263',
'Бобруйск':'/15734/15735/16322',
'Бонн':'/15905/3042/15955',
'Бордо':'/15906/3030/3037',
'Брадфорд':'/15904/15916/422981',
'Бразилиа':'/423837/423838/423846',
'Бремен':'/15905/3042/3052',
'Брест':'/15734/15735/15737',
'Бристоль':'/15904/15916/352886',
'Бургас':'/303253/303254/303257',
'Бухара':'/310392/310393/310399',
'Быдгощ':'/423195/423197/423206',
'Вавуния':'/423103/423105/423113',
'Вагаршапат':'/303829/303830/423575',
'Валенсия (Ve)':'/375142/375143/375146',
'Ванадзор':'/303829/303830/303833',
'Ванкувер':'/422362/422364/422367',
'Вантаа':'/301309/301310/422978',
'Варна':'/303253/303254/303256',
'Варшава':'/423195/423196/423199',
'Великие Луки':'/2931/331858/331870',
'Великий Новгород':'/2931/331858/331866',
'Велико-Тырново':'/303253/303254/423033',
'Вентспилс':'/325645/325646/422943',
'Вилейка':'/15734/15735/422521',
'Виллахермоса':'/422607/422611/422648',
'Вильнюс':'/325650/325651/325652',
'Виннипег':'/422362/422364/422372',
'Винница':'/3010/3018/3022',
'Висбаден':'/15905/3042/423027',
'Витебск':'/15734/15735/15741',
'Владивосток':'/2931/2961/2964',
'Владикавказ':'/2931/2945/366652',
'Волгоград':'/2931/2945/2947',
'Вологда':'/2931/331858/331864',
'Волос':'/422043/422044/422051',
'Воркута':'/2931/331858/331872',
'Воронеж':'/2931/2932/2935',
'Вроцлав':'/423195/423198/423202',
'Вупперталь':'/15905/3042/422980',
'Выборг':'/2931/331858/331873',
'Вышний Волочек':'/2931/2932/366651',
'Гаага':'/359837/359838/359840',
'Габрово':'/303253/303254/423021',
'Гавана':'/422187/422188/422189',
'Гавр':'/15906/3030/3039',
'Гамбург':'/15905/3042/3044',
'Гамильтон':'/422362/422363/422373',
'Ганновер':'/15905/3042/3053',
'Гатчина':'/2931/331858/331871',
'Гвадалахара':'/422607/422609/422614',
'Гданьск':'/423195/423197/423204',
'Гдыня':'/423195/423197/423807',
'Гомель':'/15734/15735/15738',
'Гояния':'/423837/423838/423853',
'Гродно':'/15734/15735/15739',
'Грозный':'/2931/2945/352279',
'Гронинген':'/359837/359838/359846',
'Гуадалупе':'/422607/422608/422633',
'Гуантанамо':'/422187/422188/422193',
'Гуарульюс':'/423837/423841/423855',
'Гюмри':'/303829/303830/303832',
'Гянджа':'/3054/3055/3057',
'Даугавпилс':'/325645/325646/325648',
'Дехивала-Маунт-Лавиния':'/423103/423104/423108',
'Джизак':'/310392/310393/423019',
'Днепропетровск':'/3010/3011/3014',
'Добрич':'/303253/303254/423022',
'Донецк':'/3010/3011/3015',
'Дортмунд':'/15905/3042/3049',
'Доха':'/423554/423555/423557',
'Дрезден':'/15905/3042/15957',
'Дуйсбург':'/15905/3042/422042',
'Дюссельдорф':'/15905/3042/3051',
'Екатеринбург':'/2931/2950/2951',
'Елабуга':'/2931/2939/422530',
'Елгава':'/325645/325646/422513',
'Ереван':'/303829/303830/303831',
'Жанаозен':'/7060/7065/422526',
'Жезказган':'/7060/7061/7068',
'Житомир':'/3010/3018/3021',
'Запорожье':'/3010/3011/3016',
'Зыряновск':'/7060/7064/422505',
'Ивано-Франковск':'/3010/3018/3020',
'Иваново':'/2931/2932/2938',
'Индустриальный район Катара':'/423554/423555/423558',
'Ираклион':'/422043/422045/422049',
'Иркутск':'/2931/2956/371340',
'Йорк':'/15904/15916/422514',
'Казанлык':'/303253/303254/422076',
'Казань':'/2931/2939/2943',
'Калгари':'/422362/422364/422368',
'Калининград':'/2931/331858/331859',
'Калмунай':'/423103/423105/423114',
'Камагуэй':'/422187/422188/422191',
'Кампинас':'/423837/423841/423856',
'Канди':'/423103/423105/423112',
'Канкун':'/422607/422611/422631',
'Канны':'/15906/3030/422528',
'Караганда':'/7060/7061/7066',
'Каракас':'/375142/375143/375144',
'Карлсруэ':'/15905/3042/422492',
'Карши':'/310392/310393/423032',
'Катовице':'/423195/423198/423208',
'Каунас':'/325650/325651/325653',
'Квебек':'/422362/422363/422371',
'Кемерово':'/2931/2956/2960',
'Киев':'/3010/3011/3012',
'Киль':'/15905/3042/422977',
'Клайпеда':'/325650/325651/325654',
'Ковентри':'/15904/15916/15943',
'Коканд':'/310392/310393/422512',
'Кокшетау':'/7060/7062/7071',
'Коломбо':'/423103/423104/423107',
'Коломна':'/2931/2932/422085',
'Копенгаген':'/423255/423256/423257',
'Костанай':'/7060/7062/7069',
'Кострома':'/2931/2932/367968',
'Коупавогюр':'/423475/423476/423478',
'Кохтла-Ярве':'/325655/325656/423548',
'Краков':'/423195/423196/423200',
'Краснодар':'/2931/2945/2948',
'Красноярск':'/2931/2956/2959',
'Кристиансанн':'/335165/335166/422021',
'Кульякан':'/422607/422608/422629',
'Курган':'/2931/2950/422086',
'Куритиба':'/423837/423842/423850',
'Курск':'/2931/2932/423527',
'Кызылорда':'/7060/7063/7080',
'Кёльн':'/15905/3042/3046',
'Ларисса':'/422043/422044/422050',
'Лас Тунас':'/422187/422188/422979',
'Ленкорань ':'/3054/3055/422527',
'Леон':'/422607/422609/422618',
'Лестер':'/15904/15916/375138',
'Ливерпуль':'/15904/15916/373539',
'Лидс':'/15904/15916/15938',
'Лиепая':'/325645/325646/325649',
'Лион':'/15906/3030/3033',
'Липецк':'/2931/2932/2937',
'Лодзь':'/423195/423196/423201',
'Лондон':'/15904/15916/15935',
'Лоустофт':'/15904/15916/422941',
'Луганск':'/3010/3011/3017',
'Львов':'/3010/3018/3019',
'Любек':'/15905/3042/422529',
'Люберцы':'/2931/2932/371339',
'Люблин':'/423195/423196/423207',
'Люксембург':'/423581/423582/423583',
'Маастрихт':'/359837/359838/359844',
'Магнитогорск':'/2931/2950/2954',
'Майкоп':'/2931/2945/423566',
'Манаус':'/423837/423840/423849',
'Манчестер':'/15904/15916/15941',
'Маракай':'/375142/375143/375149',
'Маракайбо':'/375142/375143/375145',
'Маргилан':'/310392/310393/423020',
'Марсель':'/15906/3030/3032',
'Масейо':'/423837/423839/423859',
'Матурин':'/375142/375143/375150',
'Махачкала':'/2931/2945/422506',
'Мерида':'/422607/422611/422624',
'Мехикали':'/422607/422608/422630',
'Мехико':'/422607/422610/422612',
'Минск':'/15734/15735/15736',
'Могилёв':'/15734/15735/15740',
'Молодечно':'/15734/15735/302148',
'Монреаль':'/422362/422363/422366',
'Монтеррей':'/422607/422608/422620',
'Моратува':'/423103/423104/423109',
'Москва':'/2931/2932/2933',
'Мурманск':'/2931/331858/331862',
'Мюнхен':'/15905/3042/3045',
'Наманган':'/310392/310393/310395',
'Нант':'/15906/3030/3041',
'Нарва':'/325655/325656/325659',
'Наукальпан':'/422607/422610/422623',
'Негомбо':'/423103/423104/423110',
'Несауалькойотль':'/422607/422610/422621',
'Нижний Новгород':'/2931/2939/2940',
'Николаев':'/3010/3023/3025',
'Никополь':'/3010/3011/422998',
'Ницца':'/15906/3030/3035',
'Новороссийск':'/2931/2945/2949',
'Новосибирск':'/2931/2956/2957',
'Норильск':'/2931/2956/367967',
'Ноттингем':'/15904/15916/423565',
'Нукус':'/310392/310393/310400',
'Нюрнберг':'/15905/3042/15954',
'Оденсе':'/423255/423256/423259',
'Одесса':'/3010/3023/3024',
'Ольборг':'/423255/423256/423260',
'Ольгин':'/422187/422188/422192',
'Омск':'/2931/2956/2958',
'Орхус':'/423255/423256/423258',
'Осло':'/335165/335166/335167',
'Оттава':'/422362/422363/422369',
'Оулу':'/301309/301310/422038',
'Павлодар':'/7060/7062/7072',
'Париж':'/15906/3030/3031',
'Патры':'/422043/422045/422048',
'Пермь':'/2931/2939/2944',
'Петанж':'/423581/423582/423585',
'Петрозаводск':'/2931/331858/331863',
'Петропавловск':'/7060/7062/7070',
'Петропавловск-Камчатский':'/2931/2961/422543',
'Пинар-дель-Рио':'/422187/422188/422195',
'Пирей':'/422043/422044/422495',
'Плевен':'/303253/303254/303261',
'Пловдив':'/303253/303254/303258',
'Познань':'/423195/423197/423203',
'Полтава':'/3010/3011/13055',
'Портсмут':'/15904/15916/423547',
'Порту-Алегри':'/423837/423842/423852',
'Потсдам':'/15905/3042/422022',
'Псков':'/2931/331858/331867',
'Пуэбла-де-Сарагоса':'/422607/422610/422615',
'Пярну':'/325655/325656/422019',
'Радом':'/423195/423196/423808',
'Рейкьявик':'/423475/423476/423477',
'Реймс':'/15906/3030/3040',
'Ренн':'/15906/3030/3038',
'Ресифи':'/423837/423839/423851',
'Рига':'/325645/325646/325647',
'Риддер':'/7060/7064/422507',
'Рио-де-Жанейро':'/423837/423841/423844',
'Рованиеми':'/301309/301310/301315',
'Родос':'/422043/422045/422997',
'Ромбас':'/15906/3030/423573',
'Ростов-на-Дону':'/2931/2945/2946',
'Роттердам':'/359837/359838/359841',
'Рудный':'/7060/7062/7075',
'Русе':'/303253/303254/303260',
'Рыльск':'/2931/2932/423509',
'Рязань':'/2931/2932/422040',
'Салвадор':'/423837/423839/423845',
'Салоники':'/422043/422044/422047',
'Сальтильо':'/422607/422608/422627',
'Самара':'/2931/2939/2941',
'Самарканд':'/310392/310393/310396',
'Сан-Гонсалу':'/423837/423841/423857',
'Сан-Луис':'/423837/423839/423858',
'Сан-Луис-Потоси':'/422607/422609/422628',
'Сан-Марино':'/423084/423085/423086',
'Сан-Паулу':'/423837/423841/423843',
'Санкт-Петербург':'/2931/331858/2934',
'Санта-Клара':'/422187/422188/422194',
'Сантьяго-де-Куба':'/422187/422188/422190',
'Сапопан':'/422607/422609/422619',
'Саратов':'/2931/2939/423572',
'Севастополь':'/3010/3023/3028',
'Северодвинск':'/2931/331858/331868',
'Семипалатинск':'/7060/7064/7083',
'Симферополь':'/3010/3023/3026',
'Сливен':'/303253/303254/422496',
'Смолян':'/303253/303254/423574',
'Сосновец':'/423195/423198/423809',
'София':'/303253/303254/303255',
'Сочи':'/2931/2945/5033',
'Спарта':'/422043/422045/422515',
'Ставангер':'/335165/335166/335169',
'Стара-Загора':'/303253/303254/303259',
'Страсбург':'/15906/3030/3036',
'Сумгаит':'/3054/3055/3058',
'Сургут':'/2931/2950/2955',
'Сыктывкар':'/2931/331858/331865',
'Сьюдад-Гуаяна':'/375142/375143/375148',
'Сьюдад-Хуарес':'/422607/422608/422616',
'Таганрог':'/2931/2945/423001',
'Таланс':'/15906/3030/422018',
'Талдыкорган':'/7060/7063/7079',
'Таллин':'/325655/325656/325657',
'Тампере':'/301309/301310/301313',
'Тараз':'/7060/7063/7078',
'Тарту':'/325655/325656/325658',
'Ташкент':'/310392/310393/310394',
'Темиртау':'/7060/7061/7067',
'Термез':'/310392/310393/423567',
'Тихуана':'/422607/422608/422617',
'Томск':'/2931/2956/10716',
'Торонто':'/422362/422363/422365',
'Трикомали':'/423103/423105/423111',
'Тронхейм':'/335165/335166/335170',
'Тулуза':'/15906/3030/3034',
'Турку':'/301309/301310/301314',
'Тюмень':'/2931/2950/2953',
'Ужгород':'/3010/3018/423550',
'Умм-Салаль':'/423554/423555/423563',
'Уральск':'/7060/7065/7085',
'Ургенч':'/310392/310393/423030',
'Усть-Каменогорск':'/7060/7064/7082',
'Утрехт':'/359837/359838/359842',
'Уфа':'/2931/2939/2942',
'Ухта':'/2931/331858/331869',
'Фергана':'/310392/310393/310398',
'Форталеза':'/423837/423839/423847',
'Франкфурт':'/15905/3042/3047',
'Хабаровск':'/2931/2961/2962',
'Хабнарфьордюр':'/423475/423476/423479',
'Ханья':'/422043/422045/422052',
'Харлем':'/359837/359838/422074',
'Харьков':'/3010/3011/3013',
'Хельсинки':'/301309/301310/301311',
'Херсон':'/3010/3023/3027',
'Челябинск':'/2931/2950/2952',
'Ченстохова':'/423195/423198/423209',
'Череповец':'/2931/331858/331861',
'Черновцы':'/3010/3018/423532',
'Чирчик':'/310392/310393/423029',
'Чиуауа':'/422607/422608/422622',
'Чуст':'/310392/310393/423576',
'Шауляй':'/325650/325651/422940',
'Шахты':'/2931/2945/423568',
'Шеффилд':'/15904/15916/348029',
'Шри-Джаяварденепура-Котте':'/423103/423104/423106',
'Штутгарт':'/15905/3042/3050',
'Шымкент':'/7060/7063/7077',
'Щецин':'/423195/423197/423205',
'Эбербах':'/15905/3042/422493',
'Эдмонтон':'/422362/422364/422370',
'Эйндховен':'/359837/359838/359843',
'Экатепек-де-Морелос':'/422607/422610/422613',
'Экибастуз':'/7060/7062/7074',
'Эль-Вакра':'/423554/423555/423559',
'Эль-Дахира':'/423554/423555/423561',
'Эль-Хор':'/423554/423555/423562',
'Эль-Шахания':'/423554/423555/423560',
'Эр-Райян':'/423554/423555/423556',
'Эрмосильо':'/422607/422608/422625',
'Эспоо':'/301309/301310/301312',
'Эссен':'/15905/3042/3048',
'Эш-сюр-Альзетт':'/423581/423582/423584',
'Юрмала':'/325645/325646/422037',
'Якутск':'/2931/2961/2963',
'Ялта':'/3010/3023/422089',
'Ярославль':'/2931/2932/2936'
};
    
  var $tbody = $("table.list:eq(0) > tbody:eq(0)");

	$tbody.children("tr.product_row").each(function() {
      var $tr = $(this);
		
          var productCode = $tr.children("th").children("table").children("tbody").children("tr").children("td").children("img").attr("src").split("\/").pop().replace(".gif", "");
//    console.log(productCode);

          var ProductMarketPortionVar = currentRealm +""+ shopId +""+ productCode;
//    console.log(ProductMarketPortionVar);
    
//				  var marketPortion = GM_getValue(ProductMarketPortionVar, 0);
				  var something = GM_getValue(ProductMarketPortionVar, 0).split("|");
          var marketPortion = something[0];
          var profit = something[1];
          var totalMarket = something[2];
          var color = "grey";
          if(marketPortion < 144) color = "lime";
          if(marketPortion < 50) color = "LightGreen";
          if(marketPortion < 30) color = "yellow";
          if(marketPortion < 10) color = "orange";
          if(marketPortion < 1) color = "red";
          if(marketPortion == 1) color = "grey";

          var color2 = "grey";
          color2 = "lime";
          if(profit < 50) color2 = "LightGreen";
          if(profit < 30) color2 = "yellow";
          if(profit < 10) color2 = "orange";
          if(profit < 1) color2 = "red";

    $tr.children("th").children("table").children("tbody").append('<tr><td>Доля рынка:</td><td style="background-color:'+color+';">'+marketPortion+'%</td></tr>');
    $tr.children("th").children("table").children("tbody").append('<tr><td>Заработок:</td><td style="background-color:'+color2+';">'+profit+'%</td></tr>');
//    $tr.children("th").children("table").children("tbody").append('<tr><td>10%:</td><td>15%:</td></tr>');
//    $tr.children("th").children("table").children("tbody").append('<tr><td style="background-color:'+color+';">'+Math.floor(totalMarket * 0.1)+'</td><td style="background-color:'+color+';">'+Math.floor(totalMarket * 0.15)+'</td></tr>');
//    $tr.children("th").children("table").children("tbody").append('<tr><td>20%:</td><td style="background-color:'+color+';">'+Math.floor(totalMarket * 0.2)+'</td></tr>');

    //$tr.children("td:eq(4)").children("input").val('666');
        if(marketPortion > 0.5)
            {
    $tr.children("td:eq(4)").append('<br>\
<span class=1ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.01)+'\')">1%</span>&nbsp; \
<span class=5ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.05)+'\')">5%</span>&nbsp; \
<span class=10ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.1)+'\')">10%</span><br><br> \
<span class=15ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.15)+'\')">15%</span>&nbsp; \
<span class=25ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.25)+'\')">25%</span>&nbsp; \
<span class=48ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.48)+'\')">48%</span><br><br> \
<span class=50ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.5)+'\')">50%</span>&nbsp; \
<span class=75ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 0.75)+'\')">75%</span>&nbsp; \
<span class=100ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket * 1)+'\')">100%</span>&nbsp; \
                                    ');
    }else{
        var thisid = $tr.attr("id").replace("product_row_", "").replace("-0", "");
        
        var bee = $(".officePlace").text().split("Расположение: ")[1].split(" (")[0];
        var CityId = CityList[bee];
        var link = "https://virtonomica.ru/"+currentRealm+"/window/globalreport/marketing/by_trade_at_cities/"+thisid+CityId;
        // "/423103/423104/423106";
//        console.log(link);
        $.get( link, function( data ) {
            var totalMarket2 = data.split("Объем рынка:")[1].split("ед.")[0].split("<b>")[1].replace(" ", "").replace(" ", "").replace(" ", "").replace(" ", "");
//        console.log('product - ' + thisid + '| volume: ' + totalMarket2);
            
    $tr.children("td:eq(4)").append('<br>\
<span class=1ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.01)+'\')">1%</span>&nbsp; \
<span class=5ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.05)+'\')">5%</span>&nbsp; \
<span class=10ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.1)+'\')">10%</span><br><br> \
<span class=15ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.15)+'\')">15%</span>&nbsp; \
<span class=25ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.25)+'\')">25%</span>&nbsp; \
<span class=48ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.48)+'\')">48%</span><br><br> \
<span class=50ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.5)+'\')">50%</span>&nbsp; \
<span class=75ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 0.75)+'\')">75%</span>&nbsp; \
<span class=100ex style="border-bottom: 1px dashed #0184D0; color: #0184D0; cursor: pointer;text-decoration: none;" onclick="$(this).parent().children(\'input\').val(\''+Math.floor(totalMarket2 * 1)+'\')">100%</span>&nbsp; \
                                    ');

            // console.log( "total volume: " + g );
        });
//     console.log(g);
        

    }
//    .children("div").val('666');
    
    });
    
        var $tbody = $("table.list:eq(0) > tbody:eq(0)");
    if(window.location.href.indexOf("supply") > -1) {
  $tbody.parent().before("<div>Со всеми отображенными: \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".1ex\").click();'>1%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".5ex\").click();'>5%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".10ex\").click();'>10%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".15ex\").click();'>15%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".25ex\").click();'>25%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".48ex\").click();'>48%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".50ex\").click();'>50%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".75ex\").click();'>75%</span> \
<span style=\"font-size:75%;margin:1px; padding:1px; border:1px solid #2222ff; border-radius:3px; cursor:pointer\" title='100%' onClick='$(\".100ex\").click();'>100%</span> \
</div>");  
    };
});


// setter

$(document).ready(function()
{
  var currentRealm = $('a[href*="by_trade_at_cities"]').attr("href").split("\/")[3];
  var shopId = window.location.href.split("\/")[7];

  var $tbody = $("table.grid:eq(0) > tbody:eq(0)");

    $tbody.children("tr").each(function() {
      var $tr = $(this);
      if ($tr.children("td").length > 1) {
          var productCode = $tr.children("td:eq(2)").children("a").children("img").attr("src").split("\/").pop().replace(".gif", ""); // product image
          var $td11 = $tr.children("td:eq(10)"); // % of market
          var marketPortion = $td11.text().trim().replace(" ", "").replace(" ", "").replace(" ", "").replace("%", "") - 0;
          var ProductMarketPortionVar = currentRealm +""+ shopId +""+ productCode;

          var $td09 = $tr.children("td:eq(8)"); // cost of product
          var cost = $td09.text().trim().replace(" ", "").replace(" ", "").replace(" ", "").replace("$", "") - 0;

          var $td10 = $tr.children("td:eq(9)").children("input:text"); // sell price
          var sellprice = $td10.val().replace(" ", "").replace(" ", "").replace(" ", "").replace("$", "") - 0;

          var $td3 = $tr.children("td:eq(3)"); // sold qty
          var soldqty = $td3.text().trim().replace(" ", "").replace(" ", "").replace(" ", "").replace("%", "") - 0;
        
        var total_market = Math.floor((soldqty / marketPortion) * 100);
        
        //       console.log($td10);

        var profit = ((sellprice / cost) - 1) * 100;
        profit = profit.toFixed(2);
//        console.log(ProductMarketPortionVar + ': ' + marketPortion + '|' +sellprice+ '|' + cost + '|' + profit +'%' + '|' + soldqty +'|' +total_market );
//        exit;
        
//        console.log(ProductMarketPortionVar + ': ' + marketPortion);
          GM_setValue( ProductMarketPortionVar, marketPortion+"|"+profit+"|"+total_market ); // save to local storage
//          exit;
      }
    });
});



