// ==UserScript==
// @name         PokeMap Korean Patch
// @namespace    https://seoulpokemap.com
// @version      0.1.1
// @description  Gotta Catch 'Em All
// @author       PokemonGo Gall OO
// @match        https://seoulpokemap.com/*
// @include      https://busanpokemap.com/*
// @include      https://sgpokemap.com/*
// @include      https://londonpogomap.com/*
// @include      https://vanpokemap.com/*
// @include      https://torpokemap.com/*
// @include      https://montrealpokemap.com/*
// @include      https://sydneypogomap.com/*
// @include      https://melpogomap.com/*
// @include      https://nycpokemap.com/*
// @include      https://vegaspokemap.com/*
// @include      https://phillypokemap.com/*
// @include      https://houstonpokemap.com/*
// @include      https://seapokemap.com/*
// @include      https://bostonpogomap.com/*
// @include      https://chipokemap.com/*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/31027/PokeMap%20Korean%20Patch.user.js
// @updateURL https://update.greasyfork.org/scripts/31027/PokeMap%20Korean%20Patch.meta.js
// ==/UserScript==

for(i=1;i<1000;i++){localStorage.setItem('icon'+i,'https://pkmref.com/images/set_1/'+i+'.png');}
var pokeArray = [{"i":"248","n":"마기라스"},{"i":"242","n":"해피너스"},{"i":"154","n":"메가니움"},{"i":"157","n":"블레이범"},{"i":"160","n":"장크로다일"},{"i":"181","n":"전룡"},{"i":"247","n":"데기라스"},{"i":"232","n":"코리갑"},{"i":"201","n":"안농"},{"i":"237","n":"카포에라"},{"i":"149","n":"망나뇽"},{"i":"143","n":"잠만보"},{"i":"131","n":"라프라스"},{"i":"130","n":"갸라도스"},{"i":"3","n":"이상해꽃"},{"i":"6","n":"리자몽"},{"i":"9","n":"거북왕"},{"i":"59","n":"윈디"},{"i":"103","n":"나시"},{"i":"65","n":"후딘"},{"i":"68","n":"괴력몬"},{"i":"76","n":"딱구리"},{"i":"112","n":"코뿌리"},{"i":"142","n":"프테라"},{"i":"113","n":"럭키"},{"i":"107","n":"홍수몬"},{"i":"106","n":"시라소몬"},{"i":"134","n":"샤미드"},{"i":"136","n":"부스터"},{"i":"135","n":"쥬피썬더"},{"i":"137","n":"폴리곤"},{"i":"89","n":"질뻐기"},{"i":"108","n":"내루미"},{"i":"63","n":"캐이시"},{"i":"190","n":"에이팜"},{"i":"24","n":"아보크"},{"i":"168","n":"아리아도스"},{"i":"144","n":"프리져"},{"i":"184","n":"마릴리"},{"i":"153","n":"베이리프"},{"i":"15","n":"독침붕"},{"i":"182","n":"아르코"},{"i":"69","n":"모다피","h":1},{"i":"1","n":"이상해씨"},{"i":"12","n":"버터플"},{"i":"10","n":"캐터피","h":1},{"i":"251","n":"세레비"},{"i":"4","n":"파이리"},{"i":"5","n":"리자드"},{"i":"152","n":"치코리타"},{"i":"170","n":"초라기","h":1},{"i":"36","n":"픽시"},{"i":"35","n":"삐삐","h":1},{"i":"173","n":"삐"},{"i":"91","n":"파르셀"},{"i":"222","n":"코산호"},{"i":"169","n":"크로뱃"},{"i":"159","n":"엘리게이"},{"i":"104","n":"탕구리"},{"i":"155","n":"브케인"},{"i":"225","n":"딜리버드"},{"i":"87","n":"쥬레곤"},{"i":"50","n":"디그다"},{"i":"132","n":"메타몽"},{"i":"85","n":"두트리오"},{"i":"84","n":"두두"},{"i":"148","n":"신뇽"},{"i":"147","n":"미뇽"},{"i":"96","n":"슬리프"},{"i":"51","n":"닥트리오"},{"i":"206","n":"노고치"},{"i":"133","n":"이브이"},{"i":"23","n":"아보","h":1},{"i":"125","n":"에레브"},{"i":"101","n":"붐볼"},{"i":"239","n":"에레키드"},{"i":"244","n":"앤테이"},{"i":"196","n":"에브이"},{"i":"102","n":"아라리"},{"i":"83","n":"파오리"},{"i":"22","n":"깨비드릴조"},{"i":"180","n":"보송송"},{"i":"205","n":"쏘콘"},{"i":"162","n":"다꼬리"},{"i":"92","n":"고오스"},{"i":"94","n":"팬텀"},{"i":"74","n":"꼬마돌"},{"i":"203","n":"키링키"},{"i":"207","n":"글라이거"},{"i":"44","n":"냄새꼬"},{"i":"42","n":"골뱃"},{"i":"118","n":"콘치","h":1},{"i":"55","n":"골덕"},{"i":"210","n":"그랑블루"},{"i":"75","n":"데구리"},{"i":"88","n":"질퍽이"},{"i":"58","n":"가디"},{"i":"93","n":"고우스트"},{"i":"214","n":"헤라크로스"},{"i":"250","n":"칠색조"},{"i":"163","n":"부우부","h":1},{"i":"187","n":"통통코","h":1},{"i":"116","n":"쏘드라"},{"i":"229","n":"헬가"},{"i":"228","n":"델빌"},{"i":"97","n":"슬리퍼"},{"i":"174","n":"푸푸린"},{"i":"2","n":"이상해풀"},{"i":"39","n":"푸린"},{"i":"189","n":"솜솜코"},{"i":"124","n":"루주라"},{"i":"140","n":"투구"},{"i":"141","n":"투구ps"},{"i":"64","n":"윤겔라"},{"i":"14","n":"딱충이"},{"i":"115","n":"캥카"},{"i":"230","n":"킹드라"},{"i":"99","n":"킹크랩"},{"i":"109","n":"또가스"},{"i":"98","n":"크랩","h":1},{"i":"171","n":"랜턴"},{"i":"246","n":"애버라스"},{"i":"166","n":"레디안"},{"i":"165","n":"레디바","h":1},{"i":"249","n":"루기아"}];
window.pokeArray = pokeArray.concat([{"i":"67","n":"근육몬"},{"i":"66","n":"알통몬"},{"i":"240","n":"마그비"},{"i":"219","n":"마그카르고"},{"i":"129","n":"잉어킹"},{"i":"126","n":"마그마"},{"i":"81","n":"코일"},{"i":"82","n":"레어코일"},{"i":"56","n":"망키"},{"i":"226","n":"만타인"},{"i":"179","n":"메리프"},{"i":"183","n":"마릴","h":1},{"i":"105","n":"텅구리"},{"i":"52","n":"나옹"},{"i":"11","n":"단데기"},{"i":"151","n":"뮤"},{"i":"150","n":"뮤two"},{"i":"241","n":"밀탱크"},{"i":"200","n":"무우마"},{"i":"146","n":"파이어"},{"i":"122","n":"마임맨"},{"i":"198","n":"니로우","h":1},{"i":"177","n":"네이티","h":1},{"i":"34","n":"니드킹"},{"i":"31","n":"니드퀸"},{"i":"29","n":"니드런♂","h":1},{"i":"32","n":"니드런♀","h":1},{"i":"30","n":"니드리나"},{"i":"33","n":"니드리노"},{"i":"38","n":"나인테일"},{"i":"164","n":"야부엉"},{"i":"224","n":"대포무노"},{"i":"43","n":"뚜벅쵸"},{"i":"138","n":"암나이트"},{"i":"139","n":"암스타"},{"i":"95","n":"롱스톤"},{"i":"46","n":"파라스","h":1},{"i":"47","n":"파라스ect"},{"i":"53","n":"페르시온"},{"i":"231","n":"코코리"},{"i":"172","n":"피츄"},{"i":"18","n":"피죤투"},{"i":"17","n":"피죤투to"},{"i":"16","n":"구구","h":1},{"i":"25","n":"피카츄"},{"i":"221","n":"메꾸리"},{"i":"204","n":"피콘"},{"i":"127","n":"쁘사이저"},{"i":"186","n":"왕구리"},{"i":"60","n":"발챙이","h":1},{"i":"61","n":"슈륙챙이"},{"i":"62","n":"강챙이"},{"i":"77","n":"포니타"},{"i":"233","n":"폴리곤2"},{"i":"57","n":"성원숭"},{"i":"54","n":"고라파덕","h":1},{"i":"195","n":"누오"},{"i":"156","n":"마그케인"},{"i":"211","n":"침바루"},{"i":"26","n":"라이츄"},{"i":"243","n":"라이코"},{"i":"78","n":"날쌩마"},{"i":"20","n":"레트라"},{"i":"19","n":"꼬렛","h":1},{"i":"223","n":"총어"},{"i":"111","n":"뿔카노"},{"i":"27","n":"모래두지"},{"i":"28","n":"고지"},{"i":"212","n":"핫삼"},{"i":"123","n":"스라크"},{"i":"117","n":"시드라"},{"i":"119","n":"왕콘치"},{"i":"86","n":"쥬쥬"},{"i":"161","n":"꼬리선","h":1},{"i":"90","n":"셀러"},{"i":"213","n":"단단지"},{"i":"227","n":"무장조"},{"i":"188","n":"두코"},{"i":"80","n":"야도란"},{"i":"199","n":"야도킹"},{"i":"79","n":"야돈"},{"i":"218","n":"마그마그"},{"i":"235","n":"루브도"},{"i":"238","n":"뽀뽀라"},{"i":"215","n":"포푸니"},{"i":"209","n":"블루"},{"i":"21","n":"깨비참","h":1},{"i":"167","n":"페이검","h":1},{"i":"7","n":"꼬부기"},{"i":"234","n":"노라키"},{"i":"121","n":"아쿠스타"},{"i":"120","n":"별가사리","h":1},{"i":"208","n":"강철톤"},{"i":"185","n":"꼬지모"},{"i":"245","n":"스이쿤"},{"i":"192","n":"해루미"},{"i":"191","n":"해너츠","h":1},{"i":"220","n":"꾸꾸리"},{"i":"114","n":"덩쿠리"},{"i":"128","n":"켄타로스"},{"i":"216","n":"깜지곰"},{"i":"72","n":"왕눈해"},{"i":"73","n":"독파리"},{"i":"175","n":"토게피"},{"i":"176","n":"토게틱"},{"i":"158","n":"리아코"},{"i":"236","n":"배루키"},{"i":"197","n":"블래키"},{"i":"217","n":"링곰"},{"i":"49","n":"도나리"},{"i":"48","n":"콘팡","h":1},{"i":"71","n":"우츠보트"},{"i":"45","n":"라플레시아"},{"i":"100","n":"찌리리공"},{"i":"37","n":"식스테일"},{"i":"8","n":"어니부기"},{"i":"13","n":"뿔충이","h":1},{"i":"70","n":"우츠동"},{"i":"110","n":"또도가스"},{"i":"40","n":"푸크린"},{"i":"202","n":"마자용"},{"i":"194","n":"우파","h":1},{"i":"178","n":"네이티오"},{"i":"193","n":"왕자리"},{"i":"145","n":"썬더"},{"i":"41","n":"주벳","h":1},{"i":"0","n":"Egg"}]);


window.movesDict = {"1":"전기쇼크","2":"전광석화","3":"할퀴기","4":"불꽃세례","5":"덩굴채찍","6":"몸통박치기","7":"잎날가르기","8":"돌진","9":"물대포","10":"물기","11":"막치기","12":"연속뺨치기","13":"김밥말이","14":"파괴광선","15":"핥기","16":"악의파동","17":"스모그","18":"오물공격","19":"메탈크로우","20":"찝기","21":"화염자동차","22":"메가폰","23":"날개치기","24":"화염방사","25":"기습","26":"구멍파기","27":"안다리걸기","28":"크로스촙","29":"사이코커터","30":"환상빔","31":"지진","32":"스톤에지","33":"냉동펀치","34":"하트스탬프","35":"방전","36":"러스터캐논","37":"쪼기","38":"회전부리","39":"냉동빔","40":"눈보라","41":"에어슬래시","42":"열풍","43":"더블니들","44":"독찌르기","45":"제비반환","46":"드릴라이너","47":"꽃보라","48":"메가드레인","49":"벌레의야단법석","50":"독엄니","51":"깜짝베기","52":"베어가르기","53":"거품광선","54":"지옥의바퀴","55":"태권당수","56":"로킥","57":"아쿠아제트","58":"아쿠아테일","59":"씨폭탄","60":"사이코쇼크","61":"돌떨구기","62":"원시의힘","63":"암석봉인","64":"스톤샤워","65":"파워젬","66":"야습","67":"섀도펀치","68":"섀도크루","69":"괴상한바람","70":"섀도볼","71":"불릿펀치","72":"마그넷봄","73":"강철날개","74":"아이언헤드","75":"파라볼라차지","76":"스파크","77":"번개펀치","78":"번개","79":"10만 볼트","80":"회오리","81":"용의숨결","82":"용의파동","83":"드래곤크루","84":"차밍보이스","85":"드레인키스","86":"매지컬샤인","87":"문포스","88":"치근거리기","89":"크로스포이즌","90":"오물폭탄","91":"오물웨이브","92":"더스트슈트","93":"머드숏","94":"뼈다귀치기","95":"땅고르기","96":"진흙폭탄","97":"연속자르기","98":"벌레먹음","99":"시그널빔","100":"시저크로스","101":"니트로차지","102":"불꽃튀기기","103":"불대문자","104":"소금물","105":"물의파동","106":"열탕","107":"하이드로펌프","108":"사이코키네시스","109":"사이코브레이크","110":"얼음뭉치","111":"얼다바람","112":"얼음숨결","113":"흡수","114":"기가드레인","115":"불꽃펀치","116":"솔라빔","117":"리프블레이드","118":"파워휩","119":"튀어오르기","120":"용해액","121":"에어컷터","122":"폭풍","123":"깨트리다","124":"풀베기","125":"스피드스타","126":"뿔찌르기","127":"짓밟기","128":"박치기","129":"필살앞니","130":"힘껏치기","131":"Body 힘껏치기","132":"잠자기","133":"발버둥","134":"열탕","135":"하이드로펌프","136":"김밥말이 Green","137":"김밥말이","200":"연속자르기","201":"벌레먹음","202":"물기","203":"기습","204":"용의숨결","205":"전기쇼크","206":"스파크","207":"안다리걸기","208":"태권당수","209":"불꽃세례","210":"날개치기","211":"쪼기","212":"핥기","213":"섀도크루","214":"덩굴채찍","215":"잎날가르기","216":"머드숏","217":"얼음뭉치","218":"얼음숨결","219":"전광석화","220":"할퀴기","221":"몸통박치기","222":"막치기","223":"풀베기","224":"독찌르기","225":"용해액","226":"사이코커터","227":"돌떨구기","228":"메탈크로우","229":"불릿펀치","230":"물대포","231":"튀어오르기","232":"물대포","233":"진흑뿌리기","234":"사념의 박치기","235":"염동력","236":"독침","237":"거품","238":"속여때리기","239":"강철날개","240":"불꽃엄니","241":"바위깨기","242":"변신","243":"카운터","244":"눈싸라기","245":"인파이트","246":"폭발펀치","247":"기합구슬","248":"오로라빔","249":"차지빔","250":"볼트체인지","251":"와일드볼트","252":"전자포","253":"드래곤테일","254":"눈사태","255":"에어슬래시","256":"브레이브버드","257":"불새","258":"모래지옥","259":"락블레스트","260":"엉겨붙기","261":"벌레의저항","262":"은빛바람","263":"놀래키기","264":"병상첨병","265":"나이트헤드","266":"아이언테일","267":"자이로볼","268":"헤비봄버","269":"회오리불꽃","270":"오버히트","271":"기관총","272":"풀묶기","273":"에너지볼","274":"신통력","275":"미래예지","276":"미러코트","277":"역린","278":"바크아웃","279":"깨물어부수기","280":"속임수","281":"잠재파워"};


var myCircle,myMarker;

window.getGenderString = function getGenderString(pokemon) {
    if (pokemon.gender == 1) {
        return " (수컷)";
    }
    else if (pokemon.gender == 2) {
        return " (암컷)";
    }
    return "";
};

var url = window.location.pathname;
var filename = url.substring(url.lastIndexOf('/')+1);


if(url === '/gym.html'){
    window.infoWindowString = function infoWindowString(pokemon) {

        var startTime = "";
        var endTime = "";
        var cpString = "";
        var teamString = "";
        var movesetString = "";

        if (pokemon.id === "0") {
            startTime = "<br/><b>시작 : </b> " + timeToString(pokemon.startingTime());
        }
        else {
            endTime = "<br/><b>종료 : </b> " + timeToString(pokemon.remainingTime());

            var currentTeam;
            switch (pokemon.team) {
                case 0:
                    currentTeam = "팀없음";
                    break;
                case 1:
                    currentTeam = "미스틱";
                    break;
                case 2:
                    currentTeam = "발러";
                    break;
                case 3:
                    currentTeam = "인스팅스";
                    break;
                default:
                    currentTeam = "알수없음";
            }
            teamString = "<br/><br/><b>현재 팀:</b> " + currentTeam;

            movesetString = "<br><b>무브셋:</b> " + getMoveName(pokemon.move1) + " | " + getMoveName(pokemon.move2);
        }

        if (pokemon.id !== 0) {
            cpString = '<br/><b>CP:</b> ' + pokemon.cp;
        }

        return '<b>보스:</b> ' + getPokemonName(pokemon) + '<br/><b>레벨:</b> ' + pokemon.level + cpString + movesetString + teamString + '<br/>' +  startTime + endTime + '<br/><a target="_blank" href="https://maps.google.com/maps?q=' + pokemon.center.lat + ',' + pokemon.center.lng + '">구글맵</a> | <a href="#" onclick="latlongCopy(' + pokemon.center.lat + ',' + pokemon.center.lng + ');">좌표복사</a>';

    };

}

if(url !== '/gym.html'){

    window.infoWindowString = function infoWindowString(pokemon) {
        var pokeindex = 0;
        for(var i = 0 ; i < pokemons.length ; i++){
            if(pokemons[i] ==pokemon){
                pokeindex = i;
                break;
            }
        }
        var disguiseString = "";
        if (pokemon.disguise !== 0) {
            disguiseString = " (" + getDisguisePokemonName(pokemon) + ")";
        }

        var genderString = getGenderString(pokemon);

        var formString = getFormString(pokemon);


        var ivString = "";

        var movesetString = "";

        var cpString = "";
        if (pokemon.attack != -1 && pokemon.defence != -1 && pokemon.stamina != -1 && pokemon.move1 != -1 && pokemon.move2 != -1 && pokemon.cp != -1) {
            ivString = "<b>L30+ IV:</b> "+ pokemon.attack + " | " + pokemon.defence + " | " + pokemon.stamina + " (" + Math.floor((pokemon.attack + pokemon.defence + pokemon.stamina)/45 * 100) + "%)<br />";
            movesetString = "<b>L30+ 무브셋:</b><br />" + getMoveName(pokemon.move1) + " | " + getMoveName(pokemon.move2) + "<br />";
            cpString = "<b>L30+ CP:</b> " + pokemon.cp + "<br /><br />";
        }

        return '<b>' + getPokemonName(pokemon) + disguiseString + genderString + formString + "</b><br /><br />" + ivString + movesetString + cpString + timeToString(pokemon.remainingTime()) + ' | <a target="_blank" href="https://maps.google.com/maps?q=' + pokemon.center.lat + ',' + pokemon.center.lng + '">구글맵</a> | <a href="#" onclick="latlongCopy(' + pokemon.center.lat + ',' + pokemon.center.lng + ');">좌표복사</a>';
    };

}



window.latlongCopy = function latlongCopy(xlat,xlong) {
    prompt("좌표 복사",xlat +"," + xlong);
};


(function() {
    $("#please_top").remove();
    $("#please_bottom").remove();
    $("#map").css("top","40px");
    $("#map").css("bottom","0px");
    $("#locate_input").remove();
    $("div.leaflet-control-attribution.leaflet-control").remove();
    loadPokemonList();
})();