// ==UserScript==
// @name         党员考学自动答题脚本
// @namespace    http://tampermonkey.net/
// @version      0.1
// @description  try to take over the world!
// @author       Grissom
// @match        https://ks.gdycjy.gov.cn/kQuestion*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/36609/%E5%85%9A%E5%91%98%E8%80%83%E5%AD%A6%E8%87%AA%E5%8A%A8%E7%AD%94%E9%A2%98%E8%84%9A%E6%9C%AC.user.js
// @updateURL https://update.greasyfork.org/scripts/36609/%E5%85%9A%E5%91%98%E8%80%83%E5%AD%A6%E8%87%AA%E5%8A%A8%E7%AD%94%E9%A2%98%E8%84%9A%E6%9C%AC.meta.js
// ==/UserScript==

var answer_map = {
    "党的十九大的主题是： ______，高举中国特色社会主义伟大旗帜，决胜全面建成小康社会，夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。": "B.不忘初心，牢记使命",
    "党的十九大报告指出，经过长期努力，中国特色社会主义进入了______，这是我国发展新的历史方位。": "A.新时代",
    "在现阶段，我国社会主要矛盾已经转化为人民日益增长的______需要和______的发展之间的矛盾。": "D.美好生活；不平衡不充分",
    "______是中国特色社会主义最本质的特征，是中国特色社会主义制度的最大优势。": "A.中国共产党的领导",
    "党的十九大报告指出，中国特色社会主义事业总体布局是______、战略布局是______。": "B.“五位一体”；“四个全面”",
    "党的十九大报告提出新时代党的建设总要求，突出______在党的建设中的重要地位。": "B.政治建设",
    "党政军民学，东西南北中，党是领导一切的。必须增强______，自觉维护党中央权威和集中统一领导，自觉在思想上政治上行动上同党中央保持高度一致。": "A.政治意识、大局意识、核心意识、看齐意识",
    "中国共产党领导人民建设社会主义生态文明。树立尊重自然、顺应自然、保护自然的生态文明理念，增强______的意识。": "B.绿水青山就是金山银山",
    "党的十九大报告提出一个新目标，即“在本世纪中叶建成______的社会主义现代化强国”。": "D.富强民主文明和谐美丽",
    "新时代党的建设总要求之一是全面推进党的______。": "C.政治建设、思想建设、组织建设、作风建设、纪律建设",
    "中国共产党以马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观、______作为自己的行动指南。": "D.习近平新时代中国特色社会主义思想",
    "以党的______为统领，全面推进党的政治建设、思想建设、组织建设、作风建设、纪律建设，把______贯穿其中，深入推进反腐败斗争，全面提高党的建设科学化水平。": "C.政治建设；制度建设",
    "发展党员，必须把______放在首位，经过党的支部，坚持个别吸收的原则。": "D.政治标准",
    "党的基层委员会、总支部委员会、支部委员会每届任期______。": "D.三年至五年",
    "全党要更加自觉地增强______、______、______、______，既不走封闭僵化的老路，也不走改旗易帜的邪路，保持政治定力，坚持实干兴邦，始终坚持和发展中国特色社会主义。": "B.道路自信、理论自信、制度自信、文化自信",
    "中央军事委员会负责军队中______和______，对军队中党的组织体制和机构作出规定。": "D.党的工作；政治工作",
    "党组织如果在维护党的纪律方面失职，必须______。": "B.问责",
    "党的十九大报告指出，要坚持以人民为中心。必须坚持______，坚持立党为公、执政为民，践行全心全意为人民服务的根本宗旨。": "C.人民主体地位",
    "党的十九大报告指出，成立______，加强对法治中国建设的统一领导。": "C.中央全面依法治国领导小组",
    "党的十九大报告指出，深化国家监察体制改革，将试点工作在全国推开，组建国家、省、市、县______，同党的纪律检查机关合署办公，实现对所有行使公权力的公职人员监察全覆盖。": "C.监察委员会",
    "新时代坚持和发展中国特色社会主义的基本方略指出，坚持全面从严治党，必须以______为根本遵循，把党的政治建设摆在首位。": "B.党章",
    "建设______是中华民族伟大复兴的基础工程。": "C.教育强国",
    "党的十九大报告指出，必须把维护中央对香港、澳门特别行政区______和保障特别行政区______有机结合起来，确保“一国两制”方针不会变、不动摇，确保“一国两制”实践不变形、不走样。": "D.全面管治权；高度自治权",
    "______是党的基础组织，担负直接教育党员、管理党员、监督党员和组织群众、宣传群众、凝聚群众、服务群众的职责。": "B.党支部",
    "增强党自我净化能力，根本靠强化______和______。": "B.党的自我监督；群众监督",
    "十八大以来的五年，全面从严治党成效卓著。把______挺在前面，着力解决人民群众反映最强烈、对党的执政基础威胁最大的突出问题。": "B.纪律",
    "要全面深化改革，完善和发展中国特色社会主义制度，推进国家______现代化。": "C.治理体系和治理能力",
    "为贯彻十八大精神，党中央召开______，分别就政府机构改革和职能转变、全面深化改革、全面推进依法治国、制定“十三五”规划、全面从严治党等重大问题作出决定和部署。": "D.七次全会",
    "要深刻认识党面临的______的长期性和复杂性。": "B.执政考验、改革开放考验、市场经济考验、外部环境考验",
    "______是指导党和人民实现中华民族伟大复兴的正确理论。": "B.中国特色社会主义理论体系",
    "树立______是核心战斗力的思想，推进重大技术创新、自主创新，加强军事人才培养体系建设，建设创新型人民军队。": "B.科技",
    "我们党紧密结合新的时代条件和实践要求，以全新的视野深化对______的认识，进行艰辛理论探索，取得重大理论创新成果。": "C.共产党执政规律、社会主义建设规律、人类社会发展规律",
    "赋予自由贸易试验区更大改革自主权，探索建设______。": "C.自由贸易港",
    "党的十九大报告强调，我们党面临的执政环境是复杂的，影响党的先进性、弱化党的纯洁性的因素也是复杂的，党内存在的______等突出问题尚未得到根本解决。": "D.思想不纯、组织不纯、作风不纯",
    "全党要更加自觉地坚定党性原则，勇于直面问题，敢于刮骨疗毒，消除一切损害党的先进性和纯洁性的因素，清除一切侵蚀党的健康肌体的病毒，不断增强党的______，确保我们党永葆旺盛生命力和强大战斗力。": "C.政治领导力、思想引领力、群众组织力、社会号召力",
    "五年来，我国经济保持中高速增长，在世界主要国家中名列前茅，国内生产总值从五十四万亿元增长到八十万亿元，稳居世界______，对世界经济增长贡献率超过百分之三十。": "B.第二",
    "推进______，建设覆盖纪检监察系统的检举举报平台。强化不敢腐的震慑，扎牢不能腐的笼子，增强不想腐的自觉，通过不懈努力换来海晏河清、朗朗乾坤。": "C.反腐败国家立法",
    "全党必须牢记，______的问题，是检验一个政党、一个政权性质的试金石。": "A.为什么人",
    "党的十九大报告强调，必须始终把______摆在至高无上的地位，让改革发展成果更多更公平惠及全体人民，朝着实现全体人民共同富裕不断迈进。": "A.人民利益",
    "习近平新时代中国特色社会主义思想，是______最新成果，是党和人民实践经验和集体智慧的结晶，是中国特色社会主义理论体系的重要组成部分，是全党全国人民为实现中华民族伟大复兴而奋斗的行动指南，必须长期坚持并不断发展。": "C.马克思主义中国化",
    "深刻认识党面临的______的尖锐性和严峻性，坚持问题导向，保持战略定力，推动全面从严治党向纵深发展。": "A.精神懈怠危险、能力不足危险、脱离群众危险、消极腐败危险",
    "党的十九大报告指出，发展是解决我国一切问题的基础和关键，发展必须是______。": "D.科学发展",
    "实施______。农业农村农民问题是关系国计民生的根本性问题，必须始终把解决好“三农”问题作为全党工作重中之重。": "B.乡村振兴战略",
    "党的十九大报告指出，必须把______贯彻落实到依法治国全过程和各方面，坚定不移走中国特色社会主义法治道路。": "B.党的领导",
    "______是近代以来中华民族最伟大的梦想。": "D.实现中华民族伟大复兴",
    "党的十九大报告指出，建设现代化经济体系，必须把发展经济的着力点放在实体经济上，把______作为主攻方向，显著增强我国经济质量优势。": "B.提高供给体系质量",
    "党的中央和省、自治区、直辖市委员会实行巡视制度，在一届任期内，对所管理的地方、部门、企事业单位党组织实现______全覆盖。": "A.巡视",
    "社会主义文艺是人民的文艺，必须坚持______的创作导向，在深入生活、扎根人民中进行无愧于时代的文艺创造。": "C.以人民为中心",
    "党的十九大报告指出，培养造就一支______的“三农”工作队伍。": "C.懂农业、爱农村、爱农民",
    "一个政党，一个政权，其前途命运取决于______。人民群众反对什么、痛恨什么，我们就要坚决防范和纠正什么。": "C.人心向背",
    "中国共产党人的初心和使命，就是为中国人民______ ，为中华民族______。这个初心和使命是激励中国共产党人不断前进的根本动力。": "C.谋幸福；谋复兴",
    "要坚持党管干部原则，______，把好干部标准落到实处。": "D.坚持德才兼备、以德为先，坚持五湖四海、任人唯贤，坚持事业为上、公道正派",
    "党内监督专责机关是______。": "D.党的各级纪律检查委员会",
    "加强社会治理制度建设，完善党委领导、政府负责、社会协同、公众参与、法治保障的社会治理体制，提高社会治理______水平。": "B.社会化、法治化、智能化、专业化",
    "全党要更加自觉地坚持党的领导和我国______，坚决反对一切削弱、歪曲、否定党的领导和我国社会主义制度的言行。": "B.社会主义制度",
    "五年来，我们勇于面对党面临的重大风险考验和党内存在的突出问题，以顽强意志品质正风肃纪、反腐惩恶，消除了党和国家内部存在的严重隐患，党内政治生活气象更新，党内政治生态明显好转，党的______显著增强。": "B.创造力、凝聚力、战斗力",
    "要坚持______发展，按照产业兴旺、生态宜居、乡风文明、治理有效、生活富裕的总要求，建立健全城乡融合发展体制机制和政策体系，加快推进农业农村现代化。": "B.农业农村优先",
    "党的十九大报告指出，科学立法、严格执法、公正司法、全民守法深入推进，法治国家、法治政党、法治社会建设相互促进，中国特色社会主义法治体系日益完善，全社会______明显增强。": "D.法治观念",
    "领导十三亿多人的社会主义大国，我们党______。": "D.既要政治过硬，也要本领高强",
    "党的十九大报告指出，五年来，我们坚持反腐败无禁区、全覆盖、零容忍，坚定不移“打虎”、“拍蝇”、“猎狐”，______的目标初步实现，______的笼子越扎越牢，______的堤坝正在构筑，反腐败斗争压倒性态势已经形成并巩固发展。": "A.不敢腐；不能腐；不想腐",
    "坚持党要管党、全面从严治党，加强党的______、先进性和纯洁性建设。": "D.长期执政能力建设",
    "全党要充分认识这场伟大斗争的______，发扬斗争精神，提高斗争本领，不断夺取伟大斗争新胜利。": "A.长期性、复杂性、艰巨性",
    "党的中央和地方纪律检查委员会向______党和国家机关全面派驻党的纪律检查组。": "B.同级",
    "过去五年，______新体制逐步健全，对外贸易、对外投资、外汇储备稳居世界前列。": "C.开放型经济",
    "党的十九大报告指出，面对世界经济复苏乏力、局部冲突和动荡频发、全球性问题加剧的外部环境，面对我国经济发展进入新常态等一系列深刻变化，我们坚持______工作总基调，迎难而上，开拓进取，取得了改革开放和社会主义现代化建设的历史性成就。": "C.稳中求进",
    "解决台湾问题、实现祖国完全统一，是全体中华儿女______，是中华民族______所在。": "D.共同愿望；根本利益",
    "实现“两个一百年”奋斗目标、实现中华民族伟大复兴的中国梦，不断提高人民生活水平，必须坚定不移把______作为党执政兴国的第一要务。": "C.发展",
    "要坚持无禁区、全覆盖、零容忍，坚持______，坚持受贿行贿一起查，坚决防止党内形成利益集团。": "B.重遏制、强高压、长震慑",
    "巩固和发展爱国统一战线。坚持长期共存、互相监督、肝胆相照、荣辱与共，支持民主党派按照中国特色社会主义______要求更好履行职能。": "D.参政党",
    "党的十九大报告指出，重点攻克深度贫困地区脱贫任务，确保到______我国现行标准下农村贫困人口实现脱贫，贫困县全部摘帽，解决区域性整体贫困，做到脱真贫、真脱贫。": "A.二〇二〇年",
    "加强社会保障体系建设。坚持房子是用来住的、不是用来炒的定位，加快建立______的住房制度，让全体人民住有所居。": "A.多主体供给、多渠道保障、租购并举",
    "适应世界新军事革命发展趋势和国家安全需求，提高建设质量和效益，确保到二〇二〇年基本实现______，______建设取得重大进展，______有大的提升。": "C.机械化；信息化；战略能力",
    "党的十九大报告指出，坚持全面从严治党，______是我们党最鲜明的品格。": "C.勇于自我革命，从严管党治党",
    "党的十九大报告指出，自觉抵制______对党内生活的侵蚀，营造风清气正的良好政治生态。": "A.商品交换原则",
    "加强和规范党内政治生活，增强党内政治生活的政治性、时代性、原则性、战斗性，发展积极健康的党内______，营造风清气正的良好______。": "C.政治文化；政治生态",
    "党的中央军事委员会组成人员由中央委员会决定，中央军事委员会实行______。": "C.主席负责制",
    "党的十九大报告提出的“四个伟大”是：______。": "B.伟大斗争，伟大工程，伟大事业，伟大梦想",
    "中国特色社会主义进入新时代，意味着______在二十一世纪的中国焕发出强大生机活力，在世界上高高举起了中国特色社会主义伟大旗帜。": "C.科学社会主义",
    "党的十九大报告强调，我们坚决维护国家______完整，绝不容忍国家分裂的历史悲剧重演。一切分裂祖国的活动都必将遭到全体中国人坚决反对。": "D.主权和领土",
    "提高就业质量和人民收入水平。就业是最大的民生。要坚持就业优先战略和积极就业政策，实现______就业。": "C.更高质量和更充分",
    "中国共产党坚持对人民解放军和其他人民武装力量的______。": "D.绝对领导",
    "从全面建成小康社会到基本实现现代化，再到全面建成______，是新时代中国特色社会主义发展的战略安排。": "B.社会主义现代化强国",
    "下列不属于新党章所规定的党组任务的是______。": "D.受理处置党员群众检举举报，开展谈话提醒、约谈函询",
    "国有企业党委（党组）发挥______，把方向、管大局、保落实，依照规定讨论和决定企业重大事项。": "B.领导作用",
    "中国共产党一经成立，就把实现______作为党的最高理想和最终目标，义无反顾肩负起实现中华民族伟大复兴的历史使命，团结带领人民进行了艰苦卓绝的斗争，谱写了气吞山河的壮丽史诗。": "B.共产主义",
    "中国共产党领导人民发展社会主义市场经济。发挥市场在资源配置中的______作用，更好发挥政府作用，建立完善的宏观调控体系。": "B.决定性",
    "______是激励全党全国各族人民奋勇前进的强大精神力量。": "D.中国特色社会主义文化",
    "党的十九大报告指出，制定国家监察法，依法赋予监察委员会职责权限和调查手段，用______取代“两规”措施。": "A.留置",
    "构建市场导向的______，发展绿色金融，壮大节能环保产业、清洁生产产业、清洁能源产业。": "D.绿色技术创新体系",
    "坚定不移在和平共处五项原则基础上发展同各国的友好合作，推动建设________的新型国际关系。": "C.相互尊重、公平正义、合作共赢",
    "科学立法、严格执法、公正司法、全民守法深入推进，______建设相互促进，中国特色社会主义法治体系日益完善，全社会法治观念明显增强。": "A.法治国家、法治政府、法治社会",
    "坚持______一起查，坚决防止党内形成利益集团。": "D.受贿行贿",
    "党的十九大报告指出，在市县党委建立______，加大整治群众身边腐败问题力度。": "D.巡察制度",
    "我们党的最大政治优势是密切联系群众，党执政后的最大危险是脱离群众。______、党同人民群众联系问题是关系党生死存亡的问题。": "A.党风问题",
    "党的十九大报告指出，坚持依法治国和以德治国相结合，______有机统一。": "C.依法治国和依规治党",
    "党的十九大报告指出，坚持和发展中国特色社会主义，______是实现社会主义现代化和中华民族伟大复兴。": "C.总任务",
    "保持土地承包关系稳定并长久不变，第二轮土地承包到期后再延长______年。": "B.三十",
    "______是改革开放以来党的全部理论和实践的主题，是党和人民历尽千辛万苦、付出巨大代价取得的根本成就。": "D.中国特色社会主义",
    "______是当代中国发展进步的根本制度保障。": "C.中国特色社会主义制度",
    "党的十九大报告指出，必须全面贯彻党领导人民军队的一系列根本原则和制度，确立______在国防和军队建设中的指导地位。": "C.新时代党的强军思想",
    "______是坚持党的领导、人民当家作主、依法治国有机统一的根本政治制度安排，必须长期坚持、不断完善。": "B.人民代表大会制度",
    "党的十九大报告指出，世界正处于大发展大变革大调整时期，______仍然是时代主题。": "B.和平与发展",
    "全面推进依法治国总目标是______。": "B.建设中国特色社会主义法治体系、建设社会主义法治国家",
    "从______到______，是“两个一百年”奋斗目标的历史交汇期。": "B.十九大；二十大",
    "党的十九大报告指出，______是历史的创造者，是决定党和国家前途命运的根本力量。": "B.人民",
    "世界正处于大发展大变革大调整时期，和平与发展仍然是时代主题。______深入发展。": "D.世界多极化、经济全球化、社会信息化、文化多样化",
    "中国共产党领导人民构建社会主义和谐社会。加强和创新______。": "B.社会治理",
    "必须认识到，我国社会主要矛盾的变化，没有改变我们对我国社会主义所处历史阶段的判断，我国仍处于并将长期处于______的基本国情没有变，我国是世界最大发展中国家的国际地位没有变。": "B.社会主义初级阶段",
    "全党全国各族人民要紧密团结在党中央周围，高举中国特色社会主义伟大旗帜，锐意进取，埋头苦干，为实现______三大历史任务继续奋斗。": "C.推进现代化建设、完成祖国统一、维护世界和平与促进共同发展",
    "党的十九大报告中指出，组建______机构，维护军人军属合法权益，让军人成为全社会尊崇的职业。": "C.退役军人管理保障",
    "中国特色社会主义进入新时代，意味着近代以来久经磨难的中华民族迎来了______的伟大飞跃，迎来了实现中华民族伟大复兴的光明前景。": "A.从站起来、富起来到强起来",
    "______是一个国家、一个民族发展中更基本、更深沉、更持久的力量。": "D.文化自信",
    "坚决防止和反对______，坚决防止和反对宗派主义、圈子文化、码头文化，坚决反对搞两面派、做两面人。": "C.个人主义、分散主义、自由主义、本位主义、好人主义",
    "出台中央八项规定，严厉整治形式主义、官僚主义、享乐主义和奢靡之风，坚决反对______。": "A.特权",
    "党的十九大报告指出，赋予有干部管理权限的党组相应______，强化监督执纪问责。": "C.纪律处分权限",
    "党的十九大报告指出，______是发展的根本目的。": "A.增进民生福祉",
    "实现伟大梦想，必须建设伟大工程。这个伟大工程就是我们党正在深入推进的______新的伟大工程。": "C.党的建设",
    "党的十九大报告指出，要倡导______，强化知识产权创造、保护、运用。": "A.创新文化",
    "农业农村农民问题是关系国计民生的______，必须始终把解决好“三农”问题作为全党工作重中之重。": "C.根本性问题",
    "必须坚持节约优先、保护优先、自然恢复为主的方针，形成______的空间格局、产业结构、生产方式、生活方式，还自然以宁静、和谐、美丽。": "C.节约资源和保护环境",
    "十八大以来的五年，全面推进中国特色大国外交，形成______的外交布局，为我国发展营造了良好外部条件。": "B.全方位、多层次、立体化",
    "坚持照镜子、正衣冠、洗洗澡、治治病的要求，开展党的群众路线教育实践活动和“三严三实”专题教育，推进“两学一做”学习教育______，全党理想信念更加坚定、党性更加坚强。": "D.常态化制度化",
    "中国共产党第十九次全国代表大会，是在全面建成小康社会______、中国特色社会主义进入______的关键时期召开的一次十分重要的大会。": "D.决胜阶段；新时代",
    "______是两岸关系的政治基础。": "C.一个中国原则",
    "我国是工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家，国家一切权力属于______。": "A.人民",
    "______气候变化国际合作，成为全球生态文明建设的重要参与者、贡献者、引领者。": "B.引导应对",
    "坚持党的领导、人民当家作主、依法治国有机统一。______是社会主义民主政治的本质特征。": "B.人民当家作主",
    "中国共产党始终把为人类作出新的更大的贡献作为自己的______。": "B.使命",
    "全党同志一定要永远与人民______，永远把人民对美好生活的向往作为奋斗目标，以永不懈怠的精神状态和一往无前的奋斗姿态，继续朝着实现中华民族伟大复兴的宏伟目标奋勇前进。": "B.同呼吸、共命运、心连心",
    "党的十九大报告强调，全面实施______制度，清理废除妨碍统一市场和公平竞争的各种规定和做法，支持民营企业发展，激发各类市场主体活力。": "D.市场准入负面清单",
    "着力解决突出环境问题。构建______、社会组织和公众共同参与的环境治理体系。": "B.政府为主导、企业为主体",
    "党员的党龄，从______之日算起。": "D.预备期满转为正式党员",
    "综合分析国际国内形势和我国发展条件，从二〇二〇年到本世纪中叶可以分两个阶段来安排。第一个阶段，从______到______，在全面建成小康社会的基础上，再奋斗十五年，基本实现社会主义现代化。": "A.二〇二〇年；二〇三五年",
    "党的十九大报告中列举了十四条新时代坚持和发展中国特色社会主义的基本方略，第一条是：______。": "D.坚持党对一切工作的领导",
    "力争到二〇三五年______国防和军队现代化，到本世纪中叶把人民军队______世界一流军队。": "D.基本实现；全面建成",
    "国家安全是安邦定国的重要基石，______是全国各族人民根本利益所在。": "D.维护国家安全",
    "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持______的开放战略。": "A.互利共赢",
    "军队是要准备打仗的，一切工作都必须坚持______标准，向能打仗、打胜仗聚焦。": "A.战斗力",
    "加快建立绿色生产和消费的法律制度和政策导向，建立健全______的经济体系。": "A.绿色低碳循环发展",
    "党的十九大报告指出，过去五年，公共文化服务水平不断提高，文艺创作持续繁荣，______蓬勃发展，互联网建设管理运用不断完善，全民健身和竞技体育全面发展。": "B.文化事业和文化产业",
    "纪律检查组组长参加驻在部门党的领导组织的有关会议。他们的工作必须受到该机关______的支持。": "A.党的领导组织",
    "全党要牢牢坚持______这个党和国家的生命线、人民的幸福线，领导和团结全国各族人民，以经济建设为中心，坚持四项基本原则，坚持改革开放，自力更生，艰苦创业，为把我国建设成为富强民主文明和谐美丽的社会主义现代化强国而奋斗。": "A.党的基本路线",
    "人才是实现民族振兴、赢得国际竞争主动的战略资源。实行______人才政策。": "A.更加积极、更加开放、更加有效的",
    "党的十九大报告指出，提拔重用牢固树立“四个意识”和“四个自信”、坚决维护党中央权威、全面贯彻执行党的理论和路线方针政策、______的干部。": "A.忠诚干净担当",
    "______是人民当家作主和依法治国的根本保证，人民当家作主是社会主义民主政治的本质特征，依法治国是党领导人民治理国家的基本方式，三者统一于我国社会主义民主政治伟大实践。": "D.党的领导",
    "必须坚持以人民为中心的发展思想，坚持______的发展理念。": "A.创新、协调、绿色、开放、共享",
    "从党的十九大到二十大，是“两个一百年”奋斗目标的历史______。": "C.交汇期",
    "党的十九大报告中指出，军队将开展______主题教育。": "D.“传承红色基因、担当强军重任”",
    "党的各级纪律检查委员会的职责是______，要经常对党员进行遵守纪律的教育，作出关于维护党纪的决定。": "C.监督、执纪、问责",
    "党的十九大报告指出，以城市群为主体构建大中小城市和小城镇协调发展的城镇格局，加快______。": "C.农业转移人口市民化",
    "党的十九大报告指出，在省市县对职能相近的______探索合并设立或合署办公。": "A.党政机关",
    "党的十九大报告指出，中国特色大国外交要推动构建______，推动构建人类命运共同体。": "D.新型国际关系",
    "加快完善社会主义市场经济体制。经济体制改革必须以______和______为重点。": "A.完善产权制度；要素市场化配置",
    "党的纪律主要包括______。": "D.政治纪律、组织纪律、廉洁纪律、群众纪律、工作纪律、生活纪律",
    "加强对生态文明建设的总体设计和组织领导，设立______机构。": "B.国有自然资源资产管理和自然生态监管",
    "全面准确贯彻“一国两制”方针，牢牢掌握______赋予的中央对香港、澳门全面管治权，深化内地和港澳地区交流合作，保持香港、澳门繁荣稳定。": "C.宪法和基本法",
    "我们党要增强政治领导本领，坚持______，科学制定和坚决执行党的路线方针政策，把党总揽全局、协调各方落到实处。": "D.战略思维、创新思维、辩证思维、法治思维、底线思维",
    "我们党深刻认识到，实现中华民族伟大复兴，必须推翻压在中国人民头上的______三座大山，实现民族独立、人民解放、国家统一、社会稳定。": "D.帝国主义、封建主义、官僚资本主义",
    "党的十九大报告指出，坚持全面从严治党，必须以党章为根本遵循，把党的______摆在首位。": "B.政治建设",
    "党的十九大报告指出，______是最大的民生。": "C.就业",
    "党的十九大报告指出，要建设______劳动者大军，弘扬劳模精神和工匠精神，营造劳动光荣的社会风尚和精益求精的敬业风气。": "D.知识型、技能型、创新型",
    "建设现代化经济体系，必须把发展经济的着力点放在______上，把提高供给体系质量作为主攻方向，显著增强我国经济质量优势。": "A.实体经济",
    "我国经济已由______阶段转向______阶段，正处在转变发展方式、优化经济结构、转换增长动力的攻关期，建设现代化经济体系是跨越关口的迫切要求和我国发展的战略目标。": "C.高速增长；高质量发展",
    "党的十九大报告呼吁，各国人民同心协力，构建______，建设持久和平、普遍安全、共同繁荣、开放包容、清洁美丽的世界。": "D.人类命运共同体",
    "党必须加强对工会、共产主义青年团、妇女联合会等______的领导，使它们保持和增强政治性、先进性、群众性，充分发挥作用。": "C.群团组织",
    "自觉遵守党的纪律，首先是党的______和______。": "A.政治纪律；政治规矩",
    "______是实现社会主义现代化、创造人民美好生活的必由之路。": "A.中国特色社会主义道路",
    "实施共建______，发起创办亚洲基础设施投资银行，设立丝路基金，举办首届“一带一路”国际合作高峰论坛、亚太经合组织领导人非正式会议、二十国集团领导人杭州峰会、金砖国家领导人厦门会晤、亚信峰会。": "C.“一带一路”倡议",
    "______是当代中国精神的集中体现，凝结着全体人民共同的价值追求。": "D.社会主义核心价值观",
    "我们呼吁，各国人民同心协力，构建人类命运共同体，建设______的世界。": "C.持久和平、普遍安全、共同繁荣、开放包容、清洁美丽",
    "从现在到二〇二〇年，是全面建成小康社会______。": "B. 决胜期",
    "党的十九大报告指出，构建国土空间开发保护制度，完善主体功能区配套政策，建立以______为主体的自然保护地体系。": "D.国家公园",
    "中国坚定奉行______，尊重各国人民自主选择发展道路的权利，维护国际公平正义，反对把自己的意志强加于人，反对干涉别国内政，反对以强凌弱。": "C.独立自主的和平外交政策",
    "贯彻新发展理念，建设现代化经济体系，必须坚持质量第一、效益优先，以______为主线。": "C.供给侧结构性改革",
    "我们要牢固树立社会主义生态文明观，推动形成______现代化建设新格局，为保护生态环境作出我们这代人的努力！": "C.人与自然和谐发展",
    "中国特色社会主义进入新时代，意味着中国特色社会主义道路、理论、制度、文化不断发展，拓展了发展中国家走向现代化的途径，给世界上那些既希望加快发展又希望保持自身独立性的国家和民族提供了全新选择，为解决人类问题贡献了______。": "C.中国智慧和中国方案",
    "凡属重大问题，党的各级委员会都要按照集体领导、民主集中、个别酝酿、______的原则，由党的委员会集体讨论，作出决定。": "A.会议决定",
    "改革开放以来我们取得一切成绩和进步的根本原因，归结起来就是：开辟了中国特色社会主义道路，形成了中国特色社会主义理论体系，确立了中国特色社会主义制度，发展了______。": "D.中国特色社会主义文化",
    "要支持香港、澳门融入国家发展大局，以______等为重点，全面推进内地同香港、澳门互利合作。": "A.粤港澳大湾区建设、粤港澳合作、泛珠三角区域合作",
    "党的十九大报告指出，必须坚持和完善中国特色社会主义制度，不断推进国家治理体系和治理能力现代化，构建系统完备、科学规范、运行有效的制度体系，充分发挥我国______优越性。": "D.社会主义制度",
    "______和______，是中国共产党人的精神支柱和政治灵魂，也是保持党的团结统一的思想基础。": "B.共产主义远大理想；中国特色社会主义共同理想",
    "全党同志特别是高级干部要加强党性锻炼，不断提高______，把对党忠诚、为党分忧、为党尽职、为民造福作为根本政治担当，永葆共产党人政治本色。": "B.政治觉悟和政治能力",
    "党的十九大报告指出，以县处级以上领导干部为重点，在全党开展______主题教育。": "B.“不忘初心、牢记使命”",
    "要以提升______为重点，突出政治功能，把企业、农村、机关、学校、科研院所、街道社区、社会组织等基层党组织建设成为宣传党的主张、贯彻党的决定、领导基层治理、团结动员群众、推动改革发展的坚强战斗堡垒。": "C.组织力",
    "依法治国是党领导人民治理国家的______。": "D.基本方式",
    "中国共产党领导人民建设社会主义生态文明。着力建设资源节约型、环境友好型社会，实行最严格的______。": "D.生态环境保护制度",
    "党的十九大报告指出，完善以______为核心的中国特色社会主义法律体系，建设中国特色社会主义法治体系，建设社会主义法治国家，发展中国特色社会主义法治理论。": "A.宪法",
    "______是引领发展的第一动力，是建设现代化经济体系的战略支撑。": "B.创新",
    "十八大以来，以习近平同志为主要代表的中国共产党人，顺应时代发展，从理论和实践结合上系统回答了新时代______这个重大时代课题，创立了习近平新时代中国特色社会主义思想。": "D.坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义",
    "推动形成全面开放新格局。要以______建设为重点，坚持引进来和走出去并重。": "C.“一带一路”",
    "深化机构和行政体制改革。转变政府职能，深化简政放权，创新监管方式，增强政府公信力和执行力，建设人民满意的______政府。": "D.服务型",
    "完成______三条控制线划定工作。": "C.生态保护红线、永久基本农田、城镇开发边界",
    "凡是成立党的新组织，或是撤销党的原有组织，必须由______决定。": "A.上级党组织",
    "要尊崇党章，严格执行新形势下党内政治生活若干准则，增强党内政治生活的______。": "A.政治性、时代性、原则性、战斗性",
    "发挥社会主义协商民主重要作用。______是具有中国特色的制度安排，是社会主义协商民主的重要渠道和专门协商机构。": "D.人民协商",
    "党的______是党的根本性建设，决定党的建设方向和效果。": "B.政治建设",
    "中国将高举和平、发展、合作、共赢的旗帜，恪守维护世界和平、促进___的外交政策宗旨。": "B.共同发展",
    "推动形成全面开放新格局。要遵循______原则，加强创新能力开放合作，形成陆海内外联动、东西双向互济的开放格局。": "A.共商共建共享",
    "我们党深刻认识到，实现中华民族伟大复兴，必须建立______。": "D.符合我国实际的先进社会制度"
};


(function() {
    'use strict';
    function parseQues(q_dom) {
        if (q_dom) {
            var q_div = q_dom.firstElementChild;
            if (q_div && q_div.innerText) {
                var q_reg = new RegExp('^[0-9]{1,3}、(.*。)');
                var res = q_div.innerText.match(q_reg);
                if (res && res[1]) {
                    var q_txt = res[1];
                    console.log("q = %s",q_txt);
                    if (answer_map[q_txt]) {
                        var a_txt = answer_map[q_txt];
                        console.log("a = %s",a_txt);
                        var an_li_arr = q_dom.getElementsByTagName("li");
                        for (var i = 0 ; i < an_li_arr.length ; i++) {
                            if (an_li_arr[i].innerText == a_txt) {
                                console.log("get match answer!");
                                an_li_arr[i].firstElementChild.click();
                                return true;
                            }
                        }
                        console.error("no match answer!");
                    }
                } else {
                    console.error("没有找到题目描述");
                }
            }
        } else {
           console.error("q_dom error");
        }
        return false;
    }
    function proc() {
        var q_arr = document.getElementsByClassName('txtMg');
        var n = 0;
        var r = 0;
        for (var i = 0; i < q_arr.length ; i++) {
            n++;
            var res = parseQues(q_arr[i]);
            if (res) {
               r++;
            }
        }
        if (n > r) {
            alert("本页有题目无法找到答案，请自行作答");
        }
    }

    proc();
})();