// ==UserScript==
// @name        粉丝时限显示
// @author      HY清风
// @description 为优酷粉丝增加时限
// @namespace   none 
// @icon        none
// @license     GPL-3.0
// @encoding    utf-8
// @include     *://i.youku.com/i/*

// @grant       GM_registerMenuCommand
// @require     http://cdn.bootcss.com/jquery/1.8.3/jquery.min.js
// @run-at      document-start
// @version     1.2
// @downloadURL https://update.greasyfork.org/scripts/371608/%E7%B2%89%E4%B8%9D%E6%97%B6%E9%99%90%E6%98%BE%E7%A4%BA.user.js
// @updateURL https://update.greasyfork.org/scripts/371608/%E7%B2%89%E4%B8%9D%E6%97%B6%E9%99%90%E6%98%BE%E7%A4%BA.meta.js
// ==/UserScript==

var wordlist = {

  //Syntax:"Searchword":"Replaceword",

'Tide丶潮汐':'Tide丶潮汐【2018.10.20】',
'zeromissRai':'zeromissRai【2018.10.20】',
'peerbine':'peerbine【2018.10.20】',
'土豆用户_377895450':'土豆用户_377895450【2018.10.10】',
'依久皂滑弄人':'依久皂滑弄人【2018.10.10】',
'铲不死的BrianWang98845680':'铲不死的BrianWang98845680【2018.10.20】',
'带人过球':'带人过球【2018.10.20】',
'ykapp_qaxdn81f':'ykapp_qaxdn81f【2018.10.10】',
'心09497032':'心09497032【2018.10.10】',
'微信用户5782298544':'微信用户5782298544【2018.10.10】',
'A卖会员的小阿宇':'A卖会员的小阿宇【2018.10.20】',
'手机用户_846663433':'手机用户_846663433【2018.10.10】',
'ayayoay':'ayayoay【2019.1.10】',
'单身狗打不死':'单身狗打不死【2018.10.10】',
'天殇沧月':'天殇沧月【2018.10.10】',
'空城旧梦20446476':'空城旧梦20446476【2018.10.10】',
'土豆用户_715577914':'土豆用户_715577914【2018.10.20】',
'Yourpussytotich':'Yourpussytotich【2018.10.10】',
'土豆用户_426394851':'土豆用户_426394851【2018.10.20】',
'yyxyl1_680321336':'yyxyl1_680321336【2018.10.10】',
'qizhibufan':'qizhibufan【2018.10.10】',
'微信用户1504721542486973':'微信用户1504721542486973【2018.10.10】',
'hjkhjksda546':'hjkhjksda546【2018.10.20】',
'微信用户1502374155528746':'微信用户1502374155528746【2018.10.10】',
'支付宝用户6649124136':'支付宝用户6649124136【2018.10.10】',
'腾讯用户1466688294250978':'腾讯用户1466688294250978【2018.10.10】',
'纯洁的芒果君':'纯洁的芒果君【2018.10.10】',
'poppinGEK':'poppinGEK【2018.10.20】',
'skychai':'skychai【2018.10.20】',
'黄胖子eric315':'黄胖子eric315【2019.1.10】',
'老嫩玮':'老嫩玮【2019.1.10】',
'不哭不闹只微笑29201699':'不哭不闹只微笑29201699【2018.10.10】',
'若水20345291':'若水20345291【2018.10.20】',
'腾讯用户7519537256':'腾讯用户7519537256【2018.10.10】',
'微信用户1476034884391776':'微信用户1476034884391776【2018.10.10】',
'优酷手机用户_hpFUog9n':'优酷手机用户_hpFUog9n【2018.10.10】',
'支付宝用户1531929379190448':'支付宝用户1531929379190448【2018.10.10】',
'陈赟1489166803811319':'陈赟1489166803811319【2018.10.10】',
'xiongweiabc':'xiongweiabc【2018.10.10】',
'过去的都过去了吧':'过去的都过去了吧【2018.10.10】',
'LiorSir':'LiorSir【2018.10.10】',
'微信用户1515213172809395':'微信用户1515213172809395【2019.1.1】',
'德州铭品装饰工程有限公司':'德州铭品装饰工程有限公司【2018.10.10】',
'a975079044':'a975079044【2018.10.10】',
'腾讯用户1468729000744456':'腾讯用户1468729000744456【2018.10.10】',
'土豆用户_738842533':'土豆用户_738842533【2018.10.10】',
'灬夜丶漫长':'灬夜丶漫长【2018.10.10】',
'- -青春只是一场性':'- -青春只是一场性【2018.10.10】',
'JR41859599':'JR41859599【2018.10.10】',
'辞else':'辞else【2018.10.10】',
'手机用户_731826806':'手机用户_731826806【2018.10.10】',
'优酷院线89019435':'优酷院线89019435【2019.1.1】',
'scscscscscsss':'scscscscscsss【2018.10.10】',
'谢自力22022432':'谢自力22022432【2018.10.10】',
'丶十八街麻花':'丶十八街麻花【2018.10.10】',
'暴力中绵羊':'暴力中绵羊【2018.10.10】',
'诺克堤斯路西斯切拉姆':'诺克堤斯路西斯切拉姆【2018.10.10】',
'雨过天惊93338960':'雨过天惊93338960【2018.10.10】',
'mhxq2003':'mhxq2003【2018.10.1】',
'llmshyp':'llmshyp【2018.10.1】',
'zmf52013':'zmf52013【2018.10.1】',
'微信用户8347611173':'微信用户8347611173【2018.10.1】',
'乱世歧义':'乱世歧义【2018.10.1】',
'优酷用户7146433785':'优酷用户7146433785【2018.10.1】',
'豌豆丶粑粑':'豌豆丶粑粑【2018.10.1】',
'猪猪l侠':'猪猪l侠【2018.10.1】',
'Edward7777777':'Edward7777777【2018.10.1】',
'空橙丶丶':'空橙丶丶【2018.10.1】',
'梦雅的小凯':'梦雅的小凯【2018.10.1】',
'土豆用户_815559710':'土豆用户_815559710【2018.10.1】',
'小刘换屏':'小刘换屏【2018.10.1】',
'王瑀TT':'王瑀TT【2018.9.1】',
'睿铭110':'睿铭110【2018.10.1】',
'暮帆迟红颜笑':'暮帆迟红颜笑【2018.10.1】',
'手机用户_739832874':'手机用户_739832874【2018.10.1】',
'VanMii':'VanMii【2018.10.1】',
'腾讯用户1531171116702174':'腾讯用户1531171116702174【2018.10.1】',
'Tommy20825113':'Tommy20825113【2018.10.1】',
'小书箱':'小书箱【2018.10.1】',
'这我你妹':'这我你妹【2018.10.1】',
'支付宝用户6964685640':'支付宝用户6964685640【2018.10.1】',
'花轮轮21970747':'花轮轮21970747【2018.10.1】',
'Fly鹏C4386':'Fly鹏C4386【2018.10.1】',
'微信用户1525799449876564':'微信用户1525799449876564【2018.10.1】',
'youyici123456':'youyici123456【2018.10.1】',
'手机用户_791439478':'手机用户_791439478【2018.10.1】',
'喵狗獸':'喵狗獸【2018.10.1】',
'腾讯用户1521961538632888':'腾讯用户1521961538632888【2018.10.1】',
'火线60039154':'火线60039154【2018.10.1】',
'低调枫瑟':'低调枫瑟【2018.10.1】',
'五块五块动作要快':'五块五块动作要快【2018.10.1】',
'手机用户_719574601':'手机用户_719574601【2018.10.1】',
'琪哥0000':'琪哥0000【2018.10.1】',
'飘雨爱晴天':'飘雨爱晴天【2018.10.1】',
'小王子在喵星球':'小王子在喵星球【2018.10.1】',
'土豆用户_488200862':'土豆用户_488200862【2018.9.20】',
'不恋下剑':'不恋下剑【2018.9.20】',
'热舞基地':'热舞基地【2018.9.20】',
'zjqzkhzl':'zjqzkhzl【2018.9.20】',
'bdhhdhfgcb':'bdhhdhfgcb【2018.9.20】',
'Fender456':'Fender456【2018.9.20】',
'以冬丶':'以冬丶【2018.9.20】',
'红小年':'红小年【2018.9.10】',
'ghmmmmmmmmmmmmm':'ghm【2018.9.20】',
'親你我就跑':'親你我就跑【2018.9.20】',
'优酷用户1499333298383544':'优酷用户1499333298383544【2018.9.20】',
'Apocalypse68619005':'Apocalypse68619005【2018.9.10】',
'微信用户5069644078':'微信用户5069644078【2018.11.1】',
'glamorousssssy':'glamorousssssy【2018.9.20】',
'土豆用户_851024440':'土豆用户_851024440【2018.9.20】',
'L麦O教V授E':'L麦O教V授E【2018.9.20】',
'微信用户1514114819618396':'微信用户1514114819618396【2018.9.20】',
'支付宝用户7651534077':'支付宝用户7651534077【2018.9.20】',
'後來sven':'後來sven【2018.9.20】',
'魂之守望1001':'魂之守望1001【2018.9.20】',
'贫乏的梦之':'贫乏的梦之【2018.9.20】',
'寻路123123':'寻路123123【2018.9.20】',
'糖雅儿':'糖雅儿【2018.12.10】',
'Spexial丶青衣':'Spexial丶青衣【2018.9.20】',
'无聊至死43766068':'无聊至死43766068【2018.9.10】',
'优酷用户1503935193748960':'优酷用户1503935193748960【2018.9.20】',
'微信用户1524832575398840':'微信用户1524832575398840【2018.9.20】',
'黄鹤楼74576887':'黄鹤楼74576887【2018.9.10】',
'冯见谙':'冯见谙【2018.9.10】',
'耀7211532344':'耀7211532344【2018.9.10】',
'公爵-爚':'公爵-爚【2018.9.10】',
'土豆用户_400454824':'土豆用户_400454824【2018.9.10】',
'精品制作人':'精品制作人【2018.9.10】',
'超人不会飞83147':'超人不会飞83147【2018.9.10】',
'后青春丶1481808521249503':'后青春丶1481808521249503【2018.9.10】',
'腾讯用户6771268773':'腾讯用户6771268773【2019.4.10】',
'优酷用户5723493479':'优酷用户5723493479【2018.9.10】',
'支付宝用户1530108634320714':'支付宝用户1530108634320714【2018.9.10】',
'腾讯用户9015067736':'腾讯用户9015067736【2018.9.10】',
'微信用户6272602639':'微信用户6272602639【2018.9.10】',
'闹过了木有':'闹过了木有【2018.9.10】',
'微信用户7282573322':'微信用户7282573322【2018.9.10】',
'优酷手机用户_uFAtYP7p':'优酷手机用户_uFAtYP7p【2018.9.10】',
'砼体心':'砼体心【2018.9.10】',
'live1997':'live1997【2018.9.10】',
'okko54':'okko54【2018.9.10】',
'腾讯用户1532998230612746':'腾讯用户1532998230612746【2018.9.10】',
'wu2zz':'wu2zz【2018.9.10】',
'篮板哈市佛宝哈佛':'篮板哈市佛宝哈佛【2018.9.10】',
'阿尔巴男公爵':'阿尔巴男公爵【2018.9.10】',
'月影斜风':'月影斜风【2018.9.10】',
'a0081027':'a0081027【2018.9.10】',
'风神秀彻i':'风神秀彻i【2018.9.10】',
'腾讯用户9045060157':'腾讯用户9045060157【2018.9.10】',
'Natsu.08755':'Natsu.08755【2018.9.10】',
'支付宝用户6099763981':'支付宝用户6099763981【2018.9.10】',
'丶dan曲循环':'丶dan曲循环【2018.9.10】',
'优酷用户1508147847457856':'优酷用户1508147847457856【2018.9.10】',
'凌云s':'凌云s【2018.9.10】',
'抱着嫦娥丶烤月兔':'抱着嫦娥丶烤月兔【2018.9.10】',
'TARA歌好听':'TARA歌好听【2018.9.10】',
'yudong928733':'yudong928733【2018.9.10】',
'土豆用户_468617855':'土豆用户_468617855【2018.9.10】',
'卧似尘微':'卧似尘微【2018.9.10】',
'腾讯用户1509527585197271':'腾讯用户1509527585197271【2018.12.1】',
'毛毛197912':'毛毛197912【2018.12.1】',
'bibi1484758464123769':'bibi1484758464123769【2018.9.1】',
'路灯下的男孩子':'路灯下的男孩子【2018.9.1】',
'汤咖喱61197183':'汤咖喱61197183【2018.9.1】',
'腾讯用户1532313009990949':'腾讯用户1532313009990949【2018.9.1】',
'Entrance_41':'Entrance_41【2019.1.1】',
'亦生123':'亦生123【2018.9.1】',
'支付宝用户64894573':'支付宝用户64894573【2018.9.1】',
'悲殇啊啊':'悲殇啊啊【2018.9.1】',
'xingcheng74':'xingcheng74【2018.9.1】',
'6666778ppp':'6666778ppp【2018.9.1】',
'0_0b':'0_0b【2018.9.1】',
'城市里的鱼儿':'城市里的鱼儿【2018.9.1】',
'腾讯用户7505748657':'腾讯用户7505748657【2018.9.1】',
'a282654':'a282654【2018.9.1】',
'亚麻KENZO':'亚麻KENZO【2018.9.1】',
'手机用户_393026670':'手机用户_393026670【2018.9.1】',
'遥冰寒':'遥冰寒【2018.9.1】',
'土豆用户_466930988':'土豆用户_466930988【2018.11.20】',
'手机用户_467775006':'手机用户_467775006【2018.8.20】',
'淘宝用户1520658073391947':'淘宝用户1520658073391947【2018.11.20】',
'特雷西西丶':'特雷西西丶',
'商博良15417301':'商博良15417301【2018.11.10】',
'slker9999':'slker9999【2018.9.10】',
'along7029':'along7029【2018.12.1】',
'Linkybill':'Linkybill【2018.10.10】',
'doratama':'doratama【2018.10.1】',
'微信用户1526888185185224':'微信用户1526888185185224【2018.10.1】',
'微信用户6159040848':'微信用户6159040848【2018.9.20】',
'雷H寂寞':'雷H寂寞【2018.9.20】',
'octups':'octups【2018.9.10】',
'小恶魔要装回翅膀':'小恶魔要装回翅膀【2018.9.1】',
'优酷用户1469161965579707':'优酷用户1469161965579707【2019.5.1】',
'f91acdsee':'f91acdsee【2018.9.1】',

'陨灭星辰':'陨灭星辰【2018.8.20】',
'土豆用户_397278835':'土豆用户_397278835【2018.8.1】',
'刘刘刘大哥':'刘刘刘大哥【2018.8.1】',
'灰太狼先森丶1481974592566666':'灰太狼先森丶1481974592566666【2018.8.1】'
};

(function() {
    'use strict';
    var auto=true;
    var shortcutKey=119;//快捷鍵keyCode

    function stranText(txt){
        return simplized(txt);

    }

    function stranBody(pNode){
        var childs;
        if(pNode){
            childs=pNode.childNodes;
        }else{
            childs=document.documentElement.childNodes;
        }
        if(childs)
            for(var i=0;i<childs.length;i++){
                var child=childs.item(i);
                if(/BR|META|SCRIPT|HR|TEXTAREA/.test(child.tagName))continue;
                if(child.title){
                    let title=stranText(child.title);
                    if(child.title != title){
                        child.title=title;
                    }
                }
                if(child.alt){
                    let alt=stranText(child.alt);
                    if(child.alt != alt){
                        child.alt=alt;
                    }
                }
                if(child.tagName == "INPUT" && child.value !== "" && child.type != "text" && child.type != "search" && child.type != "hidden"){
                    let value=stranText(child.value);
                    if(child.value != value){
                        child.value=value;
                    }
                }else if(child.nodeType == 3){
                    let data=stranText(child.data);
                    if(child.data != data){
                        child.data=data;
                    }
                }else stranBody(child);
            }
    }



    function simplized(orgStr){
        var str='';
        str=orgStr;
        for (var word in wordlist){
            str=str.replace(word,wordlist[word]);
        }

        return str;
    }

    function setLanguage(){
        stranBody();

    }

    function switchLanguage(){

        setLanguage();
    }


    if(auto){
        setTimeout(function(){
            stranBody();
            var MutationObserver = window.MutationObserver || window.WebKitMutationObserver || window.MozMutationObserver;
            var observer = new MutationObserver(function(records){
                records.map(function(record) {
                    if(record.addedNodes){
                        [].forEach.call(record.addedNodes,function(item){
                            stranBody(item);
                        });
                    }
                });
            });
            var option = {
                'childList': true,
                'subtree': true
            };
            observer.observe(document.body, option);
        },50);
    }


    document.addEventListener("keydown", function(e) {
        if(e.keyCode == shortcutKey && e.ctrlKey) {
            simplized(document.activeElement.value);
        }
    });

    GM_registerMenuCommand("自定义【Ctrl+F8】", switchLanguage);
})();