// ==UserScript==
// @name         取代1
// @namespace    http://tampermonkey.net/
// @version      0.1
// @description  try to take over the world!
// @author       You
// @include      https://www.piaotian*
// @exclude      https://www.google*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/383512/%E5%8F%96%E4%BB%A31.user.js
// @updateURL https://update.greasyfork.org/scripts/383512/%E5%8F%96%E4%BB%A31.meta.js
// ==/UserScript==
var simplified='骞薑妹窦猕犸饴哝迩诨闵鹬聩鸩谲铤诽谔鸢槟鸠觑诃忾泾赝馄饨鹄饪袅邬鸾纣讷钼桦玮骛谕谑莺饽呓缥缈嚣桢诏骜鹜铎谙绮讧镂尴晖谏诮诩箫箓颠谧恻珑诋鹌鹑怅伥髅喽锏赅锵颌诠犷阙锂谄巅跄鸷阈铩渎镖斓铳飙颚亵争蓦确榄娅飒潇羁跷叙胪隐砺恹玺裆妩筚褴褛哔胧锱铢枭绉浏伫嘤骁驿恸呗娴铮讪怼殒跻饷辎岚后忒于哒诶谛讦笃铛觊觎俨铿仆讨迹铠鹫币拟荟篑着财吓标号将采啧叽适并裏态皑蔼碍爱翱袄奥坝罢摆败颁办绊帮绑镑谤剥饱宝报鲍辈贝钡狈备惫绷笔毕毙闭边编贬变辩辫鳖瘪濒滨宾摈饼拨钵铂驳补参蚕残惭惨灿苍舱仓沧厕侧册测层诧搀掺蝉馋谗缠铲产阐颤场尝长偿肠厂畅钞车彻尘陈衬撑称惩诚骋痴迟驰耻齿炽冲虫宠畴踌筹绸丑橱厨锄雏础储触处传疮闯创锤纯绰辞词赐聪葱囱从丛凑窜错达带贷担单郸掸胆惮诞弹当挡党荡档捣岛祷导盗灯邓敌涤递缔点垫电淀钓调迭谍叠钉顶锭订东动栋冻斗犊独读赌镀锻断缎兑队对吨顿钝夺鹅额讹恶饿儿尔饵贰发罚阀珐矾钒烦范贩饭访纺飞废费纷坟奋愤粪丰枫锋风疯冯缝讽凤肤辐抚辅赋复负讣妇缚该钙盖赶秆赣冈刚钢纲岗皋镐搁鸽阁铬个给龚宫巩贡钩沟构购够蛊顾剐关观馆惯贯广规硅归龟闺轨诡柜贵刽辊滚锅国过骇韩汉阂鹤贺横轰鸿红后壶护沪户哗华画划话怀坏欢环还缓换唤痪焕涣黄谎挥辉毁贿秽会烩汇讳诲绘荤浑伙获货祸击机积饥讥鸡绩缉极辑级挤几蓟剂济计记际继纪夹荚颊贾钾价驾歼监坚笺间艰缄茧检碱硷拣捡简俭减荐槛鉴践贱见键舰剑饯渐溅涧浆蒋桨奖讲酱胶浇骄娇搅铰矫侥脚饺缴绞轿较秸阶节茎惊经颈静镜径痉竞净纠厩旧驹举据锯惧剧鹃绢杰洁结诫届紧锦仅谨进晋烬尽劲荆觉决诀绝钧军骏开凯颗壳课垦恳抠库裤夸块侩宽矿旷况亏岿窥馈溃扩阔蜡腊莱来赖蓝栏拦篮阑兰澜谰揽览懒缆烂滥捞劳涝乐镭垒类泪篱离鲤礼丽厉励砾历沥隶俩联莲连镰怜涟帘敛脸链恋炼练粮凉两辆谅疗辽镣猎临邻鳞凛赁龄铃凌灵岭领馏刘龙聋咙笼垄拢陇楼娄搂篓芦卢颅庐炉掳卤虏鲁赂禄录陆驴吕铝侣屡缕虑滤绿峦挛孪滦乱抡轮伦仑沦纶论萝罗逻锣箩骡骆络妈玛码蚂马骂吗买麦卖迈脉瞒馒蛮满谩猫锚铆贸么霉没镁门闷们锰梦谜弥觅绵缅庙灭悯闽鸣铭谬谋亩钠纳难挠脑恼闹馁腻撵捻酿鸟聂啮镊镍柠狞宁拧泞钮纽脓浓农疟诺欧鸥殴呕沤盘庞国爱赔喷鹏骗飘频贫苹凭评泼颇扑铺朴谱脐齐骑岂启气弃讫牵扦钎铅迁签谦钱钳潜浅谴堑枪呛墙蔷强抢锹桥乔侨翘窍窃钦亲轻氢倾顷请庆琼穷趋区躯驱龋颧权劝却鹊让饶扰绕热韧认纫荣绒软锐闰润洒萨鳃赛伞丧骚扫涩杀纱筛晒闪陕赡缮伤赏烧绍赊摄慑设绅审婶肾渗声绳胜圣师狮湿诗尸时蚀实识驶势释饰视试寿兽枢输书赎属术树竖数帅双谁税顺说硕烁丝饲耸怂颂讼诵擞苏诉肃虽绥岁孙损笋缩琐锁獭挞摊贪瘫滩坛谭谈叹汤烫涛绦腾誊锑题体屉条贴铁厅听烃铜统头图涂团颓蜕脱鸵驮驼椭洼袜弯湾顽万网韦违围为潍维苇伟伪纬谓卫温闻纹稳问瓮挝蜗涡窝呜钨乌诬无芜吴坞雾务误锡牺袭习铣戏细虾辖峡侠狭厦锨鲜纤咸贤衔闲显险现献县馅羡宪线厢镶乡详响项萧销晓啸蝎协挟携胁谐写泻谢锌衅兴汹锈绣虚嘘须许绪续轩悬选癣绚学勋询寻驯训讯逊压鸦鸭哑亚讶阉烟盐严颜阎艳厌砚彦谚验鸯杨扬疡阳痒养样瑶摇尧遥窑谣药爷页业叶医铱颐遗仪彝蚁艺亿忆义诣议谊译异绎荫阴银饮樱婴鹰应缨莹萤营荧蝇颖哟拥佣痈踊咏涌优忧邮铀犹游诱舆鱼渔娱与屿语吁御狱誉预驭鸳渊辕园员圆缘远愿约跃钥岳粤悦阅云郧匀陨运蕴酝晕韵杂灾载攒暂赞赃脏凿枣灶责择则泽贼赠扎札轧铡闸诈斋债毡盏斩辗崭栈战绽张涨帐账胀赵蛰辙锗这贞针侦诊镇阵挣睁狰帧郑证织职执纸挚掷帜质钟终种肿众诌轴皱昼骤猪诸诛烛瞩嘱贮铸筑驻专砖转赚桩庄装妆壮状锥赘坠缀谆浊兹资渍踪综总纵邹诅组钻致钟么为凶准启雳余链泄甯沖松她歎閑⑨';
var traditional='騫姜弟竇獼獁飴噥邇諢閔鷸聵鴆譎鋌誹諤鳶檳鳩覷訶愾涇贗餛飩鵠飪裊鄔鸞紂訥鉬樺瑋騖諭謔鶯餑囈縹緲囂楨詔驁鶩鐸諳綺訌鏤尷暉諫誚詡簫籙顛謐惻瓏詆鵪鶉悵倀髏嘍鐧賅鏘頜詮獷闕鋰諂巔蹌鷙閾鎩瀆鏢斕銃飆顎褻爭驀確欖婭颯瀟羈蹺敘臚隱礪懨璽襠嫵篳襤褸嗶朧錙銖梟縐瀏佇嚶驍驛慟唄嫻錚訕懟殞躋餉輜嵐後太於噠誒諦訐篤鐺覬覦儼鏗僕討跡鎧鷲幣擬薈簣著財嚇標號將採嘖嘰適並裡態皚藹礙愛翺襖奧壩罷擺敗頒辦絆幫綁鎊謗剝飽寶報鮑輩貝鋇狽備憊繃筆畢斃閉邊編貶變辯辮鼈癟瀕濱賓擯餅撥缽鉑駁補參蠶殘慚慘燦蒼艙倉滄廁側冊測層詫攙摻蟬饞讒纏鏟産闡顫場嘗長償腸廠暢鈔車徹塵陳襯撐稱懲誠騁癡遲馳恥齒熾沖蟲寵疇躊籌綢醜櫥廚鋤雛礎儲觸處傳瘡闖創錘純綽辭詞賜聰蔥囪從叢湊竄錯達帶貸擔單鄲撣膽憚誕彈當擋黨蕩檔搗島禱導盜燈鄧敵滌遞締點墊電澱釣調叠諜疊釘頂錠訂東動棟凍鬥犢獨讀賭鍍鍛斷緞兌隊對噸頓鈍奪鵝額訛惡餓兒爾餌貳發罰閥琺礬釩煩範販飯訪紡飛廢費紛墳奮憤糞豐楓鋒風瘋馮縫諷鳳膚輻撫輔賦復負訃婦縛該鈣蓋趕稈贛岡剛鋼綱崗臯鎬擱鴿閣鉻個給龔宮鞏貢鈎溝構購夠蠱顧剮關觀館慣貫廣規矽歸龜閨軌詭櫃貴劊輥滾鍋國過駭韓漢閡鶴賀橫轟鴻紅後壺護滬戶嘩華畫劃話懷壞歡環還緩換喚瘓煥渙黃謊揮輝毀賄穢會燴彙諱誨繪葷渾夥獲貨禍擊機積饑譏雞績緝極輯級擠幾薊劑濟計記際繼紀夾莢頰賈鉀價駕殲監堅箋間艱緘繭檢堿鹼揀撿簡儉減薦檻鑒踐賤見鍵艦劍餞漸濺澗漿蔣槳獎講醬膠澆驕嬌攪鉸矯僥腳餃繳絞轎較稭階節莖驚經頸靜鏡徑痙競淨糾廄舊駒舉據鋸懼劇鵑絹傑潔結誡屆緊錦僅謹進晉燼盡勁荊覺決訣絕鈞軍駿開凱顆殼課墾懇摳庫褲誇塊儈寬礦曠況虧巋窺饋潰擴闊蠟臘萊來賴藍欄攔籃闌蘭瀾讕攬覽懶纜爛濫撈勞澇樂鐳壘類淚籬離鯉禮麗厲勵礫歷瀝隸倆聯蓮連鐮憐漣簾斂臉鏈戀煉練糧涼兩輛諒療遼鐐獵臨鄰鱗凜賃齡鈴淩靈嶺領餾劉龍聾嚨籠壟攏隴樓婁摟簍蘆盧顱廬爐擄鹵虜魯賂祿錄陸驢呂鋁侶屢縷慮濾綠巒攣孿灤亂掄輪倫侖淪綸論蘿羅邏鑼籮騾駱絡媽瑪碼螞馬罵嗎買麥賣邁脈瞞饅蠻滿謾貓錨鉚貿麼黴沒鎂門悶們錳夢謎彌覓綿緬廟滅憫閩鳴銘謬謀畝鈉納難撓腦惱鬧餒膩攆撚釀鳥聶齧鑷鎳檸獰甯擰濘鈕紐膿濃農瘧諾歐鷗毆嘔漚盤龐國愛賠噴鵬騙飄頻貧蘋憑評潑頗撲鋪樸譜臍齊騎豈啓氣棄訖牽扡釺鉛遷簽謙錢鉗潛淺譴塹槍嗆牆薔強搶鍬橋喬僑翹竅竊欽親輕氫傾頃請慶瓊窮趨區軀驅齲顴權勸卻鵲讓饒擾繞熱韌認紉榮絨軟銳閏潤灑薩鰓賽傘喪騷掃澀殺紗篩曬閃陝贍繕傷賞燒紹賒攝懾設紳審嬸腎滲聲繩勝聖師獅濕詩屍時蝕實識駛勢釋飾視試壽獸樞輸書贖屬術樹豎數帥雙誰稅順說碩爍絲飼聳慫頌訟誦擻蘇訴肅雖綏歲孫損筍縮瑣鎖獺撻攤貪癱灘壇譚談嘆湯燙濤縧騰謄銻題體屜條貼鐵廳聽烴銅統頭圖塗團頹蛻脫鴕馱駝橢窪襪彎灣頑萬網韋違圍爲濰維葦偉僞緯謂衛溫聞紋穩問甕撾蝸渦窩嗚鎢烏誣無蕪吳塢霧務誤錫犧襲習銑戲細蝦轄峽俠狹廈鍁鮮纖鹹賢銜閒顯險現獻縣餡羨憲線廂鑲鄉詳響項蕭銷曉嘯蠍協挾攜脅諧寫瀉謝鋅釁興洶鏽繡虛噓須許緒續軒懸選癬絢學勳詢尋馴訓訊遜壓鴉鴨啞亞訝閹煙鹽嚴顔閻豔厭硯彥諺驗鴦楊揚瘍陽癢養樣瑤搖堯遙窯謠藥爺頁業葉醫銥頤遺儀彜蟻藝億憶義詣議誼譯異繹蔭陰銀飲櫻嬰鷹應纓瑩螢營熒蠅穎喲擁傭癰踴詠湧優憂郵鈾猶遊誘輿魚漁娛與嶼語籲禦獄譽預馭鴛淵轅園員圓緣遠願約躍鑰嶽粵悅閱雲鄖勻隕運蘊醞暈韻雜災載攢暫贊贓臟鑿棗竈責擇則澤賊贈紮劄軋鍘閘詐齋債氈盞斬輾嶄棧戰綻張漲帳賬脹趙蟄轍鍺這貞針偵診鎮陣掙睜猙幀鄭證織職執紙摯擲幟質鍾終種腫眾謅軸皺晝驟豬諸誅燭矚囑貯鑄築駐專磚轉賺樁莊裝妝壯狀錐贅墜綴諄濁茲資漬蹤綜總縱鄒詛組鑽致鐘麼為兇準啟靂餘鍊洩寧衝鬆他嘆閒九';
var new_html = document.body.innerHTML.replace(new RegExp(simplified[0] + "(?![^<]*>)","g"), traditional[0]);
for (var x = 1; x < simplified.length; x++) {new_html = new_html.replace(new RegExp(simplified[x] + "(?![^<]*>)","g"), traditional[x]);}
document.body.innerHTML = new_html;window.onload = function() {new_html = document.body.innerHTML.replace(new RegExp(simplified[0] + "(?![^<]*>)","g"), traditional[0]);
for (var x = 1; x < simplified.length; x++) {new_html = new_html.replace(new RegExp(simplified[x] + "(?![^<]*>)","g"), traditional[x]);}
document.body.innerHTML = new_html;};var replaceArry = [
[/’的/gi,'’'],[/‘|“/gi,'「'], [/’|”/gi,'」'], [/ [\u4e00-\u9fa5]{1,3}([！。…])/gi,' '],[/ [\u4e00-\u9fa5]{1,3}([！。…])/gi,' '],[/\「(.?)\」/gi,'$1'],
[/([幾一二三四五六七八九十百千萬])裡/gi,'$1里'],[/干/gi,'幹'],[/隻/gi,'只'],[/里/gi,'裡'],
[/(小孩|[雪汁法片悶色墩倍腕聲錯旋俠弦托貝準事刺伴氣彎道陣分見范尖風對猴底形溜魂這本名根煙心滾伙水蛇畫轉話夥塊臉人圈眼會界份信輩件理頭膽神半口哥哪字招格們眾坎盤那勁樣得點意個天味子腦玩茬餡攤蔫魚主豬門貓馬活盹碴邊花官鳥段詞曲臉])兒([^子孫女])/gi,'$1$2'],
[/([淩關肖蕭孟雷席張林高文蘇唐劉譚邱蔣燕姬雲曹方梁薛宋姜呂郭史辛沈楊孫羅陸章謝喬吳周荀魏嚴韓趙杜王李鄧龔姚陳黃])某/gi,'我'],
[/只([！。，？公寵喪螳蜘蝙虎熊爪鳥狐蟲老龍猴螢雞貓蠍毒眼兔惡神鱷小鬼手巨黑狗妖精怪屍幼野荒狼骷魔白風畜B])/gi,'隻$1'],[/([隻半餘船某幾每整兩一二三四五六七八九十百千萬有1234567890]|隻)只/gi,'$1隻'],[/([這那])只([^對限會有需要能不是])/gi,'$1隻$2'],
[/([甩未口哭蒸幹放流乾耗餅褪抽吃微燒發放榨魚烘肉吸喝擦一吹烤])(干|幹)/gi,'$1乾'],[/(干|幹)([淨屍涸燥杯枯性濕瘦糧癟股幹餅乾澀嚎看孫竭啃脆肉透瞪嘔硬])/gi,'乾$2'],[/(幹|乾)([涉休擾雲政預？！])/gi,'干$2'],[/([相])(幹|乾)/gi,'$1干'],
[/待([待鵝萌愣頭腦滯坐子傻若住板]|待地|待的|了待)/gi,'呆$1'],[/(呆了|發什麼|發著|[發驚癡然嚇呆口])待/gi,'$1呆'],
[/女僕裝|旗袍|唐裝|漢服|衣裳|中山裝|華服|長袍|長裙|短裙|連衣裙/gi,'衣服'],
[/來自遙遠的東方|遙遠的東方|來自神秘的東方|神秘的東方|幹的漂亮|來自仙鄉的/gi,''],
[/英姿颯爽|饒有興致|饒有興趣|俏生生|噼裡啪啦|清秀|俏皮|妖豔|金髮碧眼|笑靨如花|美豔|嬌俏|漂亮|美麗|施施然|嬌滴滴|高挑|婀娜|甜美|修長|豐滿|性感|萌萌噠|風韻猶存|曼妙|美貌|英俊|絕美|俏麗|婀娜多姿|嬌豔|羞澀|嬌羞|怯生生|妖嬈|凹凸有致|嬌媚|禿頭|身材火辣|身材火爆|窈窕|姣好|嫵媚|可愛|美美/gi,'A1MJ'],
[/A1MJ(的|和|地)/gi,''],
[/([嗔嬌]|柔聲|媚聲|嬌叱|膩聲|嗔怪|嬌喝|無奈|恭敬)道/gi,'道'],
[/([頭黑紅白金銀紫綠毛棕藍毫赤])發([^現出生])/gi,'$1髮$2'],
[/瓜子臉|臉蛋|俏臉|容顏|胖臉|精緻的五官|秀臉|臉龐/gi,'臉'],
[/眼楮|鳳目|眼眸|美眸|眸子|美目|妙目|眸/gi,'眼'],
[/小([腳嘴臉手])/gi,'$1'],
[/胸脯/gi,'胸'],
[/([秀])眉/gi,'眉'],
[/德意國|英倫|華夏國|倭國|燈塔國|山姆國|繁櫻國|太平洋聯邦|玄國|China|日國|祖國|歐洲|俄羅斯|RB|義大利|美利堅|扶桑|德國|霓虹|俄國|歐美|華國|東瀛|香江|英國|加拿大|法國|台彎|港臺|港台|香港|臺灣|美國|日本|高麗|韓國|華夏|中國|印度|國外|國内|海外|外國|[A-Z]國|國家國|國家和國家|國家，國家|國家國家|國家、國家/gi,'國家'],
[/北京|天京|燕京|A市市/gi,'A市'],
[/共和幣|美刀|美元|美金|軟妹幣|rmb|人民幣/gi,'信用點'],[/([百千萬億])信用點/gi,'$1'],
[/哭笑不得|苦笑|無奈(一聲|連連|了一聲|了一下)/gi,'無奈'],
[/君莎小姐|君莎|君沙|捕快|員警|民警|公安|警花|警察叔叔/gi,'警察'],[/派出所/gi,'警察局'],[/\*\*師/gi,'大法師'],
[/([^上下左右外後前裡側])面([店湯粉包條餅館團])/gi,'$1麵$2'],[/([牛肉|炒碗泡米拉吃])面/gi,'$1麵'],[/方便面|速食面/gi,'泡麵'],
[/國人|歪果仁|老外|洋鬼子|W人|E人|亞洲人|亞裔|華裔|白人|白種人|黑人|黃種人|黃皮猴子|華人|國家人|白種女人|白種人/gi,'人'],
[/玄文|華語|英文|韓文|中文|漢語|普通話|漢字|英語|日文|通用語通用語/gi,'通用語'],
[/([今明昨])(兒個|兒)/gi,'$1天'],[/拜托|拜託|么蛾子|妖蛾子|幺蛾子/gi,'麻煩'],
[/([咱我你他它她])(倆)/gi,'$1們'],[/([弟們妻子])倆/gi,'$1'],
[/桀桀桀|嘟嘟嘟|喂喂喂|滋滋滋|停停停|呼呼呼|噗噗噗|轟轟轟|嘶嘶嘶|嘭嘭嘭|買買買|蹬蹬蹬|砰砰砰|行行行|踏踏踏|走走走|來來來|好好好|喂喂/gi,''],
[/不不不|對對對|是是是|去去去|當當當|嗖嗖嗖|叮叮叮|刷刷刷|嗚嗚嗚|嗷嗷嗷|突突突|蓬蓬蓬|啪啪啪|嗡嗡嗡|啊啊啊|啦啦啦|喵喵喵/gi,''],

[/EMMMM|EMMM|EMM/gi,'EM'],[/凱瑟琳/gi,'巫師'],[/BSS/gi,'BOSS'],[/易先生/gi,'秋禾'],[/黃猿大叔/gi,'黃猿'],
[/瑛兒|楚瑛|他他/gi,'他'],
[/福爾摩斯/gi,'福斯'],[/感情好/gi,'好'],[/紅女妖/gi,'紅妖'],[/女王/gi,'王'],[/功夫/gi,'時間'],
[/([分秒])鍾/gi,'分鐘'],[/母女/gi,'二人'],[/二人二人/gi,'二人'],[/1/gi,'1'],[/1/gi,'1'],[/1/gi,'1'],[/1/gi,'1'],[/1/gi,'1'],[/1/gi,'1'],[/1/gi,'1'],

[/「俄/gi,'「'],[/啦([？，。])/gi,'了$1'],
[/度娘|網絡/gi,'網路'],[/肥皂快樂水|肥宅快樂水/gi,'可樂'],

[/旗袍|華服|長袍|長裙|短裙|連衣裙/gi,'衣服'],[/([萬公幾百十千])裡/gi,'$1里'],[/(盈盈|冷冷|嫣然|[呵嘿哈])一笑/gi,'一笑'],
[/老先生|老太爺|老爺爺|老人家|老爺子|老人家|老頭子/gi,'老頭'],[/([上下左右外後前裡側])邊/gi,'$1面'],[/([^咱你妳我他牠她它人娘])們/gi,'$1'],
[/([半數十百千萬])載/gi,'$1年'],[/嬌軀|肉身|身子|肉體/gi,'身體'],[/的活([，。])/gi,'的工作$1'],[/好朋友|哥們|閨蜜|好友/gi,'朋友'],
[/鬼才知道|鬼知道/gi,'誰知道'],[/瞧|瞅/gi,'看'],
[/互聯網/gi,'網路'],[/功能表/gi,'菜單'],[/找茬/gi,'找麻煩'],[/沒法/gi,'沒辦法'],[/為毛/gi,'為什麼'],[/一丁點/gi,'一點'],[/狀元郎/gi,'狀元'],[/什麼鬼/gi,'什麼'],[/何方神聖/gi,'誰'],
[/於是乎/gi,'於是'],[/主人公/gi,'主角'],[/單身狗/gi,'單身'],[/撒丫子/gi,'撒腿'],[/作甚/gi,'做什麼'],[/個自然日/gi,'天'],[/幹嘛/gi,'做什麼'],[/解放軍/gi,'軍隊'],
[/無奈一聲/gi,'無奈'],[/年青人/gi,'年輕人'],[/天知道/gi,'誰知道'],[/赤果果/gi,'赤裸裸'],[/正兒八經/gi,'正經'],[/攝像頭/gi,'監視器'],
[/關系|干係/gi,'關係'],[/感情|合著/gi,'原來'],[/女聲|嬌聲/gi,'聲音'],[/牛逼|流弊/gi,'厲害'],[/熒屏|屏幕/gi,'螢幕'],[/視頻|視屏/gi,'影片'],[/厘米|釐米/gi,'公分'],[/香味|體香/gi,'味道'],
[/壓力山大/gi,'壓力大'],[/學([姐姊])/gi,'學長'],[/師([姐姊])/gi,'師兄'],[/空間布袋/gi,'空間袋'],
[/老中醫|中醫/gi,'醫生'],[/(那|這)廝/gi,'$1傢伙'],[/估摸著|估摸/gi,'估計'],[/咋([^舌])/gi,'怎麼$1'],
[/作死|自己找死/gi,'找死'],[/位元([^嬰神])/gi,'位$1'],[/(鋼鐵|蜘蛛)俠/gi,'$1人'],
[/([噗撲])([嗤哧呲])/gi,''],[/這貨|他老頭|他他/gi,'他'],[/的主([，。])/gi,'的人$1'],
[/不？/gi,'嗎？'],[/莫要/gi,'不要'],[/地兒/gi,'地方'],[/适才/gi,'剛才'],[/視窗/gi,'窗戶'],[/法子/gi,'辦法'],[/壓根/gi,'根本'],[/隕落/gi,'死亡'],[/官府/gi,'官方'],[/聖上/gi,'皇帝'],[/短信/gi,'簡訊'],[/存儲/gi,'儲存'],
[/國佬/gi,'國人'],[/赤果/gi,'赤裸'],[/説明/gi,'幫助'],[/早晨/gi,'早上'],[/公交/gi,'公車'],[/打印/gi,'列印'],[/鼠標/gi,'滑鼠'],[/倭寇/gi,'海盜'],[/拜見/gi,'見過'],[/驚異/gi,'驚訝'],[/覺察/gi,'察覺'],
[/忍者/gi,'殺手'],[/國術/gi,'武術'],[/暫態/gi,'瞬間'],[/因該/gi,'應該'],[/活計/gi,'工作'],[/倩影/gi,'身影'],[/半響/gi,'半晌'],[/法爺/gi,'法師'],[/路飛/gi,'魯夫'],[/香肩/gi,'肩膀'],[/佔卜/gi,'占卜'],[/懵逼/gi,'茫然'],
[/老板/gi,'老闆'],[/奶媽/gi,'治療'],[/自個/gi,'自己'],[/立馬/gi,'馬上'],[/無更新/gi,'無'],[/辣麼/gi,'那麼'],[/蘿卜/gi,'蘿蔔'],[/已然/gi,'已經'],[/美婦/gi,'婦人'],[/擱在/gi,'放在'],[/玩意/gi,'東西'],
[/狐狸|狐璃|狐/gi,'狗'],[/俱都/gi,'都'],[/甫一/gi,'剛'],[/巨集/gi,'宏'],[/話語/gi,'話'],[/卵用/gi,'用'],[/乃是/gi,'是'],[/腳丫/gi,'腳'],[/啥/gi,'什麼'],[/甭/gi,'不用'],[/忙活/gi,'忙'],[/女神/gi,'神'],
[/紐約/gi,'MH'],[/東京/gi,'KM'],[/U盤/gi,'USB'],
[/([多喝文打高神風])採/gi,'$1采'],
[/([北星泰八筋煙菸漏])鬥/gi,'$1斗'],
[/鬥([篷轉拱金米笠膽])/gi,'斗$1'],
[/(百多|十多|[幾千百十一二兩三四五六七八九0-9])米/gi,'$1公尺'],

[/少女|妹紙|姑娘|淑女|禦姐|美女|美人|妹子|娘們|小姐姐|小姐|女(孩兒|孩子|[孩生士子性人])/gi,'Ⓖ'],
[/([冷可嬌長美妙漂年絕俏妖金豔高紅馬黑][愛尾魅色挑俏世貌美髮齡亮麗輕豔小大]|軟|弱|大|小|萌|美|嬌|清純|青春|極品|長相|自家|身材)Ⓖ|Ⓖ([子們])/gi,'Ⓖ'],
[/([王陳許孫])Ⓖ/gi,'他'],
[/小畜生|王八蛋|小屁孩|小丫頭|雜種|蘿莉|傻小子|丫頭|小娃娃|小娃兒|兔崽子|小崽子|小妮子|小妞|小雜碎|小傢伙|妮子|小夥子|小雜種|胖子|胖砸|臭小子|小小子/gi,'小子'],[/小小子/gi,'小子'],
[/父母|爸爸|媽媽|親生母親|母親|娘親|阿母|阿爹|阿娘|父親|老爹|老媽|老爸|爹爹|爹娘|爸媽|便宜家人|家人家人|家人和家人/gi,'家人'],
[/他你|你他|您老|您|你你|你老頭|尊駕|你這小子|你小子|你丫|小子你|大爺你|Ⓖ你|QA你|師叔你|前輩你|汝/gi,'你'],[/(　|[[:punct:]])(閣下|道友|道兄)/gi,'$1你'],[/汝等|爾等/gi,'你們'],
[/爲師|本將軍|哀家|本巡撫|本督查|本汪|微臣|本相|本喵|本Ⓖ|小老兒|本長老|咱家|咱|俺|朕|奴家|本座|勞資|老衲|鄙人|洒家|貧道|老夫|老朽|本姑娘|本郡主|本娘子|本寨主|本公子|本少爺|本大爺|本小姐|我.某人|老子|老頭我|小爺我|小弟我|老娘|妾身|貧僧|師弟我|本聖|本官|老道我|我我/gi,'我'],
[/(　|[[:punct:]])(屬下|小人|在下|晚輩|孩兒|為兄|為師|徒兒)/gi,'$1我'],[/我等|吾等|我們哥幾個|我們哥倆/gi,'我們'],
[/([人統相婆帝神皇子母師魔尊教使族領爵師軍士官父宰者犬長東首主宗府火])(先生|老爺|大人|陛下|殿下|閣下|冕下)/gi,'$1'],
[/(Ⓖ|[女老])(警察|前輩|[軍戰店將法醫殺記護牧學老玩高科同施契祭])/gi,'$2'],
[/恩師|導師|師尊|師傅|師父|便宜老師/gi,'老師'],[/女僕|婢女|丫鬟|侍女|男僕/gi,'僕人'],[/位Ⓖ/gi,'個人'],
[/([艹嘛嚯咩咿咚嚶唰噠喔呵哇嘁嘞謔呸呦噢唉誒欸唉哎呃咦喏呢哈咳哦呐嘖咧唄喲哼嗯咯啊呀嘻嘿咈]|表弟|什麼的|嬌喝|你娘的|别忘了，|SHIT|他喵|踏馬的|他娘的|他娘|特碼的|特碼|特娘的|特娘|WOW|嘎吱|嘩啦啦|嘩啦|握草|咔擦|咔嚓|黑頭髮|黑眼珠|黃皮膚|冷豔|A1MJ|卧槽|大哥哥|之旅|哢嚓|黑髮|尼瑪|中華|同志|臥槽|芊芊細|纖纖玉|南無阿彌陀佛|他媽的|他媽|他娘的|該死的|丫的|來著|特嗎的|特嗎|特麼的|特麼|他麼|他喵的|未完待續|TM的|TMD|TM|蛋子|狗日的|他奶奶的|香汗淋漓|我勒個去|我了個去|迎娶白富美|MMP|有木有|禿頂)([^士頓拉成欠嗽佛])/gi,'$2'],
[/([嚯咩咿咚嚶唰噠喔呵哇嘁嘞謔呸呦噢唉誒欸唉哎呃咦喏呢哈咳哦呐嘖咧唄喲哼嗯咯啊呀嘻嘿咈]|更新快】|【31|八嘎|我艹)([^士頓拉成欠嗽佛一])/gi,'$2'],
[/([ 　「」，、。…！？])(有趣|老爺|首長|說實話|踢踏|老哥|你知道的|媽耶|有意思|恩公|蠢貨|陛下|抱歉|對不起|搭檔|少年|大人|爺爺|龍套|老頭|姐姐|哥哥|兄弟|等等|哢嚓|好人|主人|老師|HELLO|OH|公主|握草|臥槽|你妹的|叮咚|坑爹|QA|我說|宿主|FUCK|妹的|娘娘|魂淡|這不|我曰|我日|夥計|Ⓖ|親愛的|老頭子|好傢伙|我的天|媽蛋|乖乖|混蛋|朋友|來的好|OK|娘的|我草|領導|妙哉|大爺的|小輩|恩恩|麻痹|聒噪|媽的|去你的|討厭|我艸|我操|扯淡|前輩|笨蛋|奶奶的|家人|我擦|上帝|來得好|老天爺|小子|得了|王八蛋|天哪|該死|該死的|我去|我的天呐|天呐|老天|我靠|先生|恭喜|話說回來|換句話說|話說|[靠我你干曰呸的嗨吱嘩嗝鏘嗖欸唔天嘣轟淦鐺當砰蓬喵吼嚓哄嗡咻爽唰擦滴額塞哈們幹去娘嘔林耶嗤爸媽踏娘喂姐噗嘛啪噝滋嗷嘭蛤咚嗚呦爹唔得哥噓噻妹噫恩噯乖他嘀善親叮好奧呼操諾汗日行頭草暈桀嘶切呔啦喵瞄秦汪嘖艸俄孫陳鎭哢屁易徐沈])([　「」，、～~。…！？])/gi,'$1$3'],
[/([　「」，、。…！？])(真是有趣|兄台|踢踏|媽耶|有意思|恩公|蠢貨|陛下|抱歉|搭檔|[沈])([　「」，、～~。\.…！？])/gi,'$1$3'],
[/([何的有血些老兩多一種那這的麼有衣髮好秘年群的裙衫袍個通此名瘋妖靈面])(小子|Ⓖ)/gi,'$1人'],[/怎麼([地著滴])/gi,'怎麼樣'],
[/([ 　」，、。…？等如趕下著令現指見而連起了照當然識是找到聽和將對把向被在問為於與幫給看讓從夠以但]|看著|^)(小子|Ⓖ)/gi,'$1他'],
[/\s(嘩啦啦|嘩啦|轟隆隆|轟隆|嗖嗖|滴滴|[噗呼啪嗖嘶砰])/gi,''],
[/1/gi,'1'],
[/(Ⓖ|小子)([一似之是給把還他很在也說和的那])/gi,'他$2'],
[/([一二婦此兩這些眾魔貓妖仙])女/gi,'$1人'],[/狗疑/gi,'疑惑'],
[/([人他])Ⓖ/gi,'$1'],[/(櫃台|惡魔|[愉者士族員])Ⓖ/gi,'$1'],[/位(兄台|老師|朋友)/gi,'位'],[/男男女女|男女|Ⓖ/gi,'人'],
[/a/gi,'A'],[/b/gi,'B'],[/c/gi,'C'],[/d/gi,'D'],[/e/gi,'E'],[/f/gi,'F'],[/g/gi,'G'],[/h/gi,'H'],[/i/gi,'I'],[/j/gi,'J'],[/k/gi,'K'],[/l/gi,'L'],[/m/gi,'M'],[/n/gi,'N'],[/o/gi,'O'],[/p/gi,'P'],[/q/gi,'Q'],[/r/gi,'R'],[/s/gi,'S'],[/t/gi,'T'],[/u/gi,'U'],[/v/gi,'V'],[/w/gi,'W'],[/x/gi,'X'],[/y/gi,'Y'],[/z/gi,'Z'],
[/。。。|\.\./gi,'…'],[/…………|………|……/gi,'…'],[/(^：|【|「|\()([、，？！…;～~：—。])/gi,'$1'],[/([！…，]？)|(？[！~…，。？])/gi,'？'],[/([…，~—]！)|(！[…，~。！])/gi,'！'],[/([、…~—，]，)|(，[、…～~—])/gi,'，'],[/([、…~—，。]。)|(。[、…~—，。？])/gi,'。'],
[/(：| |【|「|\()([、，？！…;~：—。])/gi,'$1'],[/「」/gi,''],[/\「(.?)\」/gi,'$1'],[/([。…！])「/gi,'$1」'],];
var numTerms = replaceArry.length;var txtWalker = document.createTreeWalker ( document.body, NodeFilter.SHOW_TEXT, { acceptNode: function (node) {if (node.nodeValue.trim() ) return NodeFilter.FILTER_ACCEPT; return NodeFilter.FILTER_SKIP; } }, false);
var txtNode = null;while (txtNode = txtWalker.nextNode ()){ var oldTxt = txtNode.nodeValue; for (var J = 0; J <numTerms; J++){ oldTxt = oldTxt.replace (replaceArry[J][0], replaceArry[J][1]); } txtNode.nodeValue = oldTxt;}