// ==UserScript==
// @name         block tweet
// @namespace    https://twitter.com
// @version      2.9
// @description  أداة بلوك توييت تقوم بحجب جميع التغريدات الإعلانية و الغير لائقة، تمتع بتصفح تويتر بدون إزعاج
// @author       sultan alrefaei
// @match        https://twitter.com/*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/387449/block%20tweet.user.js
// @updateURL https://update.greasyfork.org/scripts/387449/block%20tweet.meta.js
// ==/UserScript==

var obj = {
    words: [
        "علاج",
        "للطلَب والاستِفسار",
        "نقل اثاث", "القًٍٍَِذف",
        "صـلاَبة الانتِصـاب",
        "تَأخير القَذف",
        "مجموعة القولون العصبي",
        "مجموعة كلين",
        "لَلطَلبَ والاسَتفسَار",
        "سِكس",
        "عٌلَأّجِ طّبِيِّعٌيِّ",
        "فلان سمين",
        "القٍدرات الجنسًية",
        "وَزْنَكَ",
        "عِلَاَجَ",
        "مــقويات جنـــــسية",
        "القذف",
        "الترهلات",
        "تَخْسِيسٍ",
        "الوزن الزائد",
        "انقاص الوزن",
        "تبييض أسنان",
        "فيـــــــتولايز",
        "القدرة الجنسية",
        "تـــخســر وزنـــك",
        "للطلب والاستفسار",
        "للتنحــيــف",
        "#سٌكٍُسَِ",
        "القضيــــــــــــــــــــــــــــــــــــــــــــــب",
        "#معصيتى_راحتى",
        "#معصيتي_راحتي",
        "معصيتي_راحتي",
        "ثـبات الـــوزن",
        "بــرنــامــج تــخــــسيــس",
        "معصيتى_راحتى",
        "تكــــــــتبير الٌقـــــــضيب",
        "بــرنــامــج تــخــسيــس",
        "مكونات طـبـيـعـيـة",
        "شركة تنظيف",
        "تنظيف مكيفات",
        "وزنك",
        "تخسيس",
        "تخسيس مـضـمـون",
        "للطلب وأتس أب",
        "علَاج طٓول القِضُيب",
        "كِبيُر العٓضٍو ُالٕذَكْرٌي",
        "الَرغبًة الجًنًسًية",
        "فيديو فضيحة",
        "سًرًعَة الَقذًف",
        "لنزول الوزن",
        "طبيعي💯",
        "البث المبـاشر الفاضح",
        "تخسر وزنك",
        "العُلاج الطُبيعي",
        "زيـــُادة حجــــُم",
        "لعلُاج ســُرعة القــُذف",
        "من هي المرأة المتزوجة",
        "الفيديو الفاضح",
        "بديل التكميم",
        "بلازما للنساء والرجال",
        "للقدرة الجنسية",
        "انتصاب",
        "عــــــــــــــــــــــــلاج",
        "سًكسَِ",
        "لمُنتجــات القُـدرة الجِنسـيّـة ",
        "تأخيــر قــــذف",
        "انتصاب اقـــوى",
        "تاخير القـذف",
        "قدرة جنسية حقيقة",
        "قضيب",
        "لتاخير القذف",
        "تاخير القـذف",
        "شدّة الانتَصَاب",
        "بــرنــامــج تـخــــسيــس",
        "قدرة جنسية",
        "سُكُس",
        "عًلاجً سًرًعَة الَقذًف",
        "علًاجَ ضًعَف الانتًصَاَب",
        "تكبيــر الصدر والارداف",
        "العِلاقة الزوجِية",
        "الاعشاب الطبيعيه",
        "للضـعــفَ الـجِـنًسِي",
        "تكبيــر الصدر",
        "تخسيس الوزن",
        "للطلب و الاستفسار",
        "للطلب والاستفسار",
        "عـــــــــــــــــــــلاج",
        "القضيــــــــــــــــــــــــــــــــــــــــــــب",
        "القدرة الجنسية",
        "سكس",
        "اغتصاب",
        "نيك",
        "لمنتجات العلاجية",
        "المنتجات العلاجية",
        "تأخير القذف",
        "انتصاب قوي",
        "السكس",
        "اباحي",
        "فلم اباحي",
        "افلام اباحيه",
        "الضعف الجنسي",
        "ضعف الانتصاب",
        "الافلام الاباحيه",
        "القذف المبكر",
        "الرغبه الجنسيه",
        "اخسر من وزنــك",
        "اخسر وزنــك",
        "يؤخر القذف",
        "سٍَِْر~ْعَِْةَِْ القًٍَِْذف",
        "ضٍَِْعفْ~ الاًٍِ~نتصابًَِْ",
        "الْوَزْنِ",
        "كرشك مزعجك",
        "منع تساقط الشعر",
        "الكرررش",
        "لمشاكلك الجنسية"
    ]
}

window.onload = (e) =>{
    setTimeout(() => {
        init();
    }, 2500);
}

function init(){

    const tweet_text = document.getElementsByClassName("tweet-text");
    const tweet = document.getElementsByClassName("tweet");

    var index = 0;

    setInterval(() => {
        if (tweet_text == undefined || tweet_text == null) return false;
        if (tweet == undefined || tweet == null) return false;
        for (var t = 0; t < tweet_text.length; t++){
            for (var wd = 0; wd < obj.words.length; wd++){
                if (tweet_text[t].innerText.includes(obj.words[wd])){
                    tweet[t].style.display = "none";
                    tweet[t].setAttribute("tweet_block", true);
                }
            }
        }
    }, 5);

    setInterval(() => {
        index = 0;

        for (var bt = 0; bt < tweet.length; bt++){
            if (tweet[bt].hasAttribute("tweet_block")){
                index++;
            }
        }

        count(index);
    }, 5);
}

function count(num){
    if (document.getElementById("count_blocktweet") == undefined){
        var count = document.createElement("div");
        count.setAttribute("id", "count_blocktweet");
        count.setAttribute("style", "position: fixed; z-index: 10000; top: 4em; left: 0px; border-top-right-radius: 35px; border-bottom-right-radius: 35px; padding: 10px; text-align: center; color: #fff; background-color: #8BC34A;")
        count.innerText = "0";

        count.innerText = num;
    
        document.body.appendChild(count);
    }else{
        document.getElementById("count_blocktweet").innerText = num;
    }
}