const words = [
    '郭小龙', '郭欢', '刘亿平', '郑加颖', '张宏赞', '汤鹏辉', '李迅菡', '王俊轩', '杨楠', '付长杰', '黎相麟', '胡仕军', '韦雪碧', '何子欣', '李萍', '温水根', '田亚豪', '聂佳彬', '何世福', '廖志杰', '董杰', '林浩涛', '宋友芳', '刘俊裕', '韩超', '梁思远', '林新城', '邹锐', '徐凯明', '宋远征', '熊兴文', '方志杰', '凌宏开', '房海灏', '王永煌', '陈立权', '邵珠彬', '杨建全', '谭亮', '张焕旭', '蔡金武', '刘知发', '何梓健', '张哲', '沈攀', '罗锦源', '黎琳', '刘荣耀', '程江帆', '葛兵', '李科', '汪岭', '胡东', '徐春林', '黄君霖', '龚耀庭', '杨胜涛', '柳志华', '陈安', '李则意', '邓业强', '彭润彬', '上官伟', '梁春间', '邱腾达', '王伟', '李开春', '付君', '刘焕', '颜建桐', '熊军', '陈勇', '宋海诚', '董国胜', '曹开治', '黄廷武', '成欢晴', '刘明', '严涵', '史靖', '王正', '徐伟', '王家夯', '黄琦', '司马攀', '屈志平', '肖红亮', '杨聪', '陈芝砚', '丘健', '邹新祥', '张越', '梅帆', '张海洋', '蒋子文', '李皆成', '汪岸', '谢瑜', '张浩', '刘家源', '黄均鹏', '邹振', '饶章辉', '钟波',
]

function maxTimesWord(targetString) {
    // return {name: words, times: n} or undefined
    let result = [];
    for (let word of words) {
        const pattern = new RegExp(word, 'g');
        const matchTimes = targetString.match(pattern);
        if (matchTimes) {
            result.push({name: word, times: matchTimes.length})
        }
    }
    return result.sort((a, b) => {
        return b.times - a.times
    })[0]
}