// ==UserScript==
// @name        Белый список
// @author      Qc
// @description Список автомобилей который необходимо пропустить по тем или иным причинам
// @include     https://taximeter-admin.taxi.yandex-team.ru/dkk
// @include     https://taximeter-admin.taxi.yandex-team.ru/dkk/priority
// @include     https://taximeter-admin.taxi.yandex-team.ru/qc/history*
// @version     0.09
// @grant       none
// @namespace https://greasyfork.org/users/191824
// @downloadURL https://update.greasyfork.org/scripts/399353/%D0%91%D0%B5%D0%BB%D1%8B%D0%B9%20%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA.user.js
// @updateURL https://update.greasyfork.org/scripts/399353/%D0%91%D0%B5%D0%BB%D1%8B%D0%B9%20%D1%81%D0%BF%D0%B8%D1%81%D0%BE%D0%BA.meta.js
// ==/UserScript==
const numberBase = ["А057РУ777","А254РУ777","А285РУ777","А306КЕ197","А309ХК750","А312РУ777","А378ОВ190","А432ХК750","А474ХК750","А492РЕ777","А494ХК750","А503ЕО197","А504ЕО197","А555УК777","А606ТС777","А695УЕ750","А773УЕ750","А821УЕ750","А822УЕ750","А830УЕ750","А954РУ777","В001СТ750","В017СТ750","В034СТ750","В037СТ750","В153СТ750","В278ОС190","В331ВВ190","В390РВ750","В443КР77","В607ОС750","В610ОС750","В629ОС750","Е173РН77","Е175РН77","Е178РН77","Е959ОХ777","К011РУ777","К098УМ777","К680ХА750","К894УО750","К912ХР197","К914ХР197","К948УО750","К969УО750","М019УО750","М509ХА750","М551КХ777","М570ХА750","М576ХА750","М751СС750","Н545СН777","Н669СН777","О179ОА777","О277ОА777","О289ОА777","О352ХЕ197","О645ТТ750","О701ТТ750","О713ТТ750","О726ТТ750","О728ТТ750","О742ТТ750","О755ТТ750","О872АТ799","Р028УУ199","Р236УС199","Р475ОР197","Р872ВА777","Р916МК197","С152РТ777","С176КА197","С205РТ777","С255РТ777","С289РТ777","С309АВ777","С310АВ777","С319РТ777","С401ОТ197","С422УО197","С423УО197","С424УО197","С454ВА799","С506ХЕ777","С612ХЕ777","С613ХЕ777","С620ХЕ777","С688ХЕ777","С693ВА799","С806ВА799","С839РО197","С840РО197","С872ВА799","С904ВА799","С922АЕ197","С952ВА799","Т013ТВ750","Т016ТВ750","Т018ТВ750","Т024ТВ750",
    "В376ОР116", "Р940ЕЕ99", "К642АВ750", "А151МУ69", "У854ЕТ163", "Е001АО64", "К239УТ36",
                    "КВ55166",
                    "М630ВО196","М628ВО196","М615ВО196","Р627ТУ161", "В113АА761", "О894АВ761", "А126ТХ161", "Р776ТУ161", "О931АВ761", "М043ТХ161", "У505УХ161", "О470ХО161", "Р667ТУ161", "Р670ТУ161", "О929АВ761", "О933УХ161", "О556ХО161", "О951ТО161", "О183АО761", "ХХ35477", "ХХ33277", "АМ20399", "МО78177", "РХ72177", "МО76977", "ХХ35377", "ХХ34077", "МО77077", "РХ72477", "ХХ35277", "МО77977", "ТУ16877", "РХ72777", "МО77477", "ХХ33877", "ТУ13177", "МО78077", "ТУ18277", "КО26277",
                    "Х843МК197", "Х482ОВ777", "Х473МН77", "Х470МН77", "Х465МН77", "Х462МН77", "У624СК178", "У593НУ77", "У588НУ77", "У580СК178", "У442СН750", "У435СН750", "У405СН750", "У372СН750", "У198УМ777", "У192УМ777", "Т594МТ777", "Т593МТ777", "Т064ТВ750", "Т062ТВ750", "Т043ТВ750", "Т024ТВ750", "Т018ТВ750", "Т016ТВ750", "Т013ТВ750", "С952ВА799", "С922АЕ197", "С904ВА799", "С872ВА799", "С840РО197", "С839РО197", "С806ВА799", "С693ВА799", "С688ХЕ777", "С620ХЕ777", "С613ХЕ777", "С612ХЕ777", "С506ХЕ777", "С454ВА799", "С424УО197", "С423УО197", "С422УО197", "С401ОТ197", "С319РТ777", "С310АВ777", "С309АВ777", "С289РТ777", "С255РТ777", "С205РТ777", "С176КА197", "С152РТ777", "Р916МК197", "Р872ВА777", "Р475ОР197", "Р236УС199", "Р028УУ199", "О872АТ799", "О755ТТ750", "О742ТТ750", "О728ТТ750", "О726ТТ750", "О713ТТ750", "О701ТТ750", "О645ТТ750", "О352ХЕ197", "О289ОА777", "О277ОА777", "О179ОА777", "Н669СН777", "Н545СН777", "М751СС750", "М576ХА750", "М570ХА750", "М551КХ777", "М509ХА750", "М019УО750", "К969УО750", "К948УО750", "К914ХР197", "К912ХР197", "К894УО750", "К680ХА750", "К098УМ777", "К011РУ777", "Е959ОХ777", "Е178РН77", "Е175РН77", "Е173РН77", "В629ОС750", "В610ОС750", "В607ОС750", "В443КР77", "В390РВ750", "В331ВВ190", "В278ОС190", "В153СТ750", "В037СТ750", "В034СТ750", "В017СТ750", "В001СТ750", "А954РУ777", "А830УЕ750", "А822УЕ750", "А821УЕ750", "А773УЕ750", "А695УЕ750", "А606ТС777", "А555УК777", "А504ЕО197", "А503ЕО197", "А494ХК750", "А492РЕ777", "А474ХК750", "А432ХК750", "А378ОВ190", "А312РУ777", "А309ХК750", "А306КЕ197", "А285РУ777", "А254РУ777", "А057РУ777",
                    "О446ТВ05","А182КМ777","У750КА102","А909ХУ95","М338УТ05","У443УА163","О450ОС05","А326ОН196","Н124ОА98","О842АТ05","О206РВ05","О439ОХ05","О053РХ05","О817РВ05","О446ОС05","О092КК05","О104РХ05","О248МН05","О649КК05","О591РХ05","О163ОА05","О326ОС05","О668РХ05","О065ОС05","О459ОХ05","О039РА05","О967РХ05","Р487УУ152","Р179РУ152","С173ЕВ152","Р513УУ152","Р211РУ152","С963ВР152","Р189РУ152","С172ЕВ152","С105ЕВ152","Р517УУ152","С099ЕВ152","С946ВР152","С964ВР152","Р821РК152","Р448ВМ152","С045ЕХ152","С078ЕХ152","Р096МО152","С932КС152","Р049КК152","О985РВ152","С921КС152","Р766УС152","О893ХО152","Р779УС152","Р993ЕЕ152","О981НУ152","Р786УС152","Р515ОО152",
                    "Е482КА716","Е308ВТ716","Е582АО716","В043СР716","Е675РН716","Е481КА716","А716АО716","В607КУ716","В450СУ716","В391ХВ716","В398СР716","В594ХУ716","Е200ВТ716","А035РУ716","В877УН716","А489СВ716","В254ОС716","А172ТВ716","В094УН716","А999УЕ716","В286КО716","Е397КА716","А707РС716","В869АХ716","В318ХВ716","В227АТ716","А379ОМ716","В549КО716","Е513КН716","A749XO116","Н323АМ716","Н418АН716","Х948ЕУ116","Е903АА716","A911УЕ716","А318КО116","У531АЕ116","Х592ЕВ163","Н084ЕВ716","А214МК716","В472СК716","О976НС40","О941ОУ40","О792РА40","В087АО797","В060АЕ797","В085АС797","О244ОУ40","В020ВР716","В066АК797","О284ОУ40","О927НС40","В086АС797","В084АМ797","О898НС40","В591ВР716","АС59116","АС59016","АС59316","АС59216"];

function WhiteMark(a){
	$('<span/>',{
		id: 'med',
		style: 'display: block; opacity: 1; width: fit-content; margin-top: 5px; margin-bottom: 2px; padding: 4px 9px; margin-left: -4px; background: rgba(255, 0, 0, 0.66); font-weight: bold; border: 1px solid rgb(128,128,128); cursor: pointer',
        text: a,
		click: function(){
			$(this).toggleClass('hide')
		},
	}).insertAfter($('.check-thumb-number').children().eq(0));
};
function defineUS(e,params){
	$('#med').remove();
	var year = params.car.match(/[\s\S]\]\ (\d{4})\ [\s\S]/)[1];
	var number = params.car.match(/\((((?!\]).)*)\)$/)[1].replace(/\s+/g, '');
	if(numberBase.indexOf(number) >= 0){
		WhiteMark('Внимание! Пропустить, не блокировать!')
	};
};
$(document).bind('item_info', defineUS);