// ==UserScript==
// @name         Flower Knight Girls H Player
// @namespace    http://misuzu.moe/
// @version      0.11
// @description  try to take over the world!
// @author       You
// @match        http://undefined.com/
// @require      https://cdnjs.cloudflare.com/ajax/libs/pako/1.0.10/pako_inflate.min.js
// @grant        GM_xmlhttpRequest
// @grant        GM_addStyle
// @downloadURL https://update.greasyfork.org/scripts/403425/Flower%20Knight%20Girls%20H%20Player.user.js
// @updateURL https://update.greasyfork.org/scripts/403425/Flower%20Knight%20Girls%20H%20Player.meta.js
// ==/UserScript==

(function () {
  document.write(`<!DOCTYPE html>
  <html lang="en">
  <head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Flower Kngint Girls</title>
  </head>
  <body style="background-color: rgb(58, 67, 68);">
    <div id="hs-container">
      <div id="hs-loading"></div>
      <audio id="hs-bgm" src="https://misuzu.moe/wcp/fkg_bgm_hscene001.mp3"></audio>
      <audio id="hs-voice"></audio>
      <img id="hs-scene"></img>
      <div id="hs-frame"></div>
      <div id="hs-label">
        <span id="hs-name"></span>
      </div>
      <div id="hs-dialog">
        <span id="hs-text"></span>
      </div>
    </div>
    <div id="chara-select">
      <div id="star-panel">
        <button id="star3" class="">☆☆☆</button>
        <button id="star4" class="">☆☆☆☆</button>
        <button id="star5" class="">☆☆☆☆☆</button>
        <button id="star6" class="activated">☆☆☆☆☆☆</button>
      </div>
      <div id="chara-table">
        <div id="charas">
        </div>
      </div>
    </div>
  </body>`)

  const charaData = [{"star":5,"name":"赤のナーエの感謝の気持ち","id":"108001"},{"star":5,"name":"青のナーエの感謝の気持ち","id":"108005"},{"star":5,"name":"黄のナーエの感謝の気持ち","id":"108007"},{"star":5,"name":"紫のナーエの感謝の気持ち","id":"108011"},{"star":5,"name":"青のナーエの感謝の気持ち","id":"108013"},{"star":5,"name":"紫のナーエの感謝の気持ち","id":"108015"},{"star":5,"name":"生命樹 青のナーエ(庭園)","id":"108501"},{"star":5,"name":"生命樹 紫のナーエ(庭園)","id":"108503"},{"star":5,"name":"まちあわせ 青のナーエ(庭園)","id":"108505"},{"star":5,"name":"おめかし 紫のナーエ(庭園)","id":"108507"},{"star":5,"name":"生命樹 青のナーエ","id":"108601"},{"star":5,"name":"生命樹 紫のナーエ","id":"108603"},{"star":5,"name":"まちあわせ 青のナーエ","id":"108605"},{"star":5,"name":"おめかし 紫のナーエ","id":"108607"},{"star":3,"name":"強化霊 赤のマニュ20才","id":"109917"},{"star":3,"name":"強化霊 黄のマニュ20才","id":"109919"},{"star":5,"name":"強化霊 赤のマニュ100才","id":"109921"},{"star":5,"name":"強化霊 黄のマニュ100才","id":"109923"},{"star":3,"name":"進化竜 赤のブルム20才","id":"109929"},{"star":3,"name":"進化竜 黄のブルム20才","id":"109931"},{"star":5,"name":"進化竜 赤のブルム100才","id":"109933"},{"star":5,"name":"進化竜 黄のブルム100才","id":"109935"},{"star":5,"name":"開花鳥 赤のフルル","id":"109949"},{"star":5,"name":"開花鳥 黄のフルル","id":"109951"},{"star":5,"name":"知徳の花びら","id":"109953"},{"star":5,"name":"深い森の花びら","id":"109955"},{"star":5,"name":"常夏の花びら","id":"109957"},{"star":5,"name":"開花の秘薬(金)","id":"109959"},{"star":5,"name":"ヤクノヒナホシ","id":"110001"},{"star":5,"name":"スノーベリー","id":"110003"},{"star":5,"name":"カゲツ","id":"110005"},{"star":5,"name":"アリッサム","id":"110301"},{"star":5,"name":"スズシロ","id":"110303"},{"star":5,"name":"ジャーマンアイリス","id":"110401"},{"star":6,"name":"サフラン","id":"110403"},{"star":5,"name":"ジャーマンアイリス","id":"110405"},{"star":6,"name":"オジギソウ","id":"110407"},{"star":5,"name":"サフラン","id":"110409"},{"star":5,"name":"オジギソウ","id":"110411"},{"star":5,"name":"サフラン","id":"110413"},{"star":5,"name":"シーマニア","id":"110501"},{"star":6,"name":"デージー","id":"110801"},{"star":5,"name":"サイネリア","id":"110803"},{"star":5,"name":"カレンデュラ","id":"110805"},{"star":3,"name":"サンビタリア","id":"110807"},{"star":5,"name":"ピンポンマム","id":"110809"},{"star":5,"name":"カカリア","id":"110811"},{"star":5,"name":"ウィンターコスモス","id":"110813"},{"star":6,"name":"デージー","id":"110815"},{"star":5,"name":"ノースポール","id":"110817"},{"star":5,"name":"ブラキカム","id":"110819"},{"star":5,"name":"ディモルフォセカ","id":"110821"},{"star":5,"name":"フキ","id":"110823"},{"star":5,"name":"プリムラ","id":"110901"},{"star":5,"name":"シャコバサボテン","id":"111001"},{"star":5,"name":"チェリーセージ","id":"111103"},{"star":5,"name":"ローズマリー","id":"111105"},{"star":5,"name":"レオノチス","id":"111107"},{"star":5,"name":"チェリーセージ","id":"111109"},{"star":3,"name":"ホワイトパンジー","id":"111501"},{"star":3,"name":"イエローパンジー","id":"111503"},{"star":5,"name":"イヌタデ","id":"111601"},{"star":5,"name":"ツバキ","id":"111701"},{"star":5,"name":"ツバキ","id":"111703"},{"star":6,"name":"ブラックバッカラ","id":"111901"},{"star":3,"name":"ロイヤルプリンセス","id":"111903"},{"star":3,"name":"ノヴァーリス","id":"111905"},{"star":5,"name":"モケ","id":"111907"},{"star":6,"name":"ビワ","id":"111909"},{"star":6,"name":"ノヴァーリス","id":"111911"},{"star":5,"name":"ノイバラ","id":"111913"},{"star":5,"name":"ミニバラ","id":"111915"},{"star":5,"name":"ブラックバッカラ","id":"111917"},{"star":6,"name":"スノードロップ","id":"112001"},{"star":5,"name":"エウカリス","id":"112003"},{"star":6,"name":"スノードロップ","id":"112005"},{"star":5,"name":"ケイトウ","id":"112201"},{"star":6,"name":"ミモザ","id":"112401"},{"star":3,"name":"アルストロメリア","id":"112601"},{"star":6,"name":"アルストロメリア","id":"112603"},{"star":5,"name":"プルモナリア","id":"112701"},{"star":5,"name":"オンシジューム","id":"112801"},{"star":5,"name":"シンビジューム","id":"112803"},{"star":6,"name":"デンドロビウム","id":"112805"},{"star":6,"name":"カトレア","id":"112807"},{"star":6,"name":"イオノシジウム","id":"112809"},{"star":6,"name":"オンシジューム","id":"112811"},{"star":5,"name":"カトレア","id":"112813"},{"star":5,"name":"イオノシジウム","id":"112815"},{"star":6,"name":"カトレア","id":"112817"},{"star":6,"name":"パフィオペディルム","id":"112819"},{"star":5,"name":"スイセイラン","id":"112821"},{"star":6,"name":"オンシジューム","id":"112823"},{"star":5,"name":"シンビジューム","id":"112825"},{"star":5,"name":"デンドロビウム","id":"112827"},{"star":5,"name":"デンドロビウム","id":"112829"},{"star":5,"name":"トリカブト","id":"112901"},{"star":6,"name":"ミスミソウ","id":"112903"},{"star":5,"name":"ニリンソウ","id":"112905"},{"star":6,"name":"トリカブト","id":"112907"},{"star":5,"name":"ニリンソウ","id":"112909"},{"star":5,"name":"レシュノルティア","id":"113001"},{"star":5,"name":"コーレア","id":"113003"},{"star":5,"name":"ユズ","id":"113005"},{"star":5,"name":"コーレア","id":"113007"},{"star":5,"name":"オリーブ","id":"113301"},{"star":5,"name":"エノコログサ","id":"113501"},{"star":5,"name":"エノコログサ","id":"113503"},{"star":5,"name":"ジャノメエリカ","id":"114203"},{"star":5,"name":"オキザリス","id":"114601"},{"star":5,"name":"オキザリス","id":"114603"},{"star":5,"name":"マネッチア","id":"114701"},{"star":5,"name":"ブバルディア","id":"114703"},{"star":6,"name":"ヒナソウ","id":"114705"},{"star":5,"name":"ヤツデ","id":"114801"},{"star":5,"name":"シンクライリアナ","id":"114901"},{"star":6,"name":"ハートツリー","id":"115201"},{"star":5,"name":"ブルーエルフィン","id":"115501"},{"star":5,"name":"クラリンドウ","id":"115503"},{"star":5,"name":"ポインセチア","id":"116001"},{"star":6,"name":"ハツユキソウ","id":"116003"},{"star":5,"name":"ハツユキソウ","id":"116005"},{"star":5,"name":"ポインセチア","id":"116007"},{"star":5,"name":"ハツユキソウ","id":"116009"},{"star":6,"name":"ユキハナソウ","id":"116011"},{"star":5,"name":"ホーリー","id":"116201"},{"star":5,"name":"ホーリー","id":"116203"},{"star":5,"name":"アロエ","id":"117001"},{"star":5,"name":"アロエ","id":"117005"},{"star":5,"name":"ロウバイ","id":"117101"},{"star":5,"name":"ストレリチア","id":"117401"},{"star":5,"name":"ベルゲニア","id":"117601"},{"star":5,"name":"ベルゲニア","id":"117603"},{"star":5,"name":"ツキトジ","id":"118101"},{"star":5,"name":"カランコエ","id":"118103"},{"star":5,"name":"クリスマスベゴニア","id":"119101"},{"star":5,"name":"リトープス","id":"119201"},{"star":6,"name":"セルリア","id":"119501"},{"star":5,"name":"セルリア","id":"119503"},{"star":5,"name":"チューベローズ","id":"120001"},{"star":5,"name":"ウェルウィッチア","id":"120003"},{"star":5,"name":"ノラナ","id":"120005"},{"star":6,"name":"ホウセンカ","id":"120007"},{"star":5,"name":"ナツメ","id":"120009"},{"star":5,"name":"インパチェンス","id":"120011"},{"star":6,"name":"サテラ","id":"120013"},{"star":4,"name":"ハイビスカス","id":"120101"},{"star":3,"name":"クレナイ","id":"120201"},{"star":3,"name":"アジサイ","id":"120203"},{"star":3,"name":"グラジオラス","id":"120401"},{"star":5,"name":"モントブレチア","id":"120403"},{"star":3,"name":"キキョウ","id":"120701"},{"star":5,"name":"ガイラルディア","id":"120803"},{"star":6,"name":"ヘレニウム","id":"120805"},{"star":5,"name":"ガザニア","id":"120807"},{"star":5,"name":"フジバカマ","id":"120809"},{"star":5,"name":"ルドベキア","id":"120811"},{"star":6,"name":"ヘレニウム","id":"120813"},{"star":5,"name":"ルドベキア","id":"120815"},{"star":5,"name":"ヘリクリサム","id":"120817"},{"star":5,"name":"チトニア","id":"120819"},{"star":6,"name":"ウサギギク","id":"120821"},{"star":5,"name":"ソリダスター","id":"120823"},{"star":5,"name":"ヘレニウム","id":"120825"},{"star":5,"name":"シルフィウム","id":"120827"},{"star":5,"name":"チコリー","id":"120829"},{"star":6,"name":"ヘリアンサス","id":"120831"},{"star":5,"name":"ヘリオプシス","id":"120835"},{"star":6,"name":"レッドジンジャー","id":"121201"},{"star":6,"name":"クルクマ","id":"121203"},{"star":5,"name":"スイレン","id":"121301"},{"star":3,"name":"アカバナスイレン","id":"121303"},{"star":6,"name":"オオオニバス","id":"121305"},{"star":6,"name":"オオオニバス","id":"121307"},{"star":6,"name":"スイレン","id":"121309"},{"star":5,"name":"アカバナスイレン","id":"121311"},{"star":6,"name":"イタドリ","id":"121603"},{"star":5,"name":"ヒメシャラ","id":"121701"},{"star":6,"name":"ヒメシャラ","id":"121703"},{"star":5,"name":"サカキ","id":"121705"},{"star":5,"name":"グリーンベル","id":"121801"},{"star":5,"name":"レインボーローズ","id":"121901"},{"star":6,"name":"ブラックベリー","id":"121903"},{"star":4,"name":"ゼフィランサス","id":"122001"},{"star":5,"name":"レインリリー","id":"122003"},{"star":6,"name":"ハブランサス","id":"122005"},{"star":5,"name":"アガパンサス","id":"122007"},{"star":3,"name":"ヒルガオ","id":"122301"},{"star":5,"name":"ヨルガオ","id":"122303"},{"star":3,"name":"アサガオ","id":"122305"},{"star":5,"name":"ルコウソウ","id":"122307"},{"star":4,"name":"カイコウズ","id":"122401"},{"star":5,"name":"カズラ","id":"122403"},{"star":4,"name":"カサブランカ","id":"122701"},{"star":5,"name":"ヤマユリ","id":"122703"},{"star":5,"name":"オトメユリ","id":"122705"},{"star":5,"name":"ヒメユリ","id":"122707"},{"star":5,"name":"サンダーソニア","id":"122709"},{"star":5,"name":"ユリ","id":"122711"},{"star":5,"name":"カノコユリ","id":"122713"},{"star":5,"name":"クルマユリ","id":"122715"},{"star":6,"name":"グロリオサ","id":"122717"},{"star":6,"name":"ベッセラ","id":"122719"},{"star":6,"name":"サンダーソニア","id":"122723"},{"star":5,"name":"ミルトニア","id":"122801"},{"star":6,"name":"コランバイン","id":"122901"},{"star":5,"name":"レモン","id":"123001"},{"star":5,"name":"タチバナ","id":"123101"},{"star":5,"name":"ファンフラワー","id":"123103"},{"star":5,"name":"アンスリウム","id":"123401"},{"star":5,"name":"ヒペリカム","id":"123801"},{"star":5,"name":"オシロイバナ","id":"123901"},{"star":6,"name":"オシロイバナ","id":"123903"},{"star":5,"name":"カラスウリ","id":"124001"},{"star":6,"name":"ペポ","id":"124003"},{"star":6,"name":"ペポ","id":"124005"},{"star":5,"name":"ヘザー","id":"124201"},{"star":5,"name":"ツキミソウ","id":"124301"},{"star":5,"name":"ツキミソウ","id":"124305"},{"star":6,"name":"ゴデチア","id":"124307"},{"star":5,"name":"アンゲロニア","id":"124401"},{"star":5,"name":"リシアンサス","id":"124501"},{"star":5,"name":"エキザカム","id":"124503"},{"star":5,"name":"カタバミ","id":"124601"},{"star":5,"name":"カタバミ","id":"124603"},{"star":5,"name":"サオトメバナ","id":"124701"},{"star":5,"name":"クチナシ","id":"124703"},{"star":5,"name":"キヌタソウ","id":"124705"},{"star":5,"name":"サンタンカ","id":"124707"},{"star":5,"name":"アカンサス","id":"124901"},{"star":5,"name":"ベロペロネ","id":"124903"},{"star":5,"name":"ディプラデニア","id":"125001"},{"star":5,"name":"プルメリア","id":"125003"},{"star":5,"name":"ニチニチソウ","id":"125005"},{"star":5,"name":"プルメリア","id":"125007"},{"star":5,"name":"ディプラデニア","id":"125009"},{"star":5,"name":"ランタナ","id":"125501"},{"star":6,"name":"ランタナ","id":"125503"},{"star":5,"name":"フォックスフェイス","id":"125601"},{"star":5,"name":"ベラドンナ","id":"125603"},{"star":5,"name":"ワルナスビ","id":"125605"},{"star":5,"name":"ハバネロ","id":"125607"},{"star":6,"name":"ワルナスビ","id":"125609"},{"star":5,"name":"ホップ","id":"125901"},{"star":5,"name":"ホップ","id":"125903"},{"star":5,"name":"キャッツテール","id":"126001"},{"star":6,"name":"マンリョウ","id":"126401"},{"star":5,"name":"マンリョウ","id":"126403"},{"star":5,"name":"センリョウ","id":"126501"},{"star":6,"name":"センリョウ","id":"126503"},{"star":6,"name":"カカオ","id":"127201"},{"star":5,"name":"カカオ","id":"127203"},{"star":5,"name":"ギンバイソウ","id":"127601"},{"star":5,"name":"ロエオ","id":"128001"},{"star":5,"name":"エケベリア","id":"128101"},{"star":5,"name":"ロケア","id":"128103"},{"star":6,"name":"ポーチュラカ","id":"128201"},{"star":5,"name":"ザクロ","id":"128301"},{"star":5,"name":"キウイ","id":"128701"},{"star":5,"name":"ライオンゴロシ","id":"128801"},{"star":5,"name":"セリ","id":"129601"},{"star":5,"name":"サラセニア","id":"130001"},{"star":5,"name":"シバザクラ","id":"130005"},{"star":5,"name":"セアノサス","id":"130007"},{"star":5,"name":"グーズベリー","id":"130009"},{"star":5,"name":"ギリア","id":"130011"},{"star":5,"name":"スキラ","id":"130013"},{"star":5,"name":"スグリ","id":"130017"},{"star":5,"name":"バーゼリア","id":"130019"},{"star":5,"name":"イセビ","id":"130021"},{"star":5,"name":"シィル・プライン","id":"130027"},{"star":5,"name":"アニソドンテア","id":"130101"},{"star":4,"name":"アブラナ","id":"130301"},{"star":6,"name":"イベリス","id":"130303"},{"star":5,"name":"イベリス","id":"130305"},{"star":6,"name":"ムラサキハナナ","id":"130307"},{"star":6,"name":"フリージア","id":"130401"},{"star":6,"name":"イキシア","id":"130403"},{"star":4,"name":"セントポーリア","id":"130501"},{"star":5,"name":"セントポーリア","id":"130503"},{"star":5,"name":"ダリア","id":"130803"},{"star":5,"name":"ローダンセ","id":"130805"},{"star":5,"name":"キンセンカ","id":"130807"},{"star":5,"name":"ハルジオン","id":"130809"},{"star":6,"name":"アザミ","id":"130811"},{"star":5,"name":"カウスリップ","id":"130901"},{"star":6,"name":"カウスリップ","id":"130903"},{"star":5,"name":"アナガリス","id":"130905"},{"star":6,"name":"サボテン","id":"131001"},{"star":5,"name":"サボテン","id":"131003"},{"star":6,"name":"ホシクジャク","id":"131007"},{"star":5,"name":"ホシクジャク","id":"131009"},{"star":6,"name":"サボテン","id":"131011"},{"star":5,"name":"スズラン","id":"131401"},{"star":5,"name":"スミレ","id":"131501"},{"star":6,"name":"ビオラ","id":"131503"},{"star":6,"name":"ビオラ","id":"131505"},{"star":5,"name":"キランソウ","id":"131601"},{"star":5,"name":"コマチソウ","id":"131801"},{"star":6,"name":"シャボンソウ","id":"131803"},{"star":5,"name":"ハコベラ","id":"131805"},{"star":6,"name":"ミリム(セキチク)","id":"131807"},{"star":6,"name":"異世界の暴君","id":"131809"},{"star":5,"name":"シャボンソウ","id":"131811"},{"star":6,"name":"ウメ","id":"131903"},{"star":5,"name":"バラ","id":"131905"},{"star":6,"name":"サクラ","id":"131907"},{"star":5,"name":"モモ","id":"131911"},{"star":6,"name":"ハナモモ","id":"131913"},{"star":6,"name":"サクランボ","id":"131915"},{"star":6,"name":"アプリコット","id":"131917"},{"star":5,"name":"ハナモモ","id":"131919"},{"star":5,"name":"ウメ","id":"131921"},{"star":5,"name":"サクラ","id":"131923"},{"star":5,"name":"アプリコット","id":"131925"},{"star":5,"name":"カンヒザクラ","id":"131927"},{"star":6,"name":"プラム","id":"131929"},{"star":5,"name":"サクランボ","id":"131931"},{"star":6,"name":"サクラ","id":"131933"},{"star":5,"name":"キジムシロ","id":"131935"},{"star":5,"name":"プルーン","id":"131937"},{"star":5,"name":"キルタンサス","id":"132003"},{"star":5,"name":"イフェイオン","id":"132005"},{"star":5,"name":"イフェイオン","id":"132007"},{"star":4,"name":"ヒノキ","id":"132101"},{"star":3,"name":"レンゲソウ","id":"132401"},{"star":6,"name":"アカシア","id":"132403"},{"star":5,"name":"ハリエンジュ","id":"132405"},{"star":5,"name":"ルピナス","id":"132407"},{"star":5,"name":"キヌサヤ","id":"132409"},{"star":6,"name":"エニシダ","id":"132413"},{"star":6,"name":"アカシア","id":"132415"},{"star":6,"name":"ハリエンジュ","id":"132417"},{"star":4,"name":"ハクモクレン","id":"132501"},{"star":6,"name":"ナイトメア(カタクリ)","id":"132701"},{"star":3,"name":"コチョウラン","id":"132801"},{"star":5,"name":"マスデバリア","id":"132803"},{"star":5,"name":"エビネ","id":"132805"},{"star":6,"name":"アネモネ","id":"132901"},{"star":6,"name":"クリスマスローズ","id":"132903"},{"star":5,"name":"フクジュソウ","id":"132905"},{"star":5,"name":"ラナンキュラス","id":"132907"},{"star":5,"name":"ヒメリュウキンカ","id":"132909"},{"star":5,"name":"アネモネ","id":"132911"},{"star":5,"name":"アンリ(バイカカラマツ)","id":"132913"},{"star":5,"name":"アネモネ","id":"132915"},{"star":5,"name":"アネモネ","id":"132917"},{"star":6,"name":"アネモネ","id":"132921"},{"star":5,"name":"サザンクロス","id":"133001"},{"star":5,"name":"サザンクロス","id":"133003"},{"star":6,"name":"オレンジ","id":"133005"},{"star":6,"name":"ウサギノオ","id":"133501"},{"star":5,"name":"ウサギノオ","id":"133503"},{"star":5,"name":"キンギョソウ","id":"134101"},{"star":5,"name":"キンギョソウ","id":"134103"},{"star":5,"name":"ツツジ","id":"134201"},{"star":6,"name":"ツツジ","id":"134203"},{"star":5,"name":"クランベリー","id":"134205"},{"star":5,"name":"シズ(ドウダンツツジ)","id":"134207"},{"star":5,"name":"異世界の炎使い","id":"134209"},{"star":5,"name":"カルセオラリア","id":"134401"},{"star":5,"name":"ビンカ","id":"135001"},{"star":4,"name":"ワスレナグサ","id":"135101"},{"star":5,"name":"ボリジ","id":"135103"},{"star":5,"name":"アンチューサ","id":"135105"},{"star":5,"name":"メイゲツカエデ","id":"135301"},{"star":5,"name":"バーベナ","id":"135501"},{"star":5,"name":"ユーカリ","id":"135801"},{"star":6,"name":"ヤドリギ","id":"136101"},{"star":5,"name":"リュウゼツラン","id":"136701"},{"star":5,"name":"ボタン","id":"136801"},{"star":5,"name":"ポピー","id":"136901"},{"star":5,"name":"メコノプシス","id":"136903"},{"star":6,"name":"メコノプシス","id":"136905"},{"star":5,"name":"メギ","id":"137801"},{"star":5,"name":"ゼブリナ","id":"138001"},{"star":6,"name":"マロニエ","id":"139001"},{"star":5,"name":"ランプランサス","id":"139201"},{"star":5,"name":"ヨウラクボタン","id":"139801"},{"star":5,"name":"ガジュマル","id":"140001"},{"star":5,"name":"カカラ","id":"140003"},{"star":5,"name":"アベリア","id":"140005"},{"star":5,"name":"ツルバキア","id":"140007"},{"star":5,"name":"ゼンマイ","id":"140009"},{"star":5,"name":"ガーリックバイン","id":"140011"},{"star":6,"name":"ミムルス","id":"140013"},{"star":5,"name":"コナラ","id":"140015"},{"star":5,"name":"シイタケ","id":"140017"},{"star":5,"name":"見当かなみ","id":"140019"},{"star":5,"name":"ウキツリボク","id":"140101"},{"star":6,"name":"ウキツリボク","id":"140103"},{"star":5,"name":"ハナオクラ","id":"140105"},{"star":5,"name":"ハナショウブ","id":"140401"},{"star":5,"name":"ハナショウブ","id":"140403"},{"star":6,"name":"ストレプトカーパス","id":"140501"},{"star":6,"name":"ストレプトカーパス","id":"140503"},{"star":5,"name":"ローレンティア","id":"140701"},{"star":5,"name":"ローレンティア","id":"140703"},{"star":5,"name":"コスモス","id":"140801"},{"star":3,"name":"マリーゴールド","id":"140803"},{"star":5,"name":"ガーベラ","id":"140805"},{"star":5,"name":"チョコレートコスモス","id":"140807"},{"star":5,"name":"エキナセア","id":"140809"},{"star":5,"name":"ヨモギ","id":"140811"},{"star":5,"name":"シオン","id":"140813"},{"star":5,"name":"チョコレートコスモス","id":"140815"},{"star":5,"name":"イモーテル","id":"140817"},{"star":5,"name":"アルテミシア","id":"140819"},{"star":5,"name":"クラスペディア","id":"140821"},{"star":6,"name":"ゴギョウ","id":"140823"},{"star":5,"name":"エキナセア","id":"140825"},{"star":5,"name":"アルテミシア","id":"140827"},{"star":5,"name":"シオン(ノコンギク)","id":"140829"},{"star":5,"name":"異世界の武士","id":"140831"},{"star":5,"name":"ピレスラム","id":"140833"},{"star":6,"name":"チョコレートコスモス","id":"140835"},{"star":5,"name":"シクラメン","id":"140903"},{"star":5,"name":"ゲッカビジン","id":"141001"},{"star":5,"name":"サンカクサボテン","id":"141003"},{"star":5,"name":"サンカクサボテン","id":"141005"},{"star":6,"name":"ゲッカビジン","id":"141007"},{"star":6,"name":"サンカクサボテン","id":"141009"},{"star":5,"name":"ラベンダー","id":"141103"},{"star":5,"name":"ワタチョロギ","id":"141105"},{"star":5,"name":"ミント","id":"141107"},{"star":5,"name":"コリウス","id":"141109"},{"star":6,"name":"ラベンダー","id":"141111"},{"star":5,"name":"ワタチョロギ","id":"141113"},{"star":6,"name":"ネペタ","id":"141115"},{"star":3,"name":"ブルーロータス","id":"141301"},{"star":3,"name":"サザンカ","id":"141303"},{"star":4,"name":"ワレモコウ","id":"141701"},{"star":5,"name":"ワレモコウ","id":"141703"},{"star":5,"name":"チャノキ","id":"141705"},{"star":6,"name":"ワビスケ","id":"141707"},{"star":6,"name":"ナデシコ","id":"141801"},{"star":5,"name":"ナデシコ","id":"141803"},{"star":5,"name":"リクニス","id":"141805"},{"star":3,"name":"センニチコウ","id":"141901"},{"star":5,"name":"カリン","id":"141903"},{"star":6,"name":"ネリネ","id":"142001"},{"star":6,"name":"ヒガンバナ","id":"142003"},{"star":6,"name":"ヒガンバナ","id":"142005"},{"star":5,"name":"ネリネ","id":"142007"},{"star":6,"name":"ネリネ","id":"142009"},{"star":5,"name":"コキア","id":"142203"},{"star":6,"name":"ガンライコウ","id":"142205"},{"star":3,"name":"キンモクセイ","id":"142401"},{"star":5,"name":"ストロベリーキャンドル","id":"142403"},{"star":6,"name":"ハギ","id":"142405"},{"star":5,"name":"クローバー","id":"142407"},{"star":5,"name":"アズキ","id":"142409"},{"star":3,"name":"ジャスミン","id":"142501"},{"star":5,"name":"ホトトギス","id":"142503"},{"star":5,"name":"ホトトギス","id":"142505"},{"star":5,"name":"リリオペ","id":"142701"},{"star":5,"name":"オニユリ","id":"142703"},{"star":5,"name":"オニユリ","id":"142705"},{"star":5,"name":"クレマチス","id":"142901"},{"star":6,"name":"シュウメイギク","id":"142903"},{"star":6,"name":"シュウメイギク","id":"142905"},{"star":5,"name":"スキミア","id":"143001"},{"star":5,"name":"カラタチ","id":"143003"},{"star":5,"name":"ススキ","id":"143501"},{"star":6,"name":"ススキ","id":"143503"},{"star":5,"name":"カンナ","id":"143701"},{"star":5,"name":"オトギリソウ","id":"143801"},{"star":5,"name":"オトギリソウ","id":"143803"},{"star":5,"name":"ヒョウタン","id":"144001"},{"star":5,"name":"ヘチマ","id":"144003"},{"star":5,"name":"フクシア","id":"144301"},{"star":5,"name":"ベロニカ","id":"144401"},{"star":5,"name":"ラッセリア","id":"144403"},{"star":6,"name":"ステラ","id":"144405"},{"star":5,"name":"ディアスキア","id":"144407"},{"star":5,"name":"ステラ","id":"144409"},{"star":5,"name":"リンドウ","id":"144501"},{"star":5,"name":"アカネ","id":"144701"},{"star":5,"name":"アイビー","id":"144803"},{"star":6,"name":"アイビー","id":"144805"},{"star":5,"name":"アイビー","id":"144807"},{"star":6,"name":"カヤナ","id":"144901"},{"star":5,"name":"ヘリオトロープ","id":"145101"},{"star":5,"name":"ヘリオトロープ","id":"145103"},{"star":5,"name":"ヒギリ","id":"145501"},{"star":5,"name":"ランギク","id":"145503"},{"star":5,"name":"キンレンカ","id":"145701"},{"star":5,"name":"バルーンバイン","id":"147501"},{"star":5,"name":"バルーンバイン","id":"147503"},{"star":5,"name":"スイギョク","id":"147901"},{"star":5,"name":"ハゼラン","id":"148201"},{"star":6,"name":"レウイシア","id":"148203"},{"star":5,"name":"マツバボタン","id":"148205"},{"star":5,"name":"ハゼラン","id":"148207"},{"star":5,"name":"クフェア","id":"148301"},{"star":6,"name":"オミナエシ","id":"148401"},{"star":5,"name":"エルダーフラワー","id":"148601"},{"star":5,"name":"パイナップル","id":"148901"},{"star":6,"name":"コルチカム","id":"149901"},{"star":6,"name":"クルミ","id":"150001"},{"star":5,"name":"トケイソウ","id":"150003"},{"star":6,"name":"モンヨウショウ","id":"150005"},{"star":5,"name":"エノキ","id":"150007"},{"star":6,"name":"魔想志津香","id":"150009"},{"star":5,"name":"モルチアナ","id":"150101"},{"star":6,"name":"タチアオイ","id":"150103"},{"star":5,"name":"パキラ","id":"150105"},{"star":5,"name":"ルナリア","id":"150201"},{"star":5,"name":"アナベル","id":"150203"},{"star":5,"name":"ルナリア","id":"150205"},{"star":5,"name":"ハボタン","id":"150301"},{"star":5,"name":"スズナ","id":"150305"},{"star":5,"name":"エーデルワイス","id":"150601"},{"star":6,"name":"エーデルワイス","id":"150603"},{"star":5,"name":"オトメギキョウ","id":"150701"},{"star":4,"name":"タンポポ","id":"150801"},{"star":4,"name":"ヤグルマギク","id":"150803"},{"star":5,"name":"アスター","id":"150805"},{"star":5,"name":"アキレア","id":"150807"},{"star":6,"name":"シロタエギク","id":"150809"},{"star":5,"name":"オナモミ","id":"150811"},{"star":6,"name":"タラゴン","id":"150813"},{"star":6,"name":"シロタエギク","id":"150815"},{"star":6,"name":"アキレア","id":"150817"},{"star":5,"name":"ルリタマアザミ","id":"150819"},{"star":6,"name":"オステオスペルマム","id":"150821"},{"star":5,"name":"フィソステギア","id":"151101"},{"star":3,"name":"カーネーション","id":"151801"},{"star":5,"name":"スイートウィリアム","id":"151803"},{"star":6,"name":"アグロステンマ","id":"151805"},{"star":5,"name":"ビスカリア","id":"151809"},{"star":4,"name":"ナナカマド","id":"151901"},{"star":5,"name":"リンゴ","id":"151903"},{"star":5,"name":"ピラカンサ","id":"151905"},{"star":5,"name":"コデマリ","id":"151907"},{"star":6,"name":"リンゴ","id":"151909"},{"star":5,"name":"マルメロ","id":"151911"},{"star":6,"name":"コデマリ","id":"151913"},{"star":5,"name":"ゲウム","id":"151915"},{"star":4,"name":"スノーフレーク","id":"152001"},{"star":5,"name":"ヒメノカリス","id":"152003"},{"star":4,"name":"スイートピー","id":"152401"},{"star":6,"name":"エニシダ","id":"152403"},{"star":4,"name":"ライラック","id":"152501"},{"star":6,"name":"クロユリ","id":"152703"},{"star":5,"name":"レッドチューリップ","id":"152705"},{"star":4,"name":"イエローチューリップ","id":"152707"},{"star":4,"name":"パープルチューリップ","id":"152709"},{"star":4,"name":"ホワイトチューリップ","id":"152711"},{"star":5,"name":"リューココリーネ","id":"152713"},{"star":5,"name":"アリウム","id":"152715"},{"star":5,"name":"クロユリ","id":"152717"},{"star":5,"name":"テッポウユリ","id":"152719"},{"star":6,"name":"フリチラリア","id":"152721"},{"star":4,"name":"ギンラン","id":"152801"},{"star":5,"name":"エピデンドラム","id":"152803"},{"star":6,"name":"エピデンドラム","id":"152805"},{"star":5,"name":"リカステ","id":"152807"},{"star":6,"name":"エピデンドラム","id":"152809"},{"star":5,"name":"デルフィニウム","id":"152901"},{"star":5,"name":"ニゲラ","id":"152903"},{"star":5,"name":"ラークスパー","id":"152905"},{"star":5,"name":"デルフィニウム","id":"152907"},{"star":5,"name":"キンポウゲ","id":"152909"},{"star":5,"name":"ラークスパー","id":"152911"},{"star":5,"name":"ボタンヅル","id":"152913"},{"star":5,"name":"ミカン","id":"153001"},{"star":5,"name":"ブンタン","id":"153003"},{"star":6,"name":"ハナミズキ","id":"153201"},{"star":5,"name":"ハナミズキ","id":"153203"},{"star":5,"name":"カラー","id":"153401"},{"star":5,"name":"テンナンショウ","id":"153403"},{"star":6,"name":"コムギ","id":"153501"},{"star":6,"name":"コムギ","id":"153503"},{"star":5,"name":"ゼラニウム","id":"153601"},{"star":6,"name":"ゼラニウム","id":"153603"},{"star":5,"name":"ギンリョウソウ","id":"154201"},{"star":5,"name":"スズランノキ","id":"154203"},{"star":5,"name":"サツキ","id":"154205"},{"star":5,"name":"カルミア","id":"154207"},{"star":5,"name":"コケモモ","id":"154209"},{"star":6,"name":"エノテラ","id":"154301"},{"star":5,"name":"エノテラ","id":"154303"},{"star":5,"name":"エノテラ","id":"154305"},{"star":5,"name":"ナイトフロックス","id":"154401"},{"star":5,"name":"ペンステモン","id":"154403"},{"star":5,"name":"トレニア","id":"154405"},{"star":5,"name":"ナイトフロックス","id":"154407"},{"star":5,"name":"ペンタス","id":"154701"},{"star":6,"name":"バンテイシ","id":"154703"},{"star":5,"name":"トレイニー(シェフレラ)","id":"154801"},{"star":5,"name":"異世界の精霊使い","id":"154803"},{"star":5,"name":"サンゴバナ","id":"154901"},{"star":5,"name":"サンゴバナ","id":"154903"},{"star":6,"name":"ニシキギ","id":"155201"},{"star":6,"name":"モミジ","id":"155301"},{"star":5,"name":"モミジ","id":"155303"},{"star":6,"name":"モミジ","id":"155305"},{"star":5,"name":"イチョウ","id":"155401"},{"star":6,"name":"デュランタ","id":"155501"},{"star":5,"name":"ホオズキ","id":"155601"},{"star":5,"name":"モミノキ","id":"156301"},{"star":5,"name":"マツ","id":"156303"},{"star":5,"name":"ヒトリシズカ","id":"156501"},{"star":5,"name":"ナンテン","id":"156601"},{"star":5,"name":"ブローディア","id":"156701"},{"star":6,"name":"シャクヤク","id":"156801"},{"star":6,"name":"シャクヤク","id":"156803"},{"star":6,"name":"シャムサクララン","id":"157301"},{"star":5,"name":"シャムサクララン","id":"157303"},{"star":5,"name":"ハートカズラ","id":"157305"},{"star":5,"name":"ユキノシタ","id":"157601"},{"star":5,"name":"クモマグサ","id":"157603"},{"star":5,"name":"ネモフィラ","id":"157701"},{"star":5,"name":"イカリソウ","id":"157801"},{"star":5,"name":"ツユクサ","id":"158001"},{"star":6,"name":"キリンソウ","id":"158101"},{"star":6,"name":"キリンソウ","id":"158103"},{"star":5,"name":"ハゼ","id":"158501"},{"star":5,"name":"アナナス","id":"158901"},{"star":5,"name":"ペペロミア","id":"159301"},{"star":5,"name":"ユズリハ","id":"159401"},{"star":5,"name":"プロテア","id":"159501"},{"star":6,"name":"パクチー","id":"159601"},{"star":5,"name":"コマクサ","id":"159801"},{"star":5,"name":"リムナンテス","id":"160001"},{"star":5,"name":"サンデリアーナ","id":"160003"},{"star":4,"name":"アサザ","id":"160005"},{"star":4,"name":"タイリンオモダカ","id":"160011"},{"star":6,"name":"ウサギゴケ","id":"160013"},{"star":5,"name":"ビバーナム","id":"160015"},{"star":5,"name":"バイカソウ","id":"160017"},{"star":5,"name":"スターチス","id":"160019"},{"star":5,"name":"ニレ","id":"160021"},{"star":5,"name":"エリンギ","id":"160023"},{"star":5,"name":"マイヅルソウ","id":"160025"},{"star":6,"name":"ビバーナム","id":"160027"},{"star":5,"name":"パピルス","id":"160029"},{"star":5,"name":"ヤブデマリ","id":"160031"},{"star":5,"name":"ツリフネソウ","id":"160037"},{"star":6,"name":"ミズヒナゲシ","id":"160039"},{"star":5,"name":"ハナイ","id":"160101"},{"star":5,"name":"クレソン","id":"160301"},{"star":6,"name":"ストック","id":"160303"},{"star":6,"name":"カルダミネ・リラタ","id":"160305"},{"star":5,"name":"アイリス","id":"160401"},{"star":5,"name":"カキツバタ","id":"160403"},{"star":3,"name":"ニワゼキショウ","id":"160405"},{"star":6,"name":"スパラキシス","id":"160407"},{"star":5,"name":"アヤメ","id":"160409"},{"star":6,"name":"トリトニア","id":"160411"},{"star":5,"name":"スミシアンサ","id":"160501"},{"star":5,"name":"アキメネス","id":"160503"},{"star":5,"name":"ロベリア","id":"160701"},{"star":5,"name":"サワギキョウ","id":"160703"},{"star":5,"name":"ヨメナ","id":"160801"},{"star":6,"name":"コオニタビラコ","id":"160803"},{"star":5,"name":"イソギク","id":"160805"},{"star":5,"name":"アステリカリス","id":"160807"},{"star":5,"name":"ハマシオン","id":"160811"},{"star":5,"name":"ハマギク","id":"160815"},{"star":5,"name":"リシマキア","id":"160901"},{"star":5,"name":"クリンソウ","id":"160903"},{"star":5,"name":"ラミウム","id":"161101"},{"star":5,"name":"タツナミソウ","id":"161105"},{"star":5,"name":"オレガノ","id":"161107"},{"star":5,"name":"ヒメオドリコソウ","id":"161109"},{"star":6,"name":"ヒツジグサ","id":"161301"},{"star":5,"name":"ミズヒキ","id":"161601"},{"star":5,"name":"ハマナデシコ","id":"161801"},{"star":6,"name":"ヤマブキ","id":"161901"},{"star":5,"name":"ハマナス","id":"161903"},{"star":6,"name":"コンボルブルス","id":"162301"},{"star":6,"name":"ネムノキ","id":"162401"},{"star":5,"name":"バイケイソウ","id":"162701"},{"star":5,"name":"トキソウ","id":"162801"},{"star":5,"name":"バイカモ","id":"162901"},{"star":5,"name":"キツネノボタン","id":"162903"},{"star":5,"name":"バイカモ","id":"162907"},{"star":6,"name":"キツネノボタン","id":"162909"},{"star":5,"name":"トウカ","id":"163501"},{"star":5,"name":"ホルデュウム","id":"163503"},{"star":5,"name":"ムギ","id":"163505"},{"star":6,"name":"フウロソウ","id":"163601"},{"star":5,"name":"ヤマゴーヤ","id":"164001"},{"star":5,"name":"ガウラ","id":"164301"},{"star":5,"name":"ミズバコパ","id":"164401"},{"star":5,"name":"リンデルニア","id":"164403"},{"star":6,"name":"クガイソウ","id":"164405"},{"star":5,"name":"リナリア","id":"164407"},{"star":5,"name":"パキスタキス","id":"164901"},{"star":5,"name":"アデニウム","id":"165001"},{"star":5,"name":"メルテンシア","id":"165101"},{"star":5,"name":"リッピア","id":"165501"},{"star":6,"name":"クコ","id":"165601"},{"star":5,"name":"フユサンゴ","id":"165603"},{"star":5,"name":"シザンサス","id":"165607"},{"star":5,"name":"クローブ","id":"165801"},{"star":6,"name":"ヒヤシンス","id":"166701"},{"star":5,"name":"ホスタ","id":"166703"},{"star":5,"name":"チオノドクサ","id":"166705"},{"star":5,"name":"カガミ","id":"167301"},{"star":5,"name":"ミズアオイ","id":"167901"},{"star":5,"name":"ポンテデリア","id":"167903"},{"star":6,"name":"ミズアオイ","id":"167905"},{"star":6,"name":"コナギ","id":"167907"},{"star":5,"name":"インクバナ","id":"168001"},{"star":5,"name":"セダム","id":"168101"},{"star":6,"name":"イワレンゲ","id":"168103"},{"star":5,"name":"ヘナ","id":"168301"},{"star":5,"name":"ウルシ","id":"168501"},{"star":5,"name":"フェンネル","id":"169601"},{"star":5,"name":"アンゼリカ","id":"169603"},{"star":5,"name":"エリンジウム","id":"169605"},{"star":5,"name":"ブプレウルム","id":"169607"},{"star":6,"name":"フェンネル","id":"169609"},{"star":6,"name":"ハス","id":"169701"},{"star":6,"name":"ハス","id":"169703"},{"star":5,"name":"ヤクノヒナホシ","id":"410001"},{"star":5,"name":"スノーベリー","id":"410003"},{"star":5,"name":"カゲツ","id":"410005"},{"star":5,"name":"アリッサム","id":"410301"},{"star":5,"name":"スズシロ","id":"410303"},{"star":5,"name":"ジャーマンアイリス","id":"410401"},{"star":6,"name":"サフラン","id":"410403"},{"star":5,"name":"ジャーマンアイリス","id":"410405"},{"star":6,"name":"オジギソウ","id":"410407"},{"star":5,"name":"サフラン","id":"410409"},{"star":5,"name":"オジギソウ","id":"410411"},{"star":5,"name":"サフラン","id":"410413"},{"star":5,"name":"シーマニア","id":"410501"},{"star":6,"name":"デージー","id":"410801"},{"star":5,"name":"サイネリア","id":"410803"},{"star":5,"name":"カレンデュラ","id":"410805"},{"star":6,"name":"サンビタリア","id":"410807"},{"star":5,"name":"ピンポンマム","id":"410809"},{"star":5,"name":"カカリア","id":"410811"},{"star":5,"name":"ウィンターコスモス","id":"410813"},{"star":6,"name":"デージー","id":"410815"},{"star":5,"name":"ノースポール","id":"410817"},{"star":5,"name":"ブラキカム","id":"410819"},{"star":5,"name":"ディモルフォセカ","id":"410821"},{"star":5,"name":"フキ","id":"410823"},{"star":5,"name":"プリムラ","id":"410901"},{"star":5,"name":"シャコバサボテン","id":"411001"},{"star":6,"name":"サルビア","id":"411101"},{"star":5,"name":"チェリーセージ","id":"411103"},{"star":5,"name":"ローズマリー","id":"411105"},{"star":5,"name":"レオノチス","id":"411107"},{"star":5,"name":"チェリーセージ","id":"411109"},{"star":6,"name":"ホワイトパンジー","id":"411501"},{"star":6,"name":"イエローパンジー","id":"411503"},{"star":6,"name":"パープルパンジー","id":"411505"},{"star":5,"name":"イヌタデ","id":"411601"},{"star":5,"name":"ツバキ","id":"411701"},{"star":5,"name":"ツバキ","id":"411703"},{"star":6,"name":"ブラックバッカラ","id":"411901"},{"star":6,"name":"ロイヤルプリンセス","id":"411903"},{"star":6,"name":"ノヴァーリス","id":"411905"},{"star":5,"name":"モケ","id":"411907"},{"star":6,"name":"ビワ","id":"411909"},{"star":6,"name":"ノヴァーリス","id":"411911"},{"star":5,"name":"ノイバラ","id":"411913"},{"star":5,"name":"ミニバラ","id":"411915"},{"star":5,"name":"ブラックバッカラ","id":"411917"},{"star":6,"name":"スノードロップ","id":"412001"},{"star":5,"name":"エウカリス","id":"412003"},{"star":6,"name":"スノードロップ","id":"412005"},{"star":5,"name":"ケイトウ","id":"412201"},{"star":6,"name":"ミモザ","id":"412401"},{"star":6,"name":"アルストロメリア","id":"412601"},{"star":6,"name":"アルストロメリア","id":"412603"},{"star":5,"name":"プルモナリア","id":"412701"},{"star":5,"name":"オンシジューム","id":"412801"},{"star":5,"name":"シンビジューム","id":"412803"},{"star":6,"name":"デンドロビウム","id":"412805"},{"star":6,"name":"カトレア","id":"412807"},{"star":6,"name":"イオノシジウム","id":"412809"},{"star":6,"name":"オンシジューム","id":"412811"},{"star":5,"name":"カトレア","id":"412813"},{"star":5,"name":"イオノシジウム","id":"412815"},{"star":6,"name":"カトレア","id":"412817"},{"star":6,"name":"パフィオペディルム","id":"412819"},{"star":5,"name":"スイセイラン","id":"412821"},{"star":6,"name":"オンシジューム","id":"412823"},{"star":5,"name":"シンビジューム","id":"412825"},{"star":5,"name":"デンドロビウム","id":"412827"},{"star":5,"name":"デンドロビウム","id":"412829"},{"star":5,"name":"トリカブト","id":"412901"},{"star":6,"name":"ミスミソウ","id":"412903"},{"star":5,"name":"ニリンソウ","id":"412905"},{"star":6,"name":"トリカブト","id":"412907"},{"star":5,"name":"ニリンソウ","id":"412909"},{"star":5,"name":"レシュノルティア","id":"413001"},{"star":5,"name":"コーレア","id":"413003"},{"star":5,"name":"ユズ","id":"413005"},{"star":5,"name":"コーレア","id":"413007"},{"star":5,"name":"オリーブ","id":"413301"},{"star":5,"name":"エノコログサ","id":"413501"},{"star":5,"name":"エノコログサ","id":"413503"},{"star":5,"name":"ジャノメエリカ","id":"414203"},{"star":5,"name":"オキザリス","id":"414601"},{"star":5,"name":"オキザリス","id":"414603"},{"star":5,"name":"マネッチア","id":"414701"},{"star":5,"name":"ブバルディア","id":"414703"},{"star":6,"name":"ヒナソウ","id":"414705"},{"star":5,"name":"ヤツデ","id":"414801"},{"star":5,"name":"シンクライリアナ","id":"414901"},{"star":6,"name":"ハートツリー","id":"415201"},{"star":5,"name":"ブルーエルフィン","id":"415501"},{"star":5,"name":"クラリンドウ","id":"415503"},{"star":5,"name":"ポインセチア","id":"416001"},{"star":6,"name":"ハツユキソウ","id":"416003"},{"star":5,"name":"ハツユキソウ","id":"416005"},{"star":5,"name":"ポインセチア","id":"416007"},{"star":5,"name":"ハツユキソウ","id":"416009"},{"star":6,"name":"ユキハナソウ","id":"416011"},{"star":5,"name":"ホーリー","id":"416201"},{"star":5,"name":"ホーリー","id":"416203"},{"star":5,"name":"アロエ","id":"417001"},{"star":5,"name":"アロエ","id":"417005"},{"star":5,"name":"ロウバイ","id":"417101"},{"star":5,"name":"ストレリチア","id":"417401"},{"star":5,"name":"ベルゲニア","id":"417601"},{"star":5,"name":"ベルゲニア","id":"417603"},{"star":5,"name":"ツキトジ","id":"418101"},{"star":5,"name":"カランコエ","id":"418103"},{"star":5,"name":"クリスマスベゴニア","id":"419101"},{"star":5,"name":"リトープス","id":"419201"},{"star":6,"name":"セルリア","id":"419501"},{"star":5,"name":"セルリア","id":"419503"},{"star":5,"name":"チューベローズ","id":"420001"},{"star":5,"name":"ウェルウィッチア","id":"420003"},{"star":5,"name":"ノラナ","id":"420005"},{"star":6,"name":"ホウセンカ","id":"420007"},{"star":5,"name":"ナツメ","id":"420009"},{"star":5,"name":"インパチェンス","id":"420011"},{"star":6,"name":"サテラ","id":"420013"},{"star":6,"name":"ハイビスカス","id":"420101"},{"star":6,"name":"クレナイ","id":"420201"},{"star":6,"name":"アジサイ","id":"420203"},{"star":6,"name":"グラジオラス","id":"420401"},{"star":5,"name":"モントブレチア","id":"420403"},{"star":6,"name":"キキョウ","id":"420701"},{"star":6,"name":"ヒマワリ","id":"420801"},{"star":5,"name":"ガイラルディア","id":"420803"},{"star":6,"name":"ヘレニウム","id":"420805"},{"star":5,"name":"ガザニア","id":"420807"},{"star":5,"name":"フジバカマ","id":"420809"},{"star":5,"name":"ルドベキア","id":"420811"},{"star":6,"name":"ヘレニウム","id":"420813"},{"star":5,"name":"ルドベキア","id":"420815"},{"star":5,"name":"ヘリクリサム","id":"420817"},{"star":5,"name":"チトニア","id":"420819"},{"star":6,"name":"ウサギギク","id":"420821"},{"star":5,"name":"ソリダスター","id":"420823"},{"star":5,"name":"ヘレニウム","id":"420825"},{"star":5,"name":"シルフィウム","id":"420827"},{"star":5,"name":"チコリー","id":"420829"},{"star":6,"name":"ヘリアンサス","id":"420831"},{"star":5,"name":"ヘリオプシス","id":"420835"},{"star":6,"name":"レッドジンジャー","id":"421201"},{"star":6,"name":"クルクマ","id":"421203"},{"star":5,"name":"スイレン","id":"421301"},{"star":6,"name":"アカバナスイレン","id":"421303"},{"star":6,"name":"オオオニバス","id":"421305"},{"star":6,"name":"オオオニバス","id":"421307"},{"star":6,"name":"スイレン","id":"421309"},{"star":5,"name":"アカバナスイレン","id":"421311"},{"star":6,"name":"イブキトラノオ","id":"421601"},{"star":6,"name":"イタドリ","id":"421603"},{"star":5,"name":"ヒメシャラ","id":"421701"},{"star":6,"name":"ヒメシャラ","id":"421703"},{"star":5,"name":"サカキ","id":"421705"},{"star":5,"name":"グリーンベル","id":"421801"},{"star":5,"name":"レインボーローズ","id":"421901"},{"star":6,"name":"ブラックベリー","id":"421903"},{"star":6,"name":"ゼフィランサス","id":"422001"},{"star":5,"name":"レインリリー","id":"422003"},{"star":6,"name":"ハブランサス","id":"422005"},{"star":5,"name":"アガパンサス","id":"422007"},{"star":6,"name":"ヒルガオ","id":"422301"},{"star":5,"name":"ヨルガオ","id":"422303"},{"star":6,"name":"アサガオ","id":"422305"},{"star":5,"name":"ルコウソウ","id":"422307"},{"star":6,"name":"カイコウズ","id":"422401"},{"star":5,"name":"カズラ","id":"422403"},{"star":6,"name":"カサブランカ","id":"422701"},{"star":5,"name":"ヤマユリ","id":"422703"},{"star":5,"name":"オトメユリ","id":"422705"},{"star":5,"name":"ヒメユリ","id":"422707"},{"star":5,"name":"サンダーソニア","id":"422709"},{"star":5,"name":"ユリ","id":"422711"},{"star":5,"name":"カノコユリ","id":"422713"},{"star":5,"name":"クルマユリ","id":"422715"},{"star":6,"name":"グロリオサ","id":"422717"},{"star":6,"name":"ベッセラ","id":"422719"},{"star":6,"name":"サンダーソニア","id":"422723"},{"star":5,"name":"ミルトニア","id":"422801"},{"star":6,"name":"コランバイン","id":"422901"},{"star":5,"name":"レモン","id":"423001"},{"star":5,"name":"タチバナ","id":"423101"},{"star":5,"name":"アンスリウム","id":"423401"},{"star":5,"name":"ヒペリカム","id":"423801"},{"star":5,"name":"オシロイバナ","id":"423901"},{"star":6,"name":"オシロイバナ","id":"423903"},{"star":5,"name":"カラスウリ","id":"424001"},{"star":6,"name":"ペポ","id":"424003"},{"star":6,"name":"ペポ","id":"424005"},{"star":5,"name":"ヘザー","id":"424201"},{"star":5,"name":"ツキミソウ","id":"424301"},{"star":5,"name":"ツキミソウ","id":"424305"},{"star":6,"name":"ゴデチア","id":"424307"},{"star":5,"name":"アンゲロニア","id":"424401"},{"star":5,"name":"リシアンサス","id":"424501"},{"star":5,"name":"エキザカム","id":"424503"},{"star":5,"name":"カタバミ","id":"424601"},{"star":5,"name":"カタバミ","id":"424603"},{"star":5,"name":"サオトメバナ","id":"424701"},{"star":5,"name":"クチナシ","id":"424703"},{"star":5,"name":"キヌタソウ","id":"424705"},{"star":5,"name":"サンタンカ","id":"424707"},{"star":5,"name":"アカンサス","id":"424901"},{"star":5,"name":"ベロペロネ","id":"424903"},{"star":5,"name":"ディプラデニア","id":"425001"},{"star":5,"name":"プルメリア","id":"425003"},{"star":5,"name":"ニチニチソウ","id":"425005"},{"star":5,"name":"プルメリア","id":"425007"},{"star":5,"name":"ディプラデニア","id":"425009"},{"star":5,"name":"ランタナ","id":"425501"},{"star":6,"name":"ランタナ","id":"425503"},{"star":5,"name":"フォックスフェイス","id":"425601"},{"star":5,"name":"ベラドンナ","id":"425603"},{"star":5,"name":"ワルナスビ","id":"425605"},{"star":5,"name":"ハバネロ","id":"425607"},{"star":6,"name":"ワルナスビ","id":"425609"},{"star":5,"name":"ホップ","id":"425901"},{"star":5,"name":"ホップ","id":"425903"},{"star":5,"name":"キャッツテール","id":"426001"},{"star":6,"name":"マンリョウ","id":"426401"},{"star":5,"name":"マンリョウ","id":"426403"},{"star":5,"name":"センリョウ","id":"426501"},{"star":6,"name":"センリョウ","id":"426503"},{"star":6,"name":"カカオ","id":"427201"},{"star":5,"name":"カカオ","id":"427203"},{"star":5,"name":"ギンバイソウ","id":"427601"},{"star":5,"name":"ロエオ","id":"428001"},{"star":5,"name":"エケベリア","id":"428101"},{"star":5,"name":"ロケア","id":"428103"},{"star":6,"name":"ポーチュラカ","id":"428201"},{"star":5,"name":"ザクロ","id":"428301"},{"star":5,"name":"キウイ","id":"428701"},{"star":5,"name":"ライオンゴロシ","id":"428801"},{"star":5,"name":"セリ","id":"429601"},{"star":5,"name":"サラセニア","id":"430001"},{"star":5,"name":"シバザクラ","id":"430005"},{"star":5,"name":"セアノサス","id":"430007"},{"star":5,"name":"グーズベリー","id":"430009"},{"star":5,"name":"ギリア","id":"430011"},{"star":5,"name":"スキラ","id":"430013"},{"star":5,"name":"スグリ","id":"430017"},{"star":5,"name":"バーゼリア","id":"430019"},{"star":5,"name":"シィル・プライン","id":"430027"},{"star":5,"name":"アニソドンテア","id":"430101"},{"star":6,"name":"アブラナ","id":"430301"},{"star":6,"name":"イベリス","id":"430303"},{"star":5,"name":"イベリス","id":"430305"},{"star":6,"name":"ムラサキハナナ","id":"430307"},{"star":6,"name":"フリージア","id":"430401"},{"star":6,"name":"イキシア","id":"430403"},{"star":6,"name":"セントポーリア","id":"430501"},{"star":5,"name":"セントポーリア","id":"430503"},{"star":6,"name":"マーガレット","id":"430801"},{"star":5,"name":"ダリア","id":"430803"},{"star":5,"name":"ローダンセ","id":"430805"},{"star":5,"name":"キンセンカ","id":"430807"},{"star":5,"name":"ハルジオン","id":"430809"},{"star":6,"name":"アザミ","id":"430811"},{"star":5,"name":"カウスリップ","id":"430901"},{"star":6,"name":"カウスリップ","id":"430903"},{"star":5,"name":"アナガリス","id":"430905"},{"star":6,"name":"サボテン","id":"431001"},{"star":5,"name":"サボテン","id":"431003"},{"star":6,"name":"ホシクジャク","id":"431007"},{"star":5,"name":"ホシクジャク","id":"431009"},{"star":6,"name":"サボテン","id":"431011"},{"star":5,"name":"スズラン","id":"431401"},{"star":5,"name":"スミレ","id":"431501"},{"star":6,"name":"ビオラ","id":"431503"},{"star":6,"name":"ビオラ","id":"431505"},{"star":5,"name":"キランソウ","id":"431601"},{"star":5,"name":"コマチソウ","id":"431801"},{"star":6,"name":"シャボンソウ","id":"431803"},{"star":5,"name":"ハコベラ","id":"431805"},{"star":6,"name":"ミリム(セキチク)","id":"431807"},{"star":6,"name":"異世界の暴君","id":"431809"},{"star":5,"name":"シャボンソウ","id":"431811"},{"star":6,"name":"イチゴ","id":"431901"},{"star":6,"name":"ウメ","id":"431903"},{"star":5,"name":"バラ","id":"431905"},{"star":6,"name":"サクラ","id":"431907"},{"star":6,"name":"ユキヤナギ","id":"431909"},{"star":5,"name":"モモ","id":"431911"},{"star":6,"name":"ハナモモ","id":"431913"},{"star":6,"name":"サクランボ","id":"431915"},{"star":6,"name":"アプリコット","id":"431917"},{"star":5,"name":"ハナモモ","id":"431919"},{"star":5,"name":"ウメ","id":"431921"},{"star":5,"name":"サクラ","id":"431923"},{"star":5,"name":"アプリコット","id":"431925"},{"star":5,"name":"カンヒザクラ","id":"431927"},{"star":6,"name":"プラム","id":"431929"},{"star":5,"name":"サクランボ","id":"431931"},{"star":6,"name":"サクラ","id":"431933"},{"star":5,"name":"キジムシロ","id":"431935"},{"star":5,"name":"プルーン","id":"431937"},{"star":6,"name":"アマリリス","id":"432001"},{"star":5,"name":"キルタンサス","id":"432003"},{"star":5,"name":"イフェイオン","id":"432005"},{"star":5,"name":"イフェイオン","id":"432007"},{"star":6,"name":"ヒノキ","id":"432101"},{"star":6,"name":"レンゲソウ","id":"432401"},{"star":6,"name":"アカシア","id":"432403"},{"star":5,"name":"ハリエンジュ","id":"432405"},{"star":5,"name":"ルピナス","id":"432407"},{"star":5,"name":"キヌサヤ","id":"432409"},{"star":6,"name":"エニシダ","id":"432413"},{"star":6,"name":"アカシア","id":"432415"},{"star":6,"name":"ハリエンジュ","id":"432417"},{"star":6,"name":"ハクモクレン","id":"432501"},{"star":6,"name":"ナイトメア(カタクリ)","id":"432701"},{"star":6,"name":"コチョウラン","id":"432801"},{"star":5,"name":"マスデバリア","id":"432803"},{"star":5,"name":"エビネ","id":"432805"},{"star":6,"name":"アネモネ","id":"432901"},{"star":6,"name":"クリスマスローズ","id":"432903"},{"star":5,"name":"フクジュソウ","id":"432905"},{"star":5,"name":"ラナンキュラス","id":"432907"},{"star":5,"name":"ヒメリュウキンカ","id":"432909"},{"star":5,"name":"アネモネ","id":"432911"},{"star":5,"name":"アンリ(バイカカラマツ)","id":"432913"},{"star":5,"name":"アネモネ","id":"432915"},{"star":5,"name":"アネモネ","id":"432917"},{"star":6,"name":"アネモネ","id":"432921"},{"star":5,"name":"サザンクロス","id":"433001"},{"star":5,"name":"サザンクロス","id":"433003"},{"star":6,"name":"オレンジ","id":"433005"},{"star":6,"name":"ウサギノオ","id":"433501"},{"star":5,"name":"ウサギノオ","id":"433503"},{"star":5,"name":"キンギョソウ","id":"434101"},{"star":5,"name":"キンギョソウ","id":"434103"},{"star":5,"name":"ツツジ","id":"434201"},{"star":6,"name":"ツツジ","id":"434203"},{"star":5,"name":"シズ(ドウダンツツジ)","id":"434207"},{"star":5,"name":"異世界の炎使い","id":"434209"},{"star":5,"name":"カルセオラリア","id":"434401"},{"star":5,"name":"ビンカ","id":"435001"},{"star":6,"name":"ワスレナグサ","id":"435101"},{"star":5,"name":"ボリジ","id":"435103"},{"star":5,"name":"アンチューサ","id":"435105"},{"star":5,"name":"メイゲツカエデ","id":"435301"},{"star":5,"name":"バーベナ","id":"435501"},{"star":5,"name":"ユーカリ","id":"435801"},{"star":6,"name":"ヤドリギ","id":"436101"},{"star":5,"name":"リュウゼツラン","id":"436701"},{"star":5,"name":"ボタン","id":"436801"},{"star":5,"name":"ポピー","id":"436901"},{"star":5,"name":"メコノプシス","id":"436903"},{"star":6,"name":"メコノプシス","id":"436905"},{"star":5,"name":"メギ","id":"437801"},{"star":5,"name":"ゼブリナ","id":"438001"},{"star":6,"name":"マロニエ","id":"439001"},{"star":5,"name":"ランプランサス","id":"439201"},{"star":5,"name":"ヨウラクボタン","id":"439801"},{"star":5,"name":"ガジュマル","id":"440001"},{"star":5,"name":"カカラ","id":"440003"},{"star":5,"name":"アベリア","id":"440005"},{"star":5,"name":"ツルバキア","id":"440007"},{"star":5,"name":"ゼンマイ","id":"440009"},{"star":5,"name":"ガーリックバイン","id":"440011"},{"star":6,"name":"ミムルス","id":"440013"},{"star":5,"name":"コナラ","id":"440015"},{"star":5,"name":"シイタケ","id":"440017"},{"star":5,"name":"見当かなみ","id":"440019"},{"star":5,"name":"ウキツリボク","id":"440101"},{"star":6,"name":"ウキツリボク","id":"440103"},{"star":5,"name":"ハナオクラ","id":"440105"},{"star":5,"name":"ハナショウブ","id":"440401"},{"star":5,"name":"ハナショウブ","id":"440403"},{"star":6,"name":"ストレプトカーパス","id":"440501"},{"star":6,"name":"ストレプトカーパス","id":"440503"},{"star":5,"name":"ローレンティア","id":"440701"},{"star":5,"name":"ローレンティア","id":"440703"},{"star":5,"name":"コスモス","id":"440801"},{"star":6,"name":"マリーゴールド","id":"440803"},{"star":5,"name":"ガーベラ","id":"440805"},{"star":5,"name":"チョコレートコスモス","id":"440807"},{"star":5,"name":"エキナセア","id":"440809"},{"star":5,"name":"ヨモギ","id":"440811"},{"star":5,"name":"シオン","id":"440813"},{"star":5,"name":"チョコレートコスモス","id":"440815"},{"star":5,"name":"イモーテル","id":"440817"},{"star":5,"name":"アルテミシア","id":"440819"},{"star":5,"name":"クラスペディア","id":"440821"},{"star":6,"name":"ゴギョウ","id":"440823"},{"star":5,"name":"エキナセア","id":"440825"},{"star":5,"name":"アルテミシア","id":"440827"},{"star":5,"name":"シオン(ノコンギク)","id":"440829"},{"star":5,"name":"異世界の武士","id":"440831"},{"star":5,"name":"ピレスラム","id":"440833"},{"star":6,"name":"チョコレートコスモス","id":"440835"},{"star":6,"name":"シクラメン","id":"440901"},{"star":5,"name":"シクラメン","id":"440903"},{"star":5,"name":"ゲッカビジン","id":"441001"},{"star":5,"name":"サンカクサボテン","id":"441003"},{"star":5,"name":"サンカクサボテン","id":"441005"},{"star":6,"name":"ゲッカビジン","id":"441007"},{"star":6,"name":"サンカクサボテン","id":"441009"},{"star":6,"name":"ミント","id":"441101"},{"star":5,"name":"ラベンダー","id":"441103"},{"star":5,"name":"ワタチョロギ","id":"441105"},{"star":5,"name":"ミント","id":"441107"},{"star":5,"name":"コリウス","id":"441109"},{"star":6,"name":"ラベンダー","id":"441111"},{"star":5,"name":"ワタチョロギ","id":"441113"},{"star":6,"name":"ネペタ","id":"441115"},{"star":6,"name":"ブルーロータス","id":"441301"},{"star":6,"name":"サザンカ","id":"441303"},{"star":6,"name":"ワレモコウ","id":"441701"},{"star":5,"name":"ワレモコウ","id":"441703"},{"star":6,"name":"ワビスケ","id":"441707"},{"star":6,"name":"ナデシコ","id":"441801"},{"star":5,"name":"ナデシコ","id":"441803"},{"star":5,"name":"リクニス","id":"441805"},{"star":6,"name":"センニチコウ","id":"441901"},{"star":5,"name":"カリン","id":"441903"},{"star":6,"name":"ネリネ","id":"442001"},{"star":6,"name":"ヒガンバナ","id":"442003"},{"star":6,"name":"ヒガンバナ","id":"442005"},{"star":5,"name":"ネリネ","id":"442007"},{"star":6,"name":"ネリネ","id":"442009"},{"star":6,"name":"シロツメクサ","id":"442201"},{"star":5,"name":"コキア","id":"442203"},{"star":6,"name":"ガンライコウ","id":"442205"},{"star":6,"name":"キンモクセイ","id":"442401"},{"star":5,"name":"ストロベリーキャンドル","id":"442403"},{"star":6,"name":"ハギ","id":"442405"},{"star":5,"name":"クローバー","id":"442407"},{"star":5,"name":"アズキ","id":"442409"},{"star":6,"name":"ジャスミン","id":"442501"},{"star":5,"name":"ホトトギス","id":"442503"},{"star":5,"name":"ホトトギス","id":"442505"},{"star":5,"name":"リリオペ","id":"442701"},{"star":5,"name":"オニユリ","id":"442703"},{"star":5,"name":"オニユリ","id":"442705"},{"star":5,"name":"クレマチス","id":"442901"},{"star":6,"name":"シュウメイギク","id":"442903"},{"star":6,"name":"シュウメイギク","id":"442905"},{"star":5,"name":"スキミア","id":"443001"},{"star":5,"name":"カラタチ","id":"443003"},{"star":5,"name":"ススキ","id":"443501"},{"star":6,"name":"ススキ","id":"443503"},{"star":5,"name":"カンナ","id":"443701"},{"star":5,"name":"オトギリソウ","id":"443801"},{"star":5,"name":"オトギリソウ","id":"443803"},{"star":5,"name":"ヒョウタン","id":"444001"},{"star":5,"name":"ヘチマ","id":"444003"},{"star":5,"name":"フクシア","id":"444301"},{"star":5,"name":"ベロニカ","id":"444401"},{"star":5,"name":"ラッセリア","id":"444403"},{"star":6,"name":"ステラ","id":"444405"},{"star":5,"name":"ディアスキア","id":"444407"},{"star":5,"name":"ステラ","id":"444409"},{"star":5,"name":"リンドウ","id":"444501"},{"star":5,"name":"アカネ","id":"444701"},{"star":5,"name":"アイビー","id":"444803"},{"star":6,"name":"アイビー","id":"444805"},{"star":5,"name":"アイビー","id":"444807"},{"star":6,"name":"カヤナ","id":"444901"},{"star":5,"name":"ヘリオトロープ","id":"445101"},{"star":5,"name":"ヘリオトロープ","id":"445103"},{"star":5,"name":"ヒギリ","id":"445501"},{"star":5,"name":"ランギク","id":"445503"},{"star":5,"name":"キンレンカ","id":"445701"},{"star":5,"name":"バルーンバイン","id":"447501"},{"star":5,"name":"バルーンバイン","id":"447503"},{"star":5,"name":"スイギョク","id":"447901"},{"star":5,"name":"ハゼラン","id":"448201"},{"star":6,"name":"レウイシア","id":"448203"},{"star":5,"name":"マツバボタン","id":"448205"},{"star":5,"name":"ハゼラン","id":"448207"},{"star":5,"name":"クフェア","id":"448301"},{"star":6,"name":"オミナエシ","id":"448401"},{"star":5,"name":"エルダーフラワー","id":"448601"},{"star":5,"name":"パイナップル","id":"448901"},{"star":6,"name":"コルチカム","id":"449901"},{"star":6,"name":"クルミ","id":"450001"},{"star":5,"name":"トケイソウ","id":"450003"},{"star":6,"name":"モンヨウショウ","id":"450005"},{"star":5,"name":"エノキ","id":"450007"},{"star":6,"name":"魔想志津香","id":"450009"},{"star":5,"name":"モルチアナ","id":"450101"},{"star":6,"name":"タチアオイ","id":"450103"},{"star":5,"name":"パキラ","id":"450105"},{"star":5,"name":"ルナリア","id":"450201"},{"star":5,"name":"アナベル","id":"450203"},{"star":5,"name":"ルナリア","id":"450205"},{"star":5,"name":"ハボタン","id":"450301"},{"star":5,"name":"スズナ","id":"450305"},{"star":5,"name":"エーデルワイス","id":"450601"},{"star":6,"name":"エーデルワイス","id":"450603"},{"star":5,"name":"オトメギキョウ","id":"450701"},{"star":6,"name":"タンポポ","id":"450801"},{"star":6,"name":"ヤグルマギク","id":"450803"},{"star":5,"name":"アスター","id":"450805"},{"star":5,"name":"アキレア","id":"450807"},{"star":6,"name":"シロタエギク","id":"450809"},{"star":5,"name":"オナモミ","id":"450811"},{"star":6,"name":"タラゴン","id":"450813"},{"star":6,"name":"シロタエギク","id":"450815"},{"star":6,"name":"アキレア","id":"450817"},{"star":5,"name":"ルリタマアザミ","id":"450819"},{"star":6,"name":"オステオスペルマム","id":"450821"},{"star":5,"name":"フィソステギア","id":"451101"},{"star":6,"name":"カーネーション","id":"451801"},{"star":5,"name":"スイートウィリアム","id":"451803"},{"star":6,"name":"アグロステンマ","id":"451805"},{"star":5,"name":"ビスカリア","id":"451809"},{"star":6,"name":"ナナカマド","id":"451901"},{"star":5,"name":"リンゴ","id":"451903"},{"star":5,"name":"ピラカンサ","id":"451905"},{"star":5,"name":"コデマリ","id":"451907"},{"star":6,"name":"リンゴ","id":"451909"},{"star":5,"name":"マルメロ","id":"451911"},{"star":6,"name":"コデマリ","id":"451913"},{"star":5,"name":"ゲウム","id":"451915"},{"star":6,"name":"スノーフレーク","id":"452001"},{"star":5,"name":"ヒメノカリス","id":"452003"},{"star":6,"name":"スイートピー","id":"452401"},{"star":6,"name":"エニシダ","id":"452403"},{"star":6,"name":"ライラック","id":"452501"},{"star":6,"name":"ヘリコニア","id":"452701"},{"star":6,"name":"クロユリ","id":"452703"},{"star":5,"name":"レッドチューリップ","id":"452705"},{"star":6,"name":"イエローチューリップ","id":"452707"},{"star":6,"name":"パープルチューリップ","id":"452709"},{"star":6,"name":"ホワイトチューリップ","id":"452711"},{"star":5,"name":"リューココリーネ","id":"452713"},{"star":5,"name":"アリウム","id":"452715"},{"star":5,"name":"クロユリ","id":"452717"},{"star":5,"name":"テッポウユリ","id":"452719"},{"star":6,"name":"フリチラリア","id":"452721"},{"star":6,"name":"ギンラン","id":"452801"},{"star":5,"name":"エピデンドラム","id":"452803"},{"star":6,"name":"エピデンドラム","id":"452805"},{"star":5,"name":"リカステ","id":"452807"},{"star":6,"name":"エピデンドラム","id":"452809"},{"star":5,"name":"デルフィニウム","id":"452901"},{"star":5,"name":"ニゲラ","id":"452903"},{"star":5,"name":"ラークスパー","id":"452905"},{"star":5,"name":"デルフィニウム","id":"452907"},{"star":5,"name":"キンポウゲ","id":"452909"},{"star":5,"name":"ラークスパー","id":"452911"},{"star":5,"name":"ボタンヅル","id":"452913"},{"star":5,"name":"ミカン","id":"453001"},{"star":5,"name":"ブンタン","id":"453003"},{"star":6,"name":"ハナミズキ","id":"453201"},{"star":5,"name":"ハナミズキ","id":"453203"},{"star":5,"name":"カラー","id":"453401"},{"star":5,"name":"テンナンショウ","id":"453403"},{"star":6,"name":"コムギ","id":"453501"},{"star":6,"name":"コムギ","id":"453503"},{"star":5,"name":"ゼラニウム","id":"453601"},{"star":6,"name":"ゼラニウム","id":"453603"},{"star":5,"name":"ギンリョウソウ","id":"454201"},{"star":5,"name":"スズランノキ","id":"454203"},{"star":5,"name":"サツキ","id":"454205"},{"star":5,"name":"カルミア","id":"454207"},{"star":5,"name":"コケモモ","id":"454209"},{"star":6,"name":"エノテラ","id":"454301"},{"star":5,"name":"エノテラ","id":"454303"},{"star":5,"name":"エノテラ","id":"454305"},{"star":5,"name":"ナイトフロックス","id":"454401"},{"star":5,"name":"ペンステモン","id":"454403"},{"star":5,"name":"トレニア","id":"454405"},{"star":5,"name":"ナイトフロックス","id":"454407"},{"star":5,"name":"ペンタス","id":"454701"},{"star":6,"name":"バンテイシ","id":"454703"},{"star":5,"name":"トレイニー(シェフレラ)","id":"454801"},{"star":5,"name":"異世界の精霊使い","id":"454803"},{"star":5,"name":"サンゴバナ","id":"454901"},{"star":5,"name":"サンゴバナ","id":"454903"},{"star":6,"name":"ニシキギ","id":"455201"},{"star":6,"name":"モミジ","id":"455301"},{"star":5,"name":"モミジ","id":"455303"},{"star":6,"name":"モミジ","id":"455305"},{"star":5,"name":"イチョウ","id":"455401"},{"star":6,"name":"デュランタ","id":"455501"},{"star":5,"name":"ホオズキ","id":"455601"},{"star":5,"name":"モミノキ","id":"456301"},{"star":5,"name":"マツ","id":"456303"},{"star":5,"name":"ヒトリシズカ","id":"456501"},{"star":5,"name":"ナンテン","id":"456601"},{"star":5,"name":"ブローディア","id":"456701"},{"star":6,"name":"シャクヤク","id":"456801"},{"star":6,"name":"シャクヤク","id":"456803"},{"star":6,"name":"シャムサクララン","id":"457301"},{"star":5,"name":"シャムサクララン","id":"457303"},{"star":5,"name":"ハートカズラ","id":"457305"},{"star":5,"name":"ユキノシタ","id":"457601"},{"star":5,"name":"クモマグサ","id":"457603"},{"star":5,"name":"ネモフィラ","id":"457701"},{"star":5,"name":"イカリソウ","id":"457801"},{"star":5,"name":"ツユクサ","id":"458001"},{"star":6,"name":"キリンソウ","id":"458101"},{"star":6,"name":"キリンソウ","id":"458103"},{"star":5,"name":"ハゼ","id":"458501"},{"star":5,"name":"アナナス","id":"458901"},{"star":5,"name":"ペペロミア","id":"459301"},{"star":5,"name":"ユズリハ","id":"459401"},{"star":5,"name":"プロテア","id":"459501"},{"star":6,"name":"パクチー","id":"459601"},{"star":5,"name":"コマクサ","id":"459801"},{"star":5,"name":"リムナンテス","id":"460001"},{"star":5,"name":"サンデリアーナ","id":"460003"},{"star":6,"name":"アサザ","id":"460005"},{"star":6,"name":"ミツガシワ","id":"460007"},{"star":6,"name":"タイリンオモダカ","id":"460011"},{"star":6,"name":"ウサギゴケ","id":"460013"},{"star":5,"name":"ビバーナム","id":"460015"},{"star":5,"name":"バイカソウ","id":"460017"},{"star":5,"name":"スターチス","id":"460019"},{"star":5,"name":"ニレ","id":"460021"},{"star":5,"name":"エリンギ","id":"460023"},{"star":5,"name":"マイヅルソウ","id":"460025"},{"star":6,"name":"ビバーナム","id":"460027"},{"star":5,"name":"パピルス","id":"460029"},{"star":5,"name":"ヤブデマリ","id":"460031"},{"star":5,"name":"ツリフネソウ","id":"460037"},{"star":6,"name":"ミズヒナゲシ","id":"460039"},{"star":5,"name":"ハナイ","id":"460101"},{"star":5,"name":"クレソン","id":"460301"},{"star":6,"name":"ストック","id":"460303"},{"star":6,"name":"カルダミネ・リラタ","id":"460305"},{"star":5,"name":"アイリス","id":"460401"},{"star":5,"name":"カキツバタ","id":"460403"},{"star":6,"name":"ニワゼキショウ","id":"460405"},{"star":6,"name":"スパラキシス","id":"460407"},{"star":5,"name":"アヤメ","id":"460409"},{"star":6,"name":"トリトニア","id":"460411"},{"star":5,"name":"スミシアンサ","id":"460501"},{"star":5,"name":"アキメネス","id":"460503"},{"star":5,"name":"ロベリア","id":"460701"},{"star":5,"name":"サワギキョウ","id":"460703"},{"star":5,"name":"ヨメナ","id":"460801"},{"star":6,"name":"コオニタビラコ","id":"460803"},{"star":5,"name":"イソギク","id":"460805"},{"star":5,"name":"アステリカリス","id":"460807"},{"star":6,"name":"ツワブキ","id":"460809"},{"star":5,"name":"ハマシオン","id":"460811"},{"star":5,"name":"ハマギク","id":"460815"},{"star":5,"name":"リシマキア","id":"460901"},{"star":5,"name":"クリンソウ","id":"460903"},{"star":5,"name":"ラミウム","id":"461101"},{"star":5,"name":"タツナミソウ","id":"461105"},{"star":5,"name":"オレガノ","id":"461107"},{"star":5,"name":"ヒメオドリコソウ","id":"461109"},{"star":6,"name":"ヒツジグサ","id":"461301"},{"star":5,"name":"ミズヒキ","id":"461601"},{"star":5,"name":"ハマナデシコ","id":"461801"},{"star":6,"name":"ヤマブキ","id":"461901"},{"star":5,"name":"ハマナス","id":"461903"},{"star":6,"name":"コンボルブルス","id":"462301"},{"star":6,"name":"ネムノキ","id":"462401"},{"star":5,"name":"バイケイソウ","id":"462701"},{"star":5,"name":"トキソウ","id":"462801"},{"star":5,"name":"バイカモ","id":"462901"},{"star":5,"name":"キツネノボタン","id":"462903"},{"star":5,"name":"バイカモ","id":"462907"},{"star":6,"name":"キツネノボタン","id":"462909"},{"star":5,"name":"トウカ","id":"463501"},{"star":5,"name":"ホルデュウム","id":"463503"},{"star":5,"name":"ムギ","id":"463505"},{"star":6,"name":"フウロソウ","id":"463601"},{"star":5,"name":"ヤマゴーヤ","id":"464001"},{"star":5,"name":"ガウラ","id":"464301"},{"star":5,"name":"ミズバコパ","id":"464401"},{"star":5,"name":"リンデルニア","id":"464403"},{"star":6,"name":"クガイソウ","id":"464405"},{"star":5,"name":"リナリア","id":"464407"},{"star":5,"name":"パキスタキス","id":"464901"},{"star":5,"name":"アデニウム","id":"465001"},{"star":5,"name":"メルテンシア","id":"465101"},{"star":5,"name":"リッピア","id":"465501"},{"star":6,"name":"クコ","id":"465601"},{"star":5,"name":"フユサンゴ","id":"465603"},{"star":5,"name":"シザンサス","id":"465607"},{"star":5,"name":"クローブ","id":"465801"},{"star":6,"name":"ヒヤシンス","id":"466701"},{"star":5,"name":"ホスタ","id":"466703"},{"star":5,"name":"チオノドクサ","id":"466705"},{"star":5,"name":"カガミ","id":"467301"},{"star":5,"name":"ミズアオイ","id":"467901"},{"star":5,"name":"ポンテデリア","id":"467903"},{"star":6,"name":"ミズアオイ","id":"467905"},{"star":6,"name":"コナギ","id":"467907"},{"star":5,"name":"インクバナ","id":"468001"},{"star":5,"name":"セダム","id":"468101"},{"star":6,"name":"イワレンゲ","id":"468103"},{"star":5,"name":"ヘナ","id":"468301"},{"star":5,"name":"ウルシ","id":"468501"},{"star":5,"name":"フェンネル","id":"469601"},{"star":5,"name":"アンゼリカ","id":"469603"},{"star":5,"name":"エリンジウム","id":"469605"},{"star":5,"name":"ブプレウルム","id":"469607"},{"star":6,"name":"フェンネル","id":"469609"},{"star":6,"name":"ハス","id":"469701"},{"star":6,"name":"ハス","id":"469703"},{"star":5,"name":"打撃型クジラ艇","id":"700001"},{"star":5,"name":"魔砲型クジラ艇","id":"700003"},{"star":6,"name":"ペポ","id":"700101"},{"star":5,"name":"水影用ヒガンバナ","id":"700103"},{"star":3,"name":"パープルパンジー","id":"700107"},{"star":6,"name":"ラエヴァ","id":"700109"},{"star":4,"name":"マンタ艇","id":"700201"},{"star":4,"name":"マンタ艇","id":"700203"},{"star":4,"name":"マンタ艇【攻撃型】","id":"700205"},{"star":4,"name":"マンタ艇【攻撃型】","id":"700207"},{"star":4,"name":"マンタ艇【攻撃型】","id":"700209"},{"star":4,"name":"マンタ艇【防御型】","id":"700211"},{"star":4,"name":"マンタ艇【防御型】","id":"700213"},{"star":4,"name":"マンタ艇【スキル型】","id":"700215"},{"star":4,"name":"マンタ艇【スキル型】","id":"700217"},{"star":4,"name":"マンタ艇【スキル型】","id":"700219"},{"star":4,"name":"マンタ艇【特攻型】","id":"700221"},{"star":4,"name":"マンタ艇【特攻型】","id":"700223"},{"star":4,"name":"マンタ艇【耐久型】","id":"700225"},{"star":4,"name":"マンタ艇【耐久型】","id":"700227"},{"star":4,"name":"マンタ艇【耐久型】","id":"700229"},{"star":4,"name":"カジキ艇","id":"700301"},{"star":4,"name":"カジキ艇","id":"700303"},{"star":5,"name":"ラークスパー","id":"700999"},{"star":6,"name":"アネモネ","id":"132901001"},{"star":6,"name":"エノテラ","id":"154301001"}];


  class ResMgr {
    constructor() {
      this.files = [];
    }
    add(url) {
      if (this.get(url)) return;
      this.files.push({
        name: url,
        blob: null,
        burl: null,
        load: false
      });
      // async data requesting
      fetch(`${url}`)
        .then(req => req.arrayBuffer())
        .then(data => {
          if (url.includes('voice'))
            data = pako.inflate(data)
          let file = this.get(url);
          if (!file) return;
          file.load = true;
          file.blob = data;
          file.burl = window.URL.createObjectURL(new Blob([new Uint8Array(data)]));
          this.onStepLoaded && this.onStepLoaded()
          if (this.status() === 1) {
            this.onload ? this.onload() : null;
          }
        });
    }
    get(url) {
      return this.files.find(file => file.name === url);
    }
    getBlobUrl(url) {
      let file = this.get(url);
      if (!file) return null;
      return this.get(url).burl;
    }
    status() {
      return this.files.filter(file => file.load).length / this.files.length;
    }
  }

  class Story {
    constructor(id, lines, resmgr) {
      this.messages = []
      this.pointer = 0
      this.resmgr = resmgr
      this.hidden = false
      this.el = document.getElementById(id + '-container')
      this.labelEl = document.getElementById(id + '-label')
      this.bgmEl = document.getElementById(id + '-bgm')
      this.voiceEl = document.getElementById(id + '-voice')
      this.sceneEl = document.getElementById(id + '-scene')
      this.dialogEl = document.getElementById(id + '-dialog')
      for (let i = 0; i < lines.length; ++i) {
        let words = lines[i].split(',')
        // remove blank messages
        if (words.length < 2) {
          continue
        }
        // name is name in mess but imagePath in image
        this.messages.push({
          type: words[0],
          name: words[1],
          text: words[2],
          voice: words[3]
        })
      }
      this.resmgr.onStepLoaded = () => document.getElementById('hs-loading').innerHTML = `Loading: ${ this.resmgr.status() * 100}%...`
      this.loadResource()
    }
    loadResource() {
      for (let i = 0; i < this.messages.length; ++i) {
        let mess = this.messages[i]
        switch (mess.type) {
          case 'mess':
            if (mess.voice) {
              this.resmgr.add(`http://dugrqaqinbtcq.cloudfront.net/product/voice/c`
              + `/${mess.voice.split('/')[0]}/${ MD5(mess.voice.split('/')[1]) }.bin?2333`)
            }
            break;
          case 'image':
            if (mess.name) {
              this.resmgr.add(`http://dugrqaqinbtcq.cloudfront.net/product/ynnFQcGDLfaUcGhp/assets/ultra/images/hscene_r18`
              + `/${ MD5(mess.name.split('/')[1]) }.bin?2333`)
            }
            break;
          default:
            break;
        }
      }
      this.resmgr.onload = () => {
        document.getElementById('hs-loading').style.display = 'none'
        window.addEventListener('wheel', evt => {
          if (evt.target.id === '' || !evt.target.id.startsWith('hs-')) {
            return
          }
          this.pointer += evt.deltaY * 0.01 - 1 ;
          this.next()
        })
        window.addEventListener('click', evt => {
          if (evt.target.id === '' || !evt.target.id.startsWith('hs-')) {
            return
          }
          if (this.hidden) {
            this.dialogEl.style.opacity = 1
            this.labelEl.style.opacity = 1
            this.hidden = false
            return
          }
          this.next()
        })
        window.addEventListener('contextmenu', evt => {
          if (evt.target.id === '' || !evt.target.id.startsWith('hs-')) {
            return
          }
          if (this.hidden) {
            this.dialogEl.style.opacity = 1
            this.labelEl.style.opacity = 1
          } else {
            this.dialogEl.style.opacity = 0
            this.labelEl.style.opacity = 0
          }
          this.hidden = !this.hidden
          evt.preventDefault()
        })
      }
    }
    next() {
      this.bgmEl.play()
      if (this.pointer < 0) this.pointer = 0
      let current = this.messages[this.pointer]
      switch (current.type) {
        case 'mess':
          let name = current.name
          if (name !== '') {
            this.labelEl.style.display = 'block'
            this.labelEl.children[0].innerHTML = current.name
          } else {
            this.labelEl.style.display = 'none'
          }

          let text = current.text
          if (text !== '') {
            this.dialogEl.style.display = 'flex'
            this.dialogEl.children[0].innerHTML = current.text.replace(/\\n/g, '<br>')
          } else {
            this.dialogEl.style.display = 'none'
          }

          if (current.voice !== '') {
            this.voiceEl.src = this.resmgr.getBlobUrl(`http://dugrqaqinbtcq.cloudfront.net/product/voice/c`
            + `/${current.voice.split('/')[0]}/${ MD5(current.voice.split('/')[1]) }.bin?2333`)
            this.voiceEl.play()
          }
          break;
        case 'effect':
          break;
        case 'image':
          this.sceneEl.style.opacity = 0
          setTimeout(() => {
            this.sceneEl.src = `${this.resmgr.getBlobUrl(
              `http://dugrqaqinbtcq.cloudfront.net/product/ynnFQcGDLfaUcGhp/assets/ultra/images/hscene_r18`
              + `/${ MD5(current.name.split('/')[1]) }.bin?2333`)}`
            this.sceneEl.style.opacity = 1
          }, 400)
          break;
        default:
          break;
      }
      if (this.pointer < this.messages.length - 1)
        this.pointer++
    }
  }

  let options = [false, false, false, true]
  window.resmgr = new ResMgr()
  domReady('charas', charaTable => {
    showIconTable(charaTable)

    let loadImages = lazyload()
    loadImages()
    window.addEventListener('scroll', loadImages, false)

    let starsEl = ['star3', 'star4', 'star5', 'star6']
    starsEl.forEach((star, index) => {
      let el = document.getElementById(star)
      el.onclick = () => {
        options[index] = !options[index]
        if (options[index]) {
          el.className = "activated"
        } else {
          el.className = ""
        }
        showIconTable(charaTable)
      }
    })


    GM_addStyle(`body {
      width: 960px;
      margin: auto;
      width: 80vw;
    }

    .chara-icon {
      width: 100px;
      height: 100px;
      margin: 10px;
      border-radius: 8px;
    }

    #star-panel {
      display: flex;
      margin: 3rem auto;
      flex-direction: row;
      justify-content: center;
    }

    button {
      margin: 10px;
      font-size: 1.3rem;
      border: none;
    }

    button.activated {
      background: cornflowerblue;
    }
    body {
      background-color: rgba(56, 67, 78, 1)
    }
    #hs-container {
      width: 960px;
      height: 640px;
      position: relative;
      margin: auto;
      z-index: 1;
      display: flex;
      justify-content: center;
    }

    #hs-container>div {
      position: absolute;
      transition: all 0.5s ease-out;
    }

    #hs-frame {
      width: 960px;
      height: 640px;
      position: absolute;
      z-index: 3;
      background-image: url(https://misuzu.moe/wcp/border.png);
    }

    #hs-scene {
      width: 960px;
      height: 640px;
      top: 0;
      right: 0;
      border-radius: 10px;
      background: linear-gradient(rgba(163, 123, 178, 0.6), rgba(113, 113, 08, 0.6));
      z-index: 2;
      transition: all 0.4s ease-in;
    }

    #hs-label {
      width: 283px;
      height: 37px;
      top: 420px;
      left: 120px;
      display: none;
      background-image: url(https://misuzu.moe/wcp/name.png);
      z-index: 5;
      text-align: center;
    }

    #hs-dialog {
      top: 445px;
      width: 750px;
      height: 154px;
      margin: auto;
      border-radius: 15px;
      display: none;
      background-image: linear-gradient(rgba(143, 103, 120, 0.83), rgba(32, 102, 129, 0.7));
      z-index: 4;
    }

    span {
      font-size: 21px;
      color: #eee;
      line-height: 32px;
    }

    #hs-dialog>span {
      width: 96%;
      margin-top: 12px;
      margin-left: 24px;
    }

    #hs-loading {
      top: 40%;
      font-size: 30px;
      color: #eee;
    }`)
  })

  function showIconTable(charaTable) {
    // remove all icons
    charaTable.innerHTML = ''
    let charasToShow = charaData.filter(chara => options[chara.star - 3])
    const fragment = document.createDocumentFragment();
    for (let i = 0, icon = null; i < charasToShow.length; ++i) {
      icon = document.createElement('img')
      icon.className = 'chara-icon'
      icon.title = charasToShow[i].name
      icon.setAttribute('data-id', charasToShow[i].id)
      icon.setAttribute('data-src', `http://dugrqaqinbtcq.cloudfront.net/product/ynnFQcGDLfaUcGhp/assets/`
       + `ultra/images/character/dmm/i/${MD5(`icon_l_${charasToShow[i].id}`)}.bin?1.81.0`)
      icon.setAttribute('src', 'https://chiyo.now.sh/favicon.ico')
      let hsceneId = charasToShow[i].id > 400000 ? `${charasToShow[i].id - 300000}_2` : charasToShow[i].id
      icon.onclick = () => {
        loadHScene(hsceneId).then(lines => {
          new Story('hs', lines, window.resmgr)
        })
      }
      fragment.appendChild(icon)
    }
    charaTable.appendChild(fragment)
  }

  function domReady(id, callback) {
    let timer = setInterval(() => {
      let dom = document.getElementById(id)
      if (dom) {
        clearInterval(timer)
        callback && callback(dom)
      }
    }, 50)
  }

  function gmRequireImage(url) {
    return new Promise((resolve, reject) =>
      GM_xmlhttpRequest({
        method: 'GET',
        url,
        overrideMimeType: 'application/octet-stream',
        responseType: 'blob',
        asynchrouns: true,
        onload: res => {
          resolve(res.response)
        },
        onprogress: res => { },
        onerror: () => console.error
      })
    )
  }

  function MD5(e) {
    function h(a, b) {
      var c, d, e, f, g;
      e = a & 2147483648;
      f = b & 2147483648;
      c = a & 1073741824;
      d = b & 1073741824;
      g = (a & 1073741823) + (b & 1073741823);
      return c & d ? g ^ 2147483648 ^ e ^ f : c | d ? g & 1073741824 ? g ^ 3221225472 ^ e ^ f : g ^ 1073741824 ^ e ^ f : g ^ e ^ f
    }

    function k(a, b, c, d, e, f, g) {
      a = h(a, h(h(b & c | ~b & d, e), g));
      return h(a << f | a >>> 32 - f, b)
    }

    function l(a, b, c, d, e, f, g) {
      a = h(a, h(h(b & d | c & ~d, e), g));
      return h(a << f | a >>> 32 - f, b)
    }

    function m(a, b, d, c, e, f, g) {
      a = h(a, h(h(b ^ d ^ c, e), g));
      return h(a << f | a >>> 32 - f, b)
    }

    function n(a, b, d, c, e, f, g) {
      a = h(a, h(h(d ^ (b | ~c), e), g));
      return h(a << f | a >>> 32 - f, b)
    }

    function p(a) {
      var b = "",
        d = "",
        c;
      for (c = 0; 3 >= c; c++) d = a >>> 8 * c & 255, d = "0" + d.toString(16), b += d.substr(d.length - 2, 2);
      return b
    }
    var f = [],
      q, r, s, t, a, b, c, d;
    e = function (a) {
      a = a.replace(/\r\n/g, "\n");
      for (var b = "", d = 0; d < a.length; d++) {
        var c = a.charCodeAt(d);
        128 > c ? b += String.fromCharCode(c) : (127 < c && 2048 > c ? b += String.fromCharCode(c >> 6 | 192) : (b += String.fromCharCode(c >> 12 | 224), b += String.fromCharCode(c >> 6 & 63 | 128)), b += String.fromCharCode(c & 63 | 128))
      }
      return b
    }(e);
    f = function (b) {
      var a, c = b.length;
      a = c + 8;
      for (var d = 16 * ((a - a % 64) / 64 + 1), e = Array(d - 1), f = 0, g = 0; g < c;) a = (g - g % 4) / 4, f = g % 4 * 8, e[a] |= b.charCodeAt(g) << f, g++;
      a = (g - g % 4) / 4;
      e[a] |= 128 << g % 4 * 8;
      e[d - 2] = c << 3;
      e[d - 1] = c >>> 29;
      return e
    }(e);
    a = 1732584193;
    b = 4023233417;
    c = 2562383102;
    d = 271733878;
    for (e = 0; e < f.length; e += 16) q = a, r = b, s = c, t = d, a = k(a, b, c, d, f[e + 0], 7, 3614090360), d = k(d, a, b, c, f[e + 1], 12, 3905402710), c = k(c, d, a, b, f[e + 2], 17, 606105819), b = k(b, c, d, a, f[e + 3], 22, 3250441966), a = k(a, b, c, d, f[e + 4], 7, 4118548399), d = k(d, a, b, c, f[e + 5], 12, 1200080426), c = k(c, d, a, b, f[e + 6], 17, 2821735955), b = k(b, c, d, a, f[e + 7], 22, 4249261313), a = k(a, b, c, d, f[e + 8], 7, 1770035416), d = k(d, a, b, c, f[e + 9], 12, 2336552879), c = k(c, d, a, b, f[e + 10], 17, 4294925233), b = k(b, c, d, a, f[e + 11], 22, 2304563134), a = k(a, b, c, d, f[e + 12], 7, 1804603682), d = k(d, a, b, c, f[e + 13], 12, 4254626195), c = k(c, d, a, b, f[e + 14], 17, 2792965006), b = k(b, c, d, a, f[e + 15], 22, 1236535329), a = l(a, b, c, d, f[e + 1], 5, 4129170786), d = l(d, a, b, c, f[e + 6], 9, 3225465664), c = l(c, d, a, b, f[e + 11], 14, 643717713), b = l(b, c, d, a, f[e + 0], 20, 3921069994), a = l(a, b, c, d, f[e + 5], 5, 3593408605), d = l(d, a, b, c, f[e + 10], 9, 38016083), c = l(c, d, a, b, f[e + 15], 14, 3634488961), b = l(b, c, d, a, f[e + 4], 20, 3889429448), a = l(a, b, c, d, f[e + 9], 5, 568446438), d = l(d, a, b, c, f[e + 14], 9, 3275163606), c = l(c, d, a, b, f[e + 3], 14, 4107603335), b = l(b, c, d, a, f[e + 8], 20, 1163531501), a = l(a, b, c, d, f[e + 13], 5, 2850285829), d = l(d, a, b, c, f[e + 2], 9, 4243563512), c = l(c, d, a, b, f[e + 7], 14, 1735328473), b = l(b, c, d, a, f[e + 12], 20, 2368359562), a = m(a, b, c, d, f[e + 5], 4, 4294588738), d = m(d, a, b, c, f[e + 8], 11, 2272392833), c = m(c, d, a, b, f[e + 11], 16, 1839030562), b = m(b, c, d, a, f[e + 14], 23, 4259657740), a = m(a, b, c, d, f[e + 1], 4, 2763975236), d = m(d, a, b, c, f[e + 4], 11, 1272893353), c = m(c, d, a, b, f[e + 7], 16, 4139469664), b = m(b, c, d, a, f[e + 10], 23, 3200236656), a = m(a, b, c, d, f[e + 13], 4, 681279174), d = m(d, a, b, c, f[e + 0], 11, 3936430074), c = m(c, d, a, b, f[e + 3], 16, 3572445317), b = m(b, c, d, a, f[e + 6], 23, 76029189), a = m(a, b, c, d, f[e + 9], 4, 3654602809), d = m(d, a, b, c, f[e + 12], 11, 3873151461), c = m(c, d, a, b, f[e + 15], 16, 530742520), b = m(b, c, d, a, f[e + 2], 23, 3299628645), a = n(a, b, c, d, f[e + 0], 6, 4096336452), d = n(d, a, b, c, f[e + 7], 10, 1126891415), c = n(c, d, a, b, f[e + 14], 15, 2878612391), b = n(b, c, d, a, f[e + 5], 21, 4237533241), a = n(a, b, c, d, f[e + 12], 6, 1700485571), d = n(d, a, b, c, f[e + 3], 10, 2399980690), c = n(c, d, a, b, f[e + 10], 15, 4293915773), b = n(b, c, d, a, f[e + 1], 21, 2240044497), a = n(a, b, c, d, f[e + 8], 6, 1873313359), d = n(d, a, b, c, f[e + 15], 10, 4264355552), c = n(c, d, a, b, f[e + 6], 15, 2734768916), b = n(b, c, d, a, f[e + 13], 21, 1309151649), a = n(a, b, c, d, f[e + 4], 6, 4149444226), d = n(d, a, b, c, f[e + 11], 10, 3174756917), c = n(c, d, a, b, f[e + 2], 15, 718787259), b = n(b, c, d, a, f[e + 9], 21, 3951481745), a = h(a, q), b = h(b, r), c = h(c, s), d = h(d, t);
    return (p(a) + p(b) + p(c) + p(d)).toLowerCase()
  };

  function lazyload() {
    let images = document.getElementsByTagName('img')
    let n = 0
    return function () {
      let seeHeight = document.documentElement.clientHeight;
      let scrollTop = document.documentElement.scrollTop || document.body.scrollTop;
      for (let i = n; i < images.length; i++) {
        if (images[i].offsetTop < seeHeight + scrollTop) {
          if (images[i].getAttribute('src') === `https://chiyo.now.sh/favicon.ico`) {
            images[i].src = images[i].getAttribute('data-src');
          }
          n++
        }
      }
    }
  }

  function loadHScene(charaId) {
    return new Promise(resolve => {
      fetch(`http://dugrqaqinbtcq.cloudfront.net/product/event/hscene_r18/${MD5(`hscene_r18_${charaId}`)}.bin?o1`)
      .then(res => res.arrayBuffer())
      .then(buffer => {
        let dec = new TextDecoder('utf-8')
        let story = dec.decode(pako.inflate(buffer))
        resolve(story.replace(/\r\n/g, '\n').split('\n'))
      })
    })
  }
})();