// ==UserScript==
// @name        维保保工单助手V1.0
// @author       zhiwen-T
// @description       维保保工单助手V1.0，自助建单插件，工单管理工具插件，医院IT工单运维助手 [维保保，维保保，维保保，维保保，维保保，维保保，维保保，维保保]
// @include   *://itil118.wchscu.cn/*
// @include      *://itil118.wchscu.cn/*
// @include   *://oanew.cd120.info:9091/*
// @exclude   *://oanew.cd120.info:9091/resource/*
// @include      *:wchscu.cn/*
// @version V1.0
// @grant       GM_getValue
// @grant       GM_setValue
// @grant       GM_addStyle
// @grant       GM_deleteValue
// @grant       GM_xmlhttpRequest
// @grant       GM.openInTab
// @namespace   A23BACEGSDTHHDGG256YHD578
// @downloadURL https://update.greasyfork.org/scripts/414030/%E7%BB%B4%E4%BF%9D%E4%BF%9D%E5%B7%A5%E5%8D%95%E5%8A%A9%E6%89%8BV10.user.js
// @updateURL https://update.greasyfork.org/scripts/414030/%E7%BB%B4%E4%BF%9D%E4%BF%9D%E5%B7%A5%E5%8D%95%E5%8A%A9%E6%89%8BV10.meta.js
// ==/UserScript==
var location = {
       "A":  ['1','2','3','4','5','6'],
       "QY1":  ['','','','','',''],
       "QY2":  ['','','','','',''],
       "TS":   ['','','','','',''],
       "B":  ['华西院区-门诊部-便民门诊/慢病管理','华西院区-门诊部-小儿外科/内分泌科','华西院区-门诊部-呼吸内科/老年病科','华西院区-门诊部-疼痛门诊/肝胆胰外科/血管外科','华西院区-门诊部-耳鼻喉科诊断室','华西院区-门诊部-中西医结合科/医学遗传咨询室',],
       "C":  ['门诊1楼A2区','3楼B区','门诊3楼A1区','门诊3楼A2区','门诊2楼A1区','3楼C1区',],
       "D":  ['何老师','蒋老师','宋老师','黄老师','唐老师','张老师',],
       "E":  ['85422534','85422554','85423902','85423400','85422434','85423416',],
       }
var settingData = {
       "A":  ['入院服务中心自助机故障','双屏不显示','网络故障调试，联系网络部','打印机卡任务，脱机','报表卡慢','市门特退费问题','呼叫屏不亮','安装offce并激活','电脑卡慢，清理优化电脑','收费窗口刷卡报错','市门特退费问题','双屏不显示','呼叫大屏，功放没有声音','显示屏不亮','搬移电脑','市门特退费问题','搬移电脑','显示屏不亮','号别处无医生陆方','呼叫小屏绿屏','刷卡器用不起','新上门诊医生呼叫配置','条码错误','电脑打不开','鼠标乱跳','挂号票走空票','网口布置','停医嘱提示已收费','网络错误','危急值推送错误','电脑无法开机','呼叫屏卡死','显示器损坏','刷卡器故障','条码错误','收费窗口刷卡报错','报表卡慢','安装操作系统及HIS','市门特退费问题','电脑卡慢，清理优化电脑','打印机卡任务，脱机','刷卡器刷不起','ie停止运行','诊区呼叫绿屏','复诊患者报道问题','医嘱录入界面报错','市门特退费问题','word文档打不开','显示屏不亮','核查患者挂号和医嘱信息','收费窗口刷卡报错','医生排班坐诊信息查询核实','安装offce并激活','诊区呼叫绿屏','刷卡器刷不起','报表卡慢','双屏不显示','诊区呼叫绿屏','打印机未安装','重装系统',],
       "B":  ['前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-硬件新-电脑-显示器','前台工单-网络请求-网络权限变更','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-HIS','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-硬件新-电脑-电脑主机','前台工单-网络请求-前台故障协助','前台工单-网络请求-前台故障协助','前台工单-硬件新-外设-刷卡器','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-硬件新-电脑-显示器','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-电脑-显示器','前台工单-硬件新-电脑-电脑主机','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-显示器','前台工单-软件-HIS','前台工单-硬件新-LED屏-LED信息显示屏','前台工单-硬件新-外设-刷卡器','前台工单-服务请求新-配置','前台工单-软件-LIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-鼠标','前台工单-硬件新-打印机新-针式打印机','前台工单-网络请求-前台故障协助','前台工单-软件-HIS','前台工单-软件-LIS','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-电脑-显示器','前台工单-硬件新-外设-刷卡器','前台工单-硬件新-打印机新-条码打印机','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-应用系统-系统安装-操作系统安装','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-网络请求-前台故障协助','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-软件-应用故障协助','前台工单-硬件新-电脑-显示器','前台工单-系统操作指导新-HIS护士操作指导','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-网络请求-前台故障协助','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-硬件新-电脑-显示器','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-打印机新-热敏打印机','前台工单-应用系统-系统安装-操作系统安装',],
       "C":  ['219186','220843','114201','252901','100116','219373','219081','156062','156062','219201','219373','220843','219193','220843','219081','219373','219081','220843','100116','219195','219201','228736','100118','219081','220852','220867','156062','100116','100118','100116','219081','219193','220843','219201','220873','219201','100116','219283','219373','156062','252901','219201','100116','219193','100116','100116','219373','130202','220843','224658','219201','100116','156062','219193','219201','100116','220843','219193','252901','219283',],
       "D":  ['硬件故障','稳定性不足','网络权限变更','稳定性不足','HIS','操作咨询','稳定性不足','前台故障协助','前台故障协助','软件故障','操作咨询','稳定性不足','稳定性不足','硬件故障','电脑安装','操作咨询','电脑安装','硬件故障','HIS','稳定性不足','稳定性不足','HIS','LIS','稳定性不足','稳定性不足','稳定性不足','前台故障协助','HIS','前台故障协助','HIS','稳定性不足','稳定性不足','硬件故障','稳定性不足','稳定性不足','软件故障','HIS','操作系统问题','操作咨询','前台故障协助','稳定性不足','稳定性不足','HIS','稳定性不足','HIS','HIS','操作咨询','软件故障','硬件故障','HIS','软件故障','HIS','前台故障协助','稳定性不足','稳定性不足','HIS','稳定性不足','稳定性不足','打印机安装','操作系统问题',],
       "E":  ['GZYY_2_16','GZYY_2_10','GZYY_6_4','GZYY_2_10','GZYY_7_1','GZYY_1_3','GZYY_2_10','GZYY_6_5','GZYY_6_5','GZYY_2_5','GZYY_1_3','GZYY_2_10','GZYY_2_10','GZYY_2_16','GZYY_2_12','GZYY_1_3','GZYY_2_12','GZYY_2_16','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_7_2','GZYY_2_10','GZYY_2_10','GZYY_2_10','GZYY_6_5','GZYY_7_1','GZYY_6_5','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_2_16','GZYY_2_10','GZYY_2_10','GZYY_2_5','GZYY_7_1','GZYY_2_4','GZYY_1_3','GZYY_6_5','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_7_1','GZYY_7_1','GZYY_1_3','GZYY_2_5','GZYY_2_16','GZYY_7_1','GZYY_2_5','GZYY_7_1','GZYY_6_5','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_2_11','GZYY_2_4',],
       "F":  ['现场处理后上报自助机故障群','重插线，重接显卡','网络故障调试，联系网络部处理','清除任务，重连打印机','更换服务器','联系检查科室撤销执行','手动开机','安装offce并激活','清理优化电脑','联系银石工程师处理','联系检查科室撤销执行','重插线，重接显卡','重启呼叫屏呼叫程序，调节功放','重打驱动，重连','搬移电脑','联系检查科室撤销执行','搬移电脑','重打驱动，重连','118配置','重启屏幕','重打驱动','mzzs配置','特殊处理','手动重启','更换鼠标','重装驱动','现场查看位置','撤销异常账单','联系LIS处理','上报后台处理','手动重启','断电重启','更换显示器','重打驱动','Lis系统问题，联系LIS肖工处理','联系银石工程师处理','更换服务器','安装操作系统及HIS','联系检查科室撤销执行','清理优化电脑','清除任务，重连打印机','重打驱动，重连','收集日志给后台','联系黄令查看处理','已经复诊，不能再次复诊','更换备用服务器，上报后台处理','联系检查科室撤销执行','重装WPS和OFFICE','重打驱动，重连','核实患者挂号和医嘱信息，回复科室','联系银石工程师处理','查询医生排班坐诊信息，回复科室','安装offce并激活','联系黄令查看处理','重打驱动，重连','更换服务器','重插线，重接显卡','联系黄令查看处理','重装驱动','重装系统',],
       "G":  ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60',],
       "K":  ['医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站','医生站',],
       "J":  [' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',],
       "message": "账户未授权，请联系管理员",
       }

var sz1= ['网络测试','科内转诊评价问题','打印机无反应','刷卡器无反应','有重复号源','更换office版本','更换系统','键盘用不起','无法科间转诊','核查pos终端编号','6.8电脑病历打不开','呼叫屏蓝屏','查交费信息','电子病历修改问题','打印机无反应','核查挂号信息','高拍仪用不起','更新pos程序','无法审核医嘱','网络故障','打印机无反应','呼叫屏未开机','双屏不显示','刷卡报错','电脑打印机安装','一体机屏幕损坏','搬移电脑','电脑卡死','更换pos机','喇叭安装','登不上患者管理系统','设备不通电','打印机无反应','审核医嘱报错','双屏不显示','电脑黑屏','pos提示MIPOS端口问题','诊区小屏黑屏','电脑蓝屏','科间转诊提示-200','心脏内科14岁以下挂号提示无权限','开药提示无权限','科内转诊评价问题','系统进不去','退费医嘱查询','呼叫屏蓝屏','双屏故障','安装电脑','更换打印机','网段规划','更新自助机程序','his报错','无法报道','开药提示库存不足','更换打印机','呼叫无声音','打印机无反应','三方系统打不开','诊间预约打不开','ris系统故障','条码打不出','更换系统','ie卡死','丙肝患者门特开药提示未上传处方','无法报道','双屏不显示','刷卡器无反应','office及erp安装','打印机无反应','医生提交后门办看不到','刷卡器故障','无法过号','药开不出','更换医生呼叫屏简介','呼叫屏蓝屏','更换打印机','病历提交后状态未变','无流行病学史','更换电脑','自助机开不起机','新上门诊医生呼叫配置。','刷不起身份证。','无法呼叫下一位。','呼叫小屏蓝屏。','高拍仪用不起。','有两个26号。','打印机故障','无法审核医嘱','补打导诊单界面空白','双屏黑屏','核查挂号信息','核医学软件报网络错误','病历无流行病学史','搬移自助机','系统进不去','开不起机','搬移电脑','自助机黑屏','无网络。','无流行病学史','双屏不显示','开不起机','his卡','开不起机','检验报告看不了','报道界面空白','无法报道','无法审核医嘱','无法审核医嘱','his打开空白','打印机无反应','电脑打不开','文件错误','word文档打不开','无法签名','安装打印机','搬移电脑','开不起机','打印机故障','呼叫无声音','更换电脑','双屏故障','his卡慢','软件打不开','患者360打不开','七日内复诊不对','无法上his','打印机无反应','无网络。','更换打印机','就诊登记导诊单故障','无网络。','搬移电脑','患者360打不开','没有流行病学史','开不起机','his卡','未复诊报道医生能刷进系统','患者360无法访问','共享打印机','无法过号','电子病历无法修改','双屏安装','重发pacs信息','核查单边账','核查挂号信息','心电图网络不通','主机报警','呼叫屏白屏',];
var sz2= ['前台工单-网络请求-网口/线路修复','前台工单-软件-HIS','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-应用系统-系统维护-办公软件维护','前台工单-应用系统-系统安装-操作系统安装','前台工单-硬件新-电脑-键盘','前台工单-软件-HIS','前台工单-硬件新-外设-POS机具','前台工单-软件-HIS','前台工单-硬件新-LED屏-LED信息显示屏','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-系统操作指导新-HIS医生操作指导','前台工单-硬件新-打印机新-热敏打印机','前台工单-系统操作指导新-HIS护士操作指导','前台工单-硬件新-外设-高拍仪','前台工单-应用系统-系统维护-HIS费用类环境维护','前台工单-软件-HIS','前台工单-网络请求-前台故障协助','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-电脑-显示器','前台工单-硬件新-外设-刷卡器','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-显示器','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-外设-POS机具','前台工单-硬件新-设备安装-第三方设备安装','前台工单-网络请求-前台故障协助','前台工单-网络请求-前台故障协助','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-HIS','前台工单-硬件新-电脑-显示器','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-外设-医保机具','前台工单-硬件新-LED屏-LED信息显示屏','前台工单-硬件新-电脑-电脑主机','前台工单-软件-HIS','前台工单-服务请求新-配置','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-系统操作指导新-HIS费用类操作指导','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-电脑-显示器','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-网络请求-前台故障协助','前台工单-硬件新-自助机-门诊自助机','前台工单-软件-HIS','前台工单-系统操作指导新-HIS护士操作指导','前台工单-软件-HIS','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-应用故障协助','前台工单-软件-HIS','前台工单-软件-PACS','前台工单-硬件新-打印机新-条码打印机','前台工单-应用系统-系统安装-操作系统安装','前台工单-软件-HIS','前台工单-系统操作指导新-HIS医生操作指导','前台工单-系统操作指导新-HIS护士操作指导','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-外设-刷卡器','前台工单-应用系统-系统安装-办公软件安装','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-HIS','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-服务请求新-配置','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-自助机-门诊自助机','前台工单-服务请求新-配置','前台工单-硬件新-外设-刷卡器','前台工单-软件-HIS','前台工单-硬件新-LED屏-LED信息显示屏','前台工单-硬件新-外设-高拍仪','前台工单-系统操作指导新-HIS护士操作指导','前台工单-硬件新-打印机新-热敏打印机','前台工单-网络请求-前台故障协助','前台工单-应用系统-系统维护-HIS医生环境维护','前台工单-硬件新-电脑-显示器','前台工单-系统操作指导新-HIS护士操作指导','前台工单-软件-应用故障协助','前台工单-系统操作指导新-HIS医生操作指导','前台工单-硬件新-自助机-门诊自助机','前台工单-应用系统-系统安装-操作系统安装','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-自助机-门诊自助机','前台工单-网络请求-前台故障协助','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-网络请求-前台故障协助','前台工单-硬件新-电脑-电脑主机','前台工单-软件-应用故障协助','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-网络请求-前台故障协助','前台工单-网络请求-前台故障协助','前台工单-软件-HIS','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-电脑-电脑主机','前台工单-系统操作指导新-办公系统操作指导','前台工单-软件-应用故障协助','前台工单-软件-HIS','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-LED屏-LED呼叫屏','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-显示器','前台工单-网络请求-前台故障协助','前台工单-软件-LIS','前台工单-网络请求-前台故障协助','前台工单-需求','前台工单-网络请求-前台故障协助','前台工单-硬件新-打印机新-热敏打印机','前台工单-网络请求-无法连接网络','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-HIS','前台工单-网络请求-前台故障协助','前台工单-硬件新-电脑-电脑主机','前台工单-网络请求-前台故障协助','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-网络请求-前台故障协助','前台工单-软件-HIS','前台工单-网络请求-前台故障协助','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-电脑-显示器','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-网络请求-前台故障协助','前台工单-硬件新-电脑-电脑主机','前台工单-软件-HIS',];
var sz3= ['113814','100116','252901','219201','100116','219266','219283','220849','100116','219203','100116','219195','219373','219369','252901','224658','219216','219259','100116','156062','252901','219193','220843','219201','219081','220843','219081','219081','219203','219240','156062','156062','252901','100116','220843','219081','219205','219195','219081','100116','228736','100116','100116','219081','219373','219193','220843','219081','220879','156062','219183','100116','224658','100116','252901','219193','252901','130202','100116','100120','220873','219283','100116','219369','224658','219081','219201','219296','252901','100116','219201','100116','100116','228736','219193','220879','100116','100116','219081','219183','228736','219201','100116','219195','219216','224658','252901','156062','219254','220843','224658','130202','219369','219183','219283','219081','219081','219183','156062','100116','219081','219081','156062','219081','130202','100116','100116','156062','156062','100116','252901','219081','219379','130202','100116','252901','219081','219081','252901','219193','219081','220843','156062','100118','156062','104439','156062','252901','247733','252901','100116','156062','219081','156062','100116','219081','156062','100116','156062','220879','100116','100116','220843','100116','100116','100116','156062','219081','100116',];
var sz4= ['网口/线路修复','人员使用故障','稳定性不足','稳定性不足','HIS','软件故障','操作系统问题','硬件故障','HIS','HIS','HIS','稳定性不足','操作咨询','人员使用故障','稳定性不足','人员使用故障','稳定性不足','第三方系统','稳定性不足','前台故障协助','稳定性不足','稳定性不足','稳定性不足','软件故障','电脑安装','硬件故障','电脑安装','稳定性不足','其它设备安装','其它设备安装','前台故障协助','前台故障协助','稳定性不足','HIS','稳定性不足','稳定性不足','硬件故障','稳定性不足','操作系统问题','HIS','人员使用故障','HIS','人员使用故障','稳定性不足','人员使用故障','稳定性不足','稳定性不足','电脑安装','打印机安装','前台故障协助','软件故障','HIS','人员使用故障','HIS','打印机安装','稳定性不足','稳定性不足','三方应用系统','HIS','PACS','稳定性不足','安装系统','HIS','人员使用故障','人员使用故障','硬件损坏','稳定性不足','软件故障','稳定性不足','人员使用故障','稳定性不足','HIS','人员使用故障','HIS','稳定性不足','打印机安装','HIS','HIS','电脑安装','稳定性不足','人员使用故障','稳定性不足','HIS','稳定性不足','人员使用故障','人员使用故障','稳定性不足','前台故障协助','操作系统问题','稳定性不足','人员使用故障','三方应用系统','人员使用故障','其它设备安装','操作系统问题','稳定性不足','电脑安装','稳定性不足','前台故障协助','人员使用故障','硬件故障','稳定性不足','前台故障协助','稳定性不足','三方应用系统','HIS','人员使用故障','前台故障协助','前台故障协助','HIS','稳定性不足','稳定性不足','人员使用故障','软件故障','HIS','打印机安装','电脑安装','稳定性不足','稳定性不足','稳定性不足','电脑安装','稳定性不足','前台故障协助','LIS','前台故障协助','HIS','前台故障协助','稳定性不足','前台故障协助','稳定性不足','HIS','前台故障协助','电脑安装','前台故障协助','HIS','稳定性不足','前台故障协助','HIS','网络权限变更','打印机安装','HIS','HIS','电脑安装','PACS','HIS','HIS','前台故障协助','稳定性不足','前台故障协助',];
var sz5= ['GZYY_6_2','GZYY_1_4','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_2_5','GZYY_2_4','GZYY_2_16','GZYY_7_1','GZYY_7_1','GZYY_7_1','GZYY_2_10','GZYY_1_3','GZYY_1_4','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_2_9','GZYY_2_10','GZYY_6_5','GZYY_2_10','GZYY_2_10','GZYY_2_10','GZYY_2_5','GZYY_2_12','GZYY_2_16','GZYY_2_12','GZYY_2_10','GZYY_2_15','GZYY_2_15','GZYY_6_5','GZYY_6_5','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_2_16','GZYY_2_10','GZYY_2_4','GZYY_7_1','GZYY_1_4','GZYY_7_1','GZYY_1_4','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_2_10','GZYY_2_12','GZYY_2_11','GZYY_6_5','GZYY_2_5','GZYY_7_1','GZYY_1_4','GZYY_7_1','GZYY_2_11','GZYY_2_10','GZYY_2_10','GZYY_7_4','GZYY_7_1','GZYY_7_3','GZYY_2_10','GZYY_2_8','GZYY_7_1','GZYY_1_4','GZYY_1_4','GZYY_2_6','GZYY_2_10','GZYY_2_5','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_7_1','GZYY_1_4','GZYY_7_1','GZYY_2_10','GZYY_2_11','GZYY_7_1','GZYY_7_1','GZYY_2_12','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_1_4','GZYY_1_4','GZYY_2_10','GZYY_6_5','GZYY_2_4','GZYY_2_10','GZYY_1_4','GZYY_7_4','GZYY_1_4','GZYY_2_15','GZYY_2_4','GZYY_2_10','GZYY_2_12','GZYY_2_10','GZYY_6_5','GZYY_1_4','GZYY_2_16','GZYY_2_10','GZYY_6_5','GZYY_2_10','GZYY_7_4','GZYY_7_1','GZYY_1_4','GZYY_6_5','GZYY_6_5','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_1_4','GZYY_2_5','GZYY_7_1','GZYY_2_11','GZYY_2_12','GZYY_2_10','GZYY_2_10','GZYY_2_10','GZYY_2_12','GZYY_2_10','GZYY_6_5','GZYY_7_2','GZYY_6_5','GZYY_7_1','GZYY_6_5','GZYY_2_10','GZYY_6_5','GZYY_2_10','GZYY_7_1','GZYY_6_5','GZYY_2_12','GZYY_6_5','GZYY_7_1','GZYY_2_10','GZYY_6_5','GZYY_7_1','GZYY_6_4','GZYY_2_11','GZYY_7_1','GZYY_7_1','GZYY_2_12','GZYY_7_3','GZYY_7_1','GZYY_7_1','GZYY_6_5','GZYY_2_10','GZYY_6_5',];
var sz6= ['模块修复','现场处理','清除任务重启','重插线','收集问题上报','更换office版本','更换系统','更换键盘','联系东华工程师处理','核查pos终端编号','更换为10服务器','手动重启','查询交费信息','现场处理','清理后重启','核查挂号信息','更换数据口','协助银石工程师更新pos程序','刷新数据','开通访问权限','取消任务重启','上报群处理','重插线','联系银石工程师处理','电脑，打印机安装','118借备用机更换','搬移电脑','重启电脑','协助银石工程师更换pos机','协助伟业安装','联系181开权限','联系179处理','取消任务重启','刷新his','重插数据线','更换备用机','联系银行工程师处理','联系179处理','手动重启','上报东华工程师处理','要看的医生打申请特例配置','重登his','现场处理','重装系统','现场查询','重启电视','重插数据线','安装电脑','更换打印机','房间内所有电脑调为同一网段','协助更新','上报后台处理','卡拿错，换卡','上报后台处理','更换打印机','重启电视','清除后重启','三方系统打不开','上报后台处理','联系ris工程师处理','清除数据重启','更换系统','手动重启电脑','联系医保办处理','本次为复诊号无法再复诊','更换显卡','重插数据线','office及erp安装','重插数据线','对应原因前打?即可','重插数据线','上报后台处理','药已开完','mzzs配置','手动重启','安装打印机','问题收集上报','手动引用','更换电脑','上报故障群处理','mzzs配置呼叫。','重插数据线。','当前病人的未录诊断。','重插网线。','更换数据插口。','核查后为不同医生病人。','清除任务重启。','更换服务器','重配环境','重插电源线','上次为复诊','联系三方厂家处理，必要时可配合','手动引用','搬自助机','重装系统','手动重启','搬移电脑','重插电源线','重插hub电源','在知识库里手动引用','更换显卡','手动重启','更换服务器','手动重启','重装pdf程序','上报后台处理','该病人当日未挂号','更换服务器','更换服务器为mz','报IP给181','清除后重启','手动重启','回收站还原','重装wps','账号被停用，临时放开。','安装打印机','搬移电脑','手动重启','取消任务重启','电源接触不良','更换电脑','重装系统','更换服务器','联系lis工程师解决','联系181开权限','手收集问题提优化','更换IP重新配置','更换数据线','重连数据线','更换打印机','上报后台处理','更换网线','搬移电脑','重开权限','手动引用','手动重启','添加备用服务器','刷新页面','重新开通访问权限','共享打印机','mzzs过号','使用自动审批','双屏安装','重发信息','核查单边账','核查挂号信息','his正常，联系三方工程师处理','清理内存条','联系黄令处理',];
var sz7= ['门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊','门诊',];
var zy1= ['无法打印','安装erp','网页打不开','安装五笔输入法','无法开机','安装条码打印机','安装新电脑','整理电脑','整理电脑','无法打印','无法打印','打印机卡纸','更换键盘','打印机卡纸','调试打印机','打印机卡纸','安装打印机','无法扫描','更换鼠标','安装his','无法连网','无法开机','无法连网','Pda无法扫描','装his6.8','电脑杀毒','无法预览医嘱单','安装office','无法打印','安装his6.8','打印机卡纸','配置扫描枪','无法打印','无法开机','电脑老是弹窗','共享打印机','无法上网','安装新电脑','外网调内网','PDA无法连网',];
var zy2= ['前台工单-硬件新-打印机新-激光黑白打印机','前台工单-应用系统-系统安装-第三方系统安装','前台工单-应用系统-系统维护-第三方系统维护','前台工单-服务请求新-软件服务','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-条码打印机','前台工单-硬件新-电脑-电脑主机','前台工单-服务请求新-硬件服务','前台工单-服务请求新-硬件服务','前台工单-硬件新-打印机新-条码打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-电脑-键盘','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-PDA-PDA硬件','前台工单-硬件新-电脑-鼠标','前台工单-应用系统-系统安装-HIS医生环境安装','前台工单-网络请求-无法连接网络','前台工单-硬件新-移动查房车-移动查房车硬件','前台工单-网络请求-无法连接网络','前台工单-硬件新-PDA-PDA硬件','前台工单-应用系统-系统安装-HIS医生环境安装','前台工单-应用系统-系统维护-操作系统维护','前台工单-应用系统-系统维护-HIS医生环境维护','前台工单-应用系统-系统维护-办公软件维护','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-应用系统-系统安装-HIS医生环境安装','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-外设-扫描枪','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-移动查房车-移动查房车硬件','前台工单-应用系统-系统维护-操作系统维护','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-网络请求-无法连接网络','前台工单-硬件新-电脑-电脑主机','前台工单-网络请求-网络权限变更','前台工单-硬件新-PDA-PDA网络',];
var zy3= ['220879','219301','219270','219348','219081','220873','219081','219350','219350','220873','220879','220879','220849','220879','220879','220879','220879','219028','220852','219285','247733','220894','247733','219028','219285','219252','219254','219266','220879','219285','220879','219199','220879','220894','219252','220879','247733','219081','114201','219057',];
var zy4= ['卡纸','第三方系统','软件故障','软件故障','硬件故障','打印机安装','电脑安装','电脑安装','电脑安装','操作不当','耗材问题','卡纸','硬件损坏','卡纸','操作咨询','卡纸','打印机安装','稳定性不足','硬件损坏','HIS','前台故障协助','硬件故障','前台故障协助','稳定性不足','HIS','操作系统问题','软件运行环境','软件故障','操作不当','HIS','卡纸','其它设备安装','卡纸','硬件故障','操作系统问题','打印机安装','稳定性不足','电脑安装','网络权限变更','硬件故障',];
var zy5= ['GZYY_2_13','GZYY_2_9','GZYY_2_5','GZYY_2_5','GZYY_2_16','GZYY_2_11','GZYY_2_12','GZYY_2_12','GZYY_2_12','GZYY_1_2','GZYY_3_1','GZYY_2_13','GZYY_2_6','GZYY_2_13','GZYY_1_3','GZYY_2_13','GZYY_2_11','GZYY_2_10','GZYY_2_6','GZYY_7_1','GZYY_6_5','GZYY_2_16','GZYY_6_5','GZYY_2_10','GZYY_7_1','GZYY_2_4','GZYY_5_3','GZYY_2_5','GZYY_1_2','GZYY_7_1','GZYY_2_13','GZYY_2_15','GZYY_2_13','GZYY_2_16','GZYY_2_4','GZYY_2_11','GZYY_2_10','GZYY_2_12','GZYY_6_4','GZYY_2_16',];
var zy6= ['重新安装碳带','联系后台协同处理','重新配置ie浏览器','取出吞卡','重新连接打印机','更换服务器地址','重新连接打印机','重新设置ip地址','重启自助机','取出吞卡','重新设置dns','重新调整打印模板','取出卡纸','联系后台协同处理','开启主机','取出卡纸','重新获取ip地址','重新设置打印机','释放静电，重启电脑','完成住院电子发票打印参数配置','更换打印机','取出卡纸','联系银海处理成不确定交易，删除交易','重新设置地址','修改为正确dns','修复flash插件','重新安装打印机','更换dns服务器地址','重新获取ip地址','重新安装碳带','取出吞卡','更换网线','完成电子发票打印环境配置','完成打印机安装','修复flash','取消休眠','重插显卡','修复his环境','重新获取地址','重新获取地址',];
var zy7= ['住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院','住院',];
var yb1= ['条码打印不清晰','预交金发票无法作废','发药界面看不到内容','自助机吞卡','无法打印','药品清单无法打印','无法打印病理报告','病理系统打不开','自助机无法插卡','自助机吞卡','His系统打不开','打印内容位置不对','无法打印','His交易无法撤销','扫描图片打不开','热敏机无法使用','病理系统打不开','处方无法打印','进不到桌面','配置电子发票打印参数','结算票据无法打印','无法打印','无法医保登记','erp打不开','erp系统打不开','两定平台无法上传图片','门特结算票据无法打印','刷银行卡很慢','上不起外网','条码打印不显示','自助机吞卡','上不起网','配置电子发票打印环境','更换打印机','两定平台无法上传图片','屏幕黑屏','显示器不亮','医保无法签到','无法连接his','上不起网','电脑屏幕不显示','上不起网','自助机不打凭条','处方无法上屏','刷医保卡一直提示阳光救助','开不起机','两定无法上传图片','两定无法上传图片','排批看不到信息','无法打印','安装热敏打印机','安装热敏打印机','自助机网络异常','退药申请单查不到','刷不起银行功能社保卡','无法打印','自助机吞卡','上不起网','无法打印单据','看不到病人医嘱信息','无法打印发票','自助机吞卡','病理系统打不开','安装热敏打印机','预交金票无法打印','安装热敏打印机','电子发票无法打印','安装热敏打印机','看不起病历','无法打印','安装浏览器','条码无法打印','更换社保加密键盘','刷不起银行卡','自助机吞卡','社保卡刷不起','病理系统打不开','信息屏不显示内容','无法打印','药品清单查不到','条码打不出来','西门子打不开','自助机无法使用','上不起外网','病理系统打不开','病理系统打不开','图片看不到','安装电脑','退药单无法打印','电脑蓝屏','电脑蓝屏','无法打印文件','自助机吞卡','电子病历看不起','条码打印不清晰','无法打印退药单','无法打印','开不起机','病理系统打不开','自助机吞卡','药品管理系统打不开','无法打印','日报表打不开','无法打印','安装操作系统','挪动自助机位置','调整网络权限','安装电脑','内网调外网  ','His系统无法登录','开不起机','打印不了文档','图片无法打印','安装电脑','视频会议连接投影仪','文件打不开','病理系统打不开','刷不了银行卡','显示器不亮','无法打印','网页打不开','病理系统打不开','预交金发票打印显示不全','安装电脑','安装内网电脑','安装电脑','无法打印','上不起网','住院电子发票无法打印','His系统打开空白','拆除电脑','自助机无法使用','处方无法上屏','银行卡刷卡报错','社保卡刷不起','开不起机','无法打印发票','His系统打不开','安装新电脑','无法结算病人','显示器有黑点','条码打印空白','无法生成住院电子发票','安装电脑','安装收费室电脑','自助机吞卡','安装Pos机','病理系统打不开','科室装修，挪动主机位置',];
var yb2= ['前台工单-硬件新-打印机新-条码打印机','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-软件-HIS','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-服务请求新-软件服务','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-软件-HIS','前台工单-硬件新-打印机新-针式打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-热敏打印机','前台工单-服务请求新-软件服务','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-电脑-电脑主机','前台工单-软件-HIS','前台工单-硬件新-打印机新-针式打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-软件-HIS','前台工单-服务请求新-软件服务','前台工单-服务请求新-软件服务','前台工单-服务请求新-软件服务','前台工单-硬件新-打印机新-针式打印机','前台工单-软件-HIS','前台工单-网络请求-无法连接网络','前台工单-硬件新-打印机新-条码打印机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-网络请求-无法连接网络','前台工单-软件-HIS','前台工单-硬件新-打印机新-针式打印机','前台工单-服务请求新-软件服务','前台工单-硬件新-电脑-显示器','前台工单-硬件新-电脑-显示器','前台工单-软件-HIS','前台工单-网络请求-无法连接网络','前台工单-网络请求-无法连接网络','前台工单-硬件新-电脑-电脑主机','前台工单-服务请求新-软件服务','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-服务请求新-软件服务','前台工单-硬件新-电脑-电脑主机','前台工单-软件-HIS','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-网络请求-无法连接网络','前台工单-硬件新-打印机新-针式打印机','前台工单-软件-HIS','前台工单-硬件新-打印机新-针式打印机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-服务请求新-软件服务','前台工单-硬件新-打印机新-热敏打印机','前台工单-硬件新-打印机新-针式打印机','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-HIS','前台工单-硬件新-打印机新-热敏打印机','前台工单-软件-HIS','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-服务请求新-软件服务','前台工单-硬件新-打印机新-条码打印机','前台工单-硬件新-外设-医保机具','前台工单-硬件新-外设-刷卡器','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-硬件新-外设-刷卡器','前台工单-服务请求新-软件服务','前台工单-硬件新-LED屏-LED信息显示屏','前台工单-硬件新-打印机新-针式打印机','前台工单-软件-HIS','前台工单-硬件新-打印机新-条码打印机','前台工单-服务请求新-软件服务','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-网络请求-无法连接网络','前台工单-服务请求新-软件服务','前台工单-服务请求新-软件服务','前台工单-硬件新-外设-其它外设设备','前台工单-硬件新-电脑-电脑主机','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-软件-HIS','前台工单-硬件新-打印机新-条码打印机','前台工单-硬件新-打印机新-针式打印机','前台工单-硬件新-打印机新-针式打印机','前台工单-硬件新-电脑-电脑主机','前台工单-服务请求新-软件服务','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-服务请求新-软件服务','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-软件-HIS','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-网络请求-网络权限变更','前台工单-硬件新-电脑-电脑主机','前台工单-网络请求-网络权限变更','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-外设-投影仪','前台工单-服务请求新-软件服务','前台工单-服务请求新-软件服务','前台工单-硬件新-外设-POS机具','前台工单-硬件新-电脑-显示器','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-网络请求-无法连接网络','前台工单-服务请求新-软件服务','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-激光黑白打印机','前台工单-网络请求-无法连接网络','前台工单-软件-HIS','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-软件-HIS','前台工单-硬件新-外设-刷卡器','前台工单-硬件新-外设-医保机具','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-打印机新-针式打印机','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-软件-HIS','前台工单-硬件新-电脑-显示器','前台工单-硬件新-打印机新-条码打印机','前台工单-软件-HIS','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-电脑-电脑主机','前台工单-硬件新-自助机-住院查询结算类自助机','前台工单-硬件新-外设-POS机具','前台工单-服务请求新-软件服务','前台工单-硬件新-电脑-电脑主机',];
var yb3= ['220873','100116','100116','219186','220879','100116','220879','219348','219186','219186','100116','220867','220879','100116','219081','252901','219348','220879','219081','100116','220867','220879','100116','219348','219348','219348','220867','100116','247733','220873','219186','247733','100116','220867','219348','220843','220843','100116','247733','247733','219081','219348','219186','100116','100116','219081','219348','219081','100116','220879','252901','252901','219186','100116','100116','220879','219186','247733','220867','100116','220867','219186','219348','252901','220867','252901','100116','252901','100116','220879','219348','220873','219205','219201','219186','219201','219348','219195','220867','100116','220873','219348','219186','247733','219348','219348','219221','219081','100116','219081','219081','220879','219186','100116','220873','220867','220867','219081','219348','219186','219348','220879','100116','220879','219081','219186','114201','219081','114201','100116','219081','220879','220879','219081','219207','219348','219348','219203','220843','220879','247733','219348','100116','219081','219081','219081','220879','247733','100116','100116','219081','219186','100116','219201','219205','219081','220867','100116','219081','100116','220843','220873','100116','219081','219081','219186','219203','219348','219081',];
var yb4= ['硬件故障','稳定性不足','网络权限变更','稳定性不足','HIS','操作咨询','稳定性不足','前台故障协助','前台故障协助','软件故障','操作咨询','稳定性不足','稳定性不足','硬件故障','电脑安装','操作咨询','电脑安装','硬件故障','HIS','稳定性不足','稳定性不足','HIS','LIS','稳定性不足','稳定性不足','稳定性不足','前台故障协助','HIS','前台故障协助','HIS','稳定性不足','稳定性不足','硬件故障','稳定性不足','稳定性不足','软件故障','HIS','操作系统问题','操作咨询','前台故障协助','稳定性不足','稳定性不足','HIS','稳定性不足','HIS','HIS','操作咨询','软件故障','硬件故障','HIS','软件故障','HIS','前台故障协助','稳定性不足','稳定性不足','HIS','稳定性不足','稳定性不足','打印机安装','操作系统问题','稳定性不足','打印机安装','稳定性不足','HIS','HIS','前台故障协助','稳定性不足','性能不足','硬件故障','HIS','操作系统问题','HIS','HIS','三方应用系统','电脑安装','网口/线路修复','人员使用故障','稳定性不足','稳定性不足','HIS','软件故障','操作系统问题','硬件故障','HIS','HIS','HIS','稳定性不足','操作咨询','人员使用故障','稳定性不足','人员使用故障','稳定性不足','第三方系统','稳定性不足','前台故障协助','稳定性不足','稳定性不足','稳定性不足','软件故障','电脑安装','硬件故障','电脑安装','稳定性不足','其它设备安装','其它设备安装','前台故障协助','前台故障协助','稳定性不足','HIS','稳定性不足','稳定性不足','硬件故障','稳定性不足','操作系统问题','HIS','人员使用故障','HIS','人员使用故障','稳定性不足','人员使用故障','稳定性不足','稳定性不足','电脑安装','打印机安装','前台故障协助','软件故障','HIS','人员使用故障','HIS','打印机安装','稳定性不足','稳定性不足','三方应用系统','HIS','PACS','稳定性不足','安装系统','HIS','人员使用故障','人员使用故障','硬件损坏','稳定性不足','软件故障','稳定性不足','人员使用故障','稳定性不足','HIS','人员使用故障','HIS',];
var yb5= ['GZYY_2_16','GZYY_2_10','GZYY_6_4','GZYY_2_10','GZYY_7_1','GZYY_1_3','GZYY_2_10','GZYY_6_5','GZYY_6_5','GZYY_2_5','GZYY_1_3','GZYY_2_10','GZYY_2_10','GZYY_2_16','GZYY_2_12','GZYY_1_3','GZYY_2_12','GZYY_2_16','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_7_2','GZYY_2_10','GZYY_2_10','GZYY_2_10','GZYY_6_5','GZYY_7_1','GZYY_6_5','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_2_16','GZYY_2_10','GZYY_2_10','GZYY_2_5','GZYY_7_1','GZYY_2_4','GZYY_1_3','GZYY_6_5','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_7_1','GZYY_7_1','GZYY_1_3','GZYY_2_5','GZYY_2_16','GZYY_7_1','GZYY_2_5','GZYY_7_1','GZYY_6_5','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_2_11','GZYY_2_4','GZYY_2_10','GZYY_2_11','GZYY_2_10','GZYY_7_1','GZYY_7_1','GZYY_6_5','GZYY_2_10','GZYY_2_2','GZYY_2_16','GZYY_7_1','GZYY_2_4','GZYY_7_1','GZYY_7_1','GZYY_7_4','GZYY_2_12','GZYY_6_2','GZYY_1_4','GZYY_2_10','GZYY_2_10','GZYY_7_1','GZYY_2_5','GZYY_2_4','GZYY_2_16','GZYY_7_1','GZYY_7_1','GZYY_7_1','GZYY_2_10','GZYY_1_3','GZYY_1_4','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_2_9','GZYY_2_10','GZYY_6_5','GZYY_2_10','GZYY_2_10','GZYY_2_10','GZYY_2_5','GZYY_2_12','GZYY_2_16','GZYY_2_12','GZYY_2_10','GZYY_2_15','GZYY_2_15','GZYY_6_5','GZYY_6_5','GZYY_2_10','GZYY_7_1','GZYY_2_10','GZYY_2_10','GZYY_2_16','GZYY_2_10','GZYY_2_4','GZYY_7_1','GZYY_1_4','GZYY_7_1','GZYY_1_4','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_2_10','GZYY_2_12','GZYY_2_11','GZYY_6_5','GZYY_2_5','GZYY_7_1','GZYY_1_4','GZYY_7_1','GZYY_2_11','GZYY_2_10','GZYY_2_10','GZYY_7_4','GZYY_7_1','GZYY_7_3','GZYY_2_10','GZYY_2_8','GZYY_7_1','GZYY_1_4','GZYY_1_4','GZYY_2_6','GZYY_2_10','GZYY_2_5','GZYY_2_10','GZYY_1_4','GZYY_2_10','GZYY_7_1','GZYY_1_4','GZYY_7_1',];
var yb6= ['重新安装碳带','联系后台协同处理','重新配置ie浏览器','取出吞卡','重新连接打印机','更换服务器地址','重新连接打印机','重新设置ip地址','重启自助机','取出吞卡','重新设置dns','重新调整打印模板','取出卡纸','联系后台协同处理','开启主机','取出卡纸','重新获取ip地址','重新设置打印机','释放静电，重启电脑','完成住院电子发票打印参数配置','更换打印机','取出卡纸','联系银海处理成不确定交易，删除交易','重新设置地址','修改为正确dns','修复flash插件','重新安装打印机','更换dns服务器地址','重新获取ip地址','重新安装碳带','取出吞卡','更换网线','完成电子发票打印环境配置','完成打印机安装','修复flash','取消休眠','重插显卡','修复his环境','重新获取地址','重新获取地址','重新插线','重新获取ip','重新上纸','联系后台人员处理','更换控件','取消自动修复','修复flash程序环境','修复flash程序环境','联系后台处理','取出卡纸','完成打印机安装','完成打印机安装','更换网口','联系后台协同处理','联系银石工程师处理','重新连接打印机','取出吞卡','重新获取ip地址','重启打印机','联系后台处理','重新连接打印机','取出吞卡','重新获取ip地址','完成打印机安装及配置','取出卡纸','完成打印机安装及系统配置','配置打印参数','完成打印机硬件安装及系统配置','安装病历插件','取出卡纸','按科室老师要求安装谷歌浏览器','更改正确打印机名','完成密码键盘更换','重新连接刷卡器','取出吞卡','更换usb口','重新设置ip地址','重启屏幕','更换数据线','指导正确操作','重新插线','重装西门子','联系自助机相关人员更新版本','重新获取地址','重新设置ip地址','重插网线','重新设置快捷方式','安装操作系统并配置his及相关软件','切换服务器地址','安装系统补丁','安装补丁','取出卡纸','取出吞卡','重配his环境','重新调整碳带','更换碳带','重新连接打印机','重新选择正常启动Windows','更换ip地址','取出吞卡','修改计算机名','修改默认打印机设置','联系后台处理','取出卡纸','连接相关外设并安装操作系统','按科室要求重新摆放自助机位置','联系网络部相关人员内网调外网','安装外设、操作系统及相关办公软件','更改端口业务，已处理','重启网卡','重插内存条','重装打印机驱动','重新连接打印机','安装新电脑并配置医保环境','连接投影仪并调试外网网络','恢复被损坏文件','重新获取ip地址','重插pos机电源','返回厂家检修','重新连接打印机','联系网络部协同处理','重新设置ip地址','重新打印发票','安装操作系统及相关软件','配置his环境及药品管理系统相关环境','安装外网电脑并配置相关环境','重启打印机','重新获取地址','重新配置住院电子发票打印环境','重新插网线','完成拆除','重开显示器','联系后台协同处理','更换数据线','更换密码键盘','重插内存条','重装驱动，重新配置打印机','重插网线','备份数据并安装新电脑','更新医保控件','更换备用屏幕','重新安装驱动','联系后台协同处理','完成硬件安装并测试功能','完成电脑及相关外设的安装并测试功能','取出吞卡','重新安装Pos机并测试','重新配置ip地址','重新挪动位置，并重装连接相关外设',];
var yb7= ['医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保','医保',];
var locmz1= ['1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27',];
var locmz2= ['华西院区-门诊部-便民门诊/慢病管理','华西院区-门诊部-小儿外科/内分泌科','华西院区-门诊部-呼吸内科/老年病科','华西院区-门诊部-疼痛门诊/肝胆胰外科/血管外科','华西院区-门诊部-耳鼻喉科诊断室','华西院区-门诊部-中西医结合科/医学遗传咨询室','华西院区-门诊部-肾脏内科/泌尿外科','华西院区-门诊部-收费室','华西院区-门诊部-内分泌/甲状腺外科','华西院区-门诊部-中西医结合科/医学遗传咨询室','华西院区-门诊部-耳鼻喉科诊断室','华西院区-门诊部-门诊办公室-骨科','华西院区-门诊部-耳鼻喉科诊断室','华西院区-门诊部-疼痛门诊/肝胆胰外科/血管外科','华西院区-门诊部-门诊财务办公室','华西院区-门诊部-消化内科','华西院区-门诊部-中西医结合科/医学遗传咨询室','华西院区-门诊部-华西院区-门诊部-心血管内科','华西院区-门诊部-耳鼻喉科诊断室','华西院区-门诊部-门诊财务办公室','华西院区-门诊部-门诊办公室-骨科','华西院区-门诊部-华西院区-门诊部-心血管内科','华西院区-门诊部-呼吸内科/老年病科','华西院区-门诊部-肾脏内科/泌尿外科','华西院区-门诊部-门诊财务办公室','华西院区-门诊部-肾脏内科/泌尿外科','华西院区-门诊部-华西院区-门诊部-心血管内科',];
var locmz3= ['门诊1楼A2区','3楼B区','门诊3楼A1区','门诊3楼A2区','门诊2楼A1区','3楼C1区','3楼E区','门诊一楼收费室','4楼B区','3楼C1区','门诊2楼A1区','门诊2楼E区','门诊2楼A1区','门诊3楼A2区','门诊2楼A3财务办','门诊2楼D区','3楼C1区','门诊三楼D区','门诊2楼A1区','门诊2楼A3财务办','门诊2楼E区','门诊三楼D区','门诊3楼A1区','3楼E区','门诊2楼A3财务办','3楼E区','门诊三楼D区',];
var locmz4= ['何老师','蒋老师','宋老师','黄老师','唐老师','张老师','罗老师','王老师','周老师','张老师','唐老师','丁老师','唐老师','黄老师','王老师','邓老师','张老师','李老师','唐老师','王老师','丁老师','李老师','宋老师','罗老师','王老师','罗老师','李老师',];
var locmz5= ['85422534','85422554','85423902','85423400','85422434','85423416','85422415','85422244','85422745','85423416','85422434','85422397','85422434','85423400','85422086','85423392','85423416','85423415','85422434','85422086','85422397','85423415','85423902','85422415','85422086','85422415','85423415',];
var loczy1= ['1','2','3','4','5','6','7','8','9','10','11','12','13','14',];
var loczy2= ['华西院区-第三住院大楼-第三综合','华西院区-第一住院大楼-心脏内科','华西院区-第三住院大楼-第三综合','华西院区-第一住院大楼-胃肠外科二病区','华西院区-第一住院大楼-急诊手术室','华西院区-第一住院大楼-输血科','华西院区-第三住院大楼-肿瘤PIVAS（肿瘤配置室）','华西院区-第一住院大楼-心脏外科','华西院区-第一住院大楼-胃肠外科二病区','华西院区-第一住院大楼-消化内科一病房','华西院区-第三住院大楼-中西医结合科','华西院区-第三住院大楼-内分泌代谢科','华西院区-第一住院大楼-胃肠外科二病区','华西院区-第三住院大楼-消化内科',];
var loczy3= ['3住3楼','5楼B区501','三楼3楼A区护士站','6楼B区护士站','2楼9间手术室','3楼','三住一楼肿瘤配置中心','12楼A区医生办公室','6楼B区护士站','6楼A区护士站','3住10楼','3住11楼','6楼B区护士站','三住院部二楼2楼B区护士站',];
var loczy4= ['老师','老师','李老师','李老师','五老师','陈老师','王老师','吕老师','廖老师','卫老师','老师','老师','李老师','欧老师',];
var loczy5= ['85422925','85423959','85422925','85422480','85423809','85422523','85423851','85422343','85422480','85422385','85422210','85422359','85422480','85422311',];
var locyb1= ['1','2','3','4','5','6','7','8','9','10','11','12',];
var locyb2= ['华西院区-第一住院大楼-医保办公室','华西院区-第一住院大楼-结算科','华西院区-门诊部-门诊药房','华西院区-结算科','华西院区-第一住院大楼-住院药房','华西院区-医技科室-病理科','华西院区-门诊部-门诊药房','华西院区-门诊部-门诊药房','华西院区-医技科室-病理科','华西院区-门诊部-门诊药房','华西院区-第一住院大楼-住院部药房','华西院区-第一住院大楼-出院结算',];
var locyb3= ['','','一住负一楼西药库房','','住院药房','三楼病理科','门诊药房窗口','','四楼病理科','门诊药房窗口','','',];
var locyb4= ['张老师','王老师','马老师','王老师','张老师','简老师','郭老师','郭老师','简老师','郭老师','陈老师','唐老师',];
var locyb5= ['85423449','85422158','85422685','85422158','85422691','85422678','85422679','85422679','85422678','85422679','85422158','85422158',];
var mr1= [];
var mr2= [];
var mr3= [];
var mr4= [];
var mr5= [];
var mr6= [];
var mr7= [];
var mr8= [];
var study_userData = null;
var userDatalocation = null;
// 查看本地是否存在旧数据
study_userData = GM_getValue("study_userData");
if (!study_userData) {
    study_userData = settingData
}
userDatalocation = GM_getValue("userDatalocation");
if (!userDatalocation) {
    userDatalocation = location
}
var userSetting = study_userData;
var message = userSetting.message;
var A = userSetting.A;
var B = userSetting.B;
var C = userSetting.C;
var D = userSetting.D;
var E = userSetting.E;
var F = userSetting.F;
var G = userSetting.G;
var K = userSetting.K;
var J = userSetting.J;

var location = userDatalocation;
var AA = location.A;
var QY1 = location.QY1;
var QY2 = location.QY2;
var TSS = location.TS;
var BB = location.B;
var CC = location.C;
var DD = location.D;
var EE = location.E;

var wxq='账户未授权,请联系管理员'
function yzzh(){
if ($("#user_info").text() == "信息中心 您好，谭智文"||$("#user_info").text() == "信息中心 您好，胡浪"||$("#user_info").text() == "信息中心 您好，黄玲灵"||$("#user_info").text() == "信息中心 您好，章永强"||$("#user_info").text() == "信息中心 您好，孙金"||$("#user_info").text() == "信息中心 您好，谭云杨"||$("#user_info").text() == "信息中心 您好，祝龙"||$("#user_info").text() == "信息中心 您好，许炜林") {
       window.localStorage.setItem("yzzhz", 1);
  }else{
       window.localStorage.removeItem('yzzhz');
   }
}

function JDD(){ // 功能判断
       try {
		var onchangeValue = document.getElementsByClassName('bigger-125')[0].innerHTML;// 确定工单总数
        window.localStorage.setItem("GDZS", onchangeValue);
        onsole.log(onchangeValue);
		} catch (err) {
        }
if (localStorage.getItem("start") != null) {  //判断总功能是否开启
 //console.log('总功能已关闭');
}else{
  //console.log('总功能已开启');
var study_userData = null;
var userDatalocation = null;
// 查看本地是否存在旧数据
study_userData = GM_getValue("study_userData");
if (!study_userData) {
    study_userData = settingData
    // GM_setValue("study_userData",study_userData);
}
userDatalocation = GM_getValue("userDatalocation");
if (!userDatalocation) {
    userDatalocation = location
    // GM_setValue("study_userData",study_userData);
}
var userSetting = study_userData;
var A = userSetting.A;
var B = userSetting.B;
var C = userSetting.C;
var D = userSetting.D;
var E = userSetting.E;
var F = userSetting.F;
var G = userSetting.G;
var K = userSetting.K;
var J = userSetting.J;

var location = userDatalocation;
var AA = location.A;
var QY1 = location.QY1;
var QY2 = location.QY2;
var TSS = location.TS;
var BB = location.B;
var CC = location.C;
var DD = location.D;
var EE = location.E;
var url = window.location.href;
var IFRAME=document.getElementById("TEMP_REASON"); //判断页面是不是建单界面     新增页面 http://itil118.wchscu.cn:80/repair/goAdd.do?OTYPE=2&SOURCE_TYPE=SJLY_3
var zx=document.getElementById("zhongxin");        //判断页面建单界面是否打开   建单后完成后编辑 http://itil118.wchscu.cn:80/repair/goEdit.do?REPAIR_ID=784068&commonEdit=yes&finish=1
var bj=document.getElementById("SERVICE_TYPE");    //判断是否处理工单界面       建单后暂停界面 http://itil118.wchscu.cn:80/repair/goEdit.do?REPAIR_ID=784068&commonEdit=yes&finish=0
if (localStorage.getItem("start") != null) {  //判断总功能是否开启              建单后未处理页面   http://itil118.wchscu.cn:80/repair/goOperate.do?STATE=RS_5&REPAIR_ID=784487
    //console.log('脚本已关闭');
 }else{
    //console.log('脚本已开启');
if(url.indexOf("STATE=RS_5&REPAIR") >= 0){   //建单后 未处理页面
//console.log('建单后 未处理页面');
// ----------------故障类型随机分配-----------------------------------
 var num = Math.floor(Math.random()*A.length);
//console.log(num)
$("#REPAIR_DESCRIPTION").val(A[num]);
$("#FAILURE_TYPE").val(C[num]);
$("#TYPE_INIT").val(C[num]);
$("#REASON").val(E[num]);
$("#TEMP_REASON").val(D[num] );
$("#TEMP_TYPE").val(B[num] );
$("#FAILURE_TYPE_STR").val(B[num] );
$("#SOLUTION").val(F[num] )
$("#USE_SUGGEST").val(J[num])
   if($("p:first")){
   var val3=$("p:first").text();
   var val= val3 + ""
   var val33= val.replace(/(^\s*)|(\s*$)/g, "");
for(var u = 0; u < A.length; u++){
    $("#table_report span:contains('现场')").click(); //选择现场
                  if (val33 === A[u]) {
                  $("#SOLUTION").val(F[u])
             //   console.log(F[u]);
                window.localStorage.setItem("PD", 1);
                   if (K[u]==='医生站' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_1']").attr("selected",true);
                       //$("#FAULT_ADDRESS").val('GZFSDD_1')
                       $('.chosen-single.chosen-default span:first').html("医生站");
                       $('.chosen-single.chosen-single-with-deselect span:first').html("医生站");
                     }else if (K[u]==='护士站' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_2']").attr("selected",true);
                       //$("#FAULT_ADDRESS").val('GZFSDD_2')
                       $('.chosen-single.chosen-default span:first').html("护士站");
                       $('.chosen-single.chosen-single-with-deselect span:first').html("护士站");
                     }else if (K[u]==='药剂' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_3']").attr("selected",true);
                       //$("#FAULT_ADDRESS").val('GZFSDD_3')
                       $('.chosen-single.chosen-default span:first').html("药剂");
                       $('.chosen-single.chosen-single-with-deselect span:first').html("药剂");
                     }else if (K[u]==='财务' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_4']").attr("selected",true);
                       //$("#FAULT_ADDRESS").val('GZFSDD_4')
                       $('.chosen-single.chosen-default span:first').html("财务");
                       $('.chosen-single.chosen-single-with-deselect span:first').html("财务");
                     }else if (K[u]==='其他' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_5']").attr("selected",true);
                       //$("#FAULT_ADDRESS").val('GZFSDD_5')
                       $('.chosen-single.chosen-default span:first').html("其他");
                       $('.chosen-single.chosen-single-with-deselect span:first').html("其他");
                     }
                   break;
                 } else{
                  window.localStorage.removeItem('PD');
                  }
       }

   }else{
      try {
        $("#SOLUTION").val("")
         $("#tishi").html("未找到对应的处理过程，请手动填写处理过程");
         } catch (err) {
         }
    }
if (localStorage.getItem("PD") != null) {
} else{
      try {
        $("#SOLUTION").val("")
        $("#tishi").html("未找到对应的处理过程，请手动填写处理过程");
         }catch (err) {
        }
 }
      document.getElementById("table_report").value = window.localStorage.getItem("upload5") //工单号自动累加+1
      var b=$('#table_report').val();
      var bb =   Number(b)
      var dd= "00"
       ////console.log($('#table_report').val());
       window.localStorage.setItem("upload6", dd+$('#table_report').val());
       document.getElementById("PAPER_REPORT_CODE").value = window.localStorage.getItem("upload6") // 累加工单号 +1
}else if(url.indexOf("SOURCE_TYPE=SJLY_3") >= 0){ //新增工单 建单界面
//console.log('建单界面');
// ----------------科室位置随机分配-----------------------------------
 var num = Math.floor(Math.random()*AA.length);
$("#REPAIR_DEPARTMENT_NAME").val(BB[num]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[num]);
$("#REPORT_TEL").val(EE[num]);
$("#REPORT_NAME").val(DD[num]);
$("#REPAIR_DEPARTMENT_NAME").click();
setTimeout(function() {
var time1 = window.localStorage.getItem("time1")
var time2 = time1-2
function clock(){
if (time2 > 0) {
      var dataid = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
      var dataid2= dataid + ""
      if(dataid2== ""||dataid2== " "||dataid2== "undefined"){
      $("#tishi").html("位置索引不到，正在更换位置！");
      var num = Math.floor(Math.random()*AA.length);
      $("#REPAIR_DEPARTMENT_NAME").val(BB[num]);
      $("#REPAIR_DEPARTMENT_NAME").click();
      }else{
      console.log(dataid2);
      $("#REPAIR_DEPARTMENT_ID").val(dataid2);
      $("#REMARK").focus();
      $("#tishi").html("");
      clearInterval(t);
      }
  time2--;
 }else  {
 $("#tishi").html("获取不到位置，请检查网络，或者手动选择位置！");
//$("#xiugai").click();
   clearInterval(t);
  }
}
var t = setInterval(clock,1000);
}, 1000);
// ----------------故障类型随机分配-----------------------------------
 var num = Math.floor(Math.random()*A.length);
  //////console.log(num)
   var Anum = A[num]
   var Bnum = B[num]
   var Cnum = C[num]
   var Dnum = D[num]
   var Enum = E[num]
   var Fnum = F[num]
   var Gnum = G[num]
   var Jnum = J[num]
$("#REPAIR_DESCRIPTION").val(Anum);
$("#FAILURE_TYPE").val(Cnum);
$("#TYPE_INIT").val(Cnum);
$("#REASON").val(Enum);
$("#TEMP_REASON").val(Dnum);
$("#TEMP_TYPE").val(Bnum);
$("#FAILURE_TYPE_STR").val(Bnum);
//$("#SOLUTION").val(Fnum)
//$("#USE_SUGGEST").val('Jnum')
$(":contains('否')").click(); //修改联系电话点 否
        }
     }
   }
}

function fuzhibaocun(){
var textA  = [],textB  = [];
$("#baocun").click(function(){
        var text2 = $("#TEMP_TYPE").val(), text3 = $("#TYPE_INIT").val(), text4 = $("#REASON_STR").attr("alt"), text5 =  $("#REASON").val();
        textA.push(text2);
        textA.push(text3);
        textB.push(text4);
        textB.push(text5);
 })

$("#baocun3").click(function(){
if (localStorage.getItem("yzzhz") != null) {
      var text1 = $("#REPAIR_DESCRIPTION").val();
      var text2 = $("#FAILURE_TYPE_STR").val();
      var text3 = $("#TYPE_INIT").val();
      var text4 = $("#REASON_STR").val();
      var text5 = $("#REASON").val();
      var text6 = $("#FAULT_ADDRESS_chosen").find('span:first').html();
      var text7 = $("#SOLUTION").val();
      var text8 = $("#USE_SUGGEST").val();
        closeiframelayer(); //关闭页面
       $("#set",top.document).click();
       $("#shezhi",top.document).click();
     // $("#biaoti",top.document).find("#table_baocun3").remove(); //清空复制的模板工单
    var table = document.createElement("table");
        table.id = "table_baocun3";
         //console.log('复制工单信息');
          var table1 =
            "<tr class='TALB' style='padding: 4px 10px;' >" +
            "<td class='fzgdxx'><input  class='G1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '复制'> </input></td>" +
            "<td class='center'><input  class='A1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+text1+"> </input></td>" +
            "<td class='center'><input  class='B1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()' type=\"text\"  value="+text2+" ></td> " +
            "<td class='center'><input  class='C1'  name='abcd'   style='font-size:14px; width:90px;'  onclick=' this.select()' readonly='readonly'  type=\"text\"  value="+text3+" ></td>" +
            "<td class='center'><input  class='D1'  name='abcd'   style='font-size:14px; width:120px;' onclick=' this.select()'  type=\"text\"   value="+text4+" >  </td> " +
            "<td class='center'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;'  onclick=' this.select()' readonly='readonly'   type=\"text\"  value="+text5+" > </input></td>" +
            "<td class='center'><input  class='K1'  name='abcd'  style='font-size:14px; width:80px;'  onclick=' this.select()' type=\"text\"   value="+text6+" >  </td> " +
            "<td class='center'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;'  onclick=' this.select()' type=\"text\"  value= "+text7+"> </input></td>" +
            "<td class='center'><input  class='J1'  name='abcd'  style='font-size:14px; width:120px;'  onclick=' this.select()' type=\"text\"  value= "+text8+"> </input></td>" +
           "<td class='center'><a  class='removeclass' ><input  class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td></tr>"+
             "";
       table.innerHTML = table1;
      $("#biaoti",top.document).after(table);
    }else{
   alert(wxq)
  }
 })

$("#baocun2").click(function(){
if (localStorage.getItem("yzzhz") != null) {
      var text1 = $("#REPAIR_DESCRIPTION").val();
      var text2 = $("#FAILURE_TYPE_STR").val();
      var text3 = $("#TYPE_INIT").val();
      var text4 = $("#REASON_STR").val();
      var text5 = $("#REASON").val();
      var text6 = $("#FAULT_ADDRESS_chosen").find('span:first').html();
      var text7 = $("#SOLUTION").val();
////console.log(text1  + "\n" +text2 + "\n" +text3 + "\n" +text4 + "\n" +text5 + "\n" +text6 + "\n" +text7 + "\n" +text8) //hello
var oInput = document.createElement('textarea');
        oInput.value = text1   + "\n" +text2  +"\n" +text3 + "\n" +text4 + "\n" +text5 + "\n" +text6 + "\n" +text7;
        document.body.appendChild(oInput);
        oInput.select(); // 选择对象
        document.execCommand("Copy"); // 执行浏览器复制命令
        oInput.className = 'oInput';
        oInput.style.display='none';
        alert(oInput.value);
    }else{
   alert(wxq)
  }
})

$("#xiugai").click(function(){
if (localStorage.getItem("yzzhz") != null) {
var url = window.location.href;
    $("#tishi").html("");
// ----------------科室位置随机分配-----------------------------------
 var num = Math.floor(Math.random()*AA.length);
$("#REPAIR_DEPARTMENT_NAME").val(BB[num]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[num]);
$("#REPORT_TEL").val(EE[num]);
$("#REPORT_NAME").val(DD[num]);
$("#REPAIR_DEPARTMENT_NAME").click();
setTimeout(function() {
    if ($(".table.table-condensed.table-sm").find("tr:eq(1)")) {
        console.log($(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id"));
        $("#REPAIR_DEPARTMENT_ID").val($(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id"));
       }

var time = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
var val= time + ""
if(val== ""||val== " "||val== "undefined"){
 $("#tishi").html("位置不对，请手动填写位置！！！");
}else{
  $("#tishi").html("");
  }
  $("#REMARK").focus();
}, 1000);
// ----------------故障类型随机分配-----------------------------------
 var num = Math.floor(Math.random()*A.length);
  //////console.log(num)
   var Anum = A[num]
   var Bnum = B[num]
   var Cnum = C[num]
   var Dnum = D[num]
   var Enum = E[num]
   var Fnum = F[num]
   var Gnum = G[num]
   var Jnum = J[num]
$("#REPAIR_DESCRIPTION").val(Anum);
$("#TYPE_INIT").val(Cnum);
$("#REASON").val(Enum);
$("#TEMP_TYPE").val(Bnum);
$("#FAILURE_TYPE_STR").val(Bnum);
//$("#SOLUTION").val(Fnum)
//$("#USE_SUGGEST").val('Jnum')

if(url.indexOf("STATE=RS_5&REPAIR") >= 0||url.indexOf("commonEdit=yes&finish=1") >= 0){   //建单后 未处理页面
$("#FINISH_TYPE_STR").val(Bnum);
$("#REASON_STR").val(Dnum);
$("#FAILURE_TYPE").val(Cnum);
$("#TEMP_REASON").val(Dnum);
$("#SOLUTION").val(F[num] )
$("#USE_SUGGEST").val(J[num])
                   if (K[num]==='医生站' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_1']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("医生站");
                     }else if (K[num]==='护士站' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_2']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("护士站");
                     }else if (K[num]==='药剂' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_3']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("药剂");
                     }else if (K[num]==='财务' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_4']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("财务");
                     }else if (K[num]==='其他' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_5']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("其他");
                     }
}
 }else{
   alert(wxq)
  }
})

$(document).on("click","#start1",function(){ //脚本总功能开启
 $("#k").hide(); $("#g").show(); $(":contains('助手已开启✔')").click; $(":contains('助手已开启✔')").trigger("click");
  window.localStorage.setItem("start", 1);
 })
$(document).on("click","#stop1",function(){  //脚本总功能关闭
  $("#k").show(); $("#g").hide();  $("a:contains('创建工单')").click;  $(":contains('助手已关闭✘')").trigger("click");
    window.localStorage.removeItem('start');
 })
$(document).on("click","#start",function(){//脚本总功能开启
 $("#k").hide();  $("#g").show();  $("#h").hide();  $("#j").show();   $("#start1",top.document).click();
  window.localStorage.setItem("start", 1);
 })
$(document).on("click","#stop",function(){ //脚本总功能关闭
 //console.log('开启助手');
 $("#k").show();   $("#g").hide();   $("#h").show();   $("#j").hide();    $("#stop1",top.document).click();
  window.localStorage.removeItem('start');
 })
}

//--------------------------工单设置功能----------
function gzfl() {
$(".B1").change(function() {
 var ttt =   $(this).val();
 //if ($(this).text() == "前台工单-应用系统-系统维护-操作系统维护") {
 if ( ttt == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
   $(this).parent().parent().find('.C1').val("220879");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医生操作指导") {
   $(this).parent().parent().find('.C1').val("219369");
 }else  if ( ttt ==  "前台工单-软件-EMR") {
   $(this).parent().parent().find('.C1').val("100115");
 }else  if ( ttt ==  "前台工单-服务请求新-配置") {
   $(this).parent().parent().find('.C1').val("228736");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-条码打印机") {
   $(this).parent().parent().find('.C1').val("220873");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-电脑主机") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-硬件新-电脑") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
   $(this).parent().parent().find('.C1').val("219377");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS护士操作指导") {
   $(this).parent().parent().find('.C1').val("224658");
 }else  if ( ttt ==  "前台工单-网络请求-网络权限变更") {
   $(this).parent().parent().find('.C1').val("114201");
 }else  if ( ttt ==  "前台工单-软件-自助打印") {
   $(this).parent().parent().find('.C1').val("100129");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA 网络") {
   $(this).parent().parent().find('.C1').val("219057");
 }else  if ( ttt ==  "前台工单-网络请求-前台故障协助") {
   $(this).parent().parent().find('.C1').val("156062");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA硬件") {
   $(this).parent().parent().find('.C1').val("219028");
 }else  if ( ttt ==  "前台工单-软件-院内网") {
   $(this).parent().parent().find('.C1').val("100125");
 }else  if ( ttt ==  "前台工单-网络请求-网口/线路修复") {
   $(this).parent().parent().find('.C1').val("113814");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
   $(this).parent().parent().find('.C1').val("220876");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
   $(this).parent().parent().find('.C1').val("219254");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA其它") {
   $(this).parent().parent().find('.C1').val("219061");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
   $(this).parent().parent().find('.C1').val("219186");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-电脑安装") {
   $(this).parent().parent().find('.C1').val("219230");
 }else  if ( ttt ==  "前台工单-服务请求新-硬件服务") {
   $(this).parent().parent().find('.C1').val("219350");
 }else  if ( ttt ==  "前台工单-服务请求新-软件服务") {
   $(this).parent().parent().find('.C1').val("219348");
 }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
   $(this).parent().parent().find('.C1').val("220885");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-显示器") {
   $(this).parent().parent().find('.C1').val("220843");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-门诊自助机") {
   $(this).parent().parent().find('.C1').val("219183");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
   $(this).parent().parent().find('.C1').val("219193");
 }else  if ( ttt ==  "前台工单-硬件新-外设-刷卡器") {
   $(this).parent().parent().find('.C1').val("219201");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
   $(this).parent().parent().find('.C1').val("219257");
 }else  if ( ttt ==  "前台工单-软件-LIS") {
   $(this).parent().parent().find('.C1').val("100118");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-第三方系统维护") {
   $(this).parent().parent().find('.C1').val("219270");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
   $(this).parent().parent().find('.C1').val("220894");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-打印机安装") {
   $(this).parent().parent().find('.C1').val("219232");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
   $(this).parent().parent().find('.C1').val("219373");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
   $(this).parent().parent().find('.C1').val("219371");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-操作系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-硬件新-外设-其它外设设备") {
   $(this).parent().parent().find('.C1').val("219221");
 }else  if ( ttt ==  "前台工单-服务请求新-上锦卡同步") {
   $(this).parent().parent().find('.C1').val("228727");
 }else  if ( ttt ==  "前台工单-网络请求-网点新增") {
   $(this).parent().parent().find('.C1').val("113812");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-LIS") {
   $(this).parent().parent().find('.C1').val("220365");
 }else  if ( ttt ==  "前台工单-软件-PACS") {
   $(this).parent().parent().find('.C1').val("100120");
 }else  if ( ttt ==  "前台工单-需求") {
   $(this).parent().parent().find('.C1').val("104439");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-操作系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
  }else  if ( ttt ==  "前台工单-应用系统-系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-鼠标") {
   $(this).parent().parent().find('.C1').val("220852");
 }else  if ( ttt ==  "前台工单-软件-应用故障协助") {
   $(this).parent().parent().find('.C1').val("130202");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
   $(this).parent().parent().find('.C1').val("219285");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
   $(this).parent().parent().find('.C1').val("220888");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
   $(this).parent().parent().find('.C1').val("219259");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-办公软件维护") {
   $(this).parent().parent().find('.C1').val("219266");
 }else  if ( ttt ==  "前台工单-服务请求新-PACS重发") {
   $(this).parent().parent().find('.C1').val("228725");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-服务请求新-耗材配送") {
   $(this).parent().parent().find('.C1').val("219346");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA HIS") {
   $(this).parent().parent().find('.C1').val("219059");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
   $(this).parent().parent().find('.C1').val("220891");
 }else  if ( ttt ==  "前台工单-软件-排队叫号") {
   $(this).parent().parent().find('.C1').val("100121");
 }else  if ( ttt ==  "前台工单-服务请求新-解锁") {
   $(this).parent().parent().find('.C1').val("228729");
 }else  if ( ttt ==  "前台工单-硬件新-外设-POS机具") {
   $(this).parent().parent().find('.C1').val("219203");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-办公软件安装") {
   $(this).parent().parent().find('.C1').val("219296");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
   $(this).parent().parent().find('.C1').val("220882");
 }else  if ( ttt ==  "前台工单-网络请求-零星布线") {
   $(this).parent().parent().find('.C1').val("113971");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-键盘") {
   $(this).parent().parent().find('.C1').val("220849");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-医技系统维护") {
   $(this).parent().parent().find('.C1').val("219268");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-针式打印机") {
   $(this).parent().parent().find('.C1').val("220867");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
   $(this).parent().parent().find('.C1').val("219289");
 }else  if ( ttt ==  "前台工单-系统操作指导新-办公系统操作指导") {
   $(this).parent().parent().find('.C1').val("219379");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
   $(this).parent().parent().find('.C1').val("219287");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
   $(this).parent().parent().find('.C1').val("219195");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
   $(this).parent().parent().find('.C1').val("219261");
 }else  if ( ttt ==  "前台工单-硬件新-外设-扫描枪") {
   $(this).parent().parent().find('.C1').val("219199");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-腕带打印机") {
   $(this).parent().parent().find('.C1').val("220864");
 }else  if ( ttt ==  "前台工单-网络请求-网线整理") {
   $(this).parent().parent().find('.C1').val("241664");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
   $(this).parent().parent().find('.C1').val("219375");
 }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-文档数据类维护") {
   $(this).parent().parent().find('.C1').val("219263");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-LIS") {
   $(this).parent().parent().find('.C1').val("220370");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-复印打印一体机") {
   $(this).parent().parent().find('.C1').val("220861");
 }else  if ( ttt ==  "前台工单-门诊窗口值守") {
   $(this).parent().parent().find('.C1').val("219442");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-喷墨打印机") {
   $(this).parent().parent().find('.C1').val("220870");
 }else  if ( ttt ==  "前台工单-硬件新-外设-高拍仪") {
   $(this).parent().parent().find('.C1').val("219216");
 }else  if ( ttt ==  "前台工单-硬件新-外设-投影仪") {
   $(this).parent().parent().find('.C1').val("219207");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-PACS") {
   $(this).parent().parent().find('.C1').val("220368");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-第三方设备安装") {
   $(this).parent().parent().find('.C1').val("219240");
 }else  if ( ttt ==  "前台工单-软件-ICU系统") {
   $(this).parent().parent().find('.C1').val("100117");
 }else  if ( ttt ==  "前台工单-硬件新-外设-多功能卡") {
   $(this).parent().parent().find('.C1').val("219214");
 }else  if ( ttt ==  "前台工单-软件-营养筛查") {
   $(this).parent().parent().find('.C1').val("100126");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-医技系统安装") {
   $(this).parent().parent().find('.C1').val("219298");
 }else  if ( ttt ==  "前台工单-软件-EC") {
   $(this).parent().parent().find('.C1').val("100114");
 }else  if ( ttt ==  "前台工单-软件-OA") {
   $(this).parent().parent().find('.C1').val("100119");
 }else  if ( ttt ==  "前台工单-软件-职工平台") {
   $(this).parent().parent().find('.C1').val("100124");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-扩展卡安装") {
   $(this).parent().parent().find('.C1').val("219238");
 }else  if ( ttt ==  "前台工单-软件-心电图") {
   $(this).parent().parent().find('.C1').val("100128");
 }else  if ( ttt ==  "前台工单-软件-移动护理") {
   $(this).parent().parent().find('.C1').val("100122");
 }else  if ( ttt ==  "前台工单-硬件新-外设-采集卡") {
   $(this).parent().parent().find('.C1').val("219211");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-PACS") {
   $(this).parent().parent().find('.C1').val("220372");
 }else  if ( ttt ==  "前台工单-软件-院内邮箱") {
   $(this).parent().parent().find('.C1').val("100123");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
   $(this).parent().parent().find('.C1').val("219292");
 }else  if ( ttt ==  "前台工单-硬件新-外设-话筒") {
   $(this).parent().parent().find('.C1').val("219219");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-显卡安装") {
   $(this).parent().parent().find('.C1').val("219234");
  }else  if ( ttt ==  "前台工单-硬件新-打印机新-热敏打印机") {
   $(this).parent().parent().find('.C1').val("252901");
  }else  if ( ttt ==  "前台工单-网络请求-无法连接网络") {
   $(this).parent().parent().find('.C1').val("247733");
  }else  if ( ttt ==  "前台工单-咨询信息") {
   $(this).parent().parent().find('.C1').val("104783");
  }else  if ( ttt ==  "前台工单-网络请求-做网线") {
   $(this).parent().parent().find('.C1').val("247735");
  }else  if ( ttt ==  "前台工单-应用系统-系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
  }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
  }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
  }else  if ( ttt ==  "信息中心-医保") {
   $(this).parent().parent().find('.C1').val("1408533");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.C1').val("");
     }
  });
 }

function gzyy() {
$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();
 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");

}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.E1').val("");
     }
    });
 }

function mz() {
     $('#tableks>#table_mz').remove();  //防止多次创建MZ模板工单
   //     $('#tableks>tr.datarow').remove();
   //      $("#rwl-setbtn",top.document).click();
        mr1 = [].concat(settingData.A);
        mr2 = [].concat(settingData.B);
        mr3 = [].concat(settingData.C);
        mr4 = [].concat(settingData.D);
        mr5 = [].concat(settingData.E);
        mr6 = [].concat(settingData.F);
        mr7 = [].concat(settingData.G);
for(var u = 0; u < sz1.length; u++){
   var SZ1 = sz1[u]
   var SZ2 = sz2[u]
   var SZ3 = sz3[u]
   var SZ4 = sz4[u]
   var SZ5 = sz5[u]
   var SZ6 = sz6[u]
   var SZ7 = sz7[u]
     var table = document.createElement("table");
        table.id = "table_mz";
          var table1 =
            "<tr class='TALB' style='padding: 4px 10px;' >" +
            "<td class='BT'><input  class='G1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '门诊'> </input></td>" +
            "<td class='MZ'><input  class='A1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+SZ1+"> </input></td>" +
            "<td class='BT'><input  class='B1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\" list='problem_list'  value="+SZ2+" ></td> " +
              '<datalist id="problem_list">' +
              ' <option value="前台工单-应用系统-系统安装-办公软件安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-操作系统安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-HIS医生环境安装"/>' +
              ' <option value="前台工单-应用系统-系统维护-操作系统维护"/>' +
              ' <option value="前台工单-应用系统-系统维护-HIS医生环境维护"/>' +
              ' <option value="前台工单-网络请求-无法连接网络"/>' +
              ' <option value="前台工单-网络请求-网络权限变更"/>' +
              ' <option value="前台工单-网络请求-前台故障协助"/>' +
              ' <option value="前台工单-系统操作指导新-HIS医生操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS护士操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-办公系统操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS药品类操作指导"/>' +
              ' <option value="前台工单-咨询信息"/>' +
              ' <option value="前台工单-软件-HIS"/>' +
              ' <option value="前台工单-软件-LIS"/>' +
              ' <option value="前台工单-软件-PACS"/>' +
              ' <option value="前台工单-软件-医保"/>' +
              ' <option value="前台工单-硬件新-外设-医保机具"/>' +
              ' <option value="信息中心-医保"/>' +
              ' <option value="前台工单-硬件新-打印机新-条码打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-热敏打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-激光黑白打印机"/>' +
              ' <option value="前台工单-硬件新-电脑-电脑主机"/>' +
              ' <option value="前台工单-硬件新-电脑-显示器"/>' +
              ' <option value="前台工单-硬件新-外设-刷卡器"/>' +
              ' <option value="前台工单-硬件新-外设-高拍仪"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED呼叫屏"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED信息显示屏"/>' +
              ' <option value="前台工单-硬件新-自助机-门诊自助机"/>' +
              ' <option value="前台工单-硬件新-自助机-住院查询结算类自助机"/>' +
              '</datalist>  ' +
             "<td class='BT'><input  class='C1'  name='abcd'   style='font-size:14px; width:90px;'  onclick=' this.select()' readonly='readonly'  type=\"text\"  value="+SZ3+" ></td>" +
             "<td class='BT'><input  class='D1'  name='abcd'   style='font-size:14px; width:120px;' onclick=' this.select()'  type=\"text\" list='reason_list'   value="+SZ4+" >  </td> " +
             '<datalist id="reason_list">' +
              ' <option value="操作咨询"/>' +
              ' <option value="人员使用故障"/>' +
              ' <option value="硬件故障"/>' +
              ' <option value="稳定性不足"/>' +
              ' <option value="软件运行环境"/>' +
              ' <option value="操作系统问题"/>' +
              ' <option value="打印机安装"/>' +
              ' <option value="电脑安装"/>' +
              ' <option value="网络权限变更"/>' +
              ' <option value="前台故障协助"/>' +
              ' <option value="网口/线路修复"/>' +
              ' <option value="HIS"/>' +
              ' <option value="LIS"/>' +
              ' <option value="三方应用系统"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;' onclick=' this.select()'  readonly='readonly'   type=\"text\"  value="+SZ5+" > </input></td>" +
             "<td class='BT'><input class='K1'  name='abcd'  style='font-size:14px; width:80px;' onclick=' this.select()'  type=\"text\" list='location'   value='医生站' >  </td> " +
              '<datalist id="location">' +
              ' <option value="医生站"/>' +
              ' <option value="护士站"/>' +
              ' <option value="药剂"/>' +
              ' <option value="财务"/>' +
              ' <option value="其他"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;' onclick=' this.select()'  type=\"text\"  value= "+SZ6+"> </input></td>" +
            "<td class='BT'><input  class='J1'  name='abcd'  style='font-size:14px; width:120px;'  onclick=' this.select()' type=\"text\"  value='' > </input></td>" +
           "<td class='BT'><a  class='removeclass' ><input      class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#tableks22").before(table);
}

$(".MZ:last").find("input").focus();
  $(document).on("click",".removeclass",function(){
 $(this).parent().parent().parent().remove();
return false;
})
$(".B1").change(function() {
 var ttt =   $(this).val();
 //if ($(this).text() == "前台工单-应用系统-系统维护-操作系统维护") {
 if ( ttt == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
   $(this).parent().parent().find('.C1').val("220879");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医生操作指导") {
   $(this).parent().parent().find('.C1').val("219369");
 }else  if ( ttt ==  "前台工单-软件-EMR") {
   $(this).parent().parent().find('.C1').val("100115");
 }else  if ( ttt ==  "前台工单-服务请求新-配置") {
   $(this).parent().parent().find('.C1').val("228736");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-条码打印机") {
   $(this).parent().parent().find('.C1').val("220873");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-电脑主机") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-硬件新-电脑") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
   $(this).parent().parent().find('.C1').val("219377");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS护士操作指导") {
   $(this).parent().parent().find('.C1').val("224658");
 }else  if ( ttt ==  "前台工单-网络请求-网络权限变更") {
   $(this).parent().parent().find('.C1').val("114201");
 }else  if ( ttt ==  "前台工单-软件-自助打印") {
   $(this).parent().parent().find('.C1').val("100129");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA 网络") {
   $(this).parent().parent().find('.C1').val("219057");
 }else  if ( ttt ==  "前台工单-网络请求-前台故障协助") {
   $(this).parent().parent().find('.C1').val("156062");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA硬件") {
   $(this).parent().parent().find('.C1').val("219028");
 }else  if ( ttt ==  "前台工单-软件-院内网") {
   $(this).parent().parent().find('.C1').val("100125");
 }else  if ( ttt ==  "前台工单-网络请求-网口/线路修复") {
   $(this).parent().parent().find('.C1').val("113814");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
   $(this).parent().parent().find('.C1').val("220876");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
   $(this).parent().parent().find('.C1').val("219254");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA其它") {
   $(this).parent().parent().find('.C1').val("219061");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
   $(this).parent().parent().find('.C1').val("219186");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-电脑安装") {
   $(this).parent().parent().find('.C1').val("219230");
 }else  if ( ttt ==  "前台工单-服务请求新-硬件服务") {
   $(this).parent().parent().find('.C1').val("219350");
 }else  if ( ttt ==  "前台工单-服务请求新-软件服务") {
   $(this).parent().parent().find('.C1').val("219348");
 }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
   $(this).parent().parent().find('.C1').val("220885");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-显示器") {
   $(this).parent().parent().find('.C1').val("220843");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-门诊自助机") {
   $(this).parent().parent().find('.C1').val("219183");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
   $(this).parent().parent().find('.C1').val("219193");
 }else  if ( ttt ==  "前台工单-硬件新-外设-刷卡器") {
   $(this).parent().parent().find('.C1').val("219201");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
   $(this).parent().parent().find('.C1').val("219257");
 }else  if ( ttt ==  "前台工单-软件-LIS") {
   $(this).parent().parent().find('.C1').val("100118");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-第三方系统维护") {
   $(this).parent().parent().find('.C1').val("219270");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
   $(this).parent().parent().find('.C1').val("220894");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-打印机安装") {
   $(this).parent().parent().find('.C1').val("219232");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
   $(this).parent().parent().find('.C1').val("219373");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
   $(this).parent().parent().find('.C1').val("219371");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-操作系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-硬件新-外设-其它外设设备") {
   $(this).parent().parent().find('.C1').val("219221");
 }else  if ( ttt ==  "前台工单-服务请求新-上锦卡同步") {
   $(this).parent().parent().find('.C1').val("228727");
 }else  if ( ttt ==  "前台工单-网络请求-网点新增") {
   $(this).parent().parent().find('.C1').val("113812");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-LIS") {
   $(this).parent().parent().find('.C1').val("220365");
 }else  if ( ttt ==  "前台工单-软件-PACS") {
   $(this).parent().parent().find('.C1').val("100120");
 }else  if ( ttt ==  "前台工单-需求") {
   $(this).parent().parent().find('.C1').val("104439");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-操作系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
  }else  if ( ttt ==  "前台工单-应用系统-系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-鼠标") {
   $(this).parent().parent().find('.C1').val("220852");
 }else  if ( ttt ==  "前台工单-软件-应用故障协助") {
   $(this).parent().parent().find('.C1').val("130202");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
   $(this).parent().parent().find('.C1').val("219285");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
   $(this).parent().parent().find('.C1').val("220888");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
   $(this).parent().parent().find('.C1').val("219259");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-办公软件维护") {
   $(this).parent().parent().find('.C1').val("219266");
 }else  if ( ttt ==  "前台工单-服务请求新-PACS重发") {
   $(this).parent().parent().find('.C1').val("228725");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-服务请求新-耗材配送") {
   $(this).parent().parent().find('.C1').val("219346");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA HIS") {
   $(this).parent().parent().find('.C1').val("219059");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
   $(this).parent().parent().find('.C1').val("220891");
 }else  if ( ttt ==  "前台工单-软件-排队叫号") {
   $(this).parent().parent().find('.C1').val("100121");
 }else  if ( ttt ==  "前台工单-服务请求新-解锁") {
   $(this).parent().parent().find('.C1').val("228729");
 }else  if ( ttt ==  "前台工单-硬件新-外设-POS机具") {
   $(this).parent().parent().find('.C1').val("219203");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-办公软件安装") {
   $(this).parent().parent().find('.C1').val("219296");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
   $(this).parent().parent().find('.C1').val("220882");
 }else  if ( ttt ==  "前台工单-网络请求-零星布线") {
   $(this).parent().parent().find('.C1').val("113971");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-键盘") {
   $(this).parent().parent().find('.C1').val("220849");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-医技系统维护") {
   $(this).parent().parent().find('.C1').val("219268");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-针式打印机") {
   $(this).parent().parent().find('.C1').val("220867");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
   $(this).parent().parent().find('.C1').val("219289");
 }else  if ( ttt ==  "前台工单-系统操作指导新-办公系统操作指导") {
   $(this).parent().parent().find('.C1').val("219379");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
   $(this).parent().parent().find('.C1').val("219287");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
   $(this).parent().parent().find('.C1').val("219195");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
   $(this).parent().parent().find('.C1').val("219261");
 }else  if ( ttt ==  "前台工单-硬件新-外设-扫描枪") {
   $(this).parent().parent().find('.C1').val("219199");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-腕带打印机") {
   $(this).parent().parent().find('.C1').val("220864");
 }else  if ( ttt ==  "前台工单-网络请求-网线整理") {
   $(this).parent().parent().find('.C1').val("241664");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
   $(this).parent().parent().find('.C1').val("219375");
 }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-文档数据类维护") {
   $(this).parent().parent().find('.C1').val("219263");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-LIS") {
   $(this).parent().parent().find('.C1').val("220370");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-复印打印一体机") {
   $(this).parent().parent().find('.C1').val("220861");
 }else  if ( ttt ==  "前台工单-门诊窗口值守") {
   $(this).parent().parent().find('.C1').val("219442");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-喷墨打印机") {
   $(this).parent().parent().find('.C1').val("220870");
 }else  if ( ttt ==  "前台工单-硬件新-外设-高拍仪") {
   $(this).parent().parent().find('.C1').val("219216");
 }else  if ( ttt ==  "前台工单-硬件新-外设-投影仪") {
   $(this).parent().parent().find('.C1').val("219207");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-PACS") {
   $(this).parent().parent().find('.C1').val("220368");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-第三方设备安装") {
   $(this).parent().parent().find('.C1').val("219240");
 }else  if ( ttt ==  "前台工单-软件-ICU系统") {
   $(this).parent().parent().find('.C1').val("100117");
 }else  if ( ttt ==  "前台工单-硬件新-外设-多功能卡") {
   $(this).parent().parent().find('.C1').val("219214");
 }else  if ( ttt ==  "前台工单-软件-营养筛查") {
   $(this).parent().parent().find('.C1').val("100126");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-医技系统安装") {
   $(this).parent().parent().find('.C1').val("219298");
 }else  if ( ttt ==  "前台工单-软件-EC") {
   $(this).parent().parent().find('.C1').val("100114");
 }else  if ( ttt ==  "前台工单-软件-OA") {
   $(this).parent().parent().find('.C1').val("100119");
 }else  if ( ttt ==  "前台工单-软件-职工平台") {
   $(this).parent().parent().find('.C1').val("100124");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-扩展卡安装") {
   $(this).parent().parent().find('.C1').val("219238");
 }else  if ( ttt ==  "前台工单-软件-心电图") {
   $(this).parent().parent().find('.C1').val("100128");
 }else  if ( ttt ==  "前台工单-软件-移动护理") {
   $(this).parent().parent().find('.C1').val("100122");
 }else  if ( ttt ==  "前台工单-硬件新-外设-采集卡") {
   $(this).parent().parent().find('.C1').val("219211");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-PACS") {
   $(this).parent().parent().find('.C1').val("220372");
 }else  if ( ttt ==  "前台工单-软件-院内邮箱") {
   $(this).parent().parent().find('.C1').val("100123");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
   $(this).parent().parent().find('.C1').val("219292");
 }else  if ( ttt ==  "前台工单-硬件新-外设-话筒") {
   $(this).parent().parent().find('.C1').val("219219");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-显卡安装") {
   $(this).parent().parent().find('.C1').val("219234");
  }else  if ( ttt ==  "前台工单-硬件新-打印机新-热敏打印机") {
   $(this).parent().parent().find('.C1').val("252901");
  }else  if ( ttt ==  "前台工单-网络请求-无法连接网络") {
   $(this).parent().parent().find('.C1').val("247733");
  }else  if ( ttt ==  "前台工单-咨询信息") {
   $(this).parent().parent().find('.C1').val("104783");
  }else  if ( ttt ==  "前台工单-网络请求-做网线") {
   $(this).parent().parent().find('.C1').val("247735");
  }else  if ( ttt ==  "前台工单-应用系统-系统维护") {
   $(this).parent().parent().find('.C1').val("219252" );
  }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
  }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
  }else  if ( ttt ==  "信息中心-医保") {
   $(this).parent().parent().find('.C1').val("1408533");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.C1').val("");
     }
  });

$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();
 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");

//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.E1').val("");
     }
    });
 }

function zy() {
     $('#tableks>#table_zy').remove();  //防止多次创建MZ模板工单
   //     $('#tableks>tr.datarow').remove();
   //      $("#rwl-setbtn",top.document).click();
for(var u = 0; u < zy1.length; u++){
   var ZY1 = zy1[u]
   var ZY2 = zy2[u]
   var ZY3 = zy3[u]
   var ZY4 = zy4[u]
   var ZY5 = zy5[u]
   var ZY6 = zy6[u]
   var ZY7 = zy7[u]
     var table = document.createElement("table");
        table.id = "table_zy";
          var table1 =
            "<tr class='TALB' style='padding: 4px 10px;' >" +
            "<td class='BT'><input  class='G1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '住院'> </input></td>" +
            "<td class='ZY'><input  class='A1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+ZY1+"> </input></td>" +
            "<td class='BT'><input  class='B1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()' type=\"text\" list='problem_list'  value="+ZY2+" ></td> " +
              '<datalist id="problem_list">' +
              ' <option value="前台工单-应用系统-系统安装-办公软件安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-操作系统安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-HIS医生环境安装"/>' +
              ' <option value="前台工单-应用系统-系统维护-操作系统维护"/>' +
              ' <option value="前台工单-应用系统-系统维护-HIS医生环境维护"/>' +
              ' <option value="前台工单-网络请求-无法连接网络"/>' +
              ' <option value="前台工单-网络请求-网络权限变更"/>' +
              ' <option value="前台工单-网络请求-前台故障协助"/>' +
              ' <option value="前台工单-系统操作指导新-HIS医生操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS护士操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-办公系统操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS药品类操作指导"/>' +
              ' <option value="前台工单-咨询信息"/>' +
              ' <option value="前台工单-软件-HIS"/>' +
              ' <option value="前台工单-软件-LIS"/>' +
              ' <option value="前台工单-软件-PACS"/>' +
              ' <option value="前台工单-硬件新-打印机新-条码打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-热敏打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-激光黑白打印机"/>' +
              ' <option value="前台工单-硬件新-电脑-电脑主机"/>' +
              ' <option value="前台工单-硬件新-电脑-显示器"/>' +
              ' <option value="前台工单-硬件新-外设-刷卡器"/>' +
              ' <option value="前台工单-硬件新-外设-高拍仪"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED呼叫屏"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED信息显示屏"/>' +
              ' <option value="前台工单-硬件新-自助机-门诊自助机"/>' +
              ' <option value="前台工单-硬件新-自助机-住院查询结算类自助机"/>' +
              '</datalist>  ' +
            "<td class='BT'><input class='C1'  name='abcd'   style='font-size:14px; width:90px;' onclick=' this.select()'  readonly='readonly'  type=\"text\"  value="+ZY3+" ></td>" +
            "<td class='BT'><input class='D1'  name='abcd'   style='font-size:14px; width:120px;' onclick=' this.select()'  type=\"text\" list='reason_list'   value="+ZY4+" >  </td> " +
             '<datalist id="reason_list">' +
              ' <option value="操作咨询"/>' +
              ' <option value="人员使用故障"/>' +
              ' <option value="硬件故障"/>' +
              ' <option value="稳定性不足"/>' +
              ' <option value="软件运行环境"/>' +
              ' <option value="操作系统问题"/>' +
              ' <option value="打印机安装"/>' +
              ' <option value="电脑安装"/>' +
              ' <option value="网络权限变更"/>' +
              ' <option value="前台故障协助"/>' +
              ' <option value="网口/线路修复"/>' +
              ' <option value="HIS"/>' +
              ' <option value="LIS"/>' +
              ' <option value="三方应用系统"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;'  onclick=' this.select()' readonly='readonly'   type=\"text\"  value="+ZY5+" > </input></td>" +
             "<td class='BT'><input class='K1'  name='abcd'  style='font-size:14px; width:80px;'  onclick=' this.select()' type=\"text\" list='location'   value='医生站' >  </td> " +
              '<datalist id="location">' +
              ' <option value="医生站"/>' +
              ' <option value="护士站"/>' +
              ' <option value="药剂"/>' +
              ' <option value="财务"/>' +
              ' <option value="其他"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;' onclick=' this.select()'  type=\"text\"  value= "+ZY6+"> </input></td>" +
            "<td class='BT'><input  class='J1'  name='abcd'  style='font-size:14px; width:120px;'  onclick=' this.select()' type=\"text\"  value='' > </input></td>" +
           "<td class='BT'><a  class='removeclass' ><input  class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#tableks22").before(table);
}

$(".ZY:last").find("input").focus();
   $(document).on("click",".removeclass",function(){
 $(this).parent().parent().parent().remove();
return false;
})
$(".B1").change(function() {
 var ttt =   $(this).val();
 //if ($(this).text() == "前台工单-应用系统-系统维护-操作系统维护") {
 if ( ttt == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
   $(this).parent().parent().find('.C1').val("220879");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医生操作指导") {
   $(this).parent().parent().find('.C1').val("219369");
 }else  if ( ttt ==  "前台工单-软件-EMR") {
   $(this).parent().parent().find('.C1').val("100115");
 }else  if ( ttt ==  "前台工单-服务请求新-配置") {
   $(this).parent().parent().find('.C1').val("228736");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-条码打印机") {
   $(this).parent().parent().find('.C1').val("220873");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-电脑主机") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-硬件新-电脑") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
   $(this).parent().parent().find('.C1').val("219377");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS护士操作指导") {
   $(this).parent().parent().find('.C1').val("224658");
 }else  if ( ttt ==  "前台工单-网络请求-网络权限变更") {
   $(this).parent().parent().find('.C1').val("114201");
 }else  if ( ttt ==  "前台工单-软件-自助打印") {
   $(this).parent().parent().find('.C1').val("100129");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA 网络") {
   $(this).parent().parent().find('.C1').val("219057");
 }else  if ( ttt ==  "前台工单-网络请求-前台故障协助") {
   $(this).parent().parent().find('.C1').val("156062");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA硬件") {
   $(this).parent().parent().find('.C1').val("219028");
 }else  if ( ttt ==  "前台工单-软件-院内网") {
   $(this).parent().parent().find('.C1').val("100125");
 }else  if ( ttt ==  "前台工单-网络请求-网口/线路修复") {
   $(this).parent().parent().find('.C1').val("113814");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
   $(this).parent().parent().find('.C1').val("220876");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
   $(this).parent().parent().find('.C1').val("219254");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA其它") {
   $(this).parent().parent().find('.C1').val("219061");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
   $(this).parent().parent().find('.C1').val("219186");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-电脑安装") {
   $(this).parent().parent().find('.C1').val("219230");
 }else  if ( ttt ==  "前台工单-服务请求新-硬件服务") {
   $(this).parent().parent().find('.C1').val("219350");
 }else  if ( ttt ==  "前台工单-服务请求新-软件服务") {
   $(this).parent().parent().find('.C1').val("219348");
 }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
   $(this).parent().parent().find('.C1').val("220885");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-显示器") {
   $(this).parent().parent().find('.C1').val("220843");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-门诊自助机") {
   $(this).parent().parent().find('.C1').val("219183");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
   $(this).parent().parent().find('.C1').val("219193");
 }else  if ( ttt ==  "前台工单-硬件新-外设-刷卡器") {
   $(this).parent().parent().find('.C1').val("219201");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
   $(this).parent().parent().find('.C1').val("219257");
 }else  if ( ttt ==  "前台工单-软件-LIS") {
   $(this).parent().parent().find('.C1').val("100118");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-第三方系统维护") {
   $(this).parent().parent().find('.C1').val("219270");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
   $(this).parent().parent().find('.C1').val("220894");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-打印机安装") {
   $(this).parent().parent().find('.C1').val("219232");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
   $(this).parent().parent().find('.C1').val("219373");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
   $(this).parent().parent().find('.C1').val("219371");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-操作系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-硬件新-外设-其它外设设备") {
   $(this).parent().parent().find('.C1').val("219221");
 }else  if ( ttt ==  "前台工单-服务请求新-上锦卡同步") {
   $(this).parent().parent().find('.C1').val("228727");
 }else  if ( ttt ==  "前台工单-网络请求-网点新增") {
   $(this).parent().parent().find('.C1').val("113812");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-LIS") {
   $(this).parent().parent().find('.C1').val("220365");
 }else  if ( ttt ==  "前台工单-软件-PACS") {
   $(this).parent().parent().find('.C1').val("100120");
 }else  if ( ttt ==  "前台工单-需求") {
   $(this).parent().parent().find('.C1').val("104439");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-操作系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
  }else  if ( ttt ==  "前台工单-应用系统-系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-鼠标") {
   $(this).parent().parent().find('.C1').val("220852");
 }else  if ( ttt ==  "前台工单-软件-应用故障协助") {
   $(this).parent().parent().find('.C1').val("130202");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
   $(this).parent().parent().find('.C1').val("219285");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
   $(this).parent().parent().find('.C1').val("220888");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
   $(this).parent().parent().find('.C1').val("219259");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-办公软件维护") {
   $(this).parent().parent().find('.C1').val("219266");
 }else  if ( ttt ==  "前台工单-服务请求新-PACS重发") {
   $(this).parent().parent().find('.C1').val("228725");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-服务请求新-耗材配送") {
   $(this).parent().parent().find('.C1').val("219346");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA HIS") {
   $(this).parent().parent().find('.C1').val("219059");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
   $(this).parent().parent().find('.C1').val("220891");
 }else  if ( ttt ==  "前台工单-软件-排队叫号") {
   $(this).parent().parent().find('.C1').val("100121");
 }else  if ( ttt ==  "前台工单-服务请求新-解锁") {
   $(this).parent().parent().find('.C1').val("228729");
 }else  if ( ttt ==  "前台工单-硬件新-外设-POS机具") {
   $(this).parent().parent().find('.C1').val("219203");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-办公软件安装") {
   $(this).parent().parent().find('.C1').val("219296");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
   $(this).parent().parent().find('.C1').val("220882");
 }else  if ( ttt ==  "前台工单-网络请求-零星布线") {
   $(this).parent().parent().find('.C1').val("113971");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-键盘") {
   $(this).parent().parent().find('.C1').val("220849");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-医技系统维护") {
   $(this).parent().parent().find('.C1').val("219268");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-针式打印机") {
   $(this).parent().parent().find('.C1').val("220867");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
   $(this).parent().parent().find('.C1').val("219289");
 }else  if ( ttt ==  "前台工单-系统操作指导新-办公系统操作指导") {
   $(this).parent().parent().find('.C1').val("219379");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
   $(this).parent().parent().find('.C1').val("219287");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
   $(this).parent().parent().find('.C1').val("219195");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
   $(this).parent().parent().find('.C1').val("219261");
 }else  if ( ttt ==  "前台工单-硬件新-外设-扫描枪") {
   $(this).parent().parent().find('.C1').val("219199");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-腕带打印机") {
   $(this).parent().parent().find('.C1').val("220864");
 }else  if ( ttt ==  "前台工单-网络请求-网线整理") {
   $(this).parent().parent().find('.C1').val("241664");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
   $(this).parent().parent().find('.C1').val("219375");
 }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-文档数据类维护") {
   $(this).parent().parent().find('.C1').val("219263");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-LIS") {
   $(this).parent().parent().find('.C1').val("220370");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-复印打印一体机") {
   $(this).parent().parent().find('.C1').val("220861");
 }else  if ( ttt ==  "前台工单-门诊窗口值守") {
   $(this).parent().parent().find('.C1').val("219442");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-喷墨打印机") {
   $(this).parent().parent().find('.C1').val("220870");
 }else  if ( ttt ==  "前台工单-硬件新-外设-高拍仪") {
   $(this).parent().parent().find('.C1').val("219216");
 }else  if ( ttt ==  "前台工单-硬件新-外设-投影仪") {
   $(this).parent().parent().find('.C1').val("219207");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-PACS") {
   $(this).parent().parent().find('.C1').val("220368");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-第三方设备安装") {
   $(this).parent().parent().find('.C1').val("219240");
 }else  if ( ttt ==  "前台工单-软件-ICU系统") {
   $(this).parent().parent().find('.C1').val("100117");
 }else  if ( ttt ==  "前台工单-硬件新-外设-多功能卡") {
   $(this).parent().parent().find('.C1').val("219214");
 }else  if ( ttt ==  "前台工单-软件-营养筛查") {
   $(this).parent().parent().find('.C1').val("100126");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-医技系统安装") {
   $(this).parent().parent().find('.C1').val("219298");
 }else  if ( ttt ==  "前台工单-软件-EC") {
   $(this).parent().parent().find('.C1').val("100114");
 }else  if ( ttt ==  "前台工单-软件-OA") {
   $(this).parent().parent().find('.C1').val("100119");
 }else  if ( ttt ==  "前台工单-软件-职工平台") {
   $(this).parent().parent().find('.C1').val("100124");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-扩展卡安装") {
   $(this).parent().parent().find('.C1').val("219238");
 }else  if ( ttt ==  "前台工单-软件-心电图") {
   $(this).parent().parent().find('.C1').val("100128");
 }else  if ( ttt ==  "前台工单-软件-移动护理") {
   $(this).parent().parent().find('.C1').val("100122");
 }else  if ( ttt ==  "前台工单-硬件新-外设-采集卡") {
   $(this).parent().parent().find('.C1').val("219211");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-PACS") {
   $(this).parent().parent().find('.C1').val("220372");
 }else  if ( ttt ==  "前台工单-软件-院内邮箱") {
   $(this).parent().parent().find('.C1').val("100123");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
   $(this).parent().parent().find('.C1').val("219292");
 }else  if ( ttt ==  "前台工单-硬件新-外设-话筒") {
   $(this).parent().parent().find('.C1').val("219219");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-显卡安装") {
   $(this).parent().parent().find('.C1').val("219234");
  }else  if ( ttt ==  "前台工单-硬件新-打印机新-热敏打印机") {
   $(this).parent().parent().find('.C1').val("252901");
  }else  if ( ttt ==  "前台工单-网络请求-无法连接网络") {
   $(this).parent().parent().find('.C1').val("247733");
  }else  if ( ttt ==  "前台工单-咨询信息") {
   $(this).parent().parent().find('.C1').val("104783");
  }else  if ( ttt ==  "前台工单-网络请求-做网线") {
   $(this).parent().parent().find('.C1').val("247735");
  }else  if ( ttt ==  "前台工单-应用系统-系统维护") {
   $(this).parent().parent().find('.C1').val("219252" );
  }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
  }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
  }else  if ( ttt ==  "信息中心-医保") {
   $(this).parent().parent().find('.C1').val("1408533");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.C1').val("");
     }
  });

$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();
 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.E1').val("");
     }
    });
 }

function yb() {
     $('#tableks>#table_yb').remove();  //防止多次创建MZ模板工单
   //     $('#tableks>tr.datarow').remove();
   //      $("#rwl-setbtn",top.document).click();
        mr1 = [].concat(settingData.A);
        mr2 = [].concat(settingData.B);
        mr3 = [].concat(settingData.C);
        mr4 = [].concat(settingData.D);
        mr5 = [].concat(settingData.E);
        mr6 = [].concat(settingData.F);
        mr7 = [].concat(settingData.G);
for(var u = 0; u < yb1.length; u++){
   var YB1 = yb1[u]
   var YB2 = yb2[u]
   var YB3 = yb3[u]
   var YB4 = yb4[u]
   var YB5 = yb5[u]
   var YB6 = yb6[u]
   var YB7 = yb7[u]
     var table = document.createElement("table");
        table.id = "table_yb";
         var table1 =
            "<tr class='TALB' style='padding: 4px 10px;' >" +
            "<td class='BT'><input  class='G1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '医保'> </input></td>" +
            "<td class='YB'><input  class='A1'  name='abcd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value= "+YB1+"> </input></td>" +
            "<td class='BT'><input  class='B1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()' type=\"text\" list='problem_list'  value="+YB2+" ></td> " +
              '<datalist id="problem_list">' +
              ' <option value="前台工单-应用系统-系统安装-办公软件安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-操作系统安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-HIS医生环境安装"/>' +
              ' <option value="前台工单-应用系统-系统维护-操作系统维护"/>' +
              ' <option value="前台工单-应用系统-系统维护-HIS医生环境维护"/>' +
              ' <option value="前台工单-网络请求-无法连接网络"/>' +
              ' <option value="前台工单-网络请求-网络权限变更"/>' +
              ' <option value="前台工单-网络请求-前台故障协助"/>' +
              ' <option value="前台工单-系统操作指导新-HIS医生操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS护士操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-办公系统操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS药品类操作指导"/>' +
              ' <option value="前台工单-咨询信息"/>' +
              ' <option value="前台工单-软件-HIS"/>' +
              ' <option value="前台工单-软件-LIS"/>' +
              ' <option value="前台工单-软件-PACS"/>' +
              ' <option value="前台工单-硬件新-打印机新-条码打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-热敏打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-激光黑白打印机"/>' +
              ' <option value="前台工单-硬件新-电脑-电脑主机"/>' +
              ' <option value="前台工单-硬件新-电脑-显示器"/>' +
              ' <option value="前台工单-硬件新-外设-刷卡器"/>' +
              ' <option value="前台工单-硬件新-外设-高拍仪"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED呼叫屏"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED信息显示屏"/>' +
              ' <option value="前台工单-硬件新-自助机-门诊自助机"/>' +
              ' <option value="前台工单-硬件新-自助机-住院查询结算类自助机"/>' +
              '</datalist>  ' +
             "<td class='BT'><input class='C1'  name='abcd'   style='font-size:14px; width:90px;'  onclick=' this.select()'   readonly='readonly'  type=\"text\"  value="+YB3+" ></td>" +
             "<td class='BT'><input class='D1'  name='abcd'   style='font-size:14px; width:120px;'  onclick=' this.select()'   type=\"text\" list='reason_list'   value="+YB4+" >  </td> " +
             '<datalist id="reason_list">' +
              ' <option value="操作咨询"/>' +
              ' <option value="人员使用故障"/>' +
              ' <option value="硬件故障"/>' +
              ' <option value="稳定性不足"/>' +
              ' <option value="软件运行环境"/>' +
              ' <option value="操作系统问题"/>' +
              ' <option value="打印机安装"/>' +
              ' <option value="电脑安装"/>' +
              ' <option value="网络权限变更"/>' +
              ' <option value="前台故障协助"/>' +
              ' <option value="网口/线路修复"/>' +
              ' <option value="HIS"/>' +
              ' <option value="LIS"/>' +
              ' <option value="三方应用系统"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;' onclick=' this.select()'  readonly='readonly'   type=\"text\"  value="+YB5+" > </input></td>" +
             "<td class='BT'><input class='K1'  name='abcd'  style='font-size:14px; width:80px;' onclick=' this.select()'  type=\"text\" list='location'   value='其他' >  </td> " +
              '<datalist id="location">' +
              ' <option value="医生站"/>' +
              ' <option value="护士站"/>' +
              ' <option value="药剂"/>' +
              ' <option value="财务"/>' +
              ' <option value="其他"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;' onclick=' this.select()'  type=\"text\"  value= "+YB6+"> </input></td>" +
            "<td class='BT'><input  class='J1'  name='abcd'  style='font-size:14px; width:120px;' onclick=' this.select()'  type=\"text\"  value='' > </input></td>" +
            "<td class='BT'><a  class='removeclass' ><input  class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#tableks22").before(table);
}

  $(".YB:last").find("input").focus();
  $(document).on("click",".removeclass",function(){
  $(this).parent().parent().parent().remove();
return false;
})

$(".B1").change(function() {
 var ttt =   $(this).val();
 //if ($(this).text() == "前台工单-应用系统-系统维护-操作系统维护") {
 if ( ttt == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
   $(this).parent().parent().find('.C1').val("220879");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医生操作指导") {
   $(this).parent().parent().find('.C1').val("219369");
 }else  if ( ttt ==  "前台工单-软件-EMR") {
   $(this).parent().parent().find('.C1').val("100115");
 }else  if ( ttt ==  "前台工单-服务请求新-配置") {
   $(this).parent().parent().find('.C1').val("228736");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-条码打印机") {
   $(this).parent().parent().find('.C1').val("220873");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-电脑主机") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-硬件新-电脑") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
   $(this).parent().parent().find('.C1').val("219377");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS护士操作指导") {
   $(this).parent().parent().find('.C1').val("224658");
 }else  if ( ttt ==  "前台工单-网络请求-网络权限变更") {
   $(this).parent().parent().find('.C1').val("114201");
 }else  if ( ttt ==  "前台工单-软件-自助打印") {
   $(this).parent().parent().find('.C1').val("100129");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA 网络") {
   $(this).parent().parent().find('.C1').val("219057");
 }else  if ( ttt ==  "前台工单-网络请求-前台故障协助") {
   $(this).parent().parent().find('.C1').val("156062");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA硬件") {
   $(this).parent().parent().find('.C1').val("219028");
 }else  if ( ttt ==  "前台工单-软件-院内网") {
   $(this).parent().parent().find('.C1').val("100125");
 }else  if ( ttt ==  "前台工单-网络请求-网口/线路修复") {
   $(this).parent().parent().find('.C1').val("113814");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
   $(this).parent().parent().find('.C1').val("220876");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
   $(this).parent().parent().find('.C1').val("219254");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA其它") {
   $(this).parent().parent().find('.C1').val("219061");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
   $(this).parent().parent().find('.C1').val("219186");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-电脑安装") {
   $(this).parent().parent().find('.C1').val("219230");
 }else  if ( ttt ==  "前台工单-服务请求新-硬件服务") {
   $(this).parent().parent().find('.C1').val("219350");
 }else  if ( ttt ==  "前台工单-服务请求新-软件服务") {
   $(this).parent().parent().find('.C1').val("219348");
 }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
   $(this).parent().parent().find('.C1').val("220885");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-显示器") {
   $(this).parent().parent().find('.C1').val("220843");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-门诊自助机") {
   $(this).parent().parent().find('.C1').val("219183");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
   $(this).parent().parent().find('.C1').val("219193");
 }else  if ( ttt ==  "前台工单-硬件新-外设-刷卡器") {
   $(this).parent().parent().find('.C1').val("219201");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
   $(this).parent().parent().find('.C1').val("219257");
 }else  if ( ttt ==  "前台工单-软件-LIS") {
   $(this).parent().parent().find('.C1').val("100118");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-第三方系统维护") {
   $(this).parent().parent().find('.C1').val("219270");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
   $(this).parent().parent().find('.C1').val("220894");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-打印机安装") {
   $(this).parent().parent().find('.C1').val("219232");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
   $(this).parent().parent().find('.C1').val("219373");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
   $(this).parent().parent().find('.C1').val("219371");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-操作系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-硬件新-外设-其它外设设备") {
   $(this).parent().parent().find('.C1').val("219221");
 }else  if ( ttt ==  "前台工单-服务请求新-上锦卡同步") {
   $(this).parent().parent().find('.C1').val("228727");
 }else  if ( ttt ==  "前台工单-网络请求-网点新增") {
   $(this).parent().parent().find('.C1').val("113812");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-LIS") {
   $(this).parent().parent().find('.C1').val("220365");
 }else  if ( ttt ==  "前台工单-软件-PACS") {
   $(this).parent().parent().find('.C1').val("100120");
 }else  if ( ttt ==  "前台工单-需求") {
   $(this).parent().parent().find('.C1').val("104439");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-操作系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
  }else  if ( ttt ==  "前台工单-应用系统-系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-鼠标") {
   $(this).parent().parent().find('.C1').val("220852");
 }else  if ( ttt ==  "前台工单-软件-应用故障协助") {
   $(this).parent().parent().find('.C1').val("130202");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
   $(this).parent().parent().find('.C1').val("219285");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
   $(this).parent().parent().find('.C1').val("220888");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
   $(this).parent().parent().find('.C1').val("219259");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-办公软件维护") {
   $(this).parent().parent().find('.C1').val("219266");
 }else  if ( ttt ==  "前台工单-服务请求新-PACS重发") {
   $(this).parent().parent().find('.C1').val("228725");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-服务请求新-耗材配送") {
   $(this).parent().parent().find('.C1').val("219346");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA HIS") {
   $(this).parent().parent().find('.C1').val("219059");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
   $(this).parent().parent().find('.C1').val("220891");
 }else  if ( ttt ==  "前台工单-软件-排队叫号") {
   $(this).parent().parent().find('.C1').val("100121");
 }else  if ( ttt ==  "前台工单-服务请求新-解锁") {
   $(this).parent().parent().find('.C1').val("228729");
 }else  if ( ttt ==  "前台工单-硬件新-外设-POS机具") {
   $(this).parent().parent().find('.C1').val("219203");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-办公软件安装") {
   $(this).parent().parent().find('.C1').val("219296");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
   $(this).parent().parent().find('.C1').val("220882");
 }else  if ( ttt ==  "前台工单-网络请求-零星布线") {
   $(this).parent().parent().find('.C1').val("113971");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-键盘") {
   $(this).parent().parent().find('.C1').val("220849");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-医技系统维护") {
   $(this).parent().parent().find('.C1').val("219268");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-针式打印机") {
   $(this).parent().parent().find('.C1').val("220867");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
   $(this).parent().parent().find('.C1').val("219289");
 }else  if ( ttt ==  "前台工单-系统操作指导新-办公系统操作指导") {
   $(this).parent().parent().find('.C1').val("219379");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
   $(this).parent().parent().find('.C1').val("219287");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
   $(this).parent().parent().find('.C1').val("219195");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
   $(this).parent().parent().find('.C1').val("219261");
 }else  if ( ttt ==  "前台工单-硬件新-外设-扫描枪") {
   $(this).parent().parent().find('.C1').val("219199");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-腕带打印机") {
   $(this).parent().parent().find('.C1').val("220864");
 }else  if ( ttt ==  "前台工单-网络请求-网线整理") {
   $(this).parent().parent().find('.C1').val("241664");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
   $(this).parent().parent().find('.C1').val("219375");
 }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-文档数据类维护") {
   $(this).parent().parent().find('.C1').val("219263");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-LIS") {
   $(this).parent().parent().find('.C1').val("220370");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-复印打印一体机") {
   $(this).parent().parent().find('.C1').val("220861");
 }else  if ( ttt ==  "前台工单-门诊窗口值守") {
   $(this).parent().parent().find('.C1').val("219442");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-喷墨打印机") {
   $(this).parent().parent().find('.C1').val("220870");
 }else  if ( ttt ==  "前台工单-硬件新-外设-高拍仪") {
   $(this).parent().parent().find('.C1').val("219216");
 }else  if ( ttt ==  "前台工单-硬件新-外设-投影仪") {
   $(this).parent().parent().find('.C1').val("219207");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-PACS") {
   $(this).parent().parent().find('.C1').val("220368");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-第三方设备安装") {
   $(this).parent().parent().find('.C1').val("219240");
 }else  if ( ttt ==  "前台工单-软件-ICU系统") {
   $(this).parent().parent().find('.C1').val("100117");
 }else  if ( ttt ==  "前台工单-硬件新-外设-多功能卡") {
   $(this).parent().parent().find('.C1').val("219214");
 }else  if ( ttt ==  "前台工单-软件-营养筛查") {
   $(this).parent().parent().find('.C1').val("100126");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-医技系统安装") {
   $(this).parent().parent().find('.C1').val("219298");
 }else  if ( ttt ==  "前台工单-软件-EC") {
   $(this).parent().parent().find('.C1').val("100114");
 }else  if ( ttt ==  "前台工单-软件-OA") {
   $(this).parent().parent().find('.C1').val("100119");
 }else  if ( ttt ==  "前台工单-软件-职工平台") {
   $(this).parent().parent().find('.C1').val("100124");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-扩展卡安装") {
   $(this).parent().parent().find('.C1').val("219238");
 }else  if ( ttt ==  "前台工单-软件-心电图") {
   $(this).parent().parent().find('.C1').val("100128");
 }else  if ( ttt ==  "前台工单-软件-移动护理") {
   $(this).parent().parent().find('.C1').val("100122");
 }else  if ( ttt ==  "前台工单-硬件新-外设-采集卡") {
   $(this).parent().parent().find('.C1').val("219211");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-PACS") {
   $(this).parent().parent().find('.C1').val("220372");
 }else  if ( ttt ==  "前台工单-软件-院内邮箱") {
   $(this).parent().parent().find('.C1').val("100123");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
   $(this).parent().parent().find('.C1').val("219292");
 }else  if ( ttt ==  "前台工单-硬件新-外设-话筒") {
   $(this).parent().parent().find('.C1').val("219219");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-显卡安装") {
   $(this).parent().parent().find('.C1').val("219234");
  }else  if ( ttt ==  "前台工单-硬件新-打印机新-热敏打印机") {
   $(this).parent().parent().find('.C1').val("252901");
  }else  if ( ttt ==  "前台工单-网络请求-无法连接网络") {
   $(this).parent().parent().find('.C1').val("247733");
  }else  if ( ttt ==  "前台工单-咨询信息") {
   $(this).parent().parent().find('.C1').val("104783");
  }else  if ( ttt ==  "前台工单-网络请求-做网线") {
   $(this).parent().parent().find('.C1').val("247735");
  }else  if ( ttt ==  "前台工单-应用系统-系统维护") {
   $(this).parent().parent().find('.C1').val("219252" );
  }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
  }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
  }else  if ( ttt ==  "信息中心-医保") {
   $(this).parent().parent().find('.C1').val("1408533");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.C1').val("");
     }
  });

$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();
 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");

}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.E1').val("");
     }
    });
}

function fzdr() {
 //粘贴导入工单信息
 $("#fz").bind({
			paste: function(e) {
				if (window.clipboardData) {
					return ;
				}
				var clipboardData = e.originalEvent.clipboardData;
				processData(clipboardData);
			}
		});

		document.onkeyup = function(e) {
			if (window.clipboardData) {
				e = window.event || e;
				var keyCode = e.keyCode || e.which || e.charCode;
				var ctrlKey = e.ctrlKey || e.metaKey;
				if (ctrlKey && keyCode == 86) {
					var clipboardData = window.clipboardData;
					processData(clipboardData);
				}
			}
			return false;
		}

		var processData = function(clipboardData) {
			$('#tableks>.TALB.table-fz').remove();
            var Tex = clipboardData.getData('Text')
			var data = clipboardData.getData('Text').split('\n');
			var dataHtml = '';
         if(Tex.indexOf("序号")!=-1){
             alert('请检查文本类容，不要复制表头标题“序号”等')
            } else  if(Tex.indexOf("故障描述")!=-1){
             alert('请检查文本类容，不要复制表头标题“故障描述”等')
            } else{
			   for (var i = 0; i < data.length; i++) {
				if (!data[i]) {
					continue ;
				}
				var bugdetData = data[i].split('\t');
                  var problem =""
                  var reason =""

if (bugdetData[2] == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单
  problem="219252"
 }else  if (bugdetData[2] ==  "前台工单-软件-HIS") {
  problem= "100116"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
  problem= "220879"
 }else  if (bugdetData[2] ==  "前台工单-软件-HIS") {
  problem= "100116"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-HIS医生操作指导") {
  problem= "219369"
 }else  if (bugdetData[2] ==  "前台工单-软件-EMR") {
  problem= "100115"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-配置") {
  problem= "228736"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-条码打印机") {
  problem= "220873"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-电脑-电脑主机") {
  problem= "219081"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-电脑") {
  problem= "219081"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
  problem= "219377"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-HIS护士操作指导") {
  problem= "224658"
 }else  if (bugdetData[2] ==  "前台工单-网络请求-网络权限变更") {
  problem= "114201"
 }else  if (bugdetData[2] ==  "前台工单-软件-自助打印") {
  problem= "100129"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-PDA-PDA 网络") {
  problem= "219057"
 }else  if (bugdetData[2] ==  "前台工单-网络请求-前台故障协助") {
  problem= "156062"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-PDA-PDA硬件") {
  problem= "219028"
 }else  if (bugdetData[2] ==  "前台工单-软件-院内网") {
  problem= "100125"
 }else  if (bugdetData[2] ==  "前台工单-网络请求-网口/线路修复") {
  problem= "113814"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
  problem= "220876"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
  problem= "219254"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-PDA-PDA其它") {
  problem= "219061"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
  problem= "219186"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-设备安装-电脑安装") {
  problem= "219230"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-硬件服务") {
  problem= "219350"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-软件服务") {
  problem= "219348"
 }else  if (bugdetData[2] ==  "前台工单-软件-医保") {
  problem= "100127"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
  problem= "220885"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-电脑-显示器") {
  problem= "220843"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-自助机-门诊自助机") {
  problem= "219183"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
  problem= "219193"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-刷卡器") {
  problem= "219201"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
  problem= "219257"
 }else  if (bugdetData[2] ==  "前台工单-软件-LIS") {
  problem= "100118"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-第三方系统维护") {
  problem= "219270"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
  problem= "220894"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-设备安装-打印机安装") {
  problem= "219232"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
  problem= "219373"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
  problem= "219371"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-操作系统维护") {
  problem= "219252"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-其它外设设备") {
  problem= "219221"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-上锦卡同步") {
  problem= "228727"
 }else  if (bugdetData[2] ==  "前台工单-网络请求-网点新增") {
  problem= "113812"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-LIS") {
  problem= "220365"
 }else  if (bugdetData[2] ==  "前台工单-软件-PACS") {
  problem= "100120"
 }else  if (bugdetData[2] ==  "前台工单-需求") {
  problem= "104439"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-操作系统安装") {
  problem= "219283"
  }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装") {
  problem= "219283"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-电脑-鼠标") {
  problem= "220852"
 }else  if (bugdetData[2] ==  "前台工单-软件-应用故障协助") {
  problem= "130202"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
  problem= "219285"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
  problem= "220888"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
  problem= "219259"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-办公软件维护") {
  problem= "219266"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-PACS重发") {
  problem= "228725"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-第三方系统安装") {
  problem= "219301"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-第三方系统安装") {
  problem= "219301"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-耗材配送") {
  problem= "219346"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-PDA-PDA HIS") {
  problem= "219059"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
  problem= "220891"
 }else  if (bugdetData[2] ==  "前台工单-软件-排队叫号") {
  problem= "100121"
 }else  if (bugdetData[2] ==  "前台工单-服务请求新-解锁") {
  problem= "228729"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-POS机具") {
  problem= "219203"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-办公软件安装") {
  problem= "219296"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
  problem= "220882"
 }else  if (bugdetData[2] ==  "前台工单-网络请求-零星布线") {
  problem= "113971"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-电脑-键盘") {
  problem= "220849"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-医技系统维护") {
  problem= "219268"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-针式打印机") {
  problem= "220867"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
  problem= "219289"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-办公系统操作指导") {
  problem= "219379"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
  problem= "219287"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
  problem= "219195"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
  problem= "219261"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-扫描枪") {
  problem= "219199"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-腕带打印机") {
  problem= "220864"
 }else  if (bugdetData[2] ==  "前台工单-网络请求-网线整理") {
  problem= "241664"
 }else  if (bugdetData[2] ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
  problem= "219375"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-医保机具") {
  problem= "219205"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-文档数据类维护") {
  problem= "219263"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-LIS") {
  problem= "220370"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-复印打印一体机") {
  problem= "220861"
 }else  if (bugdetData[2] ==  "前台工单-门诊窗口值守") {
  problem= "219442"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-喷墨打印机") {
  problem= "220870"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-高拍仪") {
  problem= "219216"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-投影仪") {
  problem= "219207"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护-PACS") {
  problem= "220368"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-设备安装-第三方设备安装") {
  problem= "219240"
 }else  if (bugdetData[2] ==  "前台工单-软件-ICU系统") {
  problem= "100117"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-多功能卡") {
  problem= "219214"
 }else  if (bugdetData[2] ==  "前台工单-软件-营养筛查") {
  problem= "100126"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-医技系统安装") {
  problem= "219298"
 }else  if (bugdetData[2] ==  "前台工单-软件-EC") {
  problem= "100114"
 }else  if (bugdetData[2] ==  "前台工单-软件-OA") {
  problem= "100119"
 }else  if (bugdetData[2] ==  "前台工单-软件-职工平台") {
  problem= "100124"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-设备安装-扩展卡安装") {
  problem= "219238"
 }else  if (bugdetData[2] ==  "前台工单-软件-心电图") {
  problem= "100128"
 }else  if (bugdetData[2] ==  "前台工单-软件-移动护理") {
  problem= "100122"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-采集卡") {
  problem= "219211"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-PACS") {
  problem= "220372"
 }else  if (bugdetData[2] ==  "前台工单-软件-院内邮箱") {
  problem= "100123"
 }else  if (bugdetData[2] ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
  problem= "219292"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-外设-话筒") {
  problem= "219219"
 }else  if (bugdetData[2] ==  "前台工单-硬件新-设备安装-显卡安装") {
  problem= "219234"
  }else  if (bugdetData[2] ==  "前台工单-硬件新-打印机新-热敏打印机") {
  problem= "252901"
  }else  if (bugdetData[2] ==  "前台工单-网络请求-无法连接网络") {
  problem= "247733"
  }else  if (bugdetData[2] ==  "前台工单-咨询信息") {
  problem= "104783"
  }else  if (bugdetData[2] ==  "前台工单-网络请求-做网线") {
  problem= "247735"
  }else  if (bugdetData[2] ==  "前台工单-应用系统-系统维护") {
  problem= "219252"
  }else{

    ////console.log("未找到对应的故障ID");

   problem= ""
     }

 if (bugdetData[4] == "人/操作不当") {
 reason= "GZYY_1_2"
}else  if (bugdetData[4] == "人/操作咨询") {
  reason= "GZYY_1_3"
}else  if (bugdetData[4] == "人/人员使用故障") {
  reason= "GZYY_1_4"
}else  if (bugdetData[4] == "机/设备老化") {
  reason= "GZYY_2_1"
}else  if (bugdetData[4] == "机/稳定性不足") {
  reason= "GZYY_2_10"
}else  if (bugdetData[4] == "机/硬件损坏") {
  reason= "GZYY_2_6"
}else  if (bugdetData[4] == "机/安装系统") {
  reason= "GZYY_2_8"
}else  if (bugdetData[4] == "机/第三方系统") {
  reason= "GZYY_2_9"
}else  if (bugdetData[4] == "机/打印机安装") {
  reason= "GZYY_2_11"
}else  if (bugdetData[4] == "机/电脑安装") {
  reason= "GZYY_2_12"
}else  if (bugdetData[4] == "机/卡纸") {
  reason= "GZYY_2_13"
}else  if (bugdetData[4] == "机/硬件不兼容") {
  reason= "GZYY_2_14"
}else  if (bugdetData[4] == "机/其它设备安装") {
  reason= "GZYY_2_15"
}else  if (bugdetData[4] == "机/硬件故障") {
  reason= "GZYY_2_16"
}else  if (bugdetData[4] == "机/性能不足") {
  reason= "GZYY_2_2"
}else  if (bugdetData[4] == "机/质量问题") {
  reason= "GZYY_2_3"
}else  if (bugdetData[4] == "机/操作系统问题") {
  reason= "GZYY_2_4"
}else  if (bugdetData[4] == "机/软件故障") {
  reason= "GZYY_2_5"
}else  if (bugdetData[4] == "料/耗材问题") {
  reason= "GZYY_3_1"
}else  if (bugdetData[4] == "料/缺少运行组件") {
  reason= "GZYY_3_2"
}else  if (bugdetData[4] == "料/硬件不兼容") {
  reason= "GZYY_3_3"
}else  if (bugdetData[4] == "法/违背管理流程") {
  reason= "GZYY_4_1"
}else  if (bugdetData[4] == "环/软件运行环境") {
  reason= "GZYY_5_3"
}else  if (bugdetData[4] == "网络/网口开通") {
  reason= "GZYY_6_1"
}else  if (bugdetData[4] == "网络/网口/线路修复") {
  reason= "GZYY_6_2"
}else  if (bugdetData[4] == "网络/网络权限变更") {
  reason= "GZYY_6_4"
}else  if (bugdetData[4] == "网络/前台故障协助") {
  reason= "GZYY_6_5"
}else  if (bugdetData[4] == "应用系统/HIS") {
  reason= "GZYY_7_1"
}else  if (bugdetData[4] == "应用系统/LIS") {
  reason= "GZYY_7_2"
}else  if (bugdetData[4] == "应用系统/PACS") {
  reason= "GZYY_7_3"
}else  if (bugdetData[4] == "应用系统/三方应用系统") {
  reason= "GZYY_7_4"
}else  if (bugdetData[4] == "应用系统/医技") {
  reason= "GZYY_7_5"

//--------------------------复制的值匹配ID
  }else  if (bugdetData[4] == "操作不当") {
  reason= "GZYY_1_2"
}else  if (bugdetData[4] == "操作咨询") {
  reason= "GZYY_1_3"
}else  if (bugdetData[4] == "人员使用故障") {
  reason= "GZYY_1_4"
}else  if (bugdetData[4] == "设备老化") {
  reason= "GZYY_2_1"
}else  if (bugdetData[4] == "硬件损坏") {
  reason= "GZYY_2_6"
}else  if (bugdetData[4] == "安装系统") {
  reason= "GZYY_2_8"

}else  if (bugdetData[4] == "第三方系统") {
  reason= "GZYY_2_9"
}else  if (bugdetData[4] == "稳定性不足") {
  reason= "GZYY_2_10"
}else  if (bugdetData[4] == "打印机安装") {
  reason= "GZYY_2_11"
}else  if (bugdetData[4] == "电脑安装") {
  reason= "GZYY_2_12"
}else  if (bugdetData[4] == "卡纸") {
  reason= "GZYY_2_13"
}else  if (bugdetData[4] == "硬件不兼容") {
  reason= "GZYY_2_14"
}else  if (bugdetData[4] == "其它设备安装") {
  reason= "GZYY_2_15"
}else  if (bugdetData[4] == "硬件故障") {
  reason= "GZYY_2_16"
}else  if (bugdetData[4] == "性能不足") {
  reason= "GZYY_2_2"
}else  if (bugdetData[4] == "质量问题") {
  reason= "GZYY_2_3"
}else  if (bugdetData[4] == "操作系统问题") {
  reason= "GZYY_2_4"
}else  if (bugdetData[4] == "软件故障") {
  reason= "GZYY_2_5"
}else  if (bugdetData[4] == "耗材问题") {
  reason= "GZYY_3_1"
}else  if (bugdetData[4] == "缺少运行组件") {
  reason= "GZYY_3_2"
}else  if (bugdetData[4] == "硬件不兼容") {
  reason= "GZYY_3_3"
}else  if (bugdetData[4] == "违背管理流程") {
  reason= "GZYY_4_1"
}else  if (bugdetData[4] == "软件运行环境") {
  reason= "GZYY_5_3"
}else  if (bugdetData[4] == "网口开通") {
  reason= "GZYY_6_1"
}else  if (bugdetData[4] == "网口/线路修复") {
  reason= "GZYY_6_2"
}else  if (bugdetData[4] == "网络权限变更") {
  reason= "GZYY_6_4"
}else  if (bugdetData[4] == "前台故障协助") {
  reason= "GZYY_6_5"
}else  if (bugdetData[4] == "HIS") {
  reason= "GZYY_7_1"
}else  if (bugdetData[4] == "LIS") {
  reason= "GZYY_7_2"
}else  if (bugdetData[4] == "PACS") {
  reason= "GZYY_7_3"
}else  if (bugdetData[4] == "三方应用系统") {
  reason= "GZYY_7_4"
}else  if (bugdetData[4] == "医技") {
  reason= "GZYY_7_5"

  }else{

    ////console.log("未找到对应的故障ID");

   reason=""
     }

dataHtml += "<table id='table'>";
dataHtml += "<tbody>";
dataHtml +=     "<tr class='TALB table-fz' >";

dataHtml +=       "<td  class='FZ'style='width: 60px;' >";//添加适应div ，背景
dataHtml +=    "<input  class='G1' type=\"text\" readonly='readonly' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;' onclick=' this.select()' value=" + ( i+1 || '') + "   > </input>";

dataHtml +=     "</td>";

dataHtml +=      "<td class='TB'>";
dataHtml +=    "<input  class='A1' type=\"text\"  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()'  value=   " + (bugdetData[1] || '') + "  > </input>";
dataHtml +=     "</td>";
dataHtml +=     "<td class='TB'>";
dataHtml +=    "<input class='B1' type=\"text\"   name='abcd'  list='problem_list'  style='font-size:14px; width:250px;'  onclick=' this.select()' value=  " + (bugdetData[2] || '') + "  > </input>";

dataHtml +=              '<datalist id="problem_list">' ;
dataHtml +=              ' <option value="前台工单-应用系统-系统安装-办公软件安装"/>' ;
dataHtml +=              ' <option value="前台工单-应用系统-系统安装-操作系统安装"/>' ;
dataHtml +=              ' <option value="前台工单-应用系统-系统安装-HIS医生环境安装"/>' ;
dataHtml +=              ' <option value="前台工单-应用系统-系统维护-操作系统维护"/>' ;
dataHtml +=              ' <option value="前台工单-应用系统-系统维护-HIS医生环境维护"/>' ;
dataHtml +=              ' <option value="前台工单-网络请求-无法连接网络"/>' ;
dataHtml +=              ' <option value="前台工单-网络请求-网络权限变更"/>' ;
dataHtml +=              ' <option value="前台工单-网络请求-前台故障协助"/>' ;
dataHtml +=              ' <option value="前台工单-系统操作指导新-HIS医生操作指导"/>' ;
dataHtml +=              ' <option value="前台工单-系统操作指导新-HIS护士操作指导"/>' ;
dataHtml +=              ' <option value="前台工单-系统操作指导新-办公系统操作指导"/>' ;
dataHtml +=              ' <option value="前台工单-系统操作指导新-HIS药品类操作指导"/>' ;
dataHtml +=              ' <option value="前台工单-咨询信息"/>' ;
dataHtml +=              ' <option value="前台工单-软件-HIS"/>' ;
dataHtml +=              ' <option value="前台工单-软件-LIS"/>' ;
dataHtml +=              ' <option value="前台工单-软件-PACS"/>' ;
dataHtml +=              ' <option value="前台工单-软件-医保"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-外设-医保机具"/>' ;
dataHtml +=              ' <option value="信息中心-医保"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-打印机新-条码打印机"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-打印机新-热敏打印机"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-打印机新-激光黑白打印机"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-电脑-电脑主机"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-电脑-显示器"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-外设-刷卡器"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-外设-高拍仪"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-LED屏-LED呼叫屏"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-LED屏-LED信息显示屏"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-自助机-门诊自助机"/>' ;
dataHtml +=              ' <option value="前台工单-硬件新-自助机-住院查询结算类自助机"/>' ;
dataHtml +=              '</datalist>  ' ;
dataHtml +=              "<td class='BT'><input class='C1'  name='abcd'   style='font-size:14px; width:90px;' onclick=' this.select()'  readonly='readonly'  type=\"text\"  value=  " + (problem|| '') + "  ></td>"  ;
dataHtml +=              "<td class='BT'><input class='D1'  name='abcd'   style='font-size:14px; width:120px;' onclick=' this.select()'  type=\"text\" list='reason_list'    value=  " + (bugdetData[4] || '') + "  </td> "  ;
dataHtml +=             '<datalist id="reason_list">' ;
dataHtml +=              ' <option value="操作咨询"/>' ;
dataHtml +=              ' <option value="人员使用故障"/>' ;
dataHtml +=              ' <option value="硬件故障"/>' ;
dataHtml +=              ' <option value="稳定性不足"/>' ;
dataHtml +=              ' <option value="软件运行环境"/>' ;
dataHtml +=              ' <option value="操作系统问题"/>' ;
dataHtml +=              ' <option value="打印机安装"/>' ;
dataHtml +=              ' <option value="电脑安装"/>' ;
dataHtml +=              ' <option value="网络权限变更"/>' ;
dataHtml +=              ' <option value="前台故障协助"/>' ;
dataHtml +=              ' <option value="网口/线路修复"/>' ;
dataHtml +=              ' <option value="HIS"/>' ;
dataHtml +=              ' <option value="LIS"/>' ;
dataHtml +=              ' <option value="三方应用系统"/>' ;
dataHtml +=              '</datalist>  ' ;

dataHtml +=               "<td class='BT'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;'  onclick=' this.select()' readonly='readonly'   type=\"text\"  value=  " + (  reason || '') + " > </input></td>";
dataHtml +=              "<td class='BT'><input class='K1'  name='abcd'  style='font-size:14px; width:80px;'  onclick=' this.select()' type=\"text\" list='location' value= " + (bugdetData[6] || '') + " >  </td> " ;
dataHtml +=               '<datalist id="location">' ;
dataHtml +=               ' <option value="医生站"/>' ;
dataHtml +=               ' <option value="护士站"/>' ;
dataHtml +=               ' <option value="药剂"/>' ;
dataHtml +=               ' <option value="财务"/>' ;
dataHtml +=               ' <option value="其他"/>' ;
dataHtml +=               '</datalist>  ' ;
dataHtml +=     "<td class='BT'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;'  onclick=' this.select()' type=\"text\"  value= " + (bugdetData[7] || '') + " ></input></td>";
dataHtml +=     "<td class='BT'><input  class='J1'  name='abcd'  style='font-size:14px; width:120px;'  onclick=' this.select()' type=\"text\"  value=" + (bugdetData[8] || '') + " > </input></td>" ;

dataHtml +=     "<td class='BT'><a  class='removeclass' ><input  class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td></tr></tbody></table>";

           }

   }

  $('#tableks22').before(dataHtml);

$(".B1").change(function() {

 var ttt =   $(this).val();
 //if ($(this).text() == "前台工单-应用系统-系统维护-操作系统维护") {
 if ( ttt == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单

   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
   $(this).parent().parent().find('.C1').val("220879");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医生操作指导") {
   $(this).parent().parent().find('.C1').val("219369");
 }else  if ( ttt ==  "前台工单-软件-EMR") {
   $(this).parent().parent().find('.C1').val("100115");
 }else  if ( ttt ==  "前台工单-服务请求新-配置") {
   $(this).parent().parent().find('.C1').val("228736");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-条码打印机") {
   $(this).parent().parent().find('.C1').val("220873");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-电脑主机") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-硬件新-电脑") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
   $(this).parent().parent().find('.C1').val("219377");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS护士操作指导") {
   $(this).parent().parent().find('.C1').val("224658");
 }else  if ( ttt ==  "前台工单-网络请求-网络权限变更") {
   $(this).parent().parent().find('.C1').val("114201");
 }else  if ( ttt ==  "前台工单-软件-自助打印") {
   $(this).parent().parent().find('.C1').val("100129");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA 网络") {
   $(this).parent().parent().find('.C1').val("219057");
 }else  if ( ttt ==  "前台工单-网络请求-前台故障协助") {
   $(this).parent().parent().find('.C1').val("156062");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA硬件") {
   $(this).parent().parent().find('.C1').val("219028");
 }else  if ( ttt ==  "前台工单-软件-院内网") {
   $(this).parent().parent().find('.C1').val("100125");
 }else  if ( ttt ==  "前台工单-网络请求-网口/线路修复") {
   $(this).parent().parent().find('.C1').val("113814");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
   $(this).parent().parent().find('.C1').val("220876");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
   $(this).parent().parent().find('.C1').val("219254");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA其它") {
   $(this).parent().parent().find('.C1').val("219061");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
   $(this).parent().parent().find('.C1').val("219186");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-电脑安装") {
   $(this).parent().parent().find('.C1').val("219230");
 }else  if ( ttt ==  "前台工单-服务请求新-硬件服务") {
   $(this).parent().parent().find('.C1').val("219350");
 }else  if ( ttt ==  "前台工单-服务请求新-软件服务") {
   $(this).parent().parent().find('.C1').val("219348");
 }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
   $(this).parent().parent().find('.C1').val("220885");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-显示器") {
   $(this).parent().parent().find('.C1').val("220843");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-门诊自助机") {
   $(this).parent().parent().find('.C1').val("219183");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
   $(this).parent().parent().find('.C1').val("219193");
 }else  if ( ttt ==  "前台工单-硬件新-外设-刷卡器") {
   $(this).parent().parent().find('.C1').val("219201");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
   $(this).parent().parent().find('.C1').val("219257");
 }else  if ( ttt ==  "前台工单-软件-LIS") {
   $(this).parent().parent().find('.C1').val("100118");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-第三方系统维护") {
   $(this).parent().parent().find('.C1').val("219270");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
   $(this).parent().parent().find('.C1').val("220894");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-打印机安装") {
   $(this).parent().parent().find('.C1').val("219232");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
   $(this).parent().parent().find('.C1').val("219373");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
   $(this).parent().parent().find('.C1').val("219371");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-操作系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-硬件新-外设-其它外设设备") {
   $(this).parent().parent().find('.C1').val("219221");
 }else  if ( ttt ==  "前台工单-服务请求新-上锦卡同步") {
   $(this).parent().parent().find('.C1').val("228727");
 }else  if ( ttt ==  "前台工单-网络请求-网点新增") {
   $(this).parent().parent().find('.C1').val("113812");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-LIS") {
   $(this).parent().parent().find('.C1').val("220365");
 }else  if ( ttt ==  "前台工单-软件-PACS") {
   $(this).parent().parent().find('.C1').val("100120");
 }else  if ( ttt ==  "前台工单-需求") {
   $(this).parent().parent().find('.C1').val("104439");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-操作系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
  }else  if ( ttt ==  "前台工单-应用系统-系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-鼠标") {
   $(this).parent().parent().find('.C1').val("220852");
 }else  if ( ttt ==  "前台工单-软件-应用故障协助") {
   $(this).parent().parent().find('.C1').val("130202");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
   $(this).parent().parent().find('.C1').val("219285");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
   $(this).parent().parent().find('.C1').val("220888");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
   $(this).parent().parent().find('.C1').val("219259");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-办公软件维护") {
   $(this).parent().parent().find('.C1').val("219266");
 }else  if ( ttt ==  "前台工单-服务请求新-PACS重发") {
   $(this).parent().parent().find('.C1').val("228725");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-服务请求新-耗材配送") {
   $(this).parent().parent().find('.C1').val("219346");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA HIS") {
   $(this).parent().parent().find('.C1').val("219059");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
   $(this).parent().parent().find('.C1').val("220891");
 }else  if ( ttt ==  "前台工单-软件-排队叫号") {
   $(this).parent().parent().find('.C1').val("100121");
 }else  if ( ttt ==  "前台工单-服务请求新-解锁") {
   $(this).parent().parent().find('.C1').val("228729");
 }else  if ( ttt ==  "前台工单-硬件新-外设-POS机具") {
   $(this).parent().parent().find('.C1').val("219203");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-办公软件安装") {
   $(this).parent().parent().find('.C1').val("219296");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
   $(this).parent().parent().find('.C1').val("220882");
 }else  if ( ttt ==  "前台工单-网络请求-零星布线") {
   $(this).parent().parent().find('.C1').val("113971");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-键盘") {
   $(this).parent().parent().find('.C1').val("220849");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-医技系统维护") {
   $(this).parent().parent().find('.C1').val("219268");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-针式打印机") {
   $(this).parent().parent().find('.C1').val("220867");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
   $(this).parent().parent().find('.C1').val("219289");
 }else  if ( ttt ==  "前台工单-系统操作指导新-办公系统操作指导") {
   $(this).parent().parent().find('.C1').val("219379");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
   $(this).parent().parent().find('.C1').val("219287");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
   $(this).parent().parent().find('.C1').val("219195");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
   $(this).parent().parent().find('.C1').val("219261");
 }else  if ( ttt ==  "前台工单-硬件新-外设-扫描枪") {
   $(this).parent().parent().find('.C1').val("219199");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-腕带打印机") {
   $(this).parent().parent().find('.C1').val("220864");
 }else  if ( ttt ==  "前台工单-网络请求-网线整理") {
   $(this).parent().parent().find('.C1').val("241664");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
   $(this).parent().parent().find('.C1').val("219375");
 }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-文档数据类维护") {
   $(this).parent().parent().find('.C1').val("219263");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-LIS") {
   $(this).parent().parent().find('.C1').val("220370");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-复印打印一体机") {
   $(this).parent().parent().find('.C1').val("220861");
 }else  if ( ttt ==  "前台工单-门诊窗口值守") {
   $(this).parent().parent().find('.C1').val("219442");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-喷墨打印机") {
   $(this).parent().parent().find('.C1').val("220870");
 }else  if ( ttt ==  "前台工单-硬件新-外设-高拍仪") {
   $(this).parent().parent().find('.C1').val("219216");
 }else  if ( ttt ==  "前台工单-硬件新-外设-投影仪") {
   $(this).parent().parent().find('.C1').val("219207");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-PACS") {
   $(this).parent().parent().find('.C1').val("220368");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-第三方设备安装") {
   $(this).parent().parent().find('.C1').val("219240");
 }else  if ( ttt ==  "前台工单-软件-ICU系统") {
   $(this).parent().parent().find('.C1').val("100117");
 }else  if ( ttt ==  "前台工单-硬件新-外设-多功能卡") {
   $(this).parent().parent().find('.C1').val("219214");
 }else  if ( ttt ==  "前台工单-软件-营养筛查") {
   $(this).parent().parent().find('.C1').val("100126");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-医技系统安装") {
   $(this).parent().parent().find('.C1').val("219298");
 }else  if ( ttt ==  "前台工单-软件-EC") {
   $(this).parent().parent().find('.C1').val("100114");
 }else  if ( ttt ==  "前台工单-软件-OA") {
   $(this).parent().parent().find('.C1').val("100119");
 }else  if ( ttt ==  "前台工单-软件-职工平台") {
   $(this).parent().parent().find('.C1').val("100124");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-扩展卡安装") {
   $(this).parent().parent().find('.C1').val("219238");
 }else  if ( ttt ==  "前台工单-软件-心电图") {
   $(this).parent().parent().find('.C1').val("100128");
 }else  if ( ttt ==  "前台工单-软件-移动护理") {
   $(this).parent().parent().find('.C1').val("100122");
 }else  if ( ttt ==  "前台工单-硬件新-外设-采集卡") {
   $(this).parent().parent().find('.C1').val("219211");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-PACS") {
   $(this).parent().parent().find('.C1').val("220372");
 }else  if ( ttt ==  "前台工单-软件-院内邮箱") {
   $(this).parent().parent().find('.C1').val("100123");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
   $(this).parent().parent().find('.C1').val("219292");
 }else  if ( ttt ==  "前台工单-硬件新-外设-话筒") {
   $(this).parent().parent().find('.C1').val("219219");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-显卡安装") {
   $(this).parent().parent().find('.C1').val("219234");
  }else  if ( ttt ==  "前台工单-硬件新-打印机新-热敏打印机") {
   $(this).parent().parent().find('.C1').val("252901");
  }else  if ( ttt ==  "前台工单-网络请求-无法连接网络") {
   $(this).parent().parent().find('.C1').val("247733");
  }else  if ( ttt ==  "前台工单-咨询信息") {
   $(this).parent().parent().find('.C1').val("104783");
  }else  if ( ttt ==  "前台工单-网络请求-做网线") {
   $(this).parent().parent().find('.C1').val("247735");
  }else  if ( ttt ==  "前台工单-应用系统-系统维护") {
   $(this).parent().parent().find('.C1').val("219252" );
  }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
  }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
  }else  if ( ttt ==  "信息中心-医保") {
   $(this).parent().parent().find('.C1').val("1408533");

  }else{

    ////console.log("未找到对应的故障ID");

    $(this).parent().parent().find('.C1').val("");
     }

  });

$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();

 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");

//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");

}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");

  }else{

    ////console.log("未找到对应的故障ID");

    $(this).parent().parent().find('.E1').val("");
     }

    });

$(".FZ:last").find("input").focus();

 $(document).on("click",".removeclass",function(){

 $(this).parent().parent().parent().remove();

return false;
})

};
}

function download() {
   let arrt = [],
    sequence = 1;
       ////console.log(`正在导出数据`);
    $('.TALB').each(function (index, item) {

          let title = $(this).find('.G1').val(),
              title1 = $(this).find('.A1').val(),
              title2 = $(this).find('.B1').val(),
              title3 = $(this).find('.C1').val(),
              title4 = $(this).find('.D1').val(),
              title5 = $(this).find('.E1').val(),
              title6 = $(this).find('.K1').val(),
              time = $(this).find('.F1').val(),
              title7 = $(this).find('.J1').val();
        arrt.push({'title': title,'title1': title1,'title2': title2,'title3': title3,'title4': title4,'title5': title5,'title6': title6,'time': time,'title7': title7});

        sequence++;
    });
   ////console.log(arrt)

    ////console.log(`正在导出数据`);
    //列标题，逗号隔开，每一个逗号就是隔开一个单元格
    let str = `序号,故障描述,故障分类,故障 ID,故障原因,故障原因ID,发生地点,处理过程,事件原因\n`;
    //增加\t为了不让表格显示科学计数法或者其他格式
    for (let i = 0; i < arrt.length; i++) {
        for (let item in arrt[i]) {
            str += `${arrt[i][item]},`;
        }
        str += '\n';
    }
    //encodeURIComponent解决中文乱码
    let uri = 'data:text/csv;charset=utf-8,\ufeff' + encodeURIComponent(str);
    //通过创建a标签实现
    let link = document.createElement("a");
   link.href = uri;
    //对下载的文件命名
    link.download = "工单设置导出.csv";
    document.body.appendChild(link);
    link.click();
    document.body.removeChild(link);

  }

function qk() {
    if (confirm("确定清空所有工单设置吗?")) {
        mr1 = [].concat(settingData.A); //备份工单信息，可以恢复，防止误删
        mr2 = [].concat(settingData.B);
        mr3 = [].concat(settingData.C);
        mr4 = [].concat(settingData.D);
        mr5 = [].concat(settingData.E);
        mr6 = [].concat(settingData.F);
        mr7 = [].concat(settingData.G);
        $('#tableks>#table').remove(); //清空工单
        $('#tableks>#table_xz').remove(); //清空XZ模板工单

        $('#tableks>#table_mz').remove(); //清空导入的门诊模板工单
        $('#tableks>#table_yb').remove(); //清空导入的医保药房模板工单
        $('#tableks>#table_zy').remove(); //清空导入的住院模板工单
        $('#tableks>.TALB.table-fz').remove(); //清空粘贴导入的工单
        ////console.log("清空所有工单");
    }
    return false;
}

function btnsaveSetting() {  //保存  工单信息

    var oldEdit = document.querySelector("#jiazai");//验证是否已点击

    if(oldEdit){
    }else{
        var table = document.createElement("div");
        table.id = "jiazai";
        table.style.cssText ="position: absolute;" +
            "z-index:999;" +
            "left: 340px;" +
            "opacity:.50;" +
            "height: 80%;" +
            "width: 80%;" +
            "background-color: rgb(200, 200, 200);" +
            "padding: 2px;";

          var table1 =

          "<span id='tz' style='padding: 105px 100px 100px 400px; font-size:48px;  fontWeight:bold; color:#000;  '  >保存中......</span> &nbsp;&nbsp;&nbsp;" +
          "</br>" +
     // "<span id='tz' style='padding: 105px 100px 100px 300px; font-size:38px;  fontWeight:bold; color:#000;  '  >请等待脚本判断和保存完成</span> &nbsp;&nbsp;&nbsp;" +
             "";
       table.innerHTML = table1;
      $("#tableks").before(table);
   }

setTimeout(function () {//等待 保存中 框出来之后在保存
    var userSetting = GM_getValue("study_userData");
    var AAA = [];
    var BBB = [];
    var CCC = [];
    var DDD = [];
    var EEE = [];
    var FFF = [];
    var GGG = [];
    var KKK = [];
    var JJJ = [];

let el = $(".G1");
let elObj = {};
for(var i=1; i<el.length+1;i++){
  GGG.push(i);

}

     let arrtt = [],
         quence = 0;
  //  console.log(`正在保存数据`);
    $('.TALB').each(function (index, item) {
          let title = $(this).find('.G1').val(),
              title1 = $(this).find('.A1').val(),
              title2 = $(this).find('.B1').val(),
              title3 = $(this).find('.C1').val(),
              title4 = $(this).find('.D1').val(),
              title5 = $(this).find('.E1').val(),
              title6 = $(this).find('.K1').val(),
              time = $(this).find('.F1').val(),
              title7 = $(this).find('.J1').val();

       if(title1== ""||title1== " "||title1== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
         $("input[name='abcd'].A1")[quence].focus();
	      $(this).parent().find('.A1').css({"border-color":"red"});

           window.localStorage.setItem("kz", 1);
         	return false;
			}else{
           window.localStorage.removeItem('kz');
              }
      if(title2== ""||title2== " "||title2== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
          $("input[name='abcd'].B1")[quence].focus();
	      $(this).parent().find('.B1').css({"border-color":"red"});

         window.localStorage.setItem("kz", 1);
        	return false;
			}else{
           window.localStorage.removeItem('kz');
              }

            if(title3== ""||title3== " "||title3== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
             $("input[name='abcd'].C1")[quence].focus();
           $(this).parent().find('.B1').css({"border-color":"red"});

	      $(this).parent().find('.C1').css({"border-color":"red"});

            window.localStorage.setItem("kz", 1);
              return false;
			}else{
           window.localStorage.removeItem('kz');
              }

            if(title4== ""||title4== " "||title4== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
             $("input[name='abcd'].D1")[quence].focus();
	      $(this).parent().find('.D1').css({"border-color":"red"});

            window.localStorage.setItem("kz", 1);
              return false;
			}else{
           window.localStorage.removeItem('kz');
              }

            if(title5== ""||title5== " "||title5== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
              $("input[name='abcd'].E1")[quence].focus();
          $(this).parent().find('.D1').css({"border-color":"red"});

	      $(this).parent().find('.E1').css({"border-color":"red"});

            window.localStorage.setItem("kz", 1);
              return false;
			}else{
           window.localStorage.removeItem('kz');
              }

            if(time== ""||time== " "||time== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
               $("input[name='abcd'].F1")[quence].focus();
	      $(this).parent().find('.F1').css({"border-color":"red"});

           window.localStorage.setItem("kz", 1);
              return false;
			}else{
           window.localStorage.removeItem('kz');
              }

           if(title6== ""||title6== " "||title6== "null"){
              $('#jiazai').remove();     //清空工单
           alert("亲，工单设置的值不能为空或空格，请检查")
               $("input[name='abcd'].K1")[quence].focus();
	      $(this).parent().find('.K1').css({"border-color":"red"});

           window.localStorage.setItem("kz", 1);
              return false;
			}else{
           window.localStorage.removeItem('kz');
              }

        quence++;
    });

 if (localStorage.getItem("kz") != null) {
    } else{

    let arrt = [],
    sequence = 1;
       //console.log(`正在保存数据`);
    $('.TALB').each(function (index, item) {

          let title = $(this).find('.G1').val(),
              title1 = $(this).find('.A1').val(),
              title2 = $(this).find('.B1').val(),
              title3 = $(this).find('.C1').val(),
              title4 = $(this).find('.D1').val(),
              title5 = $(this).find('.E1').val(),
              title6 = $(this).find('.K1').val(),
              title7 = $(this).find('.J1').val(),
              time = $(this).find('.F1').val();

        arrt.push({'title': title,'title1': title1,'title2': title2,'title3': title3,'title4': title4,'title5': title5,'title6': title6,'time': time,'title7': title7});

      AAA.push(title1);
      BBB.push(title2);
      CCC.push(title3);
      DDD.push(title4);
      EEE.push(title5);
      FFF.push(time);
      KKK.push(title6);
      JJJ.push(title7);

        sequence++;
    });
 //   console.log(arrt)

    settingData.A = [].concat(AAA);
    settingData.B = [].concat(BBB);
    settingData.C = [].concat(CCC);
    settingData.D = [].concat(DDD);
    settingData.E = [].concat(EEE);
    settingData.F = [].concat(FFF);
    settingData.G = [].concat(GGG);
    settingData.K = [].concat(KKK);
    settingData.J = [].concat(JJJ);
  GM_setValue("study_userData", settingData);
   //console.log(GM_getValue("study_userData"));
   //
      $("#locationMenuSave2", document).click();
        setTimeout(function () {
            window.location.reload();
          // $("#shezhi",top.document).click();

        }, 100);

  }

  }, 100);

  }

function closeMenu2() {
    var oldEditBox = document.querySelector("#setMenu");
    if (oldEditBox) {
        oldEditBox.parentNode.removeChild(oldEditBox);
        return;
    }
    var oldEditBox2 = document.querySelector("#rwl-setMenu");
    if (oldEditBox2) {
        if ($("#setMenu").css("display") == "none") {} else {
            $("#setMenu").hide();
        }
        return;
    }
}

function xzSetting() {
  for(var u=0; u<1; u++){
     var table = document.createElement("table");
        table.id = "table_xz";
          var table1 =
            "<tr class='TALB' style='padding: 4px 10px;' >" +
            "<td class='BT'><input  class='G1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value=''> </input></td>" +
            "<td class='centerXZ'><input  class='A1'  name='abcd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value=''> </input></td>" +
            "<td class='BT'><input  class='B1'  name='abcd'   style='font-size:14px; width:250px;' onclick=' this.select()' type=\"text\" list='problem_list' placeholder='请选择故障分类'  value='' ></td> " +
              '<datalist id="problem_list">' +
              ' <option value="前台工单-应用系统-系统安装-办公软件安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-操作系统安装"/>' +
              ' <option value="前台工单-应用系统-系统安装-HIS医生环境安装"/>' +
              ' <option value="前台工单-应用系统-系统维护-操作系统维护"/>' +
              ' <option value="前台工单-应用系统-系统维护-HIS医生环境维护"/>' +
              ' <option value="前台工单-网络请求-无法连接网络"/>' +
              ' <option value="前台工单-网络请求-网络权限变更"/>' +
              ' <option value="前台工单-网络请求-前台故障协助"/>' +
              ' <option value="前台工单-系统操作指导新-HIS医生操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS护士操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-办公系统操作指导"/>' +
              ' <option value="前台工单-系统操作指导新-HIS药品类操作指导"/>' +
              ' <option value="前台工单-咨询信息"/>' +
              ' <option value="前台工单-软件-HIS"/>' +
              ' <option value="前台工单-软件-LIS"/>' +
              ' <option value="前台工单-软件-PACS"/>' +
              ' <option value="前台工单-软件-医保"/>' +
              ' <option value="前台工单-硬件新-外设-医保机具"/>' +
              ' <option value="信息中心-医保"/>' +
              ' <option value="前台工单-硬件新-打印机新-条码打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-热敏打印机"/>' +
              ' <option value="前台工单-硬件新-打印机新-激光黑白打印机"/>' +
              ' <option value="前台工单-硬件新-电脑-电脑主机"/>' +
              ' <option value="前台工单-硬件新-电脑-显示器"/>' +
              ' <option value="前台工单-硬件新-外设-刷卡器"/>' +
              ' <option value="前台工单-硬件新-外设-高拍仪"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED呼叫屏"/>' +
              ' <option value="前台工单-硬件新-LED屏-LED信息显示屏"/>' +
              ' <option value="前台工单-硬件新-自助机-门诊自助机"/>' +
              ' <option value="前台工单-硬件新-自助机-住院查询结算类自助机"/>' +
              '</datalist>  ' +
            "<td class='BT'><input class='C1'  name='abcd'   style='font-size:14px; width:80px;'  onclick=' this.select()' readonly='readonly'  type=\"text\"  value=''  ></td>" +
            "<td class='BT'><input class='D1'  name='abcd'   style='font-size:14px; width:110px;' onclick=' this.select()'  type=\"text\" list='reason_list' placeholder='请选择故障原因'  value=''  >  </td> " +
             '<datalist id="reason_list">' +
              ' <option value="操作咨询"/>' +
              ' <option value="人员使用故障"/>' +
              ' <option value="硬件故障"/>' +
              ' <option value="稳定性不足"/>' +
              ' <option value="软件运行环境"/>' +
              ' <option value="操作系统问题"/>' +
              ' <option value="打印机安装"/>' +
              ' <option value="电脑安装"/>' +
              ' <option value="网络权限变更"/>' +
              ' <option value="前台故障协助"/>' +
              ' <option value="网口/线路修复"/>' +
              ' <option value="HIS"/>' +
              ' <option value="LIS"/>' +
              ' <option value="三方应用系统"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;' onclick=' this.select()'  readonly='readonly'   type=\"text\"  value=''  > </input></td>" +
             "<td class='BT'><input class='K1'  name='abcd'  style='font-size:14px; width:80px;' onclick=' this.select()'  type=\"text\" list='location'    >  </td> " +
              '<datalist id="location">' +
              ' <option value="医生站"/>' +
              ' <option value="护士站"/>' +
              ' <option value="药剂"/>' +
              ' <option value="财务"/>' +
              ' <option value="其他"/>' +
              '</datalist>  ' +
            "<td class='BT'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;' onclick=' this.select()' type=\"text\"  value='' > </input></td>" +
            "<td class='BT'><input  class='J1'  name='abcd'  style='font-size:14px; width:80px;' onclick=' this.select()'  type=\"text\"  value='' > </input></td>" +
            "<td class='BT'><a  class='removeclass' ><input  class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#tableks22").before(table);
      }

   let el = $(".G1");
    var hhh = [];
    for(var i=0; i<el.length+1;i++){
      hhh.push(i);
           $(".G1").eq(i).val(i+1);
        }

  $(".centerXZ:last").find("input").focus();
  $(document).on("click",".removeclass",function(){
  $(this).parent().parent().parent().remove();
return false;
})

$(".B1").change(function() {
 var ttt =   $(this).val();
 //if ($(this).text() == "前台工单-应用系统-系统维护-操作系统维护") {
 if ( ttt == "前台工单-应用系统-系统维护-操作系统维护") { //判断 是否有待处理工单
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-激光黑白打印机") {
   $(this).parent().parent().find('.C1').val("220879");
 }else  if ( ttt ==  "前台工单-软件-HIS") {
   $(this).parent().parent().find('.C1').val("100116");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医生操作指导") {
   $(this).parent().parent().find('.C1').val("219369");
 }else  if ( ttt ==  "前台工单-软件-EMR") {
   $(this).parent().parent().find('.C1').val("100115");
 }else  if ( ttt ==  "前台工单-服务请求新-配置") {
   $(this).parent().parent().find('.C1').val("228736");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-条码打印机") {
   $(this).parent().parent().find('.C1').val("220873");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-电脑主机") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-硬件新-电脑") {
   $(this).parent().parent().find('.C1').val("219081");
 }else  if ( ttt ==  "前台工单-系统操作指导新-其它HIS类操作指导") {
   $(this).parent().parent().find('.C1').val("219377");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS护士操作指导") {
   $(this).parent().parent().find('.C1').val("224658");
 }else  if ( ttt ==  "前台工单-网络请求-网络权限变更") {
   $(this).parent().parent().find('.C1').val("114201");
 }else  if ( ttt ==  "前台工单-软件-自助打印") {
   $(this).parent().parent().find('.C1').val("100129");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA 网络") {
   $(this).parent().parent().find('.C1').val("219057");
 }else  if ( ttt ==  "前台工单-网络请求-前台故障协助") {
   $(this).parent().parent().find('.C1').val("156062");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA硬件") {
   $(this).parent().parent().find('.C1').val("219028");
 }else  if ( ttt ==  "前台工单-软件-院内网") {
   $(this).parent().parent().find('.C1').val("100125");
 }else  if ( ttt ==  "前台工单-网络请求-网口/线路修复") {
   $(this).parent().parent().find('.C1').val("113814");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-彩色激光打印机") {
   $(this).parent().parent().find('.C1').val("220876");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS医生环境维护") {
   $(this).parent().parent().find('.C1').val("219254");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA其它") {
   $(this).parent().parent().find('.C1').val("219061");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-住院查询结算类自助机") {
   $(this).parent().parent().find('.C1').val("219186");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-电脑安装") {
   $(this).parent().parent().find('.C1').val("219230");
 }else  if ( ttt ==  "前台工单-服务请求新-硬件服务") {
   $(this).parent().parent().find('.C1').val("219350");
 }else  if ( ttt ==  "前台工单-服务请求新-软件服务") {
   $(this).parent().parent().find('.C1').val("219348");
 }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车网络") {
   $(this).parent().parent().find('.C1').val("220885");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-显示器") {
   $(this).parent().parent().find('.C1').val("220843");
 }else  if ( ttt ==  "前台工单-硬件新-自助机-门诊自助机") {
   $(this).parent().parent().find('.C1').val("219183");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED呼叫屏") {
   $(this).parent().parent().find('.C1').val("219193");
 }else  if ( ttt ==  "前台工单-硬件新-外设-刷卡器") {
   $(this).parent().parent().find('.C1').val("219201");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS护士环境维护") {
   $(this).parent().parent().find('.C1').val("219257");
 }else  if ( ttt ==  "前台工单-软件-LIS") {
   $(this).parent().parent().find('.C1').val("100118");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-第三方系统维护") {
   $(this).parent().parent().find('.C1').val("219270");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车硬件") {
   $(this).parent().parent().find('.C1').val("220894");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-打印机安装") {
   $(this).parent().parent().find('.C1').val("219232");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS费用类操作指导") {
   $(this).parent().parent().find('.C1').val("219373");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS药品类操作指导") {
   $(this).parent().parent().find('.C1').val("219371");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-操作系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
 }else  if ( ttt ==  "前台工单-硬件新-外设-其它外设设备") {
   $(this).parent().parent().find('.C1').val("219221");
 }else  if ( ttt ==  "前台工单-服务请求新-上锦卡同步") {
   $(this).parent().parent().find('.C1').val("228727");
 }else  if ( ttt ==  "前台工单-网络请求-网点新增") {
   $(this).parent().parent().find('.C1').val("113812");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-LIS") {
   $(this).parent().parent().find('.C1').val("220365");
 }else  if ( ttt ==  "前台工单-软件-PACS") {
   $(this).parent().parent().find('.C1').val("100120");
 }else  if ( ttt ==  "前台工单-需求") {
   $(this).parent().parent().find('.C1').val("104439");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-操作系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
  }else  if ( ttt ==  "前台工单-应用系统-系统安装") {
   $(this).parent().parent().find('.C1').val("219283");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-鼠标") {
   $(this).parent().parent().find('.C1').val("220852");
 }else  if ( ttt ==  "前台工单-软件-应用故障协助") {
   $(this).parent().parent().find('.C1').val("130202");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS医生环境安装") {
   $(this).parent().parent().find('.C1').val("219285");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车系统") {
   $(this).parent().parent().find('.C1').val("220888");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS费用类环境维护") {
   $(this).parent().parent().find('.C1').val("219259");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-办公软件维护") {
   $(this).parent().parent().find('.C1').val("219266");
 }else  if ( ttt ==  "前台工单-服务请求新-PACS重发") {
   $(this).parent().parent().find('.C1').val("228725");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-第三方系统安装") {
   $(this).parent().parent().find('.C1').val("219301");
 }else  if ( ttt ==  "前台工单-服务请求新-耗材配送") {
   $(this).parent().parent().find('.C1').val("219346");
 }else  if ( ttt ==  "前台工单-硬件新-PDA-PDA HIS") {
   $(this).parent().parent().find('.C1').val("219059");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车HIS") {
   $(this).parent().parent().find('.C1').val("220891");
 }else  if ( ttt ==  "前台工单-软件-排队叫号") {
   $(this).parent().parent().find('.C1').val("100121");
 }else  if ( ttt ==  "前台工单-服务请求新-解锁") {
   $(this).parent().parent().find('.C1').val("228729");
 }else  if ( ttt ==  "前台工单-硬件新-外设-POS机具") {
   $(this).parent().parent().find('.C1').val("219203");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-办公软件安装") {
   $(this).parent().parent().find('.C1').val("219296");
 }else  if ( ttt ==  "前台工单-硬件新-移动查房车-移动查房车其它") {
   $(this).parent().parent().find('.C1').val("220882");
 }else  if ( ttt ==  "前台工单-网络请求-零星布线") {
   $(this).parent().parent().find('.C1').val("113971");
 }else  if ( ttt ==  "前台工单-硬件新-电脑-键盘") {
   $(this).parent().parent().find('.C1').val("220849");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-医技系统维护") {
   $(this).parent().parent().find('.C1').val("219268");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-针式打印机") {
   $(this).parent().parent().find('.C1').val("220867");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS费用类环境安装") {
   $(this).parent().parent().find('.C1').val("219289");
 }else  if ( ttt ==  "前台工单-系统操作指导新-办公系统操作指导") {
   $(this).parent().parent().find('.C1').val("219379");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS护士环境安装") {
   $(this).parent().parent().find('.C1').val("219287");
 }else  if ( ttt ==  "前台工单-硬件新-LED屏-LED信息显示屏") {
   $(this).parent().parent().find('.C1').val("219195");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-HIS药品类环境维护") {
   $(this).parent().parent().find('.C1').val("219261");
 }else  if ( ttt ==  "前台工单-硬件新-外设-扫描枪") {
   $(this).parent().parent().find('.C1').val("219199");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-腕带打印机") {
   $(this).parent().parent().find('.C1').val("220864");
 }else  if ( ttt ==  "前台工单-网络请求-网线整理") {
   $(this).parent().parent().find('.C1').val("241664");
 }else  if ( ttt ==  "前台工单-系统操作指导新-HIS医技类操作指导") {
   $(this).parent().parent().find('.C1').val("219375");
 }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-文档数据类维护") {
   $(this).parent().parent().find('.C1').val("219263");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-LIS") {
   $(this).parent().parent().find('.C1').val("220370");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-复印打印一体机") {
   $(this).parent().parent().find('.C1').val("220861");
 }else  if ( ttt ==  "前台工单-门诊窗口值守") {
   $(this).parent().parent().find('.C1').val("219442");
 }else  if ( ttt ==  "前台工单-硬件新-打印机新-喷墨打印机") {
   $(this).parent().parent().find('.C1').val("220870");
 }else  if ( ttt ==  "前台工单-硬件新-外设-高拍仪") {
   $(this).parent().parent().find('.C1').val("219216");
 }else  if ( ttt ==  "前台工单-硬件新-外设-投影仪") {
   $(this).parent().parent().find('.C1').val("219207");
 }else  if ( ttt ==  "前台工单-应用系统-系统维护-PACS") {
   $(this).parent().parent().find('.C1').val("220368");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-第三方设备安装") {
   $(this).parent().parent().find('.C1').val("219240");
 }else  if ( ttt ==  "前台工单-软件-ICU系统") {
   $(this).parent().parent().find('.C1').val("100117");
 }else  if ( ttt ==  "前台工单-硬件新-外设-多功能卡") {
   $(this).parent().parent().find('.C1').val("219214");
 }else  if ( ttt ==  "前台工单-软件-营养筛查") {
   $(this).parent().parent().find('.C1').val("100126");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-医技系统安装") {
   $(this).parent().parent().find('.C1').val("219298");
 }else  if ( ttt ==  "前台工单-软件-EC") {
   $(this).parent().parent().find('.C1').val("100114");
 }else  if ( ttt ==  "前台工单-软件-OA") {
   $(this).parent().parent().find('.C1').val("100119");
 }else  if ( ttt ==  "前台工单-软件-职工平台") {
   $(this).parent().parent().find('.C1').val("100124");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-扩展卡安装") {
   $(this).parent().parent().find('.C1').val("219238");
 }else  if ( ttt ==  "前台工单-软件-心电图") {
   $(this).parent().parent().find('.C1').val("100128");
 }else  if ( ttt ==  "前台工单-软件-移动护理") {
   $(this).parent().parent().find('.C1').val("100122");
 }else  if ( ttt ==  "前台工单-硬件新-外设-采集卡") {
   $(this).parent().parent().find('.C1').val("219211");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-PACS") {
   $(this).parent().parent().find('.C1').val("220372");
 }else  if ( ttt ==  "前台工单-软件-院内邮箱") {
   $(this).parent().parent().find('.C1').val("100123");
 }else  if ( ttt ==  "前台工单-应用系统-系统安装-HIS药品类环境安装") {
   $(this).parent().parent().find('.C1').val("219292");
 }else  if ( ttt ==  "前台工单-硬件新-外设-话筒") {
   $(this).parent().parent().find('.C1').val("219219");
 }else  if ( ttt ==  "前台工单-硬件新-设备安装-显卡安装") {
   $(this).parent().parent().find('.C1').val("219234");
  }else  if ( ttt ==  "前台工单-硬件新-打印机新-热敏打印机") {
   $(this).parent().parent().find('.C1').val("252901");
  }else  if ( ttt ==  "前台工单-网络请求-无法连接网络") {
   $(this).parent().parent().find('.C1').val("247733");
  }else  if ( ttt ==  "前台工单-咨询信息") {
   $(this).parent().parent().find('.C1').val("104783");
  }else  if ( ttt ==  "前台工单-网络请求-做网线") {
   $(this).parent().parent().find('.C1').val("247735");
  }else  if ( ttt ==  "前台工单-应用系统-系统维护") {
   $(this).parent().parent().find('.C1').val("219252");
  }else  if ( ttt ==  "前台工单-软件-医保") {
   $(this).parent().parent().find('.C1').val("100127");
  }else  if ( ttt ==  "前台工单-硬件新-外设-医保机具") {
   $(this).parent().parent().find('.C1').val("219205");
  }else  if ( ttt ==  "信息中心-医保") {
   $(this).parent().parent().find('.C1').val("1408533");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.C1').val("");
     }
  });

$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();
 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");
  }else{
    ////console.log("未找到对应的故障ID");
    $(this).parent().parent().find('.E1').val("");
     }
    });
}
//****************************工单设置功能********************************
//--------------------------位置设置功能----------

function locsave() {  //保存  工单信息
    var userlocation = GM_getValue("userDatalocation");
    var LA = [];
    var QYA = [];
    var QYB = [];
    var LTS = [];
    var LB = [];
    var LC = [];
    var LD = [];
    var LE = [];

     let arrtt = [],
         quence = 0;
    $('.LOCA').each(function (index, item) {
          let location1 = $(this).find('.L1').val(),
              location6 = $(this).find('.QY1').val(),
              location7 = $(this).find('.QY2').val(),
              location8 = $(this).find('.TS').val(),
              location2 = $(this).find('.L2').val(),
              location3 = $(this).find('.L3').val(),
              location4 = $(this).find('.L4').val(),
              location5 = $(this).find('.L5').val();
       if(location2== ""||location2== " "||location2== "null"){

           alert("亲，位置的值不能为空或空格！！")
         $("input[name='asd'].L2")[quence].focus();
	      $(this).parent().find('.L2').css({"border-color":"red"});

           window.localStorage.setItem("location", 1);
         	return false;
			}else{
           window.localStorage.removeItem('location');
              }

             if(location3== ""||location3== " "||location3== "null"){

           alert("亲，位置的值不能为空或空格！！")
         $("input[name='asd'].L3")[quence].focus();
	      $(this).parent().find('.L3').css({"border-color":"red"});

           window.localStorage.setItem("location", 1);
         	return false;
			}else{
           window.localStorage.removeItem('location');
              }

            if(location4== ""||location4== " "||location4== "null"){

           alert("亲，位置的值不能为空或空格！！")
             $("input[name='asd'].L4")[quence].focus();

	      $(this).parent().find('.L4').css({"border-color":"red"});

            window.localStorage.setItem("location", 1);
              return false;
			}else{
           window.localStorage.removeItem('location');
              }
        quence++;
    });

 if (localStorage.getItem("location") != null) {
    } else{

    let arrt = [],
    sequence = 1;
    $('.LOCA').each(function (index, item) {
          let location1 = $(this).find('.L1').val(),
              location6 = $(this).find('.QY1').val(),
              location7 = $(this).find('.QY2').val(),
              location8 = $(this).find('.TS').val(),
              location2 = $(this).find('.L2').val(),
              location3 = $(this).find('.L3').val(),
              location4 = $(this).find('.L4').val(),
              location5 = $(this).find('.L5').val();
      LA.push(location1);
      LB.push(location2);
      LC.push(location3);
      LD.push(location4);
      LE.push(location5);
      QYA.push(location6);
      QYB.push(location7);
      LTS.push(location8);
        sequence++;
    });

    location.A = [].concat(LA);
    location.B = [].concat(LB);
    location.C = [].concat(LC);
    location.D = [].concat(LD);
    location.E = [].concat(LE);
    location.QY1 = [].concat(QYA);
    location.QY2 = [].concat(QYB);
    location.TS = [].concat(LTS);
   GM_setValue("userDatalocation", location);
  // console.log(GM_getValue("userDatalocation"));
   locationMenuClose2();
  window.location.reload();

  }

}

function locationMenuClose2() {
    var oldEditBox2 = document.querySelector("#locationMenu");
    if (oldEditBox2) {
        if ($("#locationMenu").css("display") == "none") {
        } else {
        $("#locationMenu").hide();
        }
        return;
    }
}

function xzlo() {
     var table = document.createElement("table");
         table.id = "location_xz";
          var table1 =
            "<tr class='LOCA' style='padding: 4px 10px;' >" +
            "<td class='LXZ'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '新增' > </input></td>" +
            "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;'  onclick=' this.select()'   type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value= '' > </input></td>" +
            "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= ''  ></td> " +
            "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'  onclick=' this.select()'  type=\"text\"  value= ''  ></td> " +
            "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;' onclick=' this.select()'  type=\"text\"  value= ''  ></td> " +
            "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
              "</tr>" +
             "";
       table.innerHTML = table1;
      $("#weizhitable2").before(table);
  $(".LXZ:last").find("input").focus();
    $(document).on("click",".removeclass",function(){
 $(this).parent().parent().parent().remove();
return false;
})
}

function qklo() {
    if (confirm("确认清空所有位置设置?")) {
        $('#weizhitable>#location').remove(); //清空位置
            $('#weizhitable>#location_xz').remove(); //清空XZ模板工单
            $('#weizhitable>#location_mz').remove(); //清空导入的门诊模板工单
            $('#weizhitable>#location_yb').remove(); //清空导入的医保药房模板工单
            $('#weizhitable>#location_zy').remove(); //清空导入的住院模板工单
            $('#weizhitable>#location-fz').remove(); //清空粘贴导入的工单
            $('#weizhitable').remove(); //清空粘贴导入的工单
        ////console.log("清空所有位置");
    }
    return false;
}

function locdownload() {
   let arrt = [],
    sequence = 1;
       ////console.log(`正在导出数据`);
    $('.LOCA').each(function (index, item) {
          let location1 = $(this).find('.L1').val(),
              location2 = $(this).find('.L2').val(),
              location6 = $(this).find('.QY1').val(),
              location7 = $(this).find('.QY2').val(),
              location3 = $(this).find('.L3').val(),
              location4 = $(this).find('.L4').val(),
              location5 = $(this).find('.L5').val(),
              location8 = $(this).find('.TS').val();
        arrt.push({'location1': location1,'location8': location8,'location6': location6,'location7': location7,'location2': location2,'location3': location3,'location4': location4,'location5': location5});
        sequence++;
    });
   //console.log(arrt)
    //console.log(`正在导出数据`);
    //列标题，逗号隔开，每一个逗号就是隔开一个单元格
    let str = `序号,是否特殊,对应故障序号,对应故障序号,报修科室,报修地址,报修人,来电电话\n`;
    //增加\t为了不让表格显示科学计数法或者其他格式
    for (let i = 0; i < arrt.length; i++) {
        for (let item in arrt[i]) {
            str += `${arrt[i][item]},`;
        }
        str += '\n';
    }
    //encodeURIComponent解决中文乱码
    let uri = 'data:text/csv;charset=utf-8,\ufeff' + encodeURIComponent(str);
    //通过创建a标签实现
    let link = document.createElement("a");
   link.href = uri;
    //对下载的文件命名
    link.download = "位置设置导出.xls";
    document.body.appendChild(link);
    link.click();
    document.body.removeChild(link);
  }

function locmz() {
$('#weizhitable>#location_mz').remove();  //防止多次创建MZ模板工单
for(var u = 0; u < locmz2.length; u++){
     var table = document.createElement("table");
         table.id = "location_mz";
          var table1 =
            "<tr class='LOCA' style='padding: 4px 10px;' >" +
            "<td class='locmz'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '门诊'> </input></td>" +
            "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;'  list='TS'  type=\"text\"  value= ''> </input></td>" +
            "<datalist id='TS'>"+
            "<option value='特殊'/>"+
            "<option value='普通'/>"+
            "</datalist>"+
            "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'   onclick=' this.select()'  type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;'   onclick=' this.select()'  type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+locmz2[u]+" > </input></td>" +
            "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value= "+locmz3[u]+" ></td> " +
            "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'  onclick=' this.select()'  type=\"text\"  value= "+locmz4[u]+"  ></td> " +
            "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;' onclick=' this.select()'  type=\"text\"  value= "+locmz5[u]+"  ></td> " +
            "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#weizhitable2").before(table);
}

$(".locmz:last").find("input").focus();
$(document).on("click",".removeclass",function(){
$(this).parent().parent().parent().remove();
return false;
})
}

function loczy() {
$('#weizhitable>#location_zy').remove();  //防止多次创建模板工单
for(var u = 0; u < loczy2.length; u++){
     var table = document.createElement("table");
         table.id = "location_zy";
          var table1 =
            "<tr class='LOCA' style='padding: 4px 10px;' >" +
            "<td class='loczy'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '住院'> </input></td>" +
             "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;' onclick=' this.select()'  list='TS'   type=\"text\"  value= ''> </input></td>" +
              "<datalist id='TS'>"+
            "<option value='特殊'/>"+
            "<option value='普通'/>"+
            "</datalist>"+
            "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+loczy2[u]+" > </input></td>" +
            "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value= "+loczy3[u]+" ></td> " +
            "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'  onclick=' this.select()'  type=\"text\"  value= "+loczy4[u]+"  ></td> " +
            "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;' onclick=' this.select()'  type=\"text\"  value= "+loczy5[u]+"  ></td> " +
            "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#weizhitable2").before(table);
}

 $(".loczy:last").find("input").focus();
 $(document).on("click",".removeclass",function(){
 $(this).parent().parent().parent().remove();
return false;
})
}

function locyb() {
  $('#weizhitable>#location_yb').remove();  //防止多次创建MZ模板工单
for(var u = 0; u < locyb2.length; u++){
     var table = document.createElement("table");
         table.id = "location_yb";
          var table1 =
            "<tr class='LOCA' style='padding: 4px 10px;' >" +
            "<td class='locyb'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '医保' > </input></td>" +
            "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;'   list='TS'   type=\"text\"  value= ''> </input></td>" +
            "<datalist id='TS'>"+
            "<option value='特殊'/>"+
            "<option value='普通'/>"+
            "</datalist>"+
            "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'   onclick=' this.select()'  type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;'   onclick=' this.select()'  type=\"text\"  value= ''> </input></td>" +
            "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+locyb2[u]+" > </input></td>" +
            "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;' onclick=' this.select()'  type=\"text\"  value= "+locyb3[u]+" ></td> " +
            "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'  onclick=' this.select()'  type=\"text\"  value= "+locyb4[u]+"  ></td> " +
            "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;' onclick=' this.select()'  type=\"text\"  value= "+locyb5[u]+"  ></td> " +
            "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +
             "";
       table.innerHTML = table1;
      $("#weizhitable2").before(table);
}

  $(".locyb:last").find("input").focus();
  $(document).on("click",".removeclass",function(){
  $(this).parent().parent().parent().remove();
return false;
})
}

//****************************位置设置功能  结束********************************
//关闭菜单功能
function closeMenu() { //关闭菜单功能
    var oldEditBox = document.querySelector("#rwl-setMenu");
    if (oldEditBox) {
        oldEditBox.parentNode.removeChild(oldEditBox);
        return;
    }
    var oldEditBox2 = document.querySelector("#setMenu");
    if (oldEditBox2) {
        if ($("#setMenu").css("display") == "none") {} else {
            $("#setMenu").hide();
        }
    }
}

function setMenuClose() {

   $("#locationMenuClose2",top.document).click();

    var oldEditBox = document.querySelector("#rwl-setMenu");
    var oldEditBox2 = document.querySelector("#setMenu");
    if (oldEditBox && oldEditBox2) {
        oldEditBox.parentNode.removeChild(oldEditBox);
        if ($("#setMenu").css("display") == "none") {} else {
            $("#setMenu").hide();
        }
        return;
    }
    var oldEditBox = document.querySelector("#rwl-setMenu");
    if (oldEditBox) {
        oldEditBox.parentNode.removeChild(oldEditBox);
        return;
    }

}

//****************************总设置功能  结束  ********************************

//---------------------- 快捷键功能 ---------------------------------------------
function kuaijie() {

$("body").keydown(function(event){
    if (event.keyCode == 37){
    if (localStorage.getItem("kuaijie") != null) {
     ////console.log('方向左键');
         $("a:contains('上页'):first").click(); //点击
	  }
   else{
      alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 38){
    if (localStorage.getItem("kuaijie") != null) {
        ////console.log('方向上键');
        setTimeout(function(){//220毫秒后运行下列程序

        $("a:contains('处理'):eq(2)").click(); //点击处理工单
        },200);

	  }
   else{
      alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 39){
    if (localStorage.getItem("kuaijie") != null) {
      ////console.log('方向右键');
	          $("a:contains('下页'):first").click(); //点击下一页
	  }
   else{
      alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 40){
    if (localStorage.getItem("kuaijie") != null) {
        ////console.log('方向下键');
	    ////console.log('点击第一个编辑工单');
        setTimeout(function(){//220毫秒后运行下列程序

        //$("#savebtn").click();

        $("a:contains('编辑工单'):eq(0)").click(); //点击编辑工单
         },200);

   }else{
      alert('快捷功能没有开启，请开启后重试');

       }

   }

   if (event.keyCode == 32){
      if (localStorage.getItem("kuaijie") != null) {
       ////console.log('空格键');
	   ////console.log('点击新增，保存，确定，登录');
         try {
           add();

           save(1);
           saveSetting(); //保存菜单页面
           $("#savebtn").click();

         } catch (err) {
         }

          setTimeout(function(){

          $(":contains('否')").click();

          },200);

   }else{
     // alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 13){
        var buttondenglu = document.getElementById("to-recover");
	    if(buttondenglu){    //判断登录界面
         severCheck('1');    //登录界面，直接点击登录按钮
          }
    if (localStorage.getItem("kuaijie") != null) {
       ////console.log('回车键');

        var SAVE=document.getElementById("rwl-setMenu"); //判断页面是不是设置界面
           if(SAVE){

                   saveSetting(); //保存菜单页面
                   }
   } else{
     // alert('快捷功能没有开启，请开启后重试');

       }

   }

   if (event.keyCode == 27){

    if (localStorage.getItem("kuaijie") != null) {
           ////console.log('ESC键');
        $(":contains('否')").click();

          closeMenu(); //关闭菜单页面
      $(".layui-layer-close.layui-layer-close1").click();

   } else{
      alert('快捷功能没有开启，请开启后重试');

       }

   }

})

 }

//---------------------- 快捷键功能  结束 -----------------------------------------------------------------------------------------------------------------------

//--------------------------建单判断功能----------
function GNKQ() {
//----------------------保存工单增加工单号 -----------------------------------------------------------------------------------------------------------------------

$(document).on("click", "a:contains('创建工单')", function() {
    // function gdslj(){

    var n = window.localStorage.getItem("jan")
    var nn = Number(n)
    var c = "1"
    var cc = Number(c)
    window.localStorage.setItem("jan", nn - cc);
    //       }

})

//----------------页面加载判断后进行操作-----------------------------------------------------------------------------------------------------------------------

window.onload = function() { //等待面加载完毕
// -------------------------------------------------------------------------------------------------------------------------
var timeb = window.localStorage.getItem("time1")
var timea = window.localStorage.getItem("time2")
var B = Number(timeb) * 1000
var A = Number(timea) * 1000
var n = window.localStorage.getItem("jan")
var nn = Number(n)
var gd1 = window.localStorage.getItem("yeshu")
var gd2 = window.localStorage.getItem("upload11")
var gds1 = Number(gd1)
var gds2 = Number(gd2)
var kk = gds2 - gds1
var Form = document.getElementById("Form");
var IFRAME = document.getElementById("TEMP_REASON"); //判断页面是不是建单界面

var bj = document.getElementById("SERVICE_TYPE"); //判断是否处理工单界面

var zhongxin = document.getElementById("zhongxin"); //判断页面建单界面是否打开
var start = document.getElementById("PAPER_REPORT_CODE"); //判断页面建单界面是否打开
var url = window.location.href;

if (localStorage.getItem("start") != null) { //判断总功能是否开启

    //console.log('脚本已关闭');
} else {
    //console.log('脚本判断已开启，下一步');
    if (localStorage.getItem("gongdan") != null) {
        //console.log('修改工单号开始');
        if (kk > 0) {
           window.localStorage.setItem("ttt", 1);
            if (localStorage.getItem("ttt") != null) {
                var xgyy = window.localStorage.getItem("upload11")
                var num = Number(xgyy)
                var num2 = num
                //console.log(num2);
                 var url_Id = "http://itil118.wchscu.cn/repair/mlist.do?currentPage=1&showCount=" + num; //你要跳的链接加id
                //window.open(url_Id);               //新窗口 跳转链接

                window.localStorage.setItem("ttt", 1);
                window.location.href = url_Id;   //原窗口 跳转链接

               //console.log('跳转动作完成');
               // GM_openInTab('"http://itil118.wchscu.cn/repair/mlist.do?currentPage=1&showCount="+num')

            } else {

            }
            if(url.indexOf("commonEdit=yes&finish=1") >= 0){

                var b = window.localStorage.getItem("upload5");
                var bb = Number(b)
                //alert(bb);
                //console.log(bb);
                var c = "1"
                var cc = Number(c)
                var dd = "00"
                window.localStorage.setItem("upload5", bb + cc);
                window.localStorage.setItem("upload6", dd + b);
                document.getElementById("PAPER_REPORT_CODE").value = window.localStorage.getItem("upload6") // 累加工单号
                //console.log('保存工单号');
                save(1);
                //console.log('保存修改');
                var xgyy = window.localStorage.getItem("upload11")
                var num = Number(xgyy)
                var num2 = num
                var f = "1"
                var ff = Number(f)
                window.localStorage.setItem("upload11", num - ff);
                //console.log('修改工单 -1');
                //console.log(num);
            } else if(url.indexOf("showCount=") >= 0){
                if ($("ul").find("li").children("a:contains('编辑工单'):last").text() == "编辑工单") { //判断 是否有待处理工单

                    //console.log('1111111111111111111111111')
                }
                var xgyy = window.localStorage.getItem("upload11")
                var num = Number(xgyy) - 1
                //console.log(num);
                $("a:contains('编辑工单')").eq(num).click();
                //  $("ul").find("li").children("a:contains('编辑工单'):last").eq(num).click();
                // $("#simple-table li").find("a:contains('编辑工单')").eq(num).click();
                //    $("#simple-table ul").eq(0).find("li").eq(1).click();
            }
            //console.log('暂无未处理工单');
        } else {
            window.localStorage.removeItem('ttt');
            if (localStorage.getItem("ttt") != null) {
                var urlx = "http://itil118.wchscu.cn/main/index"
                window.location.href = urlx; //跳转链接

            }
        }
    } else {
        //console.log('修改工单号功能未开');
    }
}

  if (localStorage.getItem("start") != null) { //判断总功能是否开启

        //console.log('总功能已关闭');
    } else {
        //console.log('总功能已开启');
        $(":contains('我的工单')").click(); //打开我的工单

        try {
            document.getElementById('keywords').focus(); //聚焦页面
        } catch (err) {}

var study_userData = null;
var userDatalocation = null;
// 查看本地是否存在旧数据
study_userData = GM_getValue("study_userData");
if (!study_userData) {
    study_userData = settingData
    // GM_setValue("study_userData",study_userData);
}
userDatalocation = GM_getValue("userDatalocation");
if (!userDatalocation) {
    userDatalocation = location
    // GM_setValue("study_userData",study_userData);
}
var userSetting = study_userData;
var message = userSetting.message;
var A = userSetting.A;
var B = userSetting.B;
var C = userSetting.C;
var D = userSetting.D;
var E = userSetting.E;
var F = userSetting.F;
var G = userSetting.G;
var K = userSetting.K;

var location = userDatalocation;
var AA = location.A;
var QY1 = location.QY1;
var QY2 = location.QY2;
var TSS = location.TS;
var BB = location.B;
var CC = location.C;
var DD = location.D;
var EE = location.E;
if (localStorage.getItem("xuncha") != null) { //工单界面优化开启
    $("#simple-table tr").eq(0).find("th").eq(2).html("科室名称+联系人"); //工单界面优化设置
    $("#simple-table tr").eq(0).find("th").eq(3).html("科室地址+联系电话");
    $("#simple-table tr").eq(0).find("th").eq(4).html("故障描述+处理过程");
    var leng = $("#simple-table tr").length;
    for (var i = 0; i <= leng; i++) {
        var str = $("#simple-table tr").eq(i).find("td").eq(2).text();
        var str3 = str.replace(/(^\s*)|(\s*$)/g, "");
        var people = str3.substring(str3.lastIndexOf(" ") + 1);
        var str4 = str3.split('\ ')[0];
        var place = str4.substring(str4.lastIndexOf("-") + 1);
        var tel = $("#simple-table tr").eq(i).find("td").eq(3).text();
        var tel1 = tel.replace(/(^\s*)|(\s*$)/g, "");
        $("#simple-table tr").eq(i).find("td").eq(2).html("" + place + "<br>" + people + "");
        $("#simple-table tr").eq(i).find("td").eq(3).html("-----------------<br>" + tel1 + "");
        for (var u = 0; u < BB.length; u++) {
            if (tel1 == EE[u]) {
                $("#simple-table tr").eq(i).find("td").eq(3).html("" +CC[u]+ "<br>" + tel1+ "");
            }
        }
    }
    var aStr2 = $("#simple-table td a").html(); //工单界面优化设置
    var aStr = $("#simple-table td a").length;

    for (var y = 0; y < aStr; y++) {
        var val = $("#simple-table td a").eq(y).html();
        var val3 = val + ""
        var val33 = val3.replace(/(^\s*)|(\s*$)/g, "");
        for (var u = 0; u < A.length; u++) {
            if (val33 === A[u]) {
                $("#simple-table td a").eq(y).html("" + val33 + "<br>------" + F[u] + "--------");
            }

        }
    }
/*

    var url = window.location.href;
//  if(url.indexOf("http://itil118.wchscu.cn/repair/mlist.do?currentPage") >= 0 ){// 只在 120张工单界面优化显示
    var leng2 = $("#simple-table tr").length;
    for (var i = 0; i <= leng2; i++) {
        numberStr = $("#simple-table tr").eq(i).find("td:first").html();
        var u = window.localStorage.getItem("upload5") - numberStr
        data = $("#simple-table tr").eq(i).find("td").eq(1).text();
        var timedata = data.slice(0, 16)   //取时间值的前16位数
        $("#simple-table tr").eq(i).find("td").eq(1).html("" + timedata + "<br>工单号：00" + u + "");
        $("#simple-table tr").eq(0).find("th").eq(1).html("时间+工单号");
    }
    */

//}
}

        var timeb = window.localStorage.getItem("time1") //建单功能
        var timea = window.localStorage.getItem("time2")
        var B = Number(timeb) * 1000
        var A = Number(timea) * 1000
        var seconds2 = Math.floor(Math.random() * (B - A) + A)
        var seconds = Math.round(seconds2 / 1000)
        var n = window.localStorage.getItem("jan")
        var nn = Number(n)
        var xg = window.localStorage.getItem("XGGDS")
        var xgg = Number(xg)
        var Form = document.getElementById("Form");
        var zhongxin = document.getElementById("zhongxin");
        var table = document.getElementById("simple-table");
        var savebtn = document.getElementById("savebtn"); //   只有处理工单里才有
        var report = document.getElementById("table_report"); //编辑工单界面没有这个ID
        if (localStorage.getItem("start") != null) { //判断总功能是否开启

            //console.log('脚本已关闭');
        } else {
            //console.log('脚本判断已开启，下一步');
            if (localStorage.getItem("chuli") != 1) { //判断建单功能是否开启
              //console.log('处理功能未开');

                  if (localStorage.getItem("jandan") != 1) { //判断建单功能是否开启
                      //console.log('建单功能未开');

                  } else {
                        if (nn > 0) { //判断建单是否完成，未完成
                            //console.log('开始建单');
                               if(url.indexOf("SOURCE_TYPE=SJLY_3") >= 0){ //新增工单 建单界面
                                    //console.log('随机等待时间');
                                    setInterval(function() {
                                        if (seconds > 0) {
                                            //console.log(seconds);
                                            seconds--;
                                            $("#times").html("下一步操作等待时间：" + seconds + " 秒"); // 每秒刷新显示一次
                                        }
                                    }, 1000);
                                    setTimeout(function() {
                                        if (localStorage.getItem("start") != null) { //点击前 判断总功能是否开启

                                        } else {
                                            $("a:contains('创建工单')").trigger("click");
                                        }
                                    }, seconds2)
                                    setTimeout(function() {
                                     $(":contains('否')").click();
                                    }, 400);
                                } else {

                                  try    {
                                     setTimeout(function() { //200毫秒后运行下列
                                     add();
                                         }, 200);
                                        } catch (err) {}
                                }

                        }
                    }

            } else {

                var table = document.getElementById("simple-table");
                //console.log('自动处理工单');
                if ($("ul").find("li:first").children("a:contains('处理'):last").text() == "处理") { //判断 是否有待处理工单

                          $("ul").find("li:lt(3)").children("a:contains('处理'):last").each(function() {
                                if ($(this).text() == "处理") {
                                    this.click();
                                } else {
                                    //console.log('未找到“处理”字符');
                                }
                            })

                   if(url.indexOf("STATE=RS_5&REPAIR") >= 0){   //建单后 未处理页面
                        //console.log('随机等待时间');
                        setInterval(function() {
                            if (seconds > 0) {
                                //console.log(seconds);
                                seconds--;
                                $("#times").html("下一步操作等待时间：" + seconds + " 秒"); // 每秒刷新显示一次
                            }
                        }, 1000);
                        setTimeout(function() {
                            if (localStorage.getItem("start") != null) { //判断总功能是否开启

                                //console.log('脚本已关闭');
                            } else {
                                //console.log('脚本判断已开启，下一步');
                                $("#savebtn").click();
                                //console.log('点击保存');
                                setTimeout(function() { //400毫秒后运行下列
                                    $(":contains('否')").click();
                                }, 400);
                            }
                        }, seconds2)
                    }

                } else {
                    //console.log('22222222222222无待处理工单');   //判断 无待处理工单  准备开始建单
                   if(url.indexOf("STATE=RS_5&REPAIR") >= 0){   //建单后 未处理页面
                        //console.log('随机等待时间');
                        setInterval(function() {
                            if (seconds > 0) {
                                //console.log(seconds);
                                seconds--;
                                $("#times").html("下一步操作等待时间：" + seconds + " 秒"); // 每秒刷新显示一次
                            }
                        }, 1000);
                        setTimeout(function() {
                            if (localStorage.getItem("start") != null) { //判断总功能是否开启

                                //console.log('脚本已关闭');
                            } else {
                                //console.log('脚本判断已开启，下一步');
                                $("#savebtn").click();
                                //console.log('点击保存');
                                setTimeout(function() { //400毫秒后运行下列
                                    $(":contains('否')").click();
                                }, 400);
                            }
                        }, seconds2)
                    }

                    if (localStorage.getItem("jandan") != null) { //判断建单功能是否开启
                       //console.log('建单功能未开');

                        if (nn > 0) { //判断建单是否完成，未完成
                            //console.log('开始建单');
                               if(url.indexOf("SOURCE_TYPE=SJLY_3") >= 0){ //新增工单 建单界面
                                    //console.log('随机等待时间');
                                    setInterval(function() {
                                        if (seconds > 0) {
                                            //console.log(seconds);
                                            seconds--;
                                            $("#times").html("下一步操作等待时间：" + seconds + " 秒"); // 每秒刷新显示一次
                                        }
                                    }, 1000);
                                    setTimeout(function() {
                                        if (localStorage.getItem("start") != null) { //点击前 判断总功能是否开启

                                        } else {
                                            $("a:contains('创建工单')").trigger("click");
                                        }
                                    }, seconds2)
                                    setTimeout(function() {
                                     $(":contains('否')").click();
                                    }, 400);
                                } else {

                                  try    {
                                     setTimeout(function() { //200毫秒后运行下列
                                     add();
                                         }, 200);
                                        } catch (err) {}
                                }

                        }
                    }
                }

            }
        }
    }
}
}

//****************************建单判断  结束********************************

function locfzdr() {

//粘贴导入工单信息

 $("#locfz").bind({

			paste: function(e) {
				if (window.clipboardData) {
					return ;
				}
				var clipboardData = e.originalEvent.clipboardData;
				processData(clipboardData);
			}
		});

		document.onkeyup = function(e) {
			if (window.clipboardData) {
				e = window.event || e;
				var keyCode = e.keyCode || e.which || e.charCode;
				var ctrlKey = e.ctrlKey || e.metaKey;
				if (ctrlKey && keyCode == 86) {
					var clipboardData = window.clipboardData;
					processData(clipboardData);
				}
			}
			return false;
		}

var processData = function(clipboardData) {

			$('#weizhitable>#location_fz').remove();
            var Tex = clipboardData.getData('Text')
			var data = clipboardData.getData('Text').split('\n');
          // console.log(data);
			var dataHtml = '';
         if(Tex.indexOf("序号")!=-1){

             alert('请检查文本类容，不要复制表头标题“序号”等')
            } else  if(Tex.indexOf("报修科室")!=-1){

             alert('请检查文本类容，不要复制表头标题“报修科室”等')
            } else{

			   for (var i = 0; i < data.length; i++) {
				if (!data[i]) {
					continue ;
				}
				var bugdetData = data[i].split('\t');

dataHtml +=   "<table id='location_fz'>";
dataHtml +=   "<tbody>";
dataHtml +=   "<tr class='table-fz' >";

dataHtml +=   "<tr class='LOCA' style='padding: 4px 10px;' >";

dataHtml +=   "<td class='locfz'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly' value=" + ( i+1 || '') + "> </input></td>";

dataHtml +=              "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;' onclick=' this.select()'   type=\"text\" value= " + (bugdetData[1] || '') + "> </input></td>"  ;
dataHtml +=              "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= " + (bugdetData[2] || '') + "> </input></td>" ;

dataHtml +=              "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;' onclick=' this.select()'  type=\"text\"  value= " + (bugdetData[3] || '') + "> </input></td>"  ;

dataHtml +=   "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value=  " + (bugdetData[4] || '') + "> </input></td>";
dataHtml +=   "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value=  " + (bugdetData[5] || '') + " ></td> " ;
dataHtml +=   "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'   onclick=' this.select()'  type=\"text\"  value=  " + (bugdetData[6] || '') + " ></td> " ;
dataHtml +=   "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;'  onclick=' this.select()' type=\"text\"  value=  " + (bugdetData[7] || '') + "></td> " ;
dataHtml +=   "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>";
dataHtml +=   "</tr>";

dataHtml +=   "</tbody>";
dataHtml +=   "</table>";

}

}

  $('#weizhitable2').before(dataHtml);
 $(document).on("click",".removeclass",function(){

 $(this).parent().parent().parent().remove();

return false;
})

$(".locfz:last").find("input").focus();

};

  $(document).on("click",".removeclass",function(){

 $(this).parent().parent().parent().remove();

return false;
})

 }

function shezhi() {       //点击选中input框内容 功能

$(function(){        //点击选中input框内容 功能

$(":text").focus(function(){
this.select();
});
});
if (window.localStorage.getItem("jan") < 0) {
window.localStorage.setItem("jan", 0);

}

  $("#time1").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"75px"});

  $("#time2").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"75px"});

  $("#jandan").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"20px","height":"20px"});

  $("#chuli").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"20px","height":"20px"});

  $("#upload5").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"160px","maxlength":"7"});

  $("#upload6").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"160px","maxlength":"7"});
  $("#xggds").css({"color":"GREEN","font-size":"16px","fontWeight":"bold"});

  $("#yeshu").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"100px","maxlength":"7"});

  $("#jan").css({"color":"GREEN","font-size":"16px","fontWeight":"bold"});
  $("#gdzs").css({"color":"GREEN","font-size":"16px","fontWeight":"bold"});
  $("#upload11").css({"color":"GREEN","font-size":"16px","fontWeight":"bold","width":"125px","maxlength":"7"});
  $("#gdgd").css({"color":"GREEN","font-size":"16px","fontWeight":"bold"});
  $("#rwl-setMenuSave").css({"color":"GREEN","fontWeight":"bold"});
  $("#rwl-setMenuClose").css({"color":"red","fontWeight": "bold"});
  $("#weizhi").css("fontWeight", "bold")
  $("#shezhi").css("fontWeight", "bold")
  $("#xuncha").css({"width":"20px","height":"20px"});

  $("#gongdan").css({"width":"20px","height":"20px"});

  $("#kuaijie").css({"width":"20px","height":"20px"});

  $("#jan").focus();
  $("#jan").select();
 $("#time1").val(window.localStorage.getItem("time1"));

 $("#time2").val(window.localStorage.getItem("time2"));

 $("#yeshu").val(window.localStorage.getItem("yeshu"));

 $("#jan").val(window.localStorage.getItem("jan"));

 $("#upload5").val(window.localStorage.getItem("upload5"));

 $("#upload11").val(window.localStorage.getItem("upload11"));
 document.getElementById("gdzs").innerText = window.localStorage.getItem("GDZS");

$("#gongdan").change(function() {
    if ($("#gongdan").is(':checked')) {
        document.getElementById("jandan").checked = false
        document.getElementById("chuli").checked = false
    }
});
$("#jandan").change(function() {
    if ($("#jandan").is(':checked')) {
        document.getElementById("gongdan").checked = false
    }
});
$("#chuli").change(function() {
    if ($("#chuli").is(':checked')) {
        document.getElementById("gongdan").checked = false
    }
});
var jan = document.getElementById("jan"); //建单数量限制，防止一次性建太多
jan.onkeyup = function() {
    jan.value = jan.value.replace(/[^\d]/g, '');
    if (jan.value > 120) {
        jan.value = 120;
    }
}
var jan1 = document.getElementById("time1"); //等待时间限制
jan1.onkeyup = function() {
    jan1.value = jan1.value.replace(/[^\d]/g, '');
    if (jan1.value > 520) {
        jan1.value = 520;
    }
}
jan1.onblur = function() {
    jan1.value = jan1.value.replace(/[^\d]/g, ''); //等待时间限制
    if (jan1.value < 20) {
        jan1.value = 20;
    }
}
var jan2 = document.getElementById("time2"); //等待时间限制
jan2.onkeyup = function() {
    jan2.value = jan2.value.replace(/[^\d]/g, '');
    if (jan2.value > 520) {
        jan2.value = 520;
    }
}
jan2.onblur = function() {
    jan2.value = jan2.value.replace(/[^\d]/g, ''); //等待时间限制
    if (jan2.value < 40) {
        jan2.value = 40;
    }
}
var jan3 = document.getElementById("upload5"); //建单数量限制
jan3.onkeyup = function() {
    jan3.value = jan3.value.replace(/[^\d]/g, '');
    if (jan3.value > 99999) {
        jan3.value = 99999;
    }
}
var jan5 = document.getElementById("yeshu"); //建单数量限制
var j5 = Number(jan5.value)
var jan6 = document.getElementById("upload11"); //建单数量限制
var j6 = Number(jan6.value)
var gd = window.localStorage.getItem("GDZS")
var gdd = Number(gd)
if (Number(jan6.value) < Number(jan5.value)) {
    jan6.value = jan5.value
    var xggd = Number(jan6.value) - Number(jan5.value)
    window.localStorage.setItem("XGGDS", xggd);
    //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配
}
jan5.onkeyup = function() {
    var xggd = Number(jan6.value) - Number(jan5.value)
    window.localStorage.setItem("XGGDS", xggd);
    //  //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS");//数值匹配
    jan5.value = jan5.value.replace(/[^\d]/g, '');
    if (Number(jan5.value) > Number(gdd)) {
        jan5.value = window.localStorage.getItem("GDZS");
        var xggd = Number(jan6.value) - Number(jan5.value)
        window.localStorage.setItem("XGGDS", xggd);
        //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配
    }
}
jan5.onblur = function() {
    if (Number(jan6.value) < Number(jan5.value)) {
        jan6.value = jan5.value
        var xggd = Number(jan6.value) - Number(jan5.value)
        window.localStorage.setItem("XGGDS", xggd);
        //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配
    }
}
var jan6 = document.getElementById("upload11"); //建单数量限制
var j6 = Number(jan6.value)
var gd = window.localStorage.getItem("GDZS")
var gdd = Number(gd)
jan6.onkeyup = function() {
    var xggd = Number(jan6.value) - Number(jan5.value)
    window.localStorage.setItem("XGGDS", xggd);
    //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配
    jan6.value = jan6.value.replace(/[^\d]/g, '');
    if (Number(jan6.value) > Number(gdd)) {
        jan6.value = window.localStorage.getItem("GDZS");
        var xggd = Number(jan6.value) - Number(jan5.value)
        window.localStorage.setItem("XGGDS", xggd);
        //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配
    }
}
jan6.onblur = function() {
    if (Number(jan6.value) < Number(jan5.value)) {
        jan6.value = jan5.value
        var xggd = Number(jan6.value) - Number(jan5.value)
        window.localStorage.setItem("XGGDS", xggd);
        //document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配
    }
}
var xggd = Number(jan6.value) - Number(jan5.value)
window.localStorage.setItem("XGGDS", xggd);
//document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配

//
 if (localStorage.getItem("teshu")==='特殊') {
    document.getElementById("select").options[0].selected = true;

} else {
}

if (localStorage.getItem("xuncha") != null) {
    document.getElementById("xuncha").checked = true
} else {
    document.getElementById("xuncha").checked = false
}

if (localStorage.getItem("jandan") != null) {
    document.getElementById("jandan").checked = true
} else {
    document.getElementById("jandan").checked = false
}
if (localStorage.getItem("chuli") != null) {
    document.getElementById("chuli").checked = true
} else {
    document.getElementById("chuli").checked = false
}
if (localStorage.getItem("gongdan") != null) {
    document.getElementById("gongdan").checked = true
} else {
    document.getElementById("gongdan").checked = false
}
if (localStorage.getItem("kuaijie") != null) {
    document.getElementById("kuaijie").checked = true
} else {
    document.getElementById("kuaijie").checked = false
}

$("#shouxie").click(function() {
 // closeMenu(); //关闭菜单
    setTimeout(function() {
        var urlx = "http://itil118.wchscu.cn/repair/mlist.do?currentPage=1&showCount=120"
        window.open("http://itil118.wchscu.cn/repair/mlist.do?currentPage=1&showCount=120"); //新窗口打开120张工单界面
    }, 100);
})

}

//-------------------------设置UI界面和功能-----------------------------------------------------------------------------------
var url = window.location.href;

var a = '<li id=k  style="cursor: pointer; border-left: 0px; line-height: 65px;">  <a  style="min-width: 90px; font-size: 13.5px; height: 60px; background-color: rgb(13, 157, 230); color: rgb(238, 238, 238);"><i style="width: 60px; font-size: 20px; height: 60px;" class="menu-icon fa fa-cogs"  id="set" ></i><span> <span  id="start1" style="font-size: 14px;font-weight: 700;font-style: normal; font-family:"微软雅黑 Bold", "微软雅黑";letter-spacing:3px;">工单助手&nbsp ✔ </span></span></a></li>'
$("#sy").before(a);

var b = '<li id=g style="cursor: pointer; border-left: 0px; line-height: 65px;">  <a  style="min-width: 90px; font-size: 13.5px; height: 60px; background-colo:#D3D3D3;"><i  style="min-width: 60px; font-size: 20px; height: 60px;" class="menu-icon fa fa-cogs"  id="set" ></i><span> <span  id="stop1" style="font-size: 14px;background-colo:#ffffff ;font-weight: 700;font-style: normal; font-family:"微软雅黑 Bold", "微软雅黑";letter-spacing:3px;">工单助手&nbsp ✘ </span></span></a></li>'
$("#sy").before(b);

$("#g").hide();
if(url.indexOf("commonEdit=yes&finish") >= 0||url.indexOf("STATE=RS_5&REPAIR") >= 0||url.indexOf("SOURCE_TYPE=SJLY_3") >= 0){

var e = '<ul  id=h  class="nav nav-list animation2" style="padding:1px 5px 5px 5px;background-color:#AFEEEE;height;30px;"  > <li style="padding:1px 10px 10px 10px">  <a style="background-color:#AFEEEE">   <i class="menu-icon fa fa-cogs green"  id="se" >   </i>    <span id="start" style="cursor:pointer;padding-right:100px;font-weight:bold;"> &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp助手已开启✔</span>  <button id="baocun3" class="btn btn-sm btn-info no-border" style="font-weight:bold;">   复制工单信息    </button> &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <button id="xiugai" class="btn btn-sm btn-info no-border" style="font-weight:bold;">   修改工单信息    </button> &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp<span id="tishi" style="font-weight:bold;color:red;"></span>   &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  <span id="times" style="font-weight:bold;">  </span>  </a>  <b class="arrow"></b>  </li> </ul>'
$("#zhongxin").before(e);

var f = '<ul  id=j  class="nav nav-list animation2" style="padding:5px 5px 5px 5px;background-color:#D3D3D3;height;30px;"  > <li style="padding:1px 10px 10px 10px">  <a style="background-color:#D3D3D3">   <i style="background-color:#D3D3D3" class="menu-icon fa fa-cogs green"  id="se"  >    </i>   <span id="stop" style="cursor:pointer;padding-right:100px;font-weight:bold;"> &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp助手已关闭✘</span>  <button id="baocun2" class="btn btn-sm btn-info no-border"  style="font-weight:bold;">   复制工单信息    </button> &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <button id="xiugai" class="btn btn-sm btn-info no-border" style="font-weight:bold;">  修改工单信息     </button>  &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp<span id="tishi" style="font-weight:bold;color:red;"></span>  &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  <span id="times" style="font-weight:bold;">   </span>  </a> <b class="arrow"></b>  </li> </ul>'
$("#zhongxin").before(f);

$("#j").hide();
 }

if(url.indexOf("http://oanew.cd120.info:9091/sys/portal/page.jsp") >= 0||url.indexOf("http://oanew.cd120.info:9091/bmp/crm/crmcusmdm") >= 0){

setTimeout(function() {
var e = '<div  id=bmp  class="lui_portal_header_menu_item_current" style="display: inline-block;vertical-align: top;"  > <div class="lui_portal_header_menu_item_l">  <div class="lui_portal_header_menu_item_r">       <div id="setting" class="lui_portal_header_menu_item_c">BMP工时✔</div>  </div>  </div> </div>'
$(".lui_portal_header_menu_item_body").before(e);

console.log('添加BMP工时');
  }, 1000);
 }

if (localStorage.getItem("start") != null)  {  //脚本总功能开启和关闭
$("#k").hide();  $("#g").show();  $("#h").hide();  $("#j").show();

}else{

$("#k").show();   $("#g").hide();  $("#h").show();  $("#j").hide();

}

$(document).on("click","#start1",function(){ //脚本总功能开启
 $("#k").hide(); $("#g").show(); $(":contains('助手已开启✔')").click; $(":contains('助手已开启')").trigger("click"); $("#start").click();
  window.localStorage.setItem("start", 1);
 })
$(document).on("click","#stop1",function(){  //脚本总功能关闭
  $("#k").show(); $("#g").hide();  $("a:contains('创建工单')").click;  $(":contains('助手已关闭')").trigger("click"); $("#stop").click();
    window.localStorage.removeItem('start');
 })
$(document).on("click","#start",function(){//脚本总功能开启
 $("#k").hide();  $("#g").show();  $("#h").hide();  $("#j").show();   $("#start1",top.document).click();
  window.localStorage.setItem("start", 1);

 })
$(document).on("click","#stop",function(){ //脚本总功能关闭
 //console.log('开启助手');
 $("#k").show();   $("#g").hide();   $("#h").show();   $("#j").hide();    $("#stop1",top.document).click();

  window.localStorage.removeItem('start');

 })

$(document).on("click","#setting",function(){
console.log('设置');
  var oldEditBox2 = document.querySelector("#rwl-setMenu2");
        if(oldEditBox2){
        oldEditBox2.parentNode.removeChild(oldEditBox2);
        return;

        }

var setmenu2 = document.createElement("div");
            setmenu2.id = "rwl-setMenu2";
            setmenu2.style.cssText = "position: absolute;" +

              "z-index:9999;" +

              "top: 5.5px;" +

              "left: 80px;" +
              "width:340px;" +
              "height:633px;" +
              "padding: 10px;" +

              "background: #fff;" +

              " border:1px solid #40A9FF;" +

              "border-radius: 1px;";
            var setmenu2innerH = "" +

               "<button id='rwl-setMenuSave' style='font-size:14px;' >保存</button> &nbsp;&nbsp;&nbsp;" +

                "<button id='rwl-setMenuClose' style='font-size:14px;' >关闭</button> &nbsp;&nbsp;&nbsp;" +

                "<span style='font-size:14px;'>  &nbsp&nbsp&nbsp<button id=gongshi>提取工时</button> </span>" +

                //"<span style='font-size:24px;'>  &nbsp&nbsp&nbsp&nbsp<button id=shezhi>故障设置</button> </span>" +

                "<p></p>" +

                "<p style='font-size:15px;'><input id='xuncha'  type='checkbox' >  1-BMP工时粘贴 &nbsp&nbsp&nbsp&nbsp</p>" +

             " </button> &nbsp;&nbsp;&nbsp;" +
             "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class='blue'>" +
            "<input id='bmpfz'style='width:230px;' type=\"text\"   placeholder='使用Ctrl+V粘贴文本导入位置设置&nbsp;&nbsp;&nbsp;&nbsp;'>"+
            '<span class="blue"> '+
            " </button> &nbsp;&nbsp;&nbsp;" +

                "<laberl> <p style='font-size:15px;'>  <input id='kuaijie'  type='checkbox'  /> 2-快捷键&其他功能 </p> </laberl>" +

                '<div  style="background-color:#FFFFFF;">' +

                "<p>&nbsp&nbsp方向键← 左键 &nbsp&nbsp： 上一页或BMP上一日期 <br/> &nbsp&nbsp方向键→ 右键 &nbsp&nbsp： 下一页或BMP下一日期 <br/> &nbsp&nbsp方向键↑ 上键 &nbsp&nbsp&nbsp&nbsp： 处理工单 <br/>&nbsp&nbsp方向键↓ 下键 &nbsp&nbsp&nbsp&nbsp： 编辑工单<br/>&nbsp&nbsp空格键&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp ： 快捷点击确认,登录 <br/>&nbsp&nbspESC键&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp ： 快捷关闭界面<br/>&nbsp&nbsp新增删除键&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp ： 删除个人或他人工单（慎用）</p>" +

                '</div>' + "";
            setmenu2.innerHTML = setmenu2innerH;
            $("#lui-id-12").after(setmenu2);
              document.querySelector("#gongshi").addEventListener("click",gongshi);
            document.querySelector("#rwl-setMenuSave").addEventListener("click",saveSetting22);
            document.querySelector("#rwl-setMenuClose").addEventListener("click",setMenuClose22);

  $("#rwl-setMenuSave").css({"color":"GREEN","fontWeight":"bold"});
  $("#rwl-setMenuClose").css({"color":"red","fontWeight": "bold"});
  $("#weizhi").css("fontWeight", "bold")
  $("#shezhi").css("fontWeight", "bold")
$("#bmpfz").css({"color":"GREEN","font-size":"16px","fontWeight":"bold" ,"height":"30px"});

$("#kuaijie").css({"color":"GREEN","font-size":"16px","fontWeight":"bold"});

 var appendHtml = '';

appendHtml +=   "<div id='bmp_fz' style='font-size: 14px; width:1920; background: #fff; padding:15px;border-radius: 1px;'>";
appendHtml +=   "<table id='bmp_table' style=' padding:5px;'>";

appendHtml +=   "</table>";

appendHtml +=   "</div>";

$('#kuaijie').before(appendHtml);

 function bmpfzdr() {

//粘贴导入工单信息
//

 $("#bmpfz").bind({

			paste: function(e) {
				if (window.clipboardData) {
					return ;
				}
				var clipboardData = e.originalEvent.clipboardData;
				processData(clipboardData);
			}
		});

		document.onkeyup = function(e) {
			if (window.clipboardData) {
				e = window.event || e;
				var keyCode = e.keyCode || e.which || e.charCode;
				var ctrlKey = e.ctrlKey || e.metaKey;
				if (ctrlKey && keyCode == 86) {
					var clipboardData = window.clipboardData;
					processData(clipboardData);
				}
			}
			return false;
		}

var processData = function(clipboardData) {

			let paste = (clipboardData || window.clipboardData).getData('text/html');
			const selection = window.getSelection();
			if (!selection.rangeCount) return false;
			$('#bmp_fz').html(paste);

		var fontValue=['xuhao','Code','neirong','easy','leixing','chanchu','day1','day2','day3','day4','day5','day6','day7']

        var datatr=[];
		var tableArr=$('#bmp_fz tr')||[];

			for( var i=0;i< tableArr.length;i++){
				var trtemp=tableArr[i];
				var obj={};
				var tdTemp=$(trtemp).find('td');
				 console.log($(tdTemp).length);
				for(var x=0;x< $(tdTemp).length;x++){
					//var removeSpace=$(tdTemp).eq(x).text().replace(/(^\s*)|(\s*$)/g,'')
					var removeSpace=$(tdTemp).eq(x).text().replace(/\s*/g,'')
					obj[fontValue[x]]=removeSpace
				}
				datatr.push(obj)
			}
			var str=JSON.stringify(datatr, null, 4);
		    console.log(datatr[7].neirong);
			 window.localStorage.setItem("length", datatr.length);

 $(document).on("click",".removeclass",function(){

 $(this).parent().parent().parent().remove();

return false;
})

  var arrt = [];
  var arrta = [];
  var arrtb = [];
  var arrtc = [];
  var arrtd = [];
  var arrte = [];
  var arrtf = [];
  var arrtg = [];
    var cd= window.localStorage.getItem("length")

for(var p = 0; p < cd; p++){

      if (datatr[p].xuhao==='周一' ) {

       arrt.push(datatr[p+1].xuhao)
       arrta.push(datatr[p+1].neirong)
       arrtb.push(datatr[p+1].chanchu)

       arrtc.push(datatr[p+1].day1)
       arrtd.push(datatr[p+1].day2)

       arrte.push(datatr[p+1].day3)

       arrtf.push(datatr[p+1].day4)

       arrtg.push(datatr[p+1].day5)

         console.log(arrta);

        } else {

          }
      }

  //  $("#bmp_fz").remove();

};

  $(document).on("click",".removeclass",function(){

 $(this).parent().parent().parent().remove();

return false;
})

 }

    bmpfzdr();
    $("#bmp_fz").css({"background":"#fff","fontWeight":"bold"});

 })

function saveSetting22() {
 var mytable = $('#bmp_table') ;

       var valueTd2 = $("#L5").find("#P6").val();
    console.log(valueTd2);

  $("#bmp_fz").hide();
}

function gongshi() {

var arrt = [];
  var arrta = [];
  var arrtb = [];
  var arrtc = [];
  var arrtd = [];
  var arrte = [];
  var arrtf = [];
  var arrtg = [];
    var cd= window.localStorage.getItem("length")

for(var p = 0; p < cd; p++){

      if (datatr[p].xuhao==='周一' ) {
       arrt.push(datatr[p+1].xuhao)
       arrta.push(datatr[p+1].neirong)
       arrtb.push(datatr[p+1].chanchu)

       arrtc.push(datatr[p+1].day1)
       arrtd.push(datatr[p+1].day2)

       arrte.push(datatr[p+1].day3)

       arrtf.push(datatr[p+1].day4)

       arrtg.push(datatr[p+1].day5)

         console.log(arrta);

        } else {

          }
      }

/*var dataHtml = '';

dataHtml +=   "<table id='location_fz'>";
dataHtml +=   "<tbody>";
dataHtml +=   "<tr class='table-fz' >";

dataHtml +=   "<tr class='LOCA' style='padding: 4px 10px;' >";

dataHtml +=   "<td class='locfz'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly' value=" + ( i+1 || '') + "> </input></td>";

dataHtml +=              "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;' onclick=' this.select()'   type=\"text\" value= " + (bugdetData[1] || '') + "> </input></td>"  ;
dataHtml +=              "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= " + (bugdetData[2] || '') + "> </input></td>" ;

dataHtml +=              "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;' onclick=' this.select()'  type=\"text\"  value= " + (bugdetData[3] || '') + "> </input></td>"  ;

dataHtml +=   "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value=  " + (bugdetData[4] || '') + "> </input></td>";
dataHtml +=   "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value=  " + (bugdetData[5] || '') + " ></td> " ;
dataHtml +=   "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'   onclick=' this.select()'  type=\"text\"  value=  " + (bugdetData[6] || '') + " ></td> " ;
dataHtml +=   "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;'  onclick=' this.select()' type=\"text\"  value=  " + (bugdetData[7] || '') + "></td> " ;
dataHtml +=   "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>";
dataHtml +=   "</tr>";

dataHtml +=   "</tbody>";
dataHtml +=   "</table>";

$('#kuaijie').before(dataHtml);

*/

  $("#bmp_fz").remove();

}

function setMenuClose22() {
var oldEditBox = document.querySelector("#rwl-setMenu2");
    if (oldEditBox) {
        oldEditBox.parentNode.removeChild(oldEditBox);
        return;
    }
}

    $("#bmp_table").hide();

//--------------------------总设置功能----------

$(document).on("click","#set",function(){

console.log('打开设置界面');
$("#locationMenuClose2",top.document).click();

var oldEditBox = document.querySelector("#rwl-setMenu");
var oldEditBox2 = document.querySelector("#setMenu");
        if(oldEditBox&&oldEditBox2){
            oldEditBox.parentNode.removeChild(oldEditBox);
          if ($("#setMenu").css("display") == "none") {
	      }else{
           $("#setMenu").hide();
	       }

            return;
        }
       var oldEditBox = document.querySelector("#rwl-setMenu");
        if(oldEditBox){
        oldEditBox.parentNode.removeChild(oldEditBox);
        return;

        }

 var setmenu2 = document.createElement("div");
            setmenu2.id = "rwl-setMenu";
            setmenu2.style.cssText = "position: absolute;" +

              "z-index:409;" +

              "top: 65.5px;" +

              "left: 200px;" +
              "width:340px;" +
              "height:633px;" +
              "padding: 10px;" +

              "background: #fff;" +

              " border:1px solid #40A9FF;" +

              "border-radius: 1px;";
            var setmenu2innerH = "" +

                "<button id='rwl-setMenuSave' style='font-size:14px;' >保存</button> &nbsp;&nbsp;&nbsp;" +

                "<button id='rwl-setMenuClose' style='font-size:14px;' >关闭</button> &nbsp;&nbsp;&nbsp;" +

                "<span style='font-size:14px;'>  &nbsp&nbsp&nbsp<button id=weizhi>位置设置</button> </span>" +

                "<span style='font-size:14px;'>  &nbsp&nbsp&nbsp&nbsp<button id=shezhi>故障设置</button> </span>" +

                "<p></p>" +

                "<p style='font-size:15px;'><input id='xuncha'  type='checkbox' >  1-工单列表优化显示&nbsp&nbsp&nbsp&nbsp<button id=shouxie >120张工单界面</button></p>" +

                "<laberl><p style='font-size:15px;'><input id='jandan'  type='checkbox' >  2-自动快捷建单  &nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp<button id=ribao >&nbsp今日工作日志&nbsp&nbsp</button></p></laberl>" +

                "<laberl> <p > &nbsp&nbsp&nbsp建单： <input  id='jan'   type=\"text\"  value='0'/> 个工单 </p></laberl> " +

                "<laberl> <p> &nbsp&nbsp&nbsp随机等待 <input id='time1'   type=\"text\"  value='20' //> 秒，到<input id='time2'   type=\"text\" value='40' />&nbsp&nbsp秒 </p> </laberl>" +

                "<laberl><p style='font-size:15px;'><input id='chuli'  type='checkbox' >   3-自动处理故障单，工单总数&nbsp<span id='gdzs' value='0'></span>&nbsp个</p></laberl>" +

                 "<laberl> <p> &nbsp&nbsp&nbsp工单类型：&nbsp " +

               " <select id='select' style='width:100px;' >" +

               " <option selected value='特殊'>特殊 </option>" +

               " <option selected value='普通'>普通 </option>" +

               " </select>" +

                "  </p></laberl>" +
                "<laberl style='display:none;' > <p> &nbsp&nbsp&nbsp工单号从：&nbsp<span id='gdgd' >00</span> <input id='upload5'   type=\"text\" value='00000' /> 开始 </p></laberl>" +

                "<laberl style='display:none;' > <span style='font-size:15px;'> <input id='gongdan'  type='checkbox'>  4-自动修改工单号，工单总数&nbsp   </span>  <span id='gdzs-xz' value='0'></span> &nbsp个   </laberl>" +

                "<laberl style='display:none;' > <p> &nbsp&nbsp&nbsp从第： <input id='yeshu'   type=\"text\" value='0' /> 个工单开始(不包含本工单）</p> </laberl> " +

                "<laberl style='display:none;' > <p> &nbsp&nbsp&nbsp修改到第： <input id='upload11'   type=\"text\" value='0' /> 个工单结束 </p>  </laberl>" +

              //  "<span   style='display:none;' >（从后往前修改）共计&nbsp  </span>  <span id='xggds' ></span>  &nbsp个</span>" +

                "<laberl> <p style='font-size:15px;'>  <input id='kuaijie'  type='checkbox'  /> 4-快捷键&其他功能 </p> </laberl>" +

                '<div  style="background-color:#FFFFFF;">' +

                "<p>&nbsp&nbsp方向键← 左键 &nbsp&nbsp： 上一页或BMP上一日期 <br/> &nbsp&nbsp方向键→ 右键 &nbsp&nbsp： 下一页或BMP下一日期 <br/> &nbsp&nbsp方向键↑ 上键 &nbsp&nbsp&nbsp&nbsp： 处理工单 <br/>&nbsp&nbsp方向键↓ 下键 &nbsp&nbsp&nbsp&nbsp： 编辑工单<br/>&nbsp&nbsp空格键&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp ： 快捷点击确认,登录 <br/>&nbsp&nbspESC键&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp ： 快捷关闭界面<br/>&nbsp&nbsp新增删除键&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp ： 删除个人或他人工单（慎用）</p>" +

                '</div>' + "";
            setmenu2.innerHTML = setmenu2innerH;
            $("#sy").after(setmenu2);
            document.querySelector("#rwl-setMenuSave").addEventListener("click",saveSetting);
            document.querySelector("#rwl-setMenuClose").addEventListener("click",setMenuClose);

  shezhi();

})

//--------------------------总设置功能----------
function saveSetting() { // 保存选项设置
    //console.log('保存设置');

    $("#setMenuSave2", document).click();
    $("#locationMenuClose2", document).click();

    if ($("#gongdan").is(':checked')) {
        document.getElementById("jandan").checked = false
        document.getElementById("chuli").checked = false
    }
    if ($("#jandan").is(':checked')) {
        document.getElementById("gongdan").checked = false // 建单和修改工单只能选中一个（冲突）
    }
    if ($("#chuli").is(':checked')) {
        document.getElementById("gongdan").checked = false //处理工单和修改工单只能选中一个（冲突）
    }
    if ($("#xuncha").is(':checked')) {
        window.localStorage.setItem("xuncha", 1);
    } else {
        window.localStorage.removeItem('xuncha');
    }
    if ($("#jandan").is(':checked')) {
        window.localStorage.setItem("jandan", 1);
    } else {
        window.localStorage.removeItem('jandan');
    }
    if ($("#chuli").is(':checked')) {
        window.localStorage.setItem("chuli", 1);
    } else {
        window.localStorage.removeItem('chuli');
    }
    if ($("#gongdan").is(':checked')) {
        window.localStorage.setItem("gongdan", 1);
    } else {
        window.localStorage.removeItem('gongdan');
    }
    if ($("#kuaijie").is(':checked')) {
        window.localStorage.setItem("kuaijie", 1);
    } else {
        window.localStorage.removeItem('kuaijie');
    }
    var jan5 = document.getElementById("yeshu");
    var j5 = Number(jan5.value)
    var gd = window.localStorage.getItem("GDZS")
    var gdd = Number(gd)
    jan5.value = jan5.value.replace(/[^\d]/g, '');
    if (Number(jan5.value) > Number(gdd)) {
        jan5.value = window.localStorage.getItem("GDZS");
    }
    var jan6 = document.getElementById("upload11");

    var j6 = Number(jan6.value)
    var gd = window.localStorage.getItem("GDZS")
    var gdd = Number(gd)
    jan6.value = jan6.value.replace(/[^\d]/g, '');
    if (Number(jan6.value) > Number(gdd)) {
        jan6.value = window.localStorage.getItem("GDZS");
    }
    var xggd = Number(jan6.value) - Number(jan5.value)
    window.localStorage.setItem("XGGDS", xggd);
  // document.getElementById("xggds").innerText = window.localStorage.getItem("XGGDS"); //数值匹配

    var b = $('#upload5').val(); // 累加工单号功能
    var bb = Number(b)
    var c = "0"
    var cc = Number(c)
    window.localStorage.setItem("time1", $('#time1').val());
    window.localStorage.setItem("teshu", $('#select').val());
    window.localStorage.setItem("time2", $('#time2').val());

    window.localStorage.setItem("yeshu", $('#yeshu').val());

    window.localStorage.setItem("jan", $('#jan').val());
    window.localStorage.setItem("upload11", $('#upload11').val());
    var ddd = "00"
    window.localStorage.setItem("upload6", ddd + $('#upload5').val());
    window.localStorage.setItem("upload5", bb + cc);
    setTimeout(function() {
        window.location.reload(); //保存后刷新页面
    }, 100);
    closeMenu(); //保存后关闭菜单

}

$(document).on("click","#weizhi",function(){      // ----打开位置设置界面---------------------------------
var oldEditBox = document.querySelector("#locationMenu");
var oldEdit = document.querySelector("#setMenu");

if (oldEditBox) {
    if ($("#locationMenu").css("display") == "none") {
        $("#locationMenu").show();
        $('#weizhitable>#location_xz').remove();

        $('#weizhitable>#location_mz').remove();

        $('#weizhitable>#location_yb').remove();

        $('#weizhitable>#location_zy').remove();

        $('#weizhitable>#location-fz').remove();

    } else {
    $("#locationMenu").hide();
    }
} else {
   var weizhi = document.createElement("div");
            weizhi.id = "locationMenu";
            weizhi.style.cssText = "position: absolute;" +

            "top: 60px;" +
            "left: 200px;" ;

        var weizhiinnerH1 = "" +

           '<div id="content2"  style="border:1px solid #40A9FF;width:100%;background:#fff;overflow:auto;padding: 15px 10px 26px 349px;"  >'+

           "<button id='locationMenuSave2' >" +
           '<span class="blue" style="fontWeight="bold"">&nbsp;&nbsp;保存&nbsp;&nbsp;'+
           "</button> "+
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='xzlo' >" +
           '<span class="blue">新增位置'+
           " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='qklo' >" +
           '<span class="red">清空位置'+
           " </button> &nbsp;&nbsp;&nbsp;" +
           " </button> &nbsp;&nbsp;&nbsp;" +
           "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='locdownload' >" +
           '<span class="blue">导出位置数据'+
           " </button> &nbsp;&nbsp;&nbsp;" +
             "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class='blue'>" +
            "<input id='locfz'style='width:230px;' type=\"text\"   placeholder='使用Ctrl+V粘贴文本导入位置设置&nbsp;&nbsp;&nbsp;&nbsp;'>"+
            '<span class="blue"> '+
            " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='locmz' >" +
           '<span class="blue">增加门诊位置模板'+
           " </button> &nbsp;&nbsp;&nbsp;" +
           " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='locyb' >" +
           '<span class="blue">增加医保药房位置模板'+
           " </button> &nbsp;&nbsp;&nbsp;" +

            " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='loczy' >" +
           '<span class="blue">增加住院部位置模板'+
           " </button> &nbsp;&nbsp;&nbsp;" +

           "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='locationMenuClose2'  style='display:none' >" +
            '<span class="red">&nbsp;&nbsp;关闭&nbsp;&nbsp;'+
           " </button> &nbsp;&nbsp;&nbsp;" +

            "<br>" +
            "<br>" +
            '<span class="blue"> 导入功能说明：1、先点击导出位置数据 &nbsp;&nbsp;&nbsp;&nbsp;2、根据表格的模板增加或者删除位置'+
            "<br>" +
            '<span class="blue"  style="padding:0px 0px 0px 90px;"> 3、复制表格中的内容，不要复制标题 &nbsp;&nbsp;&nbsp;&nbsp;4、在对应的输入框按CTRL+V导入位置信息 '+
            "<br>" +
            '<div id="locationarea" style="width:100%;height:516px;overflow:auto;"  >'+
            "<div id='weizhitable'  >  " +

            "<table class='LOCATION' >" +

            "<td  class='L'><input  class='Q1' type=\"text\"  readonly='readonly' value= '序号'     style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 50px; '  > </input></td>" +

            "<td  class='L'><input  class='TS' type=\"text\"  readonly='readonly' value= '是否特殊位置'     style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 100px; '  > </input></td>" +

            "<td  class='L'><input  class='QY' type=\"text\"  readonly='readonly' value= '对应故障序号'     style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 150px; '  > </input></td>" +

            "<td  class='L'><input  class='Q2' type=\"text\" readonly='readonly'  value='*报修科室'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 250px; ' > </input></td>" +
            "<td  class='L'><input  class='Q3' type=\"text\" readonly='readonly'  value='*报修地址'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 250px; '   > </input></td>" +
            "<td  class='L'><input  class='Q4' type=\"text\" readonly='readonly'  value='*报修人'   style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 90px; ' > </input></td>" +
            "<td  class='L'><input  class='Q5' type=\"text\" readonly='readonly'  value='来电电话(建议填写)'   style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 140px; ' > </input></td>" +
            "<td  class='L'><input class='P0' type=\"text\"   readonly='readonly'    value='&nbsp&nbsp操作'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 50px; ' ></td>"+
            "</table>" +

            "<div id='weizhitable2'+> </div></div></div></div> " +
            "";
        weizhi.innerHTML = weizhiinnerH1;
        $("#main-container").after(weizhi);
        $("#locationMenuSave2").css({"fontWeight":"bold"});

var location = userDatalocation;
var AA = location.A;
var QY1 = location.QY1;
var QY2 = location.QY2;
var TSS = location.TS;
var BB = location.B;
var CC = location.C;
var DD = location.D;
var EE = location.E;
for(var u = 0; u < AA.length; u++){

   var Ac = AA[u] ,  Bc = BB[u] ,   Cc = CC[u],  Dc = DD[u] ,  Ec = EE[u], Q1 = QY1[u], Q2 = QY2[u], TS1 = TSS[u],  uu = u+1
     var weizhitable = document.createElement("table");
         weizhitable.id = "location";
          var weizhiinnerH2 =

            "<tr class='LOCA' style='padding: 4px 10px;' >" +

            "<td class='LO'><input  class='L1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= "+uu+"> </input></td>" +
            "<td class='LO'><input  class='TS'  name='asd'   style='font-size:14px; width:100px;'  onclick=' this.select()'   type=\"text\" list='TS' value= "+TS1+"> </input></td>" +

            "<datalist id='TS'>"+
            "<option value='特殊'/>"+

            "<option value='普通'/>"+
            "</datalist>"+

            "<td class='LO'><input  class='QY1'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()'  type=\"text\"  value= "+Q1+"> </input></td>" +

            "<td class='LO'><input  class='QY2'  name='asd'   style='font-size:14px; width:75px;'  onclick=' this.select()' type=\"text\"  value= "+Q2+"> </input></td>" +

            "<td class='LO'><input  class='L2'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value= "+Bc+"> </input></td>" +
            "<td class='LO'><input  class='L3'  name='asd'   style='font-size:14px; width:250px;'  onclick=' this.select()' type=\"text\"  value="+Cc+" ></td> " +
            "<td class='LO'><input  class='L4'  name='asd'   style='font-size:14px; width:90px;'   onclick=' this.select()' type=\"text\"  value="+Dc+" ></td> " +

            "<td class='LO'><input  class='L5'  name='asd'   style='font-size:14px; width:140px;'  onclick=' this.select()' type=\"text\"  value="+Ec+" ></td> " +
            "<td class='LO'><a  class='removeclass' ><input  class='L6'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td>"+
            "</tr>" +

             "";
       weizhitable.innerHTML = weizhiinnerH2;
      $("#weizhitable2").before(weizhitable);
  }

}
 document.querySelector("#xzlo").addEventListener("click", xzlo);
 document.querySelector("#locationMenuSave2").addEventListener("click", locsave);
 document.querySelector("#locationMenuClose2").addEventListener("click", locationMenuClose2);
 document.querySelector("#qklo").addEventListener("click", qklo);

 document.querySelector("#locdownload").addEventListener("click", locdownload);

 document.querySelector("#locmz").addEventListener("click", locmz);

 document.querySelector("#locyb").addEventListener("click", locyb);

 document.querySelector("#loczy").addEventListener("click", loczy);

 locfzdr() ;

}) //-------------------------------------------------------------------------------------------------------

$(document).on("click","#shezhi",function(){      // ---------------打开故障设置界面---------------
 //console.log('打开故障设置界面');

   var userSetting = study_userData;
   var A = userSetting.A;
   var B = userSetting.B;
   var C = userSetting.C;
   var D = userSetting.D;
   var E = userSetting.E;
   var F = userSetting.F;
   var G = userSetting.G;
   var K = userSetting.K;
   var J = userSetting.J;
   var uuu = A.length-1

var location = userDatalocation;
var AA = location.A;
var QY1 = location.QY1;
var QY2 = location.QY2;
var TSS = location.TS;
var BB = location.B;
var CC = location.C;
var DD = location.D;
var EE = location.E;

var arrt = [];
  var arrta = [];
  var arrtb = [];
  var arrtc = [];
  var arrtd = [];
  var arrte = [];
  var arrtf = [];
  var arrtg = [];
  var arrtk = [];
var arrp = [];
  var arrpa = [];
  var arrpb = [];
  var arrpc = [];
  var arrpd = [];
  var arrpe = [];
  var arrpf = [];
  var arrpg = [];
  var arrpk = [];
for(var p = 0; p < J.length; p++){

      if (J[p]==='特殊' ) {
       arrt.push(J[p])

       arrta.push(A[p])
       arrtb.push(B[p])

       arrtc.push(C[p])
       arrtd.push(D[p])

       arrte.push(E[p])
       arrtf.push(F[p])

       arrtg.push(G[p])
       arrtk.push(K[p])

        } else {

       arrp.push(J[p])

       arrpa.push(A[p])
       arrpb.push(B[p])

       arrpc.push(C[p])
       arrpd.push(D[p])

       arrpe.push(E[p])
       arrpf.push(F[p])

       arrpg.push(G[p])
       arrpk.push(K[p])

          }
      }

 var hba = arrta.concat(arrpa)
 var hbb = arrtb.concat(arrpb)
 var hbc = arrtc.concat(arrpc)
 var hbd = arrtd.concat(arrpd)
 var hbe = arrte.concat(arrpe)
 var hbf = arrtf.concat(arrpf)
 var hbg = arrtg.concat(arrpg)

 var hbk = arrtk.concat(arrpk)
 var hb = arrt.concat(arrp)

var oldEditBox = document.querySelector("#setMenu");
var oldEdit = document.querySelector("#locationMenu");
if (oldEditBox) {
    if (oldEdit) {
        if ($("#locationMenu").is(":hidden") & $("#setMenu").is(":hidden")) {
            $("#setMenu").show();
        } else if ($("#locationMenu").is(":visible") & $("#setMenu").is(":visible")) {
            $("#locationMenu").hide();
        } else if ($("#locationMenu").is(":hidden") & $("#setMenu").is(":visible")) {
            $("#setMenu").hide();
            $('#tableks>#table_xz').remove();

            $('#tableks>#table_mz').remove();

            $('#tableks>#table_yb').remove();
            $('#tableks>#table_zy').remove();
            $('#tableks>.TALB.table-fz').remove();

        } else if ($("#locationMenu").is(":visible") & $("#setMenu").is(":hidden")) {
            $("#setMenu").show();
            $("#locationMenu").hide();
        }
    } else {
        if ($("#setMenu").css("display") == "none") {
            $("#setMenu").show();
        } else {
            $("#setMenu").hide();
            $('#tableks>#table_xz').remove();

            $('#tableks>#table_mz').remove();
            $('#tableks>#table_yb').remove();
            $('#tableks>#table_zy').remove();
            $('#tableks>.TALB.table-fz').remove();
        }
    }
} else {
    if ($("#locationMenu").is(":visible")) {
      $("#locationMenu").hide();
   }
        var odom1 = document.createElement("div");
        odom1.id = "setMenu";
        odom1.style.cssText ="position: absolute;" +

            "top: 60px;" +
            "left: 200px;" ;

         var innerH1 = "" +

             '<div id="content"  style="border:1px solid #40A9FF;;width:100%;background:#fff;overflow:auto;padding: 15px 10px 24px 349px;"  >'+

             "<button id='setMenuSave2' >" +
             '<span class="blue" style="fontWeight="bold"">&nbsp;&nbsp;保存&nbsp;&nbsp;'+
             "</button> " +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='xz' >" +
           '<span class="blue">新增工单'+
           " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='qk' >" +
           '<span class="red">清空工单'+
           " </button> &nbsp;&nbsp;&nbsp;" +
           " </button> &nbsp;&nbsp;&nbsp;" +
           "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='download' >" +
           '<span class="blue">导出工单数据'+
           " </button> &nbsp;&nbsp;&nbsp;" +
             "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span class='blue'>" +
            "<input id='fz'style='width:230px;' type=\"text\"   placeholder='使用Ctrl+V粘贴文本导入工单设置&nbsp;&nbsp;&nbsp;&nbsp;'>"+
            '<span class="blue"> '+
            " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='mz' >" +
           '<span class="blue">增加门诊工单模板'+
           " </button> &nbsp;&nbsp;&nbsp;" +
           " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='yb' >" +
           '<span class="blue">增加医保药房工单模板'+
           " </button> &nbsp;&nbsp;&nbsp;" +

            " </button> &nbsp;&nbsp;&nbsp;" +
            "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<button id='zy' >" +
           '<span class="blue">增加住院部工单模板'+
           " </button> &nbsp;&nbsp;&nbsp;" +

              "<br>" +
              "<br>" +
            '<span class="blue"> 导入功能说明：1、先点击导出工单数据 &nbsp;&nbsp;&nbsp;&nbsp;2、根据表格的模板增加或者删除工单'+
            "<br>" +
            '<span class="blue"  style="padding:0px 0px 0px 90px;"> 3、复制表格中的内容，不要复制标题 &nbsp;&nbsp;&nbsp;&nbsp;4、在对应的输入框按CTRL+V导入工单信息 '+
            "<br>" +
            '<div id="inputarea" style="width:100%;height:518px;overflow:auto;"  >'+
             "<div id='tableks'  >  " +
            "<table class='TAB' id='biaoti' >" +
            "<td  class='BT'><input id='G' class='H0' type=\"text\"  readonly='readonly' value= '序号'     style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 50px; '  > </input></td>" +
            "<td  class='BT'><input id='A' class='A0' type=\"text\" readonly='readonly'  value='*故障描述'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 250px; ' > </input></td>" +
            "<td  class='BT'><input id='B' class='B0' type=\"text\" readonly='readonly'  value='*故障分类'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 250px; '   > </input></td>" +
            "<td  class='BT'><input id='C' class='C0' type=\"text\" readonly='readonly'  value='*故障 ID'   style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 80px; ' > </input></td>" +
            "<td  class='BT'><input id='D' class='D0' type=\"text\" readonly='readonly'  value='*故障原因'   style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 110px; ' > </input></td>" +
            "<td  class='BT'><input id='E' class='E0' type=\"text\" readonly='readonly'  value='*故障原因ID' style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 90px; '  > </input></td>" +
            "<td  class='BT'><input id='K' class='K0' type=\"text\" readonly='readonly'  value='*发生地点'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 80px; '  > </input></td>" +
            "<td  class='BT'><input id='F' class='F0' type=\"text\" readonly='readonly'  value='*处理过程'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 200px; ' > </input></td>" +
            "<td  class='BT'><input id='J' class='J0' type=\"text\" readonly='readonly'  value='是否特殊'   style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 80px; ' > </input></td>" +
            "<td  class='BT'><input class='P0' type=\"text\"   readonly='readonly'    value='&nbsp&nbsp操作'  style='font-size: 14px;  color: rgb(66, 139, 202); font-weight: bold; width: 50px; ' ></td>"+
            "</table>" +

            "<div id='tableks22'  > </div></div></div></div> " +
            "";

        odom1.innerHTML = innerH1;
       //    $("#mainFrame").before(odom1);
       $("#main-container").after(odom1);
  document.getElementById("setMenuSave2").style.fontWeight='bold';

   var oldEdit = document.querySelector("#jiazai2");
    if(oldEdit){
    }else{
      if(A.length > 200){
        var table = document.createElement("div");
        table.id = "jiazai2";
        table.style.cssText ="position: absolute;" +
            "z-index:999;" +
            "left: 340px;" +
            "opacity:.50;" +
            "height: 100%;" +
            "width: 80%;" +
            "background-color: rgb(200, 200, 200);" +
            "padding: 2px;";

          var table1 =

          "</br></br></br></br></br></br></br></br>  " +
          "<span id='tzz' style='padding: 105px 100px 100px 300px; font-size:48px;  fontWeight:bold; color:#000;  '  >"+A.length+"&nbsp;张工单设置 </span> &nbsp;&nbsp;&nbsp;" +
          "</br>" +
          "<span id='tzz2' style='padding: 105px 100px 100px 300px; font-size:38px;  fontWeight:bold; color:#000;  '  >加载中......</span> &nbsp;&nbsp;&nbsp;" +
             "";
       table.innerHTML = table1;
      $("#content").before(table);
        }
   }

setTimeout(function(){

for(var u = 0; u < hba.length; u++){

   //console.log('张工单详情已加载');

   var Ac = hba[u]
   var Bc = hbb[u]

   var Cc = hbc[u]
   var Dc = hbd[u]

   var Ec = hbe[u]
   var Fc = hbf[u]

   var Gc = hbg[u]
   var Kc = hbk[u]
   var Jc = hb[u]

             var addhtml = '';

              addhtml +=     '<table id="table">';
              addhtml +=     '<tbody>';
              addhtml +=     '<tr class="TALB" style="padding: 4px 10px;" >';

              addhtml +=     '<td class="BT"><input  class="G1" style="font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;"  type=\'text\' readonly="readonly"  value= '+Gc+'> </input></td>';//添加适应div ，背景
              addhtml +=     '<td class="BT"><input  class="A1"  name="abcd"   style="font-size:14px; width:250px;"  onclick="this.select()"  type=\'text\'  value= '+Ac+'> </input></td>';

              addhtml +=     '<td class="BT"><input  class="B1"  name="abcd"   style="font-size:14px; width:250px;" onclick="this.select()"   type=\'text\' list="problem_list"  value='+Bc+' ></td>';
              addhtml +=     '<datalist id="problem_list">';
              addhtml +=     ' <option value="前台工单-应用系统-系统安装-办公软件安装"/>';
              addhtml +=     ' <option value="前台工单-应用系统-系统安装-操作系统安装"/>';
              addhtml +=     ' <option value="前台工单-应用系统-系统安装-HIS医生环境安装"/>';
              addhtml +=     ' <option value="前台工单-应用系统-系统维护-操作系统维护"/>';
              addhtml +=     ' <option value="前台工单-应用系统-系统维护-HIS医生环境维护"/>';
              addhtml +=     ' <option value="前台工单-网络请求-无法连接网络"/>';
              addhtml +=     ' <option value="前台工单-网络请求-网络权限变更"/>';
              addhtml +=     ' <option value="前台工单-网络请求-前台故障协助"/>';
              addhtml +=     ' <option value="前台工单-系统操作指导新-HIS医生操作指导"/>';
              addhtml +=     ' <option value="前台工单-系统操作指导新-HIS护士操作指导"/>';
              addhtml +=     ' <option value="前台工单-系统操作指导新-办公系统操作指导"/>';
              addhtml +=     ' <option value="前台工单-系统操作指导新-HIS药品类操作指导"/>';
              addhtml +=     ' <option value="前台工单-咨询信息"/>';
              addhtml +=     ' <option value="前台工单-软件-HIS"/>';
              addhtml +=     ' <option value="前台工单-软件-LIS"/>';
              addhtml +=     ' <option value="前台工单-软件-PACS"/>';
              addhtml +=     ' <option value="前台工单-软件-医保"/>';
              addhtml +=     ' <option value="前台工单-硬件新-外设-医保机具"/>';
              addhtml +=     ' <option value="信息中心-医保"/>';
              addhtml +=     ' <option value="前台工单-硬件新-打印机新-条码打印机"/>';
              addhtml +=     ' <option value="前台工单-硬件新-打印机新-热敏打印机"/>';
              addhtml +=     ' <option value="前台工单-硬件新-打印机新-激光黑白打印机"/>';
              addhtml +=     ' <option value="前台工单-硬件新-电脑-电脑主机"/>';
              addhtml +=     ' <option value="前台工单-硬件新-电脑-显示器"/>';
              addhtml +=     ' <option value="前台工单-硬件新-外设-刷卡器"/>';
              addhtml +=     ' <option value="前台工单-硬件新-外设-高拍仪"/>';
              addhtml +=     ' <option value="前台工单-硬件新-LED屏-LED呼叫屏"/>';
              addhtml +=     ' <option value="前台工单-硬件新-LED屏-LED信息显示屏"/>';
              addhtml +=     ' <option value="前台工单-硬件新-自助机-门诊自助机"/>';
              addhtml +=     ' <option value="前台工单-硬件新-自助机-住院查询结算类自助机"/>';

              addhtml +=     '</datalist>';

              addhtml +=     '<td class="BT"><input class="C1"  name="abcd"   style="font-size:14px; width:80px;"  onclick="this.select()"  readonly="readonly"  type=\"text\"  value='+Cc+' >  </td>';

              addhtml +=     '<td class="BT"><input class="D1"  name="abcd"   style="font-size:14px; width:110px;" onclick="this.select()"    type=\"text\" list="reason_list"   value='+Dc+' >  </td>';
              addhtml +=     '<datalist id="reason_list">';
              addhtml +=     ' <option value="操作咨询"/>';
              addhtml +=     ' <option value="人员使用故障"/>';
              addhtml +=     ' <option value="硬件故障"/>';
              addhtml +=     ' <option value="稳定性不足"/>';
              addhtml +=     ' <option value="软件运行环境"/>';
              addhtml +=     ' <option value="操作系统问题"/>';
              addhtml +=     ' <option value="打印机安装"/>';
              addhtml +=     ' <option value="电脑安装"/>';
              addhtml +=     ' <option value="网络权限变更"/>';
              addhtml +=     ' <option value="前台故障协助"/>';
              addhtml +=     ' <option value="网口/线路修复"/>';
              addhtml +=     ' <option value="HIS"/>';
              addhtml +=     ' <option value="LIS"/>';
              addhtml +=     ' <option value="三方应用系统"/>';
              addhtml +=     '</datalist>';

              addhtml +=     '<td class="BT"><input  class="E1" name="abcd"  style="font-size:14px; width:90px;" onclick="this.select()"  readonly="readonly"   type=\"text\"  value='+Ec+' > </input></td>';
              addhtml +=     '<td class="BT"><input  class="K1" name="abcd"  style="font-size:14px; width:80px;" onclick="this.select()"  type=\"text\" list="location"   value='+Kc+' >  </td>';
              addhtml +=     '<datalist id="location">';
              addhtml +=     ' <option value="医生站"/>';
              addhtml +=     ' <option value="护士站"/>';
              addhtml +=     ' <option value="药剂"/>';
              addhtml +=     ' <option value="财务"/>';
              addhtml +=     ' <option value="其他"/>';
              addhtml +=     '</datalist>';

              addhtml +=     '<td class="BT"><input  class="F1"  name="abcd"  style="font-size:14px; width:200px;" onclick="this.select()"  type=\"text\"  value= '+Fc+' > </input></td>';

              addhtml +=     '<td class="BT"><input  class="J1"  name="abcd"  style="font-size:14px; width:80px;"  onclick="this.select()"  type=\"text\" list="teshu"  value= '+Jc+' > </input></td>';
              addhtml +=     '<datalist id="teshu">';
              addhtml +=     ' <option value="特殊"/>';
              addhtml +=     ' <option value="普通"/>';
              addhtml +=     '</datalist>';

              addhtml +=     '<td class="BT"><a  class="removeclass" ><input  class="P1"  type="button"  value="删除"  style="font-size:14px; width:50px;"  > </a></td>';
              addhtml +=     '</tr>';

   $('#tableks22').before(addhtml);

}

gzfl();

 gzyy();

if ($("#jiazai2").css("display") == "none") {
}else{

$("#jiazai2").hide();
}

},100);

}

 document.querySelector("#xz").addEventListener("click", xzSetting);
 document.querySelector("#setMenuSave2").addEventListener("click", btnsaveSetting);
 document.querySelector("#qk").addEventListener("click", qk);

 document.querySelector("#download").addEventListener("click", download);

 document.querySelector("#mz").addEventListener("click", mz);

 document.querySelector("#yb").addEventListener("click", yb);

 document.querySelector("#zy").addEventListener("click", zy);

 fzdr();

 gzfl();

 gzyy();

}) //--------------打开故障设置界面结束-----------------------------------------------------

function JDDX(){ // 功能判断
       try {
         var url = window.location.href;
         if(url.indexOf("repair/mlist.do") >= 0){

		var gdValue = document.getElementsByClassName('bigger-125')[0].innerHTML;// 确定工单总数
          gdValue=gdValue.replace(/[^0-9]/ig,"");
        window.localStorage.setItem("GDZS", gdValue);
        console.log("工单总数"+""+gdValue+"");

           }

		} catch (err) {

        }
if (localStorage.getItem("start") != null) {  //判断总功能是否开启

 //console.log('总功能已关闭');
}else{

  //console.log('总功能已开启');

  //
var study_userData = null;
var userDatalocation = null;
// 查看本地是否存在旧数据
study_userData = GM_getValue("study_userData");
if (!study_userData) {
    study_userData = settingData
    // GM_setValue("study_userData",study_userData);
}
userDatalocation = GM_getValue("userDatalocation");
if (!userDatalocation) {
    userDatalocation = location
    // GM_setValue("study_userData",study_userData);
}
var userSetting = study_userData;
var A = userSetting.A;
var B = userSetting.B;
var C = userSetting.C;
var D = userSetting.D;
var E = userSetting.E;
var F = userSetting.F;
var G = userSetting.G;
var K = userSetting.K;
var J = userSetting.J;

var location = userDatalocation;
var AA = location.A;
var QY1 = location.QY1;
var QY2 = location.QY2;
var TSS = location.TS;
var BB = location.B;
var CC = location.C;
var DD = location.D;
var EE = location.E;

var arrt = [];
  var arrta = [];
  var arrtb = [];
  var arrtc = [];
  var arrtd = [];
  var arrte = [];
  var arrtf = [];
  var arrtg = [];
  var arrtk = [];
var arrp = [];
  var arrpa = [];
  var arrpb = [];
  var arrpc = [];
  var arrpd = [];
  var arrpe = [];
  var arrpf = [];
  var arrpg = [];
  var arrpk = [];
for(var p = 0; p < J.length; p++){

      if (J[p]==='特殊' ) {
       arrt.push(J[p])
       arrta.push(A[p])
       arrtb.push(B[p])
       arrtc.push(C[p])
       arrtd.push(D[p])
       arrte.push(E[p])
       arrtf.push(F[p])
       arrtg.push(G[p])
       arrtk.push(K[p])
        } else {
       arrp.push(J[p])
       arrpa.push(A[p])
       arrpb.push(B[p])
       arrpc.push(C[p])
       arrpd.push(D[p])
       arrpe.push(E[p])
       arrpf.push(F[p])
       arrpg.push(G[p])
       arrpk.push(K[p])
          }
      }

  var bbbt = [];
  var bbbta = [];
  var bbbtb = [];
  var bbbtc = [];
  var bbbtd = [];
  var bbbte = [];
  var bbbtf = [];
  var bbbtg = [];

var bbbs = [];
  var bbbsa = [];
  var bbbsb = [];
  var bbbsc = [];
  var bbbsd = [];
  var bbbse = [];
  var bbbsf = [];
  var bbbsg = [];

for(var M = 0; M < TSS.length; M++){

      if (TSS[M]==='特殊' ) {
       bbbt.push(J[M])
       bbbta.push(A[M])
       bbbtb.push(B[M])
       bbbtc.push(C[M])
       bbbtd.push(D[M])
       bbbte.push(E[M])
       bbbtf.push(F[M])
       bbbtg.push(G[M])
        } else {
       bbbs.push(J[M])
       bbbsa.push(A[M])
       bbbsb.push(B[M])
       bbbsc.push(C[M])
       bbbsd.push(D[M])
       bbbse.push(E[M])
       bbbsf.push(F[M])
       bbbsg.push(G[M])
          }
      }

 // console.log(arrta)
 // console.log(arrpa)

 // console.log(bbbta)
 // console.log(bbbsa)

var url = window.location.href;

var IFRAME=document.getElementById("TEMP_REASON"); //判断页面是不是建单界面     新增页面 http://itil118.wchscu.cn:80/repair/goAdd.do?OTYPE=2&SOURCE_TYPE=SJLY_3
var zx=document.getElementById("zhongxin");        //判断页面建单界面是否打开   建单后完成后编辑 http://itil118.wchscu.cn:80/repair/goEdit.do?REPAIR_ID=784068&commonEdit=yes&finish=1
var bj=document.getElementById("SERVICE_TYPE");    //判断是否处理工单界面       建单后暂停界面 http://itil118.wchscu.cn:80/repair/goEdit.do?REPAIR_ID=784068&commonEdit=yes&finish=0
if (localStorage.getItem("start") != null) {  //判断总功能是否开启              建单后未处理页面   http://itil118.wchscu.cn:80/repair/goOperate.do?STATE=RS_5&REPAIR_ID=784487
    //console.log('脚本已关闭');
 }else{

    //console.log('脚本已开启');

if(url.indexOf("STATE=RS_5&REPAIR") >= 0){   //建单后 未处理页面
//console.log('建单后 未处理页面');

  if (localStorage.getItem("teshu")==='特殊') {
        console.log('建单-特殊工单')
       $("#REPAIR_ORDER_TYPE").find("option[value='GDLX_2']").attr("selected",true);
       $(".chosen-single.chosen-single-with-deselect").html("特殊");
    }
  // ----------------故障类型随机分配-----------------------------------
   if($("p:first")){
   var val3=$("p:first").text();

   var val= val3 + ""
   var val33= val.replace(/(^\s*)|(\s*$)/g, "");

     $("#table_report span:contains('现场')").click(); //选择现场

setTimeout(function() {

$("#SOLUTION").focus();

}, 1000)

    if (localStorage.getItem("teshu")==='特殊') {
    if(arrt.length > 0){
        console.log('处理-特殊工单')
       $("#REPAIR_ORDER_TYPE").find("option[value='GDLX_2']").attr("selected",true);
       $(".chosen-single.chosen-single-with-deselect").html("特殊");

  var num = Math.floor(Math.random()*arrt.length);
 for(var u = 0; u < arrt.length; u++){

                  if (val33 === arrta[u]) {

                  $("#SOLUTION").val(arrtf[u])

                  window.localStorage.setItem("PD", 1);
                     if (arrtk[u]==='医生站') {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_1']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("医生站");
                     }else if (arrtk[u]==='护士站' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_2']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("护士站");
                     }else if (arrtk[u]==='药剂' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_3']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("药剂");
                     }else if (arrtk[u]==='财务' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_4']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("财务");
                     }else {
                     // }else if (K[u]==='其他' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_5']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("其他");
                     }
                   break;
                 } else{
                  window.localStorage.removeItem('PD');
                  }
       }

    }else{
      alert("特殊工单选项没配置，请在故障设置选择配置")
    }

  } else  if (localStorage.getItem("teshu")==='普通') {
    if(arrp.length > 0){
       console.log('处理-普通工单')
  var num = Math.floor(Math.random()*arrp.length);
  //////console.log(num)
 for(var u = 0; u < arrp.length; u++){

                  if (val33 === arrpa[u]) {

                  $("#SOLUTION").val(arrpf[u])

                  window.localStorage.setItem("PD", 1);
                     if (arrpk[u]==='医生站') {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_1']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("医生站");
                     }else if (arrpk[u]==='护士站' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_2']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("护士站");
                     }else if (arrpk[u]==='药剂' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_3']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("药剂");
                     }else if (arrpk[u]==='财务' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_4']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("财务");
                     }else {
                     // }else if (K[u]==='其他' ) {
                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_5']").attr("selected",true);
                       $('.chosen-single.chosen-default span:first').html("其他");
                     }
                   break;
                 } else{
                  window.localStorage.removeItem('PD');
                  }

       }

    }else{
      alert("普通工单选项没配置，请在故障设置选择配置")
    }

 }else{

 }

   }else{
      try {
        $("#SOLUTION").val("")

         $("#tishi").html("未找到对应的处理过程，请手动填写处理过程,20秒后将自动刷新");
        setTimeout(function(){
        $("#savebtn").click(); //点击保存

     window.location.reload();//刷新重试
     },10000);

         } catch (err) {

         }

    }

if (localStorage.getItem("PD") != null) {
} else{
      try {
        $("#SOLUTION").val("")
        $("#tishi").html("未找到对应的处理过程，请手动填写处理过程,20秒后将自动刷新");
     setTimeout(function(){
         $("#savebtn").click(); //点击保存
     window.location.reload();//刷新重试
     },3000);
         }catch (err) {
        }
 }

}else if(url.indexOf("SOURCE_TYPE=SJLY_3") >= 0){ //新增工单 建单界面
//console.log('建单界面');
// ----------------科室位置随机分配-----------------------------------
  if (localStorage.getItem("teshu")==='特殊') {  //特殊科室位置随机分配
    if(bbbt.length > 0){
    console.log('建单-特殊位置');
var numQ = Math.floor(Math.random()*bbbt.length);
$("span:contains('前台工单')").click();
$("span:contains('常规处理')").click();
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQ]);
$("#REPORT_TEL").val(EE[numQ]);
$("#REPORT_NAME").val(DD[numQ]);
$("#REPAIR_DEPARTMENT_NAME").click();


setTimeout(function() {
var time1 = window.localStorage.getItem("time1")
var time2 = time1-2
function clock(){
if (time2 > 0) {
      var dataid = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
      var dataid2= dataid + ""
      if(dataid2== ""||dataid2== " "||dataid2== "undefined"){
      $("#tishi").html("位置索引不到，正在更换位置！");
var numQQ = Math.floor(Math.random()*bbbt.length);
$("span:contains('前台工单')").click();
$("span:contains('常规处理')").click();
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQQ]);
$("#REPORT_TEL").val(EE[numQQ]);
$("#REPORT_NAME").val(DD[numQQ]);
$("#REPAIR_DEPARTMENT_NAME").click();


var min11 = QY1[numQQ];
var max11 = QY2[numQQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);
if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= 1;      }
if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrta.length);    }
 var rand = Math.floor(Math.random()*(max1-min1))+min1;
 var rand1 =rand-1;
console.log('特殊位置序号 ：',numQ+1);
console.log('特殊位置设置的故障序号最小值 ：',min1);
console.log('特殊位置设置的故障序号最大值 ：',max1);
console.log('随机故障数序号 ：',rand);
console.log('序号：',rand ,'对应的故障描述 ：',arrta[rand1]);
$("#REPAIR_DESCRIPTION").val(arrta[rand1]);
$("#FAILURE_TYPE").val(arrtc[rand1]);
$("#TYPE_INIT").val(arrtc[rand1]);
$("#REASON").val(arrte[rand1]);
$("#TEMP_REASON").val(arrtd[rand1]);
$("#TEMP_TYPE").val(arrtb[rand1]);
$("#FAILURE_TYPE_STR").val(arrtb[rand1]);
$(":contains('否')").click(); //修改联系电话点 否
 //  if(typeof(arrta[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");        }
      }else{
             $("#REPAIR_DEPARTMENT_ID").click(); //
            if( $(".table.table-condensed.table-sm").find("tr:eq(1)")){
            $(".table.table-condensed.table-sm").find("tr:eq(1)").click;
              //  console.log($(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id"));
               }

      console.log("报修科室ID",dataid2);
      $("#REPAIR_DEPARTMENT_ID").val(dataid2);
      $("#REMARK").click();
      $("#REMARK").focus();
      $("#tishi").html("");
      clearInterval(t);
      }
  time2--;
 }else  {
 $("#tishi").html("获取不到位置，请检查网络！三秒后将刷新重试");
   clearInterval(t);
   setTimeout(function(){
     window.location.reload();//刷新重试
     },3000);
  }
}
var t = setInterval(clock,300);

}, 100);
      }else{
      alert("特殊位置没配置，请在位置设置选择配置")
    }

  } else  if (localStorage.getItem("teshu")==='普通') {   //普通科室位置随机分配
    if(bbbs.length > 0){
         console.log('普通科室位置');
 var numQ =  Math.floor(Math.random()*(AA.length-bbbt.length))+bbbt.length;
    console.log('普通位置开始序号',bbbt.length+1);
    console.log('普通位置结束序号',AA.length);
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQ]);
$("#REPORT_TEL").val(EE[numQ]);
$("#REPORT_NAME").val(DD[numQ]);
$("#REPAIR_DEPARTMENT_NAME").click();
setTimeout(function() {
var time1 = window.localStorage.getItem("time1")
var time2 = time1-2
function clock(){
if (time2 > 0) {
      var dataid = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
      var dataid2= dataid + ""
      if(dataid2== ""||dataid2== " "||dataid2== "undefined"){
      $("#tishi").html("位置索引不到，正在更换位置！");
var numQQ = Math.floor(Math.random()*bbbs.length);
$("span:contains('前台工单')").click();
$("span:contains('常规处理')").click();
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQQ]);
$("#REPORT_TEL").val(EE[numQQ]);
$("#REPORT_NAME").val(DD[numQQ]);
$("#REPAIR_DEPARTMENT_NAME").click();


var min11 = QY1[numQQ];
var max11 = QY2[numQQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);
if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= Number( 1+arrt.length);      }
if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrpa.length+arrt.length);    }
 var rand = Math.floor(Math.random()*(max1-min1+1))+min1;
 var rand1 =rand-arrt.length-1;
console.log('随机的位置序号 ：',numQQ+1);
console.log('普通位置设置的故障序号最小值 ：',min1);
console.log('普通位置设置的故障序号最大值 ：',max1);
console.log('随机的故障序号 ：',rand);
console.log('普通工单的第：',rand1+1,'张');
console.log('序号：',rand ,'对应的故障描述 ：',arrpa[rand1]);
$("#REPAIR_DESCRIPTION").val(arrpa[rand1]);
$("#FAILURE_TYPE").val(arrpc[rand1]);
$("#TYPE_INIT").val(arrpc[rand1]);
$("#REASON").val(arrpe[rand1]);
$("#TEMP_REASON").val(arrpd[rand1]);
$("#TEMP_TYPE").val(arrpb[rand1]);
$("#FAILURE_TYPE_STR").val(arrpb[rand1]);
$(":contains('否')").click(); //修改联系电话点 否
      }else{
      console.log("报修科室ID",dataid2);
      $("#REPAIR_DEPARTMENT_ID").val(dataid2);
      $("#REMARK").click();
      $("#REMARK").focus();
      $("#tishi").html("");
      clearInterval(t);
      }
  time2--;
 }else  {
 $("#tishi").html("获取不到位置，请检查网络！三秒后将刷新重试");
   clearInterval(t);
   setTimeout(function(){
     window.location.reload();//刷新重试
     },3000);
  }
}
var t = setInterval(clock,300);
}, 100);
        }else{
      alert("普通位置没配置，请在位置设置选择配置")
    }

 }else{
 }
// ----------------故障类型随机分配-----------------------------------

  if (localStorage.getItem("teshu")==='特殊') {
    if(arrt.length > 0){
        console.log('建单-特殊工单')
       $("#REPAIR_ORDER_TYPE").find("option[value='GDLX_2']").attr("selected",true);
       $(".chosen-single.chosen-single-with-deselect").html("特殊");
var min11 = QY1[numQ];
var max11 = QY2[numQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);
if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= 1;      }
if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrta.length);    }
 var rand = Math.floor(Math.random()*(max1-min1))+min1;
 var rand1 =rand-1;
console.log('特殊位置序号 ：',numQ+1);
console.log('特殊位置设置的故障序号最小值 ：',min1);
console.log('特殊位置设置的故障序号最大值 ：',max1);
console.log('随机故障数序号 ：',rand);
console.log('序号：',rand ,'对应的故障描述 ：',arrta[rand1]);
$("#REPAIR_DESCRIPTION").val(arrta[rand1]);
$("#FAILURE_TYPE").val(arrtc[rand1]);
$("#TYPE_INIT").val(arrtc[rand1]);
$("#REASON").val(arrte[rand1]);
$("#TEMP_REASON").val(arrtd[rand1]);
$("#TEMP_TYPE").val(arrtb[rand1]);
$("#FAILURE_TYPE_STR").val(arrtb[rand1]);
$(":contains('否')").click(); //修改联系电话点 否
// if(typeof(arrta[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");        }
    }else{
      alert("特殊工单选项没配置，请在故障设置选择配置")
    }
  } else  if (localStorage.getItem("teshu")==='普通') {
    if(arrp.length > 0){
       console.log('建单-普通工单')
var min11 = QY1[numQ];
var max11 = QY2[numQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);
if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= Number( 1+arrt.length);      }
if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrpa.length+arrt.length);    }
 var rand = Math.floor(Math.random()*(max1-min1+1))+min1;
 var rand1 =rand-arrt.length-1;
console.log('随机的位置序号 ：',numQ+1);
console.log('普通位置设置的故障序号最小值 ：',min1);
console.log('普通位置设置的故障序号最大值 ：',max1);
console.log('随机的故障序号 ：',rand);
console.log('普通工单的第：',rand1+1,'张');
console.log('序号：',rand ,'对应的故障描述 ：',arrpa[rand1]);
//if(typeof(arrta[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");        }
$("#REPAIR_DESCRIPTION").val(arrpa[rand1]);
$("#FAILURE_TYPE").val(arrpc[rand1]);
$("#TYPE_INIT").val(arrpc[rand1]);
$("#REASON").val(arrpe[rand1]);
$("#TEMP_REASON").val(arrpd[rand1]);
$("#TEMP_TYPE").val(arrpb[rand1]);
$("#FAILURE_TYPE_STR").val(arrpb[rand1]);
$(":contains('否')").click(); //修改联系电话点 否
    }else{
      alert("普通工单选项没配置，请在故障设置选择配置")
    }

 }else{

 }

        }

     }

   }

}

function fuzhibaocunXXX(){
var textA  = [],textB  = [];
$("#baocun").click(function(){
        var text2 = $("#TEMP_TYPE").val(), text3 = $("#TYPE_INIT").val(), text4 = $("#REASON_STR").attr("alt"), text5 =  $("#REASON").val();
        textA.push(text2);
        textA.push(text3);
        textB.push(text4);
        textB.push(text5);
 })

$("#baocun3").click(function(){
  var url = window.location.href;
     if(url.indexOf("commonEdit=yes&finish=1") >= 0){   //建单后处理完成页面
      var text1 = $("#REPAIR_DESCRIPTION").val();
      var text2 = $("#FAILURE_TYPE_STR").val();
      var text3 = $("#TYPE_INIT").val();
      var text4 = $("#REASON_STR").val();
      var text5 = $("#REASON").val();
      var text6 = $("#FAULT_ADDRESS_chosen").find('span:first').html();
      var text7 = $("#SOLUTION").val();
      var text8 = $("#USE_SUGGEST").val();
      closeiframelayer(); //关闭页面
       $("#set",top.document).click();
       $("#shezhi",top.document).click();
     // $("#biaoti",top.document).find("#table_baocun3").remove(); //清空复制的模板工单
    var table = document.createElement("table");
        table.id = "table_baocun3";
         //console.log('复制工单信息');
          var table1 =
            "<tr class='TALB' style='padding: 4px 10px;' >" +
            "<td class='fzgdxx'><input  class='G1' style='font-size: 14px; width: 50px; color: rgb(66, 139, 202); font-weight: bold;'  type=\"text\" readonly='readonly'  value= '复制'> </input></td>" +
            "<td class='center'><input  class='A1'  name='abcd'   style='font-size:14px; width:250px;'   type=\"text\"  value= "+text1+"> </input></td>" +
            "<td class='center'><input  class='B1'  name='abcd'   style='font-size:14px; width:250px;'  type=\"text\"  value="+text2+" ></td> " +
            "<td class='center'><input  class='C1'  name='abcd'   style='font-size:14px; width:80px;'   readonly='readonly'  type=\"text\"  value="+text3+" ></td>" +
            "<td class='center'><input  class='D1'  name='abcd'   style='font-size:14px; width:110px;'   type=\"text\"   value="+text4+" >  </td> " +
            "<td class='center'><input  class='E1'  name='abcd'  style='font-size:14px; width:90px;'   readonly='readonly'   type=\"text\"  value="+text5+" > </input></td>" +
            "<td class='center'><input  class='K1'  name='abcd'  style='font-size:14px; width:80px;'   type=\"text\"   value="+text6+" >  </td> " +
            "<td class='center'><input  class='F1'  name='abcd'  style='font-size:14px; width:200px;'   type=\"text\"  value= "+text7+"> </input></td>" +
            "<td class='center'><input  class='J1'  name='abcd'  style='font-size:14px; width:80px;'   type=\"text\"  value= "+text8+"> </input></td>" +
            "<td class='center'><a  class='removeclass' ><input  class='P1'  type='button'  value='删除'  style='font-size:14px; width:50px;'  > </a></td></tr>"+
             "";
       table.innerHTML = table1;
      $("#biaoti",top.document).after(table);
 }else{

     alert("请到处理完成后的界面复制工单");
}
 })

$("#baocun2").click(function(){
      var text1 = $("#REPAIR_DESCRIPTION").val();
      var text2 = $("#FAILURE_TYPE_STR").val();
      var text3 = $("#TYPE_INIT").val();
      var text4 = $("#REASON_STR").val();
      var text5 = $("#REASON").val();
      var text6 = $("#FAULT_ADDRESS_chosen").find('span:first').html();
      var text7 = $("#SOLUTION").val();
////console.log(text1  + "\n" +text2 + "\n" +text3 + "\n" +text4 + "\n" +text5 + "\n" +text6 + "\n" +text7 + "\n" +text8) //hello
var oInput = document.createElement('textarea');
        oInput.value = text1   + "\n" +text2  +"\n" +text3 + "\n" +text4 + "\n" +text5 + "\n" +text6 + "\n" +text7;
        document.body.appendChild(oInput);
        oInput.select(); // 选择对象
        document.execCommand("Copy"); // 执行浏览器复制命令
        oInput.className = 'oInput';
        oInput.style.display='none';
        alert(oInput.value);
})

$("#xiugai").click(function(){
var url = window.location.href;

  //  $("#tishi").html("");
 var arrt = [];
  var arrta = [];
  var arrtb = [];
  var arrtc = [];
  var arrtd = [];
  var arrte = [];
  var arrtf = [];
  var arrtg = [];
  var arrtk = [];
var arrp = [];
  var arrpa = [];
  var arrpb = [];
  var arrpc = [];
  var arrpd = [];
  var arrpe = [];
  var arrpf = [];
  var arrpg = [];
  var arrpk = [];
for(var p = 0; p < J.length; p++){

      if (J[p]==='特殊' ) {
       arrt.push(J[p])
       arrta.push(A[p])
       arrtb.push(B[p])
       arrtc.push(C[p])
       arrtd.push(D[p])
       arrte.push(E[p])
       arrtf.push(F[p])
       arrtg.push(G[p])
       arrtk.push(K[p])
        } else {
       arrp.push(J[p])
       arrpa.push(A[p])
       arrpb.push(B[p])
       arrpc.push(C[p])
       arrpd.push(D[p])
       arrpe.push(E[p])
       arrpf.push(F[p])
       arrpg.push(G[p])
       arrpk.push(K[p])
          }
      }

  var bbbt = [];
  var bbbta = [];
  var bbbtb = [];
  var bbbtc = [];
  var bbbtd = [];
  var bbbte = [];
  var bbbtf = [];
  var bbbtg = [];
  var bbbs = [];
  var bbbsa = [];
  var bbbsb = [];
  var bbbsc = [];
  var bbbsd = [];
  var bbbse = [];
  var bbbsf = [];
  var bbbsg = [];

for(var M = 0; M < TSS.length; M++){
      if (TSS[M]==='特殊' ) {
       bbbt.push(J[M])
       bbbta.push(A[M])
       bbbtb.push(B[M])
       bbbtc.push(C[M])
       bbbtd.push(D[M])
       bbbte.push(E[M])
       bbbtf.push(F[M])
       bbbtg.push(G[M])
        } else {
       bbbs.push(J[M])
       bbbsa.push(A[M])
       bbbsb.push(B[M])
       bbbsc.push(C[M])
       bbbsd.push(D[M])
       bbbse.push(E[M])
       bbbsf.push(F[M])
       bbbsg.push(G[M])
          }
      }

// ----------------科室位置随机分配-----------------------------------

  if (localStorage.getItem("teshu")==='特殊') {  //特殊科室位置随机分配
    if(bbbt.length > 0){
    console.log('建单-特殊位置');
var numQ = Math.floor(Math.random()*bbbt.length);
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQ]);
$("#REPORT_TEL").val(EE[numQ]);
$("#REPORT_NAME").val(DD[numQ]);
$("#REPAIR_DEPARTMENT_NAME").click();
setTimeout(function() {
var time1 = window.localStorage.getItem("time1")
var time2 = time1-2
function clock(){
if (time2 > 0) {
      var dataid = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
      var dataid2= dataid + ""
      if(dataid2== ""||dataid2== " "||dataid2== "undefined"){
      $("#tishi").html("位置索引不到，正在更换位置！");
var numQQ = Math.floor(Math.random()*bbbt.length);
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQQ]);
$("#REPORT_TEL").val(EE[numQQ]);
$("#REPORT_NAME").val(DD[numQQ]);
$("#REPAIR_DEPARTMENT_NAME").click();
var min11 = QY1[numQQ];
var max11 = QY2[numQQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);
if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= 1;      }
if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrpa.length);    }
 var rand = Math.floor(Math.random()*(max1-min1+1))+min1;
 var rand1 =rand-arrt.length;
console.log('特殊位置序号 ：',numQQ+1);
console.log('特殊故障序号最小值 ：',min1);
console.log('特殊位置设置的故障序号最大值 ：',max1);
console.log('随机故障数序号 ：',rand);
console.log('序号：',rand ,'对应的故障描述 ：',arrpa[rand1]);
//if(typeof(arrpa[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");        }
$("#REPAIR_DESCRIPTION").val(arrpa[rand1]);
$("#FAILURE_TYPE").val(arrpc[rand1]);
$("#TYPE_INIT").val(arrpc[rand1]);
$("#REASON").val(arrpe[rand1]);
$("#TEMP_REASON").val(arrpd[rand1]);
$("#TEMP_TYPE").val(arrpb[rand1]);
$("#FAILURE_TYPE_STR").val(arrpb[rand1]);
$(":contains('否')").click(); //修改联系电话点 否
      }else{
      console.log(dataid2);
      $("#REPAIR_DEPARTMENT_ID").val(dataid2);
      $("#REMARK").focus();
      $("#tishi").html("");
      clearInterval(t);
      }
  time2--;
 }else  {
 $("#tishi").html("获取不到位置，请检查网络！三秒后将刷新重试");
   clearInterval(t);
   setTimeout(function(){
     window.location.reload();//刷新重试
     },3000);
  }
}
var t = setInterval(clock,300);
}, 100);
      }else{
      alert("特殊位置没配置，请在位置设置选择配置")
    }

  } else  if (localStorage.getItem("teshu")==='普通') {   //普通科室位置随机分配
    if(bbbs.length > 0){
    console.log('普通科室位置');
    console.log('普通位置开始序号',bbbt.length+1);
    console.log('普通位置结束序号',AA.length);
 var numQ =  Math.floor(Math.random()*(AA.length-bbbt.length))+bbbt.length;
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQ]);
$("#REPORT_TEL").val(EE[numQ]);
$("#REPORT_NAME").val(DD[numQ]);
$("#REPAIR_DEPARTMENT_NAME").click();
setTimeout(function() {
var time1 = window.localStorage.getItem("time1")
var time2 = time1-2
function clock(){
if (time2 > 0) {
      var dataid = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
      var dataid2= dataid + ""
      if(dataid2== ""||dataid2== " "||dataid2== "undefined"){
      $("#tishi").html("位置索引不到，正在更换位置！");
var numQQ = Math.floor(Math.random()*bbbs.length);
$("#REPAIR_DEPARTMENT_NAME").val(BB[numQQ]);
$("#REPAIR_ADDRESS_DETAIL").val(CC[numQQ]);
$("#REPORT_TEL").val(EE[numQQ]);
$("#REPORT_NAME").val(DD[numQQ]);
$("#REPAIR_DEPARTMENT_NAME").click();
var min11 = QY1[numQQ];
var max11 = QY2[numQQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);
if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= Number( 1+arrt.length);      }
if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrpa.length+arrt.length);    }
 var rand = Math.floor(Math.random()*(max1-min1+1))+min1;
 var rand1 =rand-arrt.length-1;
console.log('随机的位置序号 ：',numQQ+1);
console.log('普通位置设置的故障序号最小值 ：',min1);
console.log('普通位置设置的故障序号最大值 ：',max1);
console.log('随机的故障序号 ：',rand);
console.log('普通工单的第：',rand1+1,'张');
console.log('序号：',rand ,'对应的故障描述 ：',arrpa[rand1]);
//if(typeof(arrpa[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");        }
$("#REPAIR_DESCRIPTION").val(arrpa[rand1]);
$("#FAILURE_TYPE").val(arrpc[rand1]);
$("#TYPE_INIT").val(arrpc[rand1]);
$("#REASON").val(arrpe[rand1]);
$("#TEMP_REASON").val(arrpd[rand1]);
$("#TEMP_TYPE").val(arrpb[rand1]);
$("#FAILURE_TYPE_STR").val(arrpb[rand1]);
$(":contains('否')").click(); //修改联系电话点 否
      }else{
      console.log(dataid2);
      $("#REPAIR_DEPARTMENT_ID").val(dataid2);
      $("#REMARK").focus();
      $("#tishi").html("");
      clearInterval(t);
      }
  time2--;
 }else  {
 $("#tishi").html("获取不到位置，请检查网络！三秒后将刷新重试");
   clearInterval(t);
   setTimeout(function(){
     window.location.reload();//刷新重试
     },3000);
  }
}
var t = setInterval(clock,300);
}, 100);
        }else{
      alert("普通位置没配置，请在位置设置选择配置")
    }
 }else{

 }
setTimeout(function() {
    if ($(".table.table-condensed.table-sm").find("tr:eq(1)")) {
        console.log($(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id"));
        $("#REPAIR_DEPARTMENT_ID").val($(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id"));
       }

var time = $(".table.table-condensed.table-sm").find("tr:eq(1)").attr("data-id");
var val= time + ""
if(val== ""||val== " "||val== "undefined"){
 $("#tishi").html("位置不对，请手动填写位置！！！");
}else{
  $("#tishi").html("");
  }
  $("#REMARK").focus();
}, 1000);

 // ----------------故障类型随机分配-----------------------------------

  if (localStorage.getItem("teshu")==='特殊') {
    if(arrt.length > 0){
        console.log('建单-特殊工单')
       $("#REPAIR_ORDER_TYPE").find("option[value='GDLX_2']").attr("selected",true);
       $(".chosen-single.chosen-single-with-deselect").html("特殊");

var min11 = QY1[numQ];
var max11 = QY2[numQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);

if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= 1;      }

if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrta.length);    }
 var rand = Math.floor(Math.random()*(max1-min1+1))+min1;

 var rand1 =rand-1;

console.log('特殊位置序号 ：',numQ+1);
console.log('特殊位置设置的故障序号最小值 ：',min1);
console.log('特殊位置设置的故障序号最大值 ：',max1);

console.log('随机故障数序号 ：',rand);

console.log('序号：',rand ,'对应的故障描述 ：',arrta[rand1]);

//if(typeof(arrta[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");      }

$("#REPAIR_DESCRIPTION").val(arrta[rand1]);

$("#FAILURE_TYPE").val(arrtc[rand1]);

$("#TYPE_INIT").val(arrtc[rand1]);

$("#REASON").val(arrte[rand1]);

$("#TEMP_REASON").val(arrtd[rand1]);

$("#TEMP_TYPE").val(arrtb[rand1]);

$("#FAILURE_TYPE_STR").val(arrtb[rand1]);

$(":contains('否')").click(); //修改联系电话点 否

 if(url.indexOf("STATE=RS_5&REPAIR") >= 0||url.indexOf("commonEdit=yes&finish=1") >= 0){   //建单后 未处理页面
$("#FINISH_TYPE_STR").val(arrtb[rand1]);

$("#REASON_STR").val(arrtd[rand1]);

$("#FAILURE_TYPE").val(arrtc[rand1]);

$("#TEMP_REASON").val(arrtd[rand1]);

$("#SOLUTION").val(arrtf[rand1])

$("#USE_SUGGEST").val()

                   if (arrtk[rand1]==='医生站' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_1']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("医生站");

                     }else if (arrtk[rand1]==='护士站' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_2']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("护士站");

                     }else if (arrtk[rand1]==='药剂' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_3']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("药剂");

                     }else if (arrtk[rand1]==='财务' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_4']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("财务");

                     }else if (arrtk[rand1]==='其他' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_5']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("其他");

                     }
}

    }else{
      alert("特殊工单选项没配置，请在故障设置选择配置")
    }

  } else  if (localStorage.getItem("teshu")==='普通') {
    if(arrp.length > 0){
       console.log('建单-普通工单')

var min11 = QY1[numQ];
var max11 = QY2[numQ];
var min1 = parseInt(min11);
var max1 = parseInt(max11);

if(min11== ""||min11== " "||min11== "NaN"||min11== "null"){min1= Number( 1+arrt.length);      }

if(max11== ""||max11== " "||max11== "NaN"||max11== "null"){max1= Number(arrpa.length+arrt.length);    }
 var rand = Math.floor(Math.random()*(max1-min1+1))+min1;

 var rand1 =rand-arrt.length-1;

console.log('随机的位置序号 ：',numQ+1);
console.log('普通位置设置的故障序号最小值 ：',min1);
console.log('普通位置设置的故障序号最大值 ：',max1);

console.log('随机的故障序号 ：',rand);

console.log('普通工单的第：',rand1+1,'张');

console.log('序号：',rand ,'对应的故障描述 ：',arrpa[rand1]);

//if(typeof(arrpa[rand1]) == "undefined"){     $("#tishi").html("位置对应的工单为undefined，请检查对应故障序号配置");        }

$("#REPAIR_DESCRIPTION").val(arrpa[rand1]);

$("#FAILURE_TYPE").val(arrpc[rand1]);

$("#TYPE_INIT").val(arrpc[rand1]);

$("#REASON").val(arrpe[rand1]);

$("#TEMP_REASON").val(arrpd[rand1]);

$("#TEMP_TYPE").val(arrpb[rand1]);

$("#FAILURE_TYPE_STR").val(arrpb[rand1]);

$(":contains('否')").click(); //修改联系电话点 否

 if(url.indexOf("STATE=RS_5&REPAIR") >= 0||url.indexOf("commonEdit=yes&finish=1") >= 0){   //建单后 未处理页面
$("#FINISH_TYPE_STR").val(arrpb[rand1]);

$("#REASON_STR").val(arrpd[rand1]);

$("#FAILURE_TYPE").val(arrpc[rand1]);

$("#TEMP_REASON").val(arrpd[rand1]);

$("#SOLUTION").val(arrpf[rand1])

$("#USE_SUGGEST").val()

                   if (arrpk[rand1]==='医生站' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_1']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("医生站");

                     }else if (arrpk[rand1]==='护士站' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_2']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("护士站");

                     }else if (arrpk[rand1]==='药剂' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_3']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("药剂");

                     }else if (arrpk[rand1]==='财务' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_4']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("财务");

                     }else if (arrpk[rand1]==='其他' ) {

                       $("#FAULT_ADDRESS").find("option[value='GZFSDD_5']").attr("selected",true);
                       $('.chosen-single.chosen-single-with-deselect span:first').html("其他");

                     }
}

    }else{
      alert("普通工单选项没配置，请在故障设置选择配置")
    }

 }else{

 }

})

}

JDDX();

fuzhibaocunXXX();

function gzyyXXX() {

$(".D1").change(function() {   //故障类型匹配ID
 var ttt =   $(this).val();

 if ( ttt == "人/操作不当") {
  $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "人/操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人/人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "机/设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "机/稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "机/硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "机/安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");
}else  if ( ttt == "机/第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "机/打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "机/电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "机/卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "机/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "机/其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "机/硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "机/性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "机/质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "机/操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "机/软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "料/耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "料/缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "料/硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "法/违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "环/软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网络/网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网络/网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络/网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "网络/前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "应用系统/HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "应用系统/LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "应用系统/PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "应用系统/三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "应用系统/医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");

//--------------------------复制的值匹配ID
  }else  if ( ttt == "操作不当") {
   $(this).parent().parent().find('.E1').val("GZYY_1_2");
}else  if ( ttt == "操作咨询") {
   $(this).parent().parent().find('.E1').val("GZYY_1_3");
}else  if ( ttt == "人员使用故障") {
   $(this).parent().parent().find('.E1').val("GZYY_1_4");
}else  if ( ttt == "设备老化") {
   $(this).parent().parent().find('.E1').val("GZYY_2_1");
}else  if ( ttt == "硬件损坏") {
   $(this).parent().parent().find('.E1').val("GZYY_2_6");
}else  if ( ttt == "安装系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_8");

}else  if ( ttt == "第三方系统") {
   $(this).parent().parent().find('.E1').val("GZYY_2_9");
}else  if ( ttt == "稳定性不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_10");
}else  if ( ttt == "打印机安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_11");
}else  if ( ttt == "电脑安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_12");
}else  if ( ttt == "卡纸") {
   $(this).parent().parent().find('.E1').val("GZYY_2_13");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_2_14");
}else  if ( ttt == "其它设备安装") {
   $(this).parent().parent().find('.E1').val("GZYY_2_15");
}else  if ( ttt == "硬件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_16");
}else  if ( ttt == "性能不足") {
   $(this).parent().parent().find('.E1').val("GZYY_2_2");
}else  if ( ttt == "质量问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_3");
}else  if ( ttt == "操作系统问题") {
   $(this).parent().parent().find('.E1').val("GZYY_2_4");
}else  if ( ttt == "软件故障") {
   $(this).parent().parent().find('.E1').val("GZYY_2_5");
}else  if ( ttt == "耗材问题") {
   $(this).parent().parent().find('.E1').val("GZYY_3_1");
}else  if ( ttt == "缺少运行组件") {
   $(this).parent().parent().find('.E1').val("GZYY_3_2");
}else  if ( ttt == "硬件不兼容") {
   $(this).parent().parent().find('.E1').val("GZYY_3_3");
}else  if ( ttt == "违背管理流程") {
   $(this).parent().parent().find('.E1').val("GZYY_4_1");
}else  if ( ttt == "软件运行环境") {
   $(this).parent().parent().find('.E1').val("GZYY_5_3");
}else  if ( ttt == "网口开通") {
   $(this).parent().parent().find('.E1').val("GZYY_6_1");
}else  if ( ttt == "网口/线路修复") {
   $(this).parent().parent().find('.E1').val("GZYY_6_2");
}else  if ( ttt == "网络权限变更") {
   $(this).parent().parent().find('.E1').val("GZYY_6_4");
}else  if ( ttt == "前台故障协助") {
   $(this).parent().parent().find('.E1').val("GZYY_6_5");
}else  if ( ttt == "HIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_1");
}else  if ( ttt == "LIS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_2");
}else  if ( ttt == "PACS") {
   $(this).parent().parent().find('.E1').val("GZYY_7_3");
}else  if ( ttt == "三方应用系统") {
   $(this).parent().parent().find('.E1').val("GZYY_7_4");
}else  if ( ttt == "医技") {
   $(this).parent().parent().find('.E1').val("GZYY_7_5");

  }else{

    ////console.log("未找到对应的故障ID");

    $(this).parent().parent().find('.E1').val("");
     }

    });

 }
gzyyXXX();

function kuaijieXXX() {

    if (localStorage.getItem("kuaijie") != null) {

var url = window.location.href;

if(url.indexOf("target=ENGINEER&sign=TOTAL_FINISH") >= 0){   //工单统计 个人工单界面

var onchangeValue = $("td").find(".btn-group").children("a:contains('查看'):first").attr("onclick");
   // alert(onchangeValue);

   //  $('.btn.btn-xs.btn-primary').each(function (index, item) {
      var sc = document.createElement("div");
          sc.id = "shanchu";
          var sc11 =

           '<a class="btn btn-white btn-danger btn-sm11" onclick="">删除'+
            "</a>" +

            "</div>" +

            "";

       sc.innerHTML = sc11;
      $('.btn.btn-xs.btn-primary').after(sc);
   // });

$(document).on("click",".btn.btn-white.btn-danger.btn-sm11",function(){

 var onchangeValue11 = $(this).parent().parent().children("a:contains('查看'):first").attr("onclick");

  onchangeValue11=onchangeValue11.replace(/[^0-9]/ig,"");
//  alert(onchangeValue11);

 var scgn= String(onchangeValue11) + ""
 // dele('scgn');
  console.log("del('"+scgn+"');");
   var url = "http://itil118.wchscu.cn:80/repair/delete.do?REPAIR_ID=" + scgn + "&tm=" + new Date().getTime();
     form_del(url, 1);
})

      //删除
    function del(Id){
        // checkRepairState2(Id,'del',routerType,function (result) {
        var url = "repair/delete.do?REPAIR_ID="+Id+"&tm="+new Date().getTime();
        form_del(url,1 );
        // });
    }

 }

var url = window.location.href;

if(url.indexOf("repair/mlist.do") >= 0){   //我的工单界面

   //  $('.btn.btn-xs.btn-primary').each(function (index, item) {
      var sc = document.createElement("span");
          sc.id = "sc";
          var sc11 =

           '&nbsp&nbsp<a class="btn btn-white btn-danger btn-sm" id="shanchu"  onclick="">删除'+
            "</a>" +

            "</span>" +

            "";
       sc.innerHTML = sc11;
      $('.btn.btn-white.btn-success.btn-sm').after(sc);
   // });

$(document).on("click","#shanchu",function(){

 var onchangeValue11 = $(this).parent().parent().children("a:contains('查看'):first").attr("onclick");

  onchangeValue11=onchangeValue11.replace(/[^0-9]/ig,"");
//alert(onchangeValue11);

 var scgn= String(onchangeValue11) + ""
  console.log("del('"+scgn+"');");
   var url = "http://itil118.wchscu.cn:80/repair/delete.do?REPAIR_ID=" + scgn + "&tm=" + new Date().getTime();
     form_del(url, 1);
})

  function del(Id) {
        // checkRepairState2(Id,'del',routerType,function (result) {
        var url = "http://itil118.wchscu.cn:80/repair/delete.do?REPAIR_ID=" + Id + "&tm=" + new Date().getTime();
        form_del(url, 1);
        // });
    }

 }

if(url.indexOf("mt/alllist.do") >= 0){   //工单查询界面

     var leng = $("#simple-table tr").length;
    for (var i = 0; i <= leng; i++) {
        var place = $("#simple-table tr").eq(i).find("td:last").html();

          $("#simple-table tr").eq(i).find("td:last").html("" + place + "<a class='btn btn-white btn-danger btn-sm333' id='"+i+"' >删除</a>");
    }

  $(document).on("click",".btn.btn-white.btn-danger.btn-sm333",function(){

 // alert($(this).attr("id"))
  var sst = $(this).attr("id");
 var onchangeValue11 = $("#simple-table tr").eq(sst).find("span:first").attr("id");
 // alert(onchangeValue11);

  onchangeValue11=onchangeValue11.replace(/[^0-9]/ig,"");
//  alert(onchangeValue11);

 var scgn= String(onchangeValue11) + ""
 // dele('scgn');
  console.log("del('"+scgn+"');");
   var url = "http://itil118.wchscu.cn:80/repair/delete.do?REPAIR_ID=" + scgn + "&tm=" + new Date().getTime();
     form_del(url, 1);
  })

}

if(url.indexOf("repair/list.do") >= 0){   //服务台界面

  var onchangeValue = $("td").find(".btn-group").children("a:contains('编辑'):first").attr("onclick");
  //alert(onchangeValue);

   //  $('.btn.btn-xs.btn-primary').each(function (index, item) {
      var sc = document.createElement("span");
          sc.id = "sc";
          var sc11 =

           '&nbsp&nbsp<a class="btn btn-white btn-danger btn-sm" id="shanchu11"  onclick="">删除'+
            "</a>" +

            "</span>" +

            "";
       sc.innerHTML = sc11;
     $("#simple-table tr td").find("a:contains('编辑'):first").after(sc);
   // });

$(document).on("click","#shanchu11",function(){

 var onchangeValue11 = $(this).parent().parent().children("a:contains('编辑'):first").attr("onclick");

  onchangeValue11=onchangeValue11.replace(/[^0-9]/ig,"");
//alert(onchangeValue11);

 var scgn= String(onchangeValue11) + ""
  console.log("del('"+scgn+"');");
   var url = "http://itil118.wchscu.cn:80/repair/delete.do?REPAIR_ID=" + scgn + "&tm=" + new Date().getTime();
     form_del(url, 1);
})

  function del(Id) {
        // checkRepairState2(Id,'del',routerType,function (result) {
        var url = "http://itil118.wchscu.cn:80/repair/delete.do?REPAIR_ID=" + Id + "&tm=" + new Date().getTime();
        form_del(url, 1);
        // });
    }

 }

  }

$("body").keydown(function(event){
    if (event.keyCode == 37){
    if (localStorage.getItem("kuaijie") != null) {
     ////console.log('方向左键');
         $("a:contains('上页'):first").click(); //点击
	  }
   else{
      //alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 38){
    if (localStorage.getItem("kuaijie") != null) {
        ////console.log('方向上键');
        setTimeout(function(){//220毫秒后运行下列程序

        $("a:contains('处理'):eq(2)").click(); //点击处理工单
        },200);

	  }
   else{
      //alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 39){
    if (localStorage.getItem("kuaijie") != null) {
      ////console.log('方向右键');
	          $("a:contains('下页'):first").click(); //点击下一页
	  }
   else{
      //alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 40){
    if (localStorage.getItem("kuaijie") != null) {
        ////console.log('方向下键');
	    ////console.log('点击第一个编辑工单');
        setTimeout(function(){//220毫秒后运行下列程序

        //$("#savebtn").click();

        $("a:contains('编辑工单'):eq(0)").click(); //点击编辑工单
         },200);

   }else{
      //alert('快捷功能没有开启，请开启后重试');

       }

   }

   if (event.keyCode == 32){
      if (localStorage.getItem("kuaijie") != null) {
       ////console.log('空格键');
	   ////console.log('点击新增，保存，确定，登录');
         try {
           var url = window.location.href;

                                       if(url.indexOf("repair/mlist.do") >= 0){   //建单后 未处理页面
                                         add();
                                         }

           save(1);
           saveSetting(); //保存菜单页面
           $("#savebtn").click();

         } catch (err) {
         }

          setTimeout(function(){

          $(":contains('否')").click();

          },200);

   }else{
     // //alert('快捷功能没有开启，请开启后重试');

       }

   }

    if (event.keyCode == 13){
        var buttondenglu = document.getElementById("to-recover");
	    if(buttondenglu){    //判断登录界面
         severCheck('1');    //登录界面，直接点击登录按钮
          }
    if (localStorage.getItem("kuaijie") != null) {
       ////console.log('回车键');

        var SAVE=document.getElementById("rwl-setMenu"); //判断页面是不是设置界面
           if(SAVE){

                   saveSetting(); //保存菜单页面
                   }
   } else{
     // //alert('快捷功能没有开启，请开启后重试');

       }

   }

   if (event.keyCode == 27){

    if (localStorage.getItem("kuaijie") != null) {
           ////console.log('ESC键');
        $(":contains('否')").click();

          closeMenu(); //关闭菜单页面
      $(".layui-layer-close.layui-layer-close1").click();

   } else{
      //alert('快捷功能没有开启，请开启后重试');

       }

   }

})

 }

kuaijieXXX();

//----------------------保存工单增加工单号 -----------------------------------------------------------------------------------------------------------------------

$(document).on("click", "a:contains('创建工单')", function() {
    // function gdslj(){

    var n = window.localStorage.getItem("jan")
    var nn = Number(n)
    var c = "1"
    var cc = Number(c)
    window.localStorage.setItem("jan", nn - cc);
    //       }

})

//----------------页面加载判断后进行操作-----------------------------------------------------------------------------------------------------------------------

window.onload = function() {//等待面加载完毕
var url = window.location.href;
$("#layui-layer100001").hide();
$("#layui-layer-shade100001").hide(); 


// -------------------------------------------------------------------------------------------------------------------------
var timeb = window.localStorage.getItem("time1") //建单功能
var timea = window.localStorage.getItem("time2")
var B = Number(timeb) * 1000
var A = Number(timea) * 1000
var seconds2 = Math.floor(Math.random() * (B - A) + A)
var seconds = Math.round(seconds2 / 1000)
var n = window.localStorage.getItem("jan")
var nn = Number(n)
var xg = window.localStorage.getItem("XGGDS")
var xgg = Number(xg)

if (localStorage.getItem("start") != null) { //判断总功能是否开启

 //console.log('总功能已关闭');
    } else {
// console.log('点击我的工单');
         $("#lm18311").click();
        $(":contains('我的工单')").click(); //打开我的工单

        try {
            document.getElementById('keywords').focus(); //聚焦页面
        } catch (err) {}

if(url.indexOf("repair/mlist.do") >= 0){

   if (localStorage.getItem("xuncha") != null) {   //工单界面优化开启
  var study_userData = null;
var userDatalocation = null;
// 查看本地是否存在旧数据
study_userData = GM_getValue("study_userData");
if (!study_userData) {
    study_userData = settingData
    // GM_setValue("study_userData",study_userData);
}
userDatalocation = GM_getValue("userDatalocation");
if (!userDatalocation) {
    userDatalocation = location
    // GM_setValue("study_userData",study_userData);
}
var userSetting = study_userData;
var message = userSetting.message;
var A = userSetting.A ,  B = userSetting.B, C = userSetting.C , D = userSetting.D, E = userSetting.E,  F = userSetting.F, G = userSetting.G, K = userSetting.K

var location = userDatalocation;
var AA = location.A, QY1 = location.QY1, QY2 = location.QY2, TSS = location.TS, BB = location.B, CC = location.C, DD = location.D, EE = location.E
    $("#simple-table tr").eq(0).find("th").eq(2).html("科室名称+联系人"); //工单界面优化设置
    $("#simple-table tr").eq(0).find("th").eq(3).html("科室地址+联系电话");
    $("#simple-table tr").eq(0).find("th").eq(4).html("故障描述+处理过程");
    var leng = $("#simple-table tr").length;
    for (var i = 0; i <= leng; i++) {
        var str = $("#simple-table tr").eq(i).find("td").eq(2).text();
        var str3 = str.replace(/(^\s*)|(\s*$)/g, "");
        var people = str3.substring(str3.lastIndexOf(" ") + 1);
        var str4 = str3.split('\ ')[0];
        var place = str4.substring(str4.lastIndexOf("-") + 1);
        var tel = $("#simple-table tr").eq(i).find("td").eq(3).text();
        var tel1 = tel.replace(/(^\s*)|(\s*$)/g, "");
        $("#simple-table tr").eq(i).find("td").eq(2).html("" + place + "<br>" + people + "");
        $("#simple-table tr").eq(i).find("td").eq(3).html("-----------------<br>" + tel1 + "");
        for (var u = 0; u < BB.length; u++) {
            if (tel1 == EE[u]) {
                $("#simple-table tr").eq(i).find("td").eq(3).html("" +CC[u]+ "<br>" + tel1+ "");
            }
        }
    }
    var aStr2 = $("#simple-table td a").html(); //工单界面优化设置
    var aStr = $("#simple-table td a").length;

    for (var y = 0; y < aStr; y++) {
        var val = $("#simple-table td a").eq(y).html();
        var val3 = val + ""
        var val33 = val3.replace(/(^\s*)|(\s*$)/g, "");
        for (var u = 0; u < A.length; u++) {
            if (val33 === A[u]) {
                $("#simple-table td a").eq(y).html("" + val33 + "<br>------" + F[u] + "--------");
            }

        }
    }

  }
}

if(url.indexOf("repair/mlist.do") >= 0){   //我的工单界面
if (localStorage.getItem("chuli") != 1) { //判断建单功能是否开启
 console.log('处理功能未开');

      if (localStorage.getItem("jandan") != 1) { //判断建单功能是否开启
        console.log('建单功能未开');

                    } else {
                         if (nn > 0) { //判断建单是否完成
                           console.log('开始建单');
                          setTimeout(function() {

                               try    {
                               add();

                                   } catch (err) {}
                                 }, seconds2/5)
                              }
                          }

       } else {

           if ($("div").find(".btn-group").children("a:contains('处理'):last").text() == "处理") { //判断 是否有待处理工单
                console.log('找到“处理” 按钮');
               setTimeout(function() {  //点击处理   随机的等待时间

                                   $("div").find(".btn-group").children("a:contains('处理'):last").click();
                                  console.log('点击“处理” 按钮');
                            }, seconds2/10)

     } else {

      if (localStorage.getItem("jandan") != 1) { //判断建单功能是否开启
        console.log('建单功能未开');

                    } else {
                         if (nn > 0) { //判断建单是否完成
                           console.log('开始建单');
                          setTimeout(function() {

                               try    {
                               add();

                                   } catch (err) {}
                                 }, seconds2/5)
                              }
                          }

       }
    }

 }

  if(url.indexOf("SOURCE_TYPE=SJLY_3") >= 0){ //新增工单 建单界面
 if (localStorage.getItem("jandan") != 1) { //判断建单功能是否开启
   console.log('建单功能未开');

                    } else {
                       console.log('建单功能开启');
                                    //console.log('随机等待时间');
                                    setInterval(function() {
                                        if (seconds > 0) {
                                            seconds--;
                                            $("#times").html("下一步操作等待时间：" + seconds + " 秒"); // 每秒刷新显示一次
                                        }
                                    }, 1000);
                                    setTimeout(function() {
                                        if (localStorage.getItem("start") != null) { //点击前 判断总功能是否开启

                                        } else {
                                            $("a:contains('创建工单')").trigger("click");
                                        }
                                    }, seconds2)
                                    setTimeout(function() {
                                     $(":contains('否')").click();
                                    }, 400);
                                }

 }

if(url.indexOf("STATE=RS_5&REPAIR") >= 0){   //建单后 未处理页面

  if (localStorage.getItem("chuli") != 1) { //判断建单功能是否开启
 console.log('处理功能未开');

       } else {
          console.log('处理功能开启');

                        console.log('随机等待时间');
                        setInterval(function() {
                            if (seconds > 0) {
                               // console.log(seconds);
                                seconds--;
                                $("#times").html("下一步操作等待时间：" + seconds + " 秒"); // 每秒刷新显示一次
                            }
                        }, 1000);
                        setTimeout(function() {
                            if (localStorage.getItem("start") != null) { //判断总功能是否开启

                                //console.log('脚本已关闭');
                            } else {
                                //console.log('脚本判断已开启，下一步');
                                $("#savebtn").click();
                                //console.log('点击保存');
                                setTimeout(function() { //400毫秒后运行下列
                                    $(":contains('否')").click();
                                }, 400);
                            }
                        }, seconds2)
                    }

  }

//***********************************************************************************************************************************

            }

//***************************************BMP工时部分********************************************************************************************
//***************************************BMP工时部分********************************************************************************************
//***************************************BMP工时部分********************************************************************************************

 if(url.indexOf("http://oanew.cd120.info:9091/bmp/crm/crmcusmdm") >= 0){
  var myDate = new Date();
//var time = myDate.toLocaleDateString().split('/').join('-');   //将1970/08/08转化成1970-08-08

var time = myDate.toISOString().replace(/T.*/,' ');
var timejiajian = time.toString();
window.localStorage.setItem("datatime",timejiajian);
   console.log('项目工作台界面');

}

else if(url.indexOf("http://oanew.cd120.info:9091/sys/portal") >= 0){

  var myDate = new Date();
//var time = myDate.toLocaleDateString().split('/').join('-');   //将1970/08/08转化成1970-08-08

var time = myDate.toISOString().replace(/T.*/,' ');
var timejiajian = time.toString();
window.localStorage.setItem("datatime",timejiajian);
   console.log('首页');

}

else  if(url.indexOf("http://oanew.cd120.info:9091/bmp/whours/pmpt/index.jsp#j_path=%2Fall") >= 0){

   console.log('工时管理-跳转');

// $("#lui-id-140").trigger("click");
// $("label:contains('华西公用')").trigger("dbclick");

window.open('http://oanew.cd120.info:9091/bmp/whours/pmpt/bmp_pmpt_main/bmpPmptMain.do?method=add&i.docTemplate=178e998cfeaed63e612eca2479ea9431');
}

else if(url.indexOf("http://oanew.cd120.info:9091/bmp/whours/pmpt/bmp_pmpt_main/bmpPmptMain.do?method=add&i.docTemplate=178e998cfeaed63e612eca2479ea9431") >= 0){

console.log('工时填写界面');
//$("a:contains('添加行')").trigger("click");

var A =5    // 添加多少行数
var myDate = new Date();
//var time = myDate.toLocaleDateString().split('/').join('-');   //将1970/08/08转化成1970-08-08

var time = myDate.toISOString().replace(/T.*/,'');
var timejiajian = time.toString();

 // alert(time);
var timeA = time.slice(2);
var timeB = timeA.replace(/[\_|\+|\=|\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\-|\>|\/|\?/\，/\。]/g,"");
var name = $("#_xform_docCreatorId").children("a").text();

var title = "华西后台组"+ timeB + name ;

 if (localStorage.getItem("datatime") != null) {

var nn = window.localStorage.getItem("datatime")

var timeNN = nn.replace(/[\_|\+|\=|\ |\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\*|\>|\/|\?/\，/\。]/g,"");

var timeC = nn.slice(2);
var timeD = timeC.replace(/[\_|\+|\=|\ |\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\-|\>|\/|\?/\，/\。]/g,"");

var titleV = "华西后台组"+ timeD + name ;
$("input[name='docSubject']").val(titleV);

$("input[name='fdInputTime']").val(timeNN);

}else{

 $("input[name='docSubject']").val(title);

$("input[name='fdInputTime']").val(timejiajian);

    }

setTimeout(function() {
if (name==='谭智文'||name==='章永强' ||name==='许炜林' ||name==='杨洋' ||name==='刘伟' ) {

   for(var p = 0; p < A; p++){

$(":contains('添加行')").trigger("click");
        }

    } else{
        $(":contains('添加行')").trigger("click");
      }
}, 100);

setTimeout(function() {

if (name==='谭智文'||name==='章永强' ||name==='许炜林' ||name==='杨洋' ||name==='刘伟' ) {
  for(var u = 0; u < A; u++){

        $form('fdDetail_Form['+u+'].fdProjectCrmpmId').required(false);
        $form('fdDetail_Form['+u+'].fdProjectCrmpmId').readOnly(true);
        $form('fdDetail_Form['+u+'].fdProjectCrmpmId').val("");
        $form('fdDetail_Form['+u+'].fdProjectCrmpmName').val("");
        $form('fdDetail_Form['+u+'].fdProjectId').required(true);
        $form('fdDetail_Form['+u+'].fdProjectId').readOnly(false);
        $form('fdDetail_Form['+u+'].fdBmpTaskMainId').required(false);
        $form('fdDetail_Form['+u+'].fdBmpTaskMainId').readOnly(true);
        $form('fdDetail_Form['+u+'].fdBmpTaskMainId').val("");
        $form('fdDetail_Form['+u+'].fdBmpTaskMainName').val("");
        $form('fdDetail_Form['+u+'].fdProjectNum').val("YW-2021-13");
        $form('fdDetail_Form['+u+'].fdWorkType').val("1");

        $form('fdDetail_Form[0].fdProjectId').val("17a855b97096aa6e196b3144e0085c98");
        $form('fdDetail_Form[0].fdProjectName').val("华西医院前台运维项目");
        $form('fdDetail_Form[0].fdDesc').val("协助处理门诊日常运维");
        $form('fdDetail_Form[0].fdWorkHours').val("1");

        $form('fdDetail_Form[0].fdProjectNum').val("YW-2021-14");

        $form('fdDetail_Form['+u+'].fdProjectId').val("17a856afd216557bd72f0db4abda1fb4");
        $form('fdDetail_Form['+u+'].fdProjectName').val("华西医院小于100人日IT项目");
        $form('fdDetail_Form['+u+'].fdDesc').val("项目工作");
        $form('fdDetail_Form['+u+'].fdWorkHours').val("2");

       }

    } else{
        $form('fdDetail_Form[0].fdProjectCrmpmId').required(false);
        $form('fdDetail_Form[0].fdProjectCrmpmId').readOnly(true);
        $form('fdDetail_Form[0].fdProjectCrmpmId').val("");
        $form('fdDetail_Form[0].fdProjectCrmpmName').val("");
        $form('fdDetail_Form[0].fdProjectId').required(true);
        $form('fdDetail_Form[0].fdProjectId').readOnly(false);
        $form('fdDetail_Form[0].fdBmpTaskMainId').required(false);
        $form('fdDetail_Form[0].fdBmpTaskMainId').readOnly(true);
        $form('fdDetail_Form[0].fdBmpTaskMainId').val("");
        $form('fdDetail_Form[0].fdBmpTaskMainName').val("");

        $form('fdDetail_Form[0].fdProjectId').val("17a855b97096aa6e196b3144e0085c98");
        $form('fdDetail_Form[0].fdProjectName').val("华西医院前台运维项目");
        $form('fdDetail_Form[0].fdDesc').val("门诊日常运维");
        $form('fdDetail_Form[0].fdWorkHours').val("7.5");
        $form('fdDetail_Form[0].fdProjectNum').val("YW-2021-14");

    }

    }, 1000);

$("body").keydown(function(event){
    if (event.keyCode == 37){
     ////console.log('方向左键');
if (localStorage.getItem("datatime") != null) {

  var nn = window.localStorage.getItem("datatime")
//console.log(nn);
var date=new Date(nn);
var date=new Date(date.setDate(date.getDate()-1));
//console.log(date);

var str=date.getFullYear()+"-"+((date.getMonth()+1)>9?date.getMonth()+1:"0"+(date.getMonth()+1))+"-"+(date.getDate()>9?date.getDate():"0"+date.getDate());

console.log(str);
 window.localStorage.setItem("datatime",str);

var timeA = str.slice(2);
var timeB = timeA.replace(/[\_|\+|\=|\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\-|\>|\/|\?/\，/\。]/g,"");

var title = "华西后台组"+ timeB + name ;
$("input[name='docSubject']").val(title);

$("input[name='fdInputTime']").val(str);

}else{
 window.localStorage.setItem("datatime",timejiajian);
    }

   }

    if (event.keyCode == 39){
      ////console.log('方向右键');
if (localStorage.getItem("datatime") != null) {

  var nn = window.localStorage.getItem("datatime")
//console.log(nn);
var date=new Date(nn);
var date=new Date(date.setDate(date.getDate()+1));
//console.log(date);

var str=date.getFullYear()+"-"+((date.getMonth()+1)>9?date.getMonth()+1:"0"+(date.getMonth()+1))+"-"+(date.getDate()>9?date.getDate():"0"+date.getDate());

console.log(str);
 window.localStorage.setItem("datatime",str);

var timeA = str.slice(2);
var timeB = timeA.replace(/[\_|\+|\=|\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\-|\>|\/|\?/\，/\。]/g,"");

var title = "华西后台组"+ timeB + name ;
$("input[name='docSubject']").val(title);

$("input[name='fdInputTime']").val(str);

}else{
 window.localStorage.setItem("datatime",timejiajian);
    }

   }

})

$(document).on("click","#lui-id-16",function(){
  var vv = window.localStorage.getItem("datatime")
//console.log(vv);
var datev=new Date(vv);
var datev=new Date(datev.setDate(datev.getDate()+1));
//console.log(date);
var str=datev.getFullYear()+"-"+((datev.getMonth()+1)>9?datev.getMonth()+1:"0"+(datev.getMonth()+1))+"-"+(datev.getDate()>9?datev.getDate():"0"+datev.getDate());
console.log(str);
 window.localStorage.setItem("datatime",str);
})

}

setTimeout(function() {

 function clock1(){

    var tianjiahang =  $(".docListTr").length
       for(var p = 1; p < tianjiahang; p++){

        $form('fdDetail_Form['+p+'].fdProjectCrmpmId').required(false);
        $form('fdDetail_Form['+p+'].fdProjectCrmpmId').readOnly(true);
        $form('fdDetail_Form['+p+'].fdProjectCrmpmId').val("");
        $form('fdDetail_Form['+p+'].fdProjectCrmpmName').val("");
        $form('fdDetail_Form['+p+'].fdProjectId').required(true);
        $form('fdDetail_Form['+p+'].fdProjectId').readOnly(false);
        $form('fdDetail_Form['+p+'].fdBmpTaskMainId').required(false);
        $form('fdDetail_Form['+p+'].fdBmpTaskMainId').readOnly(true);
        $form('fdDetail_Form['+p+'].fdBmpTaskMainId').val("");
        $form('fdDetail_Form['+p+'].fdBmpTaskMainName').val("");
        $form('fdDetail_Form['+p+'].fdProjectNum').val("YW-2021-13");
        $form('fdDetail_Form['+p+'].fdWorkType').val("1");

        $form('fdDetail_Form['+p+'].fdProjectId').val("17a856afd216557bd72f0db4abda1fb4");
        $form('fdDetail_Form['+p+'].fdProjectName').val("华西医院小于100人日IT项目");
        //$form('fdDetail_Form['+p+'].fdDesc').val("项目工作");
       // $form('fdDetail_Form['+p+'].fdWorkHours').val("2")
            }

 }
var t = setInterval(clock1,100);

}, 100);

//***************************************BMP工时部分********************************************************************************************
//***************************************BMP工时部分********************************************************************************************
//***************************************BMP工时部分********************************************************************************************

        }

$(document).on("click",".removeclass",function(){

 $(this).parent().parent().parent().remove();

return false;
})

$(document).on("click","#ribao",function(){

var myDate = new Date();
var time = myDate.toLocaleDateString().split('/').join('-');   //将1970/08/08转化成1970-08-08

        var type = $("#type").val();
            $.ajax({
                url: "http://itil118.wchscu.cn:80/worklog/findByDate",
                data: {"WORK_DATE":time},
                type: "post",
                async:false,
                success: function (list) {
                    console.log(list);
                  if(list[1]){
                   var gad= String(list[1].REPAIR_DESCRIPTION) + ""
                    if(gad== ""||gad== " "||gad== "undefined"){
                      alert("还未创建工单，请创建后使用此功能");
                    } else {
                      console.log("正在根据今日创建的工单生成对应的日报......");
                        var str = "";
                        var j=1;
                        for (var i = 1; i < list.length; i++) {
                            var remark = "";
                            if(list[i].REMARK != null)
                            {
                                remark=list[i].REMARK;
                            }
                            if (list[i].WRPSTATE == "RP_8" || list[i].WRPSTATE == "RP_9") {//工单处理
                                str = str + "" +j+"、"+"处理了 \"" + list[i].REPAIR_DEPARTMENT_NAME + "\" 的 \"" + list[i].REPAIR_DESCRIPTION + remark + "\""+ ""+"\n";

                              j++;
                            } else if (list[i].WRPSTATE == "RP_11"||list[i].WRPSTATE == "RP_12") {//工单完成
                                   str = str+"" +j+"、"+ "完成了" + ((list[i].REPAIR_DEPARTMENT_NAME == null) ? "报障工单" : "\"" + list[i].REPAIR_DEPARTMENT_NAME + "\" 的报障工单") + " \"" + ((list[i].REPAIR_DESCRIPTION == null) ? "" : list[i].REPAIR_DESCRIPTION) + remark + "\""+"\n" ;

                              j++;
                            } else if (list[i].INSPECT_COUNT != '' && list[i].INSPECT_COUNT != null) {
                                str = str + "" + j + "、巡检了" + list[i].INSPECT_COUNT + "台设备"+"\n";

                              j++;
                            } else if (list[i].SEND_COUNT != '' && list[i].SEND_COUNT != null) {
                                str = str + "" + j + "、配送了" + list[i].SEND_COUNT + "个耗材"+"\n";
                                j++;
                            } else if (list[i].MEETING_NAME != '' && list[i].MEETING_NAME != "" && list[i].MEETING_NAME != null) {
                                str = str + "" + j + "、参加了\"" + list[i].MEETING_NAME + "\"会议"+"\n";
                                j++;
                            } else {
                                var s = "";
                                if (list[i].WPTPTYPE == 'TSK_TYPE_1' || list[i].WPTPTYPE == 'TSK_TYPE_2') {
                                    if (list[i].CODE != null && list[i].CODE != "") {
                                        s += list[i].CODE;
                                    }
                                    if (list[i].PROJECT_NAME != null && list[i].PROJECT_NAME != "") {
                                        if (s != "") {
                                            s += " " + list[i].PROJECT_NAME;
                                        } else {
                                            s += list[i].PROJECT_NAME;
                                        }
                                    }
                                }

                            }
                        }

                     var oInput = document.createElement('textarea');
                      oInput.value = "" + str;
                      document.body.appendChild(oInput);
                      oInput.select();
                      document.execCommand("Copy"); //复制
                      oInput.className = 'oInput';
                      oInput.style.display='none';
                      alert(oInput.value);

                    }
 } else {
     alert("还未创建工单，请创建后使用此功能");
   }

                }

    });

 /*
var userSetting = study_userData;
var A = userSetting.A;

var F = userSetting.F;
var location = userDatalocation;
var BB = location.B;
var textA  = [],textB  = [];

var min = 6;
var max = 9;
var rand = Math.floor(Math.random()*(max-min+1))+min;
  for (var i = 0; i < rand; i++) {

      var gz = Math.floor(Math.random()*A.length);
      var wz = Math.floor(Math.random()*BB.length);

      var guzhang = A[gz].replace(/[\_|\+|\=|\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\-|\>|\/|\?/\，/\。]/g,"");
      var chuli   = F[gz].replace(/[\_|\+|\=|\||\\|\[|\]|\{|\}|\;|\:|\"|\'|\！|\-|\>|\/|\?/\，/\。]/g,"");
      var place1 = BB[wz].replace(/(^\s*)|(\s*$)/g, "");
      var place2 = place1.substring(place1.lastIndexOf("-") + 1);
      var place  = place2.split('/')[0];

      var   gzplace =  place + guzhang + "，"+ chuli +"。"+"\n"   ;
        textA.push(gzplace);
        textB.push(place);
  }
       var   textvalue = textA.join("");
      // console.log(textvalue);
   var oInput = document.createElement('textarea');
        oInput.value = "门诊日常运维："+"\n" + textvalue;
        document.body.appendChild(oInput);
        oInput.select();
        document.execCommand("Copy"); //复制
        oInput.className = 'oInput';
        oInput.style.display='none';
        alert(oInput.value);
})

 */

})
