
// ==UserScript==

// @name          Inspection_rule_tips_own

// @namespace    http://tampermonkey.net/

// @version      0.952

// @description  Wake up,samurai! Let's burn out the city!

// @author       Johnny Sliverhand

// @match        https://global-oss.zmqdez.com/bigoLiveInfo/live-real-time-info/index*

// @match        https://global-oss.zmqdez.com/bigoLiveInfo/live-real-time-info/push-new

// @grant        none

// @downloadURL https://update.greasyfork.org/scripts/414986/Inspection_rule_tips_own.user.js
// @updateURL https://update.greasyfork.org/scripts/414986/Inspection_rule_tips_own.meta.js
// ==/UserScript==



(function () {
    'use strict';



    let timer = null;

    let country = null;

    let ruleConfig = {

        //国家码对应规则配置

"JP": [
            "偏严版--JP--日本     未成年直播处罚疑似未成年", 
           "推荐降权:辱骂侮辱官方/国家领导人/国家政府/宗教", 
           "推荐降权:露脐装/胸部大面积暴露/男性赤裸上身"
           ],

"KR": [
            "偏严版--KR--韩国     未成年直播处罚疑似未成年",
            "明确抽烟喝酒处罚热门降权，需要区分是否酗酒", 
            "赤裸上身处罚警告，特殊场景不处罚",
         ],

"PK": [
            "严格版--PK--巴基斯坦     赤裸上身：明确主播本人赤裸处罚B类，否则警告", 
            "抽烟处罚警告，需明确看见烟头", 
            "未成年直播处罚A类，大人陪同B类，未成年误入镜不处罚"
         ],

"AE": [
             "严格版--AE--阿联酋    未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"SA": [
          "严格版--SA--沙特阿拉伯     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"KW": [
            "严格版--KM--科威特     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"LB": [
            "严格版--LB--黎巴嫩     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"IQ": [
           "严格版--IQ--伊拉克     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"PS": [
          "严格版--PS--巴勒斯坦     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"JO": [
            "严格版--JO--约旦    赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "未成年直播处罚A类，大人陪同特殊A类，未成年误入镜不处罚", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"YE": [
            "严格版--YE--也门    未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"OM": [
          "严格版--OM--阿曼     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"SY": [
          "严格版--SY--叙利亚     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"QA": [
            "严格版--QA--卡塔尔     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"BH": [
           "严格版--BH--巴林     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"EG": [
          "严格版--EG--埃及     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"SD": [
            "严格版--SD--苏丹     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"LY": [
            "严格版--LY--利比亚     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"TN": [
            "严格版--TN--突尼斯     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。" 
        ],

"DZ": [
            "严格版--DZ--阿尔及利亚     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"MA": [
            "严格版--MA--摩洛哥     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"SO": [
           "严格版--SO--索马里     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"IR": [
            "严格版--IR--伊朗     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"IL": [
           "严格版--IL--以色列     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"MR": [
            "严格版--MR--毛里塔尼亚     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"DJ": [
           "严格版--DJ--吉布提     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"KM": [
           "严格版--KM--科摩罗     未成年直播处罚A类，0-3岁幼儿大人陪同处罚B类，未成年误入镜不处罚", 
            "赤裸上身：明确主播本人赤裸处罚B类，否则警告；抽烟处罚警告需明确看见烟头", 
            "嘟嘴/吐舌两种行为不属于性暗示，性挑逗类。若结合当时直播氛围，可明确确认为挑逗，仍可进行特A封禁。"
        ],

"BD": [
            "严格版--BD--孟加拉     赤裸上身：明确主播本人赤裸处罚B类，否则警告", 
            "未成年直播处罚A类，大人陪同特殊A类，未成年误入镜不处罚", 
            "抽烟处罚警告需明确看见烟头"
        ],

"VN": [
            "未成年直播处罚疑似未成年",
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"KH": [
            "未成年直播处罚疑似未成年",
            "性挑逗处罚推荐降权，需含有挑逗氛围（氛围昏暗）", 
            "内衣、内裤处罚警告，内衣执行定义：仅穿文胸"
          ],

"MM": [
            "未成年直播处罚疑似未成年",
           "性挑逗处罚推荐降权，需含有挑逗氛围（氛围昏暗）", 
            "内衣、内裤处罚警告，内衣执行定义：仅穿文胸"
          ],

"PH": [
            "未成年直播处罚疑似未成年",
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"TH": [
            "未成年直播处罚疑似未成年，抖音直播处罚A类（无法区分直播或短视频则忽略处理！）",
            "推荐降权：女性/男性聚焦下体/直播睡觉（10分钟）", 
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松/胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"MY": [
            "未成年直播处罚疑似未成年", 
            "抽烟处罚热门降权，需明确看见烟头", 
            "赤裸上身处罚警告，需明确看见露点"
          ],

"CN": [
            "未成年直播处罚疑似未成年,  直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"TW": [
            "未成年直播处罚疑似未成年,  直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"HK": [
            "未成年直播处罚疑似未成年,  直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"MO": [
            "未成年直播处罚疑似未成年", 
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"SG": [
            "未成年直播处罚疑似未成年, 直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"US": [
           "英语区--US--美国      乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚警告 ", 
           "B级:聚焦臀部/男性聚焦/揉捏乳头/动作幅度大/轻微性挑逗/洗澡；内衣裤；转播", 
           "热门降权:抖臀/聚焦胸部/大腿/衣着宽松/情趣内衣/露脐装/乳沟男性赤裸上身/抽烟/喝酒/赌博无金钱"
          ],

"TR": [
            "胸部大面积暴露，露出超过1/2乳沟成线装，处罚警告", 
            "赤裸上身处罚警告，需明确看见露点；未成年直播处罚疑似未成年，车内未成年不处罚", 
            "讨论恶退/illegal beans话题处罚B类，抽烟处罚警告，需明确看见烟头"
          ],

"DE": [
            "欧非区--DE--德国       直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "黑屏挂机/直播睡觉处罚推荐降权,签约主播挂机3分钟即可处罚", 
            "未成年直播处罚疑似未成年，车内未成年不处罚"
          ],

"IT": [
            "欧非区--IT--意大利       故意展示烟酒/明确抽烟喝酒不处罚", 
            "未成年直播处罚疑似未成年", 
            "主播辱骂他人处罚B类"
          ],

"CH": [
            "欧非区--CH--瑞士       直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "黑屏挂机/直播睡觉处罚推荐降权,签约主播挂机3分钟即可处罚", 
            "未成年直播处罚疑似未成年，车内未成年不处罚"
          ],

"AT": [
            "欧非区--AT--奥地利       直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "黑屏挂机/直播睡觉处罚推荐降权,签约主播挂机3分钟即可处罚", 
            "未成年直播处罚疑似未成年，车内未成年不处罚"
          ],

"NL": [
            "欧非区--NL--荷兰       直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "黑屏挂机/直播睡觉3分钟即可处罚，普通用户处罚警告,签约主播B类挂机", 
            "未成年直播处罚疑似未成年，车内未成年不处罚"
          ],

"SE": [
            "欧非区--SE--瑞典       直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "黑屏挂机/直播睡觉3分钟即可处罚，普通用户处罚警告,签约主播B类挂机", 
            "未成年直播处罚疑似未成年，车内未成年不处罚"
          ],

"NO": [
            "普通区--NO--挪威      直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚推荐降权", 
            "黑屏挂机/直播睡觉处罚推荐降权,签约主播挂机3分钟即可处罚", 
            "未成年直播处罚疑似未成年，车内未成年不处罚"
          ],

"CA": [
          "英语区--CA--加拿大    直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚热门降权", 
          "乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
          "热门降权:赌博无金钱/比基尼/抖臀/聚焦胸部/下体/大腿/深V/乳沟/情趣内衣/侧身露胸"
          ],

"GB": [
           "英语区--GB--英国         直播或转播Greedy bigo/yummy bigo/Fisher bigo处罚热门降权", 
           "乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "热门降权:赌博无金钱/比基尼/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"NP": [
           "未成年直播处罚疑似未成年,洗澡直播/比基尼处罚警告", 
           "热门降权:抖臀/聚焦胸部/下体/大腿/深V/乳沟/情趣内衣/侧身露胸", 
           "热门降权:赌博无金钱/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"ID": [
            "未成年直播处罚疑似未成年",
            "推荐降权：乳沟/性挑逗/聚焦/抖臀/衣着宽松", 
            "推荐降权：胸部大面积/赤裸上身/臀线/女性比基尼/赌博无金钱" 
          ],

"BR": [
           "拉美区--BR--巴西        乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           "热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"FR": [
            "欧非区--FR--法国           未成年直播处罚疑似未成年", 
            "黑屏挂机/直播睡觉处罚推荐降权，签约主播挂机3分钟即可处罚", 
            "明确抽烟不处罚赤裸上身不处罚"
          ],
        
"BE": [
            "未成年直播处罚疑似未成年", 
            "黑屏挂机/直播睡觉处罚推荐降权，签约主播挂机3分钟即可处罚", 
            "明确抽烟不处罚赤裸上身不处罚"
          ],

"FL": [
           "未成年直播处罚疑似未成年，明确抽烟不处罚", 
            "女性身着不透明衣物但能明显看出未穿内衣（凸点）不处罚", 
            "赤裸上身热门降权，需明确看见露点"
          ],

"DK": [
           "未成年直播处罚疑似未成年，明确抽烟不处罚", 
            "女性身着不透明衣物但能明显看出未穿内衣（凸点）不处罚", 
            "赤裸上身热门降权，需明确看见露点"
      ],

"MX": [
            "拉美区--MX--墨西哥           乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           "热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"AR": [
           "拉美区--AR--阿根廷            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           "热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"CO": [
           "拉美区--CO --哥伦比亚           乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"BO": [
           "拉美区--BO--玻利维亚           乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"CL": [
           "拉美区--CL--智利            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"CR": [
           "拉美区--CR--哥斯达黎加            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"DO": [
           "拉美区--DO--多米尼加共和国            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"EC": [
           "拉美区--EC--厄瓜多尔            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"SV": [
           "拉美区--SV--萨尔瓦多            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"GT": [
           "拉美区--GT--危地马拉           乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"HN": [
           "拉美区--HN--洪都拉斯            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"NI": [
           "拉美区--NI--尼加拉瓜            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"PA": [
           "拉美区--PA--巴拿马            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"PY": [
           "拉美区--PY --巴拉圭           乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"PE": [
           "拉美区--PE--秘鲁            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"ES": [
           "拉美区--ES--西班牙            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],

"UY": [
           "拉美区--UY--乌拉圭            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],


"VE": [
           "拉美区--VE--委内瑞拉            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],
"PR": [
           "拉美区--PR --波多黎各           乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],
"CU": [
           "拉美区--CU--古巴            乳沟：露出1/3-2/3乳沟推荐降权，超过2/3乳沟罚热门降权   ", 
           "未成年直播处罚疑似未成年；抖臀/露臀线/深V/女性比基尼处罚警告",
           " 热门降权:聚焦胸部/下体/大腿/情趣内衣/侧身露胸/抽烟/喝酒/男性赤裸上身/婴儿赤裸上身"
          ],


"AU": [
"偏严版--澳新区--AU--澳大利亚           ", 
"未成年直播处罚疑似未成年", 
"推荐降权:男性衣内摸胸/女性比基尼"

          ],

"NZ": [
"偏严版--澳新区--NZ --新西兰            ", 
"未成年直播处罚疑似未成年", 
"推荐降权:男性衣内摸胸/女性比基尼"
          ],

"ZA": [
"标准区--欧非区--ZA --南非            ", 
"男性赤裸上身处罚B类", 
          ],


"NG": [
"标准区--NG --尼日利亚            ", 
"男性赤裸上身处罚B类", 
          ]


    }





    //功能：创建DOM，并设置id、innerText、css

    function creatNewEle(eleName, id, text, style, fatherEle) {

        //功能：创建DOM，并设置id、innerText、css

        let ele = document.createElement(eleName);

        ele.id = id;

        ele.innerText = text;

        ele.style.cssText = style.join(";");

        fatherEle.appendChild(ele);

    }



    //功能：检查元素是否存在，存在返回true，不存在返回false

    function checkDom(domSelect, index) {

        //功能：检查元素是否存在，存在返回true，不存在返回false

        //例如#show-detail-modal-ifr



        let result = false;



        try {

            if (document.querySelectorAll(domSelect)[index]) {

                result = true;

            }

        } catch (error) {

            console.log("警告：当前页面无此元素");

        }



        return result;

    }



    //功能：创建一个规则提示区域，并在区域里面创建三个div，用作规则提示

    function ruleAreaCreat(select, index) {



        //功能：创建一个规则提示区域，并在区域里面创建三个div，用作规则提示

        if (checkDom(select, index) == true) {



            console.log("iframe的父元素存在");



            //添加规则提示区域



            let mainDom = document.querySelectorAll(select)[index]

            let rulrArea_style = [

                "width: 100%",

                "height: 100px",

                "border: 1px solid black",

                "background-color:white",

                "margin-top: 5px",

            ];

            creatNewEle("div", "rule-area", "", rulrArea_style, mainDom);



            //在规则区域内添加三个div元素



            let ruleArea = document.querySelector("#rule-area");

            let rule_style = [

                "width:80%",

                "margin:0 auto",

                "font-size:25px",

                "font-weight:bolder",

                "text-align:center"

            ];

            for (let i = 0; i < 3; i++) {

                creatNewEle("div", "new_rule" + i, "", rule_style, ruleArea);

            }

            document.querySelector("#new_rule0").style.color = "red";

        }



    }



    //功能：获取iframe网页中的国家码，获取成功则返回国家码，不成功则返回"未成功获取国家码"

    function getCountryCode(select, index, ifr_id) {

        //功能：获取iframe网页中的国家码，获取成功则返回国家码，不成功则返回"未成功获取国家码"

        //参数：select:iframe的父元素的css选择器，字符串；

        //     index:索引

        //     ifr_id:iframe的id

        let ifr = "";

        let ifr_doc_country = "";

        let result = null;

        try {

            ifr = document.querySelectorAll(select)[index].querySelector(ifr_id).contentWindow;

            ifr_doc_country = ifr.document.querySelector(".feed-video>.row>div:nth-child(2)").innerText;



        } catch (error) {

            // console.log("iframe网页还未打开");

        }

        if (ifr_doc_country === null || ifr_doc_country == "") {

            ifr_doc_country = "未成功获取国家码";

        }

        result = ifr_doc_country;

        return result;

    }



    //1.脚本开始（完成）

    //2.检查业务类型：巡查业务/告警推送,确定要选中的iframe父元素的CSS选择器（完成）在选中的iframe父元素中生成规则提示区域，并在提示区域内增加三个div，id分别为new_rule0，new_rule1，new_rule2

    //3.(完成)

    //4.获取父元素的iframe中的网页（）中的国家码，并匹配国家码对应的规则，并更改3中的三个div的innerHtml:定时器(基本完成，待实际数据)









    let dom = (function () {

        let select = null;

        let ifr_id = null;

        let index = 0;

        let push_bussiness = "https://global-oss.zmqdez.com/bigoLiveInfo/live-real-time-info/push-new";
        //判断业务类型，要选中的iframe父元素的css选择器和index，并生成相应的dom和css样式；


        if(document.location.href == push_bussiness){
            select = "div[id='push-new-modal']>.modal-dialog>.modal-content>.modal-body";//告警业务
            index = 0;
            ifr_id = "#push-new-modal-ifr";
            console.log("这是告警业务");
            ruleAreaCreat(select, index);
        }
        else{
            select = "div[id='show-detail-modal']>.modal-dialog>.modal-content>.modal-body";
            index = 0;
            ifr_id = "#show-detail-modal-ifr";
            console.log("这是巡查业务");
            ruleAreaCreat(select, index)
        }

        return [select, index, ifr_id];

    })();



    let ruleArea_dom = document.querySelector("#rule-area");

    let rule_0_dom = document.querySelector("#new_rule0");

    let rule_1_dom = document.querySelector("#new_rule1");

    let rule_2_dom = document.querySelector("#new_rule2");





    timer = setInterval(function () {

        country = getCountryCode(dom[0], dom[1], dom[2]);

        // console.log(country);

        if (country != "未成功获取国家码" && country in ruleConfig) {

            console.log("当前国家码：" + country);

            rule_0_dom.innerHTML = ruleConfig[country][0];

            rule_1_dom.innerHTML = ruleConfig[country][1];

            rule_2_dom.innerHTML = ruleConfig[country][2];

        }

        else{

            rule_0_dom.innerHTML = "";

            rule_1_dom.innerHTML = "";

            rule_2_dom.innerHTML = "";

        }

    }, 1000);

})();