// ==UserScript==
// @author            Dravolution
// @name              udonarium 汉化插件
// @namespace         https://udonarium.app/
// @description       udonarium用汉化插件
// @version           0.0.5.1
// @include           https://udonarium.*
// @include           https://ryoskate.jp/*
// @include           https://udonarium2d.netlify.app/*
// @include           https://lily.onlinesession.app/
// @include           http://www.prisonerstrpg.xyz/trpg/
// @include           http://www.prisonerstrpg.xyz/2d/
// @grant             GM_addStyle
// @supportURL        ないです
// @note              测试偶尔返工版
// @downloadURL https://update.greasyfork.org/scripts/416937/udonarium%20%E6%B1%89%E5%8C%96%E6%8F%92%E4%BB%B6.user.js
// @updateURL https://update.greasyfork.org/scripts/416937/udonarium%20%E6%B1%89%E5%8C%96%E6%8F%92%E4%BB%B6.meta.js
// ==/UserScript==

'use strict'
const i18n = new Map([
    [" 接続情報 "," 连接情况 "],
    ["アイコンを変更する","更改头像"],
    ["あなたのニックネーム： ","你的昵称： "],
    ["あなたのID：","你的ID："],
    ["接続したい相手のID","连接对象的ID"],
    ["プライベート接続","私人连接"],
    ["ロビー（ルーム一覧）を表示","显示大厅（房间一览）"],
    [" ロビー "," 大厅 "],
    ["一覧を更新","刷新一览"],
    ["新しいルームを作成する","创建新房间"],
    ["ルームID","房间ID"],
    ["ルーム名","房间名"],
    ["パスワード","密码"],
    ["接続","连接"],
    ["※プライベート接続を使用する場合は、お互いのIDをユドナリウム外で共有してください。","※如果要使用私人连接，请在Udonarium外的平台分享您的ID。"],
    ["※一人で動作確認を行いたい場合はブラウザを2つ開くと良いと思います。","※想独自确认运行状况的时候，可以双开浏览器。"],
    [" ファイル一覧 ","文件一览"],
    ["メインタブ","主要"],
    ["サブタブ","闲聊"],
    [" チャットウィンドウ - メインタブ "," 聊天窗口 - 主要 "],
    [" チャットウィンドウ - サブタブ "," 聊天窗口 - 闲聊 "],
    ["ソードワールド2.5","剑之世界2.5"],
    ["タブ設定","栏目设定"],
    ["菜单","菜单"],
    ["最初のテーブル","初始桌"],
    ["キャラクターを作成","创建角色"],
    ["マップマスクを作成","创建地图迷雾"],
    ["地形を作成","创建地形"],
    ["共有メモを作成","创建公共笔记"],
    ["トランプの山札を作成","创建扑克套牌"],
    ["ダイスを作成","创建骰子"],
    ["テーブル設定","桌设定"],
    ["チャット画面","聊天画面"],
    ["チャットタブを作る","创建聊天栏"],
    ["タブ名 : ","栏目名"],
    [" チャットタブ設定 ","聊天栏设定"],
    ["ここに画像をドロップ","拖动图片到这里"],
    ["またはここをクリックして選択","或者点击这里"],
    ["１ファイルにつき2MBまで","单文件限制在2MB内"],
    ["画像","图片"],
    ["音楽","音乐"],
    [" ジュークボックス "," 点唱机 "],
    ["アップロードされた音楽ファイルはここに表示されます。","上传的音乐文件在这里显示"],
    ["ここに音楽をドロップ","拖动音乐到这里"],
    ["１ファイルにつき10MBまで","单文件限制在10MB内"],
    ["※「試聴」は自分のスピーカーだけで音楽を1回再生します。","※「试听」指的是只在自己的扬声器上播放一次。"],
    ["※「BGM」はルーム内の全員で1つの音楽をループ再生します。","※「BGM」指的是房间内的所有人都能听到某一首音乐循环播放。"],
    ["※現行バージョンのセーブデータ（zip）には音楽ファイルは含まれません。（毎回アップロードが必要です）","※音乐不会保存在ZIP中，需要每次重新上传。"],
    [" テーブル設定 ","桌设定"],
    ["新しいテーブルを作る","创建新的游戏桌"],
    [" インベントリ "," 仓库 "],
    ["インベントリ","仓库"],
    ["ZIP読込","读取ZIP"],
    ["テーブルインベントリは空です","桌面仓库是空的"],
    ["並び順:","排序:"],
    ["name (昇順)","name (升序)"],
    ["設定","设定"],
    ["共有インベントリは空です","公共仓库是空的"],
    ["個人インベントリは空です","私人仓库是空的"],
    ["墓場インベントリは空です","墓地仓库是空的"],
    ["墓場を空にする","清空墓地"],
    ["完了","结束"],
    ["詳細を表示","显示详情"],
    ["チャットパレットを表示","显示快捷聊天"],
    ["共有イベントリに移動","移动到公共仓库"],
    ["個人イベントリに移動","移动到私人仓库"],
    ["テーブルに移動","移动到桌面"],
    ["墓場に移動","移动到墓地"],
    ["コピーを作る","进行复制"],
    ["編集切り替え","切换编辑方式"],
    ["画像変更","更改图片"],
    ["テーブル","桌面"],
    ["共有インベントリ","公共仓库"],
    ["個人インベントリ","个人仓库"],
    ["通常","普通"],
    ["リソース","资源"],
    ["ノート","笔记"],
    ["共有メモ","公共笔记"],
    ["メモを編集","编辑笔记"],
    ["削除する","删除"],
    ["固定する","固定"],
    ["壁を非表示","不显示侧面"],
    ["壁を表示","显示侧面"],
    ["地形設定を編集","编辑地形设定"],
    ["オブジェクト作成","创建物体"],
    ["床の画像を変更","更改顶部图片"],
    ["壁の画像を変更","更改侧面图片"],
    ["ダイスを振る","扔骰子"],
    ["自分だけ見る","仅自己可见"],
    ["ダイス目を設定","设定骰子点数"],
    ["ダイス目の画像を変更","更改骰子点数图片"],
    ["新しい項目を追加","增加新项目"],
    [" 画像 "," 图片 "],
    [" グリッド: "," 格子: "],
    ["なし","无"],
    ["スクエア","四边"],
    ["ヘクス（縦揃え）","六边（纵向）"],
    ["ヘクス（横揃え）","六边（横向）"],
    [" 背景フィルタ "," 背景过滤 "],
    ["ホワイト","白"],
    ["ブラック","黑"],
    ["グリッドを常に表示: ","格子总是可见: "],
    ["スナップ: ","自动对齐: "],
    ["背景画像を追加","添加背景图片"],
    [" メニュー "," 菜单 "],
    ["試聴/再生","试听/播放"],
    ["BGM/再生","BGM/播放"],
    ["試聴音量：","试听音量："],
    ["1枚引く","抽1张牌"],
    ["2枚引く","抽2张牌"],
    ["3枚引く","抽3张牌"],
    ["4枚引く","抽4张牌"],
    ["5枚引く","抽5张牌"],
    ["6枚引く","抽6张牌"],
    ["一番上を表にする","将最上面的牌正面表示"],
    ["一番上を裏にする","将最上面的牌盖放表示"],
    ["すべて表にする","将所有的牌正面表示"],
    ["すべて裏にする","将所有的牌盖放表示"],
    ["すべて正位置にする","将所有的牌摆成正位"],
    ["シャッフル","洗牌"],
    ["シャッフル(裏向き正位置)","洗牌(盖放正位)"],
    ["カード一覧","卡牌一览"],
    ["逆順にソート","倒序排列"],
    ["枚数を非表示にする","不显示张数"],
    ["枚数を表示する","显示张数"],
    ["カードサイズを揃える","使卡牌尺寸一致"],
    ["山札を人数分に分割する","将牌堆按人数分割"],
    ["山札を崩す","打散牌堆"],
    ["山札を削除する","删除牌堆"],
    ["表にする","正面表示"],
    ["裏にする","盖放表示"],
    ["重なったカードで山札を作る","将重叠的卡牌变成牌堆"],
    ["最下に移動","放到最下面"],
    ["カードを編集","编辑卡牌"],
    ["接続したいルームID","想进入的房间ID"],
    ["シャッフルしてウィンドウを閉じる","洗牌并关闭窗口"],
    ["山札から出す","从牌堆里抽出"],
    ["表面の画像を変更","更改正面的图片"],
    ["裏面の画像を変更","更改背面的图片"],
    ["モンスター","魔物"],
    ["全て","全部"],
    ["タグを変更","更改标签"],
    ["新タグ名","新标签名"],
    [" 立ち絵表示: ","显示立绘"],
    [" /サイズ: "," /尺寸: "],
    ["ダイス表設定","设定骰表"],
    ["新しい表を作る","制作新的骰表"],
    ["表タイトル :","标题 :"],
    ["ダイス :","骰子 :"],
    ["ダイスボット指定なし","指定骰池"],
    ["ダイス表の編集","编辑骰表"],
    ["コマンド :","指令 :"],
    ["カットイン編集","编辑Cut in"],
    [" テーブルインベントリ非表示 "," 不在桌面仓库中显示 "],
    [" 発言をしない "," 不参与发言 "],
    [" ポップアップ横幅 "," 弹出宽度 "],
    [" ダイス表設定 "," 设定骰表 "],
    [" カットインリスト "," Cut in列表 "],
    ["バフ/デバッファー ","Buff/Debuffer "],
    ["隠す ","隐藏 "],
    ["実行","执行"],
    ["バフパレット編集","编辑Buff面板"],
    ["バフR減少/選択","Buff R减少/选择"],
    ["リモコンを表示","显示遥控面板"],
    ["0R以下消去/選択","0R以下清除/选择"],
    ["バフR減少/全員","Buff R减少/全员"],
    ["0R以下消去/全員","0R以下清除/全员"],
    ["カウンターリモコン ","遥控计数 "],
    ["リモコン操作","遥控操作"],
    ["バフ編集","编辑Buff"],
    [" ポップアップ縦幅最大 "," 弹出最大高度 "],
    ["バフ/デバフ","Buff/Debuff"],
    ["削除","删除"],
    ["マップマスク","地图迷雾"],
    ["マップマスクを編集","编辑地图迷雾"],
    [" カットインBGM選択 "," 选择Cut in的BGM "],
    ["登録","登录"],
    ["試聴/停止","试听/停止"],
    ["カットイン/再生","Cut in/播放"],
    ["カットイン/停止","Cut in/停止"],
    ["音楽ファイルが設定されていません","未设置音乐文件"],
    [" 元サイズで表示："," 以本来的尺寸显示："],
    [" ループ再生："," 循环播放："],
    [" タグ名称 :"," 标签名称 :"],
    ["音楽データ : ","音乐数据 : "],
    ["新しいカットインを作る","创建新的Cut in"],
    ["トランプ山札","扑克牌堆"],
    ["１枚引く","抽1张牌"],
    ["※カットインの挙動","※Cut in的模式"],
    ["\nタグ名称が同名のカットインは先に再生しているものを停止します(タグ空欄含む)","播放具有相同标签名称的Cut in会停止之前播放的同标签内容（包括空白标签）"],
    ["\nタグ名称が空欄で音楽が設定されている場合、ジュークボックスのBGMを停止します","播放空白标签的Cut in时将会停止点唱机中播放的背景音乐"],
    ["\nまた、そのようなカットインはジュークボックスでBGMを再生すると停止します","同样的，在点唱机中播放背景音乐时空白标签的Cut in也会停止播放"],
    ["\n銃撃音のSE等、BGMと同時再生したいカットインはタグを設定してください","如果想要在播放背景音乐的同时播放枪声之类的音效的话就设置好单独的标签吧"],
    ["ダンジョンズ＆ドラゴンズ","龙与地下城"],
    ["対象が未選択です ","未选择对象"],
    [" ルーム作成 "," 创建房间 "],
    ["ルーム名 : ","房间名 : "],
    ["パスワード: ","密码: "],
    ["新しいルームを作成","创建新房间"],
    ["※作成したルームは参加者が0人になった時点で解散します。ルームの状態を次回に持ち越したい場合は必ず「保存」してください。","※创建的房间当参加者为0人时将自动解散。想要将保持房间的状态下次继续使用的话一定要记得「保存」。"],
    ["ルームの名前は必須","必须要有房间名"],
    ["空ならパスワードなし","留空则视为无密码"],
    ["チャットパレットの編集","编辑聊天面板"],
    ["基本ステータス","基本数据"],
    ["common","基本"],
    ["name","名称"],
    ["size","尺寸"],
    ["image","图像"],
    [" チャット簡易表示: "," 聊天栏简易显示: "],
    [" ダイス表編集中です "," 骰表编辑中 "],
    ["ダイス表を確定","确定骰表"],
    [" チャット詳細設定 "," 聊天栏详细设定 "],
    [" 立ち絵をウィンドウ内に表示: "," 在窗口内显示立绘: "],
    [" 簡易表示で時間を表示: "," 简易显示表示时间: "],
    [" 簡易表示でIDを表示: "," 简易显示表示ID: "],
    ["選択タブ削除","删除选择桌"],
    ["ログ保存","保存日志"],
    ["全タブログ保存","保存所有桌日志"],
    ["選択ログ消去","删除选择日志"],
    ["全ログ消去","删除所有日志"],
    ["リストから選んだログを保存","保存从列表选择的日志"],
    ["時系列順にまとめて保存","按时间顺序一起保存"],
    ["○●○","●○●"],
])

const alertbak = window.alert.bind(window)
window.alert = (message) => {
    if (i18n.has(message)) message = i18n.get(message)
    return alertbak(message)
}
const confirmbak = window.confirm.bind(window)
window.confirm = (message) => {
    if (i18n.has(message)) message = i18n.get(message)
    return confirmbak(message)
}
const promptbak = window.prompt.bind(window)
window.prompt = (message, _default) => {
    if (i18n.has(message)) message = i18n.get(message)
    return promptbak(message, _default)
}

replaceText(document.body)

const bodyObserver = new MutationObserver(mutations => {
    mutations.forEach(mutation => {
        mutation.addedNodes.forEach(addedNode => replaceText(addedNode))
    })
})
bodyObserver.observe(document.body, { childList: true, subtree: true })

function replaceText(node) {
    nodeForEach(node).forEach(textNode => {
        if (textNode instanceof Text && i18n.has(textNode.nodeValue))
            textNode.nodeValue = i18n.get(textNode.nodeValue)
        else if (textNode instanceof HTMLInputElement) {
            if (textNode.type === 'button' && i18n.has(textNode.value))
                textNode.value = i18n.get(textNode.value)
            else if (textNode.type === 'text' && i18n.has(textNode.placeholder))
                textNode.placeholder = i18n.get(textNode.placeholder)
        }
    })
}

function nodeForEach(node) {
    const list = []
    if (node.childNodes.length === 0) list.push(node)
    else {
        node.childNodes.forEach(child => {
            if (child.childNodes.length === 0) list.push(child)
            else list.push(...nodeForEach(child))
        })
    }
    return list
}