// ==UserScript==
// @name        为布凤歌论坛自动答题
// @description  为布凤歌论坛每日全自动答题
// @namespace https://space.bilibili.com/482343
// @author 古海沉舟
// @license 古海沉舟
// @version 1.0
// @include       *weibufengge.com*
// @run-at document-end
// @grant GM_setValue
// @grant GM_getValue
// @downloadURL https://update.greasyfork.org/scripts/425328/%E4%B8%BA%E5%B8%83%E5%87%A4%E6%AD%8C%E8%AE%BA%E5%9D%9B%E8%87%AA%E5%8A%A8%E7%AD%94%E9%A2%98.user.js
// @updateURL https://update.greasyfork.org/scripts/425328/%E4%B8%BA%E5%B8%83%E5%87%A4%E6%AD%8C%E8%AE%BA%E5%9D%9B%E8%87%AA%E5%8A%A8%E7%AD%94%E9%A2%98.meta.js
// ==/UserScript==
var tk,da,i,j,k,a,b,c,d,l;
tk = ["下面关于三教灵玉及其所有者描述正确的是",
      "云海过客交代雪山银燕查探的地方不包括",
      "柳生剑影在红楼剑阁看到的三个剑心不包括",
      "武林三大宝典不包括",
      "下面有关银骠玄解的说法，正确的是",
      "戚寒雨在与涂万里争夺天元抡魁出战资格的比试中使用过的招式是",
      "下面关于段江辖根据涳溟沄渊推算出的水脉的三个副点的位置，不正确的是",
      "异度魔界断层接合后形成泪阳奇象。这三颗惑星映照之地不包括",
      "下面哪个不属于银锽朱武的武学气双流的功能",
      "四曲狭道中离三回洞最近的是第几条曲道",
      "银锽朱武与玄貘互换的是哪两本宝典？",
      "护众天元神归位时，位于佛公子左手边的人是",
      "寂寞侯在给六祸苍龙的卷轴中提醒其“未来必须注意的人”，不包括",
      "慕容胜雪入天机房接杀手任务时，架子最上面一排左起第二片竹片上的名字是",
      "慕容胜雪入天机房接杀手任务时，架子最上面一排左起第二个名字是",
      "由卧佛和伏龙护持、凤凰鸣补起的是哪里的神柱",
      "照耀往昔之灯的替代品，除了无所球外，还有",
      "下列人物中，谁不曾持有过“锐感之缨”",
      "剑子仙迹中了枯血冰痕之毒后，为他换血的人不包括",
      "阅天机第一次尝试开启中沉两域之间的通道时用的是",
      "针对天书被夺，俏如来依照的应变方案是",
      "下面有关阅天机在给葬魂皇的绝笔书中提到的其所留锦囊及里面的内容，正确的是",
      "以下哪个不是梦虬孙的表兄弟",
      "下面有关金光魔世计时的说法，错误的是",
      "医治姥无艳浑身恶臭的药材，不包括",
      "灭境三天中，一页书是称号是什么天",
      "在鼎炉分峰时提供了参天古木的是",
      "玄宗所设置的封印异度魔界的据点反射在苦境的位置，不包括",
      "霹雳三教流氓谁给他们取的绰号",
      "葬魂皇亲至壶天草堂迎聘阅天机时做的第一件事是",
      "下面关于佛公子的曲，描述正确的是",
      "殇不患中了蝎璎珞的毒后，凛雪鸦以五行之盐验毒。请问他没有用到哪种属性的盐",
      "为医治中了蝎璎珞之毒的殇不患，凛雪鸦开出的解药药方中不包括下面哪一味药",
      "下面哪一个的药性与其他三个的相反",
      "寂寞侯遗书中交待有一人非除不可，此人是",
      "佛牒第一次断掉是在什么时候",
      "霹雳金光播出在哪一年",
      "剑君十二恨诗号中所恨的内容不包括",
      "面哪句不是默苍离怼帝鬼时说过的话",
      "佛剑分说承诺化缘修复疏楼龙宿的什么地方",
      "在烽火天榜上的排名一直没变的是",
      "一步禅空的武学中，不是攻击招式的是",
      "三古奇皇因仙魔瞳移位而重获自由的是",
      "下面关于夜摩市的说法，正确的是",
      "下面有关苍针对弃天帝排布的玄罡剑奇阵说法正确的是",
      "冥医医治史艳文所需的药引不包括",
      "名战不曾向下面哪个人发出拜师申请",
      "香独秀前往火灵晶界的收获，不包括",
      "夜重生进化的关键之物，不包括",
      "为出时间城，素还真与时间城主定下三茶之约。请问素还真通过了几杯考验？",
      "为出时间城，素还真与时间城主定下三茶之约。请问第二杯茶是什么颜色？",
      "时间城主与素还真以三盘棋定随遇的去留。下面关于前两盘的说法正确的是",
      "鳞王在与玄狐一战中诈死的目的不包括",
      "宇宙天尊以四大神器划出四域界线。若要运使神器，需要命格为多少之极数？",
      "关于神州四支柱的属性，描述正确的是",
      "关于五大神器，下面哪个不是毁于一页书？",
      "在御风楼和忠烈府均有留名的人物不包括",
      "下面关于苦焦树的说法，错误的是",
      "为防神蛊温皇等人营救被囚的史艳文，赤羽信之介派人加强了西剑流要道关口的防守。下面关于其指派，说法正确的是",
      "下列人物中，谁的武器和其他三个不一样",
      "下列双持人物中，持有的武器与其他三人不同的是",
      "下列不属于阴川蝴蝶君所定义的“A级的技术”的角色是",
      "下面有关阴川蝴蝶君的价目表中的等级表述正确的是",
      "浪巫谣在入西幽宫廷前，曾在一家酒楼卖唱。请问入座该酒楼饮酒听歌至少需要多少银？",
      "玄貘造假哪本书，误导银锽朱武神州支柱在江南雨地？",
      "西剑流与中原以天下风云碑之战划分中原各区归属。请问中原胜出而得到的区域是",
      "白马纵横的马是什么颜色",
      "（刀说异数）崎路人翻开万斤巨书第三页，露出来的是谁的武器？",
      "北竞王逼狼主念书时，让婢女诵读的文章出自《礼记》的哪一篇",
      "不解之护毁于谁之手",
      "雁王vs铁骕求衣一战中，雁王一共用了几颗断云石？幻化了几样武器？",
      "下面书籍与其记录的神柱的位置正确的是",
      "在给疏楼龙宿的契约书上伪造傲笑红尘的签名的人是",
      "月神第二次射出烛龙之箭是为了",
      "下面关于霹雳四境及其通道的说法，正确的是",
      "寂寞侯曾告诉六祸苍龙他有三个隐藏的敌人，这三个隐藏的敌人不包括",
      "识能龙开出的毁不老神泉的前提条件不包括",
      "红楼剑阁比武招亲时决定比试对手的石头叫",
      "六祸苍龙用来交换月神扬弓的秘籍不包括",
      "风逍遥在前往道域的船上向天之道介绍其师兄时，不曾用过的名字是",
      "默苍离让冥医交给俏如来三颗不同颜色的药丸，下列说法中正确的是",
      "剑子仙迹曾提出烧掉疏楼龙宿的产业来逼他现身，其烧掉的顺序是",
      "西剑流与中原以天下风云碑之战划分中原各区归属。下面对战人物与赌注的区域相匹配的是",
      "欲星移让风逍遥帮忙装一瓶溪水，风逍遥提出要多少坛百里闻香交换",
      "欲星移为让风逍遥帮忙装一瓶溪水，承诺用多少坛百里闻香交换",
      "下面关于神州支柱护柱圣兽的说法正确的是",
      "灵界大战后，默苍离指出俏如来犯的19处错误中，寡断是第几错？",
      "下面哪个人物的武器不曾出现在殇不患的魔剑目录中",
      "寂寞侯请六祸苍龙颁布通缉令时，强调要留意者不包括",
      "曌云裳斩杀任剑谁后，将岁月轮插回原处时，刻盘停在什么时辰",
      "天荒不老城太辅COS的人是",
      "袭灭天来所设的轮回之门内发生的对战不包括",
      "鳞族镇国神功中，“击浪万里润汪洋”的招式对应的是哪一海的龙王",
      "下面关于破妖魔海的描述正确的是",
      "三颗惑星坠落之地不包括",
      "阅天机以三十六计中的第几计收服战堂与魍妖窟？",
      "空谷残声欲入异度魔界带走月漩涡前，朱闻苍日指点他逃走路线是",
      "佛公子所弹奏的无筝有几根弦",
      "黑白郎君受魔世三尊三掌的顺序是",
      "学海无涯审伏龙先生“一体双魂”一案时，六部中判“将功补过，戴罪立功”的是",
      "云海过客交待雪山银燕查探的地方不包括",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
     ];
da = ["地月灵玉——木姥姥",
      "黑水城",
      "孤星",
      "《万血邪箓》",
      "左手阳可变化为剑",
      "踏步杀·碎梦",
      "天允山西北十里",
      "风水禁地",
      "化攻击中的能量为自身真元",
      "二",
      "《魔宝大典》与《侠道追溯》",
      "大红袍",
      "一页书",
      "胡山不归人",
      "妖无泪",
      "北越天海",
      "萤玥石",
      "金鎏影",
      "天险刀藏",
      "雷荧珠",
      "二十七之五，三十六之八",
      "黄色锦囊——指引一名可取代自己之人",
      "欲星移",
      "三月交替一轮为一年",
      "凝碧宙",
      "梵天",
      "金包银",
      "封云山",
      "秦假仙",
      "炸了牌扁",
      "七情为基，六欲为调，三毒为奏",
      "金",
      "黄芩",
      "鸠魅果",
      "轩辕不败",
      "灭绝希望的未来",
      "1988",
      "夏日有蚊",
      "你天真的让我不忍欺负你",
      "三分春色",
      "烽火关键",
      "来处惹何埃",
      "左臂",
      "宝翠等级比赤瑚高",
      "月漩涡为心眼",
      "护心草",
      "速寒影",
      "没有温泉",
      "毒蔓草",
      "1",
      "蓝",
      "时间城主一败一和",
      "逼梦虬孙回宫",
      "二两一",
      "极封灵地神柱属性为火",
      "不解之护",
      "凤凰鸣",
      "三年一花",
      "月牙岚守北方关口",
      "吞佛童子",
      "昔苍白",
      "嵩马狄",
      "C级：白银级",
      "15",
      "《魔宝大典》",
      "北部和西部",
      "红色",
      "一剑万生",
      "《大学》",
      "九章伏藏",
      "5，6",
      "《侠道追溯》——藏青云地",
      "陶版",
      "杀一页书",
      "灭境与道境之间的通道是超凡道",
      "东瀛",
      "请素还真当主婚人",
      "回气石",
      "紫微东耀",
      "千峰残·笑金少",
      "史艳文服用的是黑色",
      "龙烟宛→三分春色→疏楼西风→儒门天下",
      "何问天vs天海光流——赌注南部",
      "3",
      "30",
      "极封灵地——肥遗",
      "五",
      "杜舞雩",
      "袭灭天来",
      "未",
      "四无君",
      "长清子vs朱厌剑灵",
      "西",
      "欲星移四箭齐发",
      "天荒不老城",
      "二十四",
      "西南西",
      "十六",
      "荡神灭——炽焰天——曼邪音",
      "射书",
      "黑水城",
      "",
      "",
      "",
      "",
      "",
      "",
      ""
     ];

var za = GM_getValue("timu","");
var zb = GM_getValue("daan","");
var zc = GM_getValue("shiji","");
var rq= GM_getValue("riqi","");
function dt(){
     var tm=document.getElementsByTagName("a");
     //console.log("自动跳转   ",tm);
     for (i=0;i<tm.length;i++){
          if (tm[i].text.indexOf("自动跳转")>-1){tm[i].click();return true;}
     }
     var dhk=document.getElementById('fwin_content_pop');
     if (dhk==null)return false;
     tm=dhk.getElementsByTagName("button");
     //console.log("领取通关奖励   ",tm);
     for (i=0;i<tm.length;i++){
          if (tm[i].innerText=="领取通关奖励"){
               tm[i].click();return true;
          }
     }
     tm=dhk.getElementsByTagName("b");
     //console.log("题目总   ",tm);
     for (i=0;i<tm.length;i++){
          if (tm[i].innerHTML=="继续闯关"){
               tm[i].parentElement.click();return true;
          }
          if (tm[i].innerHTML=="【题目】"){
               //console.log("题目   ",tm[i]);
               a=tm[i].nextSibling;
               b=[];
               tm=dhk.getElementsByTagName("div");
               for (j=0;j<tm.length;j++){
                    if (tm[j].className=="qs_option"){
                         b.push(tm[j]);
                    }
               }
               l=-1;
               for (j=0;j<tk.length;j++){
                    if (a.textContent==tk[j] && tk[j]!=""){
                         l=j;
                         break;
                    }
               }
               if (l<0){
                    for (j=0;j<tk.length;j++){
                         if (a.textContent.indexOf(tk[j])>-1 && tk[j]!=""){
                              l=j;
                              break;
                         }
                    }}
               if (l<0){
                    console.log("题库无此题目   ",a.textContent);
                    return false;
               }
               za=a.textContent+" | "+tk[l];
               for (k=0;k<b.length;k++){
                    if (b[k].textContent.replace(/\s*/g,"")==da[l]){
                         console.log("选择   ",b[k]);
                         b[k].click();
                         c = 1;
                         zb=b[k].textContent.replace(/\s*/g,"");
                         zc=da[l];
                         GM_setValue("timu", za);
                         GM_setValue("daan", zb);
                         GM_setValue("shiji", zc);
                         return true;
                    }
               }
               for (k=0;k<b.length;k++){
                    if (b[k].textContent.replace(/\s*/g,"").indexOf(da[l])>-1){
                         console.log("选择   ",b[k]);
                         b[k].click();
                         c = 1;
                         zb=b[k].textContent;
                         zc=da[l];
                         GM_setValue("timu", za);
                         GM_setValue("daan", zb);
                         GM_setValue("shiji", zc);
                         return true;
                    }
               }
               console.log("未找到答案   ",b);
          }
     }
}
function tj(){
     var dhk=document.getElementById('fwin_content_pop');
     var tm=dhk.getElementsByTagName("strong");
     for (i=0;i<tm.length;i++){
          if (tm[i].innerHTML=="提交答案"){
               tm[i].parentElement.click();return true;
          }
     }
}
setInterval(function(){
     var f;
     if (rq!=new Date().toDateString()){
          f=document.querySelector("#ahome_question_icon");
          if (f==null)return;
          f.parentNode.click();
          rq=new Date().toDateString();
          GM_setValue("riqi", rq);
          return;
     }
     c=0;
     dt();
     if (c==1)tj();
},400);