// ==UserScript==
// @name         如梦社区助手
// @version      0.8.8
// @author       Supernova
// @description  一键和谐敏感词/美化页面/下载正文/下载图片/自动签到
// @match        http*://*.s61m.com/*
// @match        http*://alhs.xyz/*
// @icon         https://www.s61m.com/favicon.ico
// @run-at       document-idle
// @grant        unsafeWindow
// @grant        GM_log
// @grant        GM_setValue
// @grant        GM_getValue
// @grant        GM_notification
// @grant        GM_xmlhttpRequest
// @grant        GM_openInTab
// @grant        GM_download
// @grant        GM_deleteValue
// @grant        GM_listValues
// @license        MIT
// @namespace https://github.com/supernovaZhangJiaXing/Tampermonkey/
// @downloadURL https://update.greasyfork.org/scripts/426211/%E5%A6%82%E6%A2%A6%E7%A4%BE%E5%8C%BA%E5%8A%A9%E6%89%8B.user.js
// @updateURL https://update.greasyfork.org/scripts/426211/%E5%A6%82%E6%A2%A6%E7%A4%BE%E5%8C%BA%E5%8A%A9%E6%89%8B.meta.js
// ==/UserScript==

// 'use strict';
var $ = unsafeWindow.jQuery || $ || window.$;

// GM_deleteValue(new Date().toDateString())
// GM_setValue(new Date().toDateString(), true)

var down_article = ''; // 存放文章内容用于下载
GM_setValue('modified', false);

if (window.location.href.indexOf('alhs.xyz') != -1) { // 图书馆地址
    // TODO: 去掉广告
    if (window.location.href.indexOf('archives') != -1) {
        var superdown = $('<a href="javascript:void(0);">点我下载全文</a>').click(function () {
            down_article = '';
            storageAllLeafNodes($('#post_content'));
            down_article = down_article.replace(/\n+/g, '\n').trim();
            if (!down_article) {
                window.alert('网络问题, 请刷新页面后重新下载')
            } else {
                var data = new Blob([down_article],{type:"text/plain; charset=UTF-8"});
                $(this).attr("download", '《' + get_title_alhs() + '》 作者：' + get_author_alhs() + '.txt');
                $(this).attr("href", window.URL.createObjectURL(data));
                window.URL.revokeObjectURL(data);
            }
        })
        $('.leftbar-announcement-body').append($('<br />'))
        $('.leftbar-announcement-body').append($('<div class="leftbar-announcement-title text-white">下载本文</div>'));
        $('.leftbar-announcement-body').append($('<div class="leftbar-announcement-content text-white"></div>').append(superdown));
    }
} else { // 如梦地址
    // 自动签到
    if (document.getElementsByClassName('login_row').length) {
        GM_log('未登录, 无法自动签到');
    } else {
        if (GM_getValue(new Date().toDateString())) {
            GM_log('已经执行签到了，此次不签到');
        } else {
            var punchurl = 'jobcenter.php?action=punch&verify=' + verifyhash + '&step=2'; // verifyhash 在head定义
            GM_xmlhttpRequest({method: 'GET', url: punchurl, onload: function (xhr) {
                if (xhr.readyState == 4 && xhr.status == 200) {
                    if (xhr.responseText.indexOf('登录') == -1) {
                        GM_log('自动签到完成');
                        GM_setValue(new Date().toDateString(), true);
                    } else {
                        GM_notification('签到失败, 请先登录jobcenter.php');
                    }
                } else {
                    GM_notification('自动签到失败, 请刷新页面');
                }
            }});
        }
    }

    // 发布帖子的页面
    console.log(window.location.href);
    if (window.location.href.indexOf('/post.php') != -1) {
        $('span.bt').eq(0).after($('span.bt').eq(0).clone()) // 取消其提交功能.find('button').eq(0).attr('name', 'prepare')
        $('span.bt').eq(0).html($('span.bt').eq(0).html().replace(' 预 览 ', ' 预处理 '))
            .click(function () { // 点击预处理按钮后的行为
            // 移植冷狼大佬的工具
            var textarea = document.getElementById("textarea");
            textarea.value = go(textarea.value);
            // window.alert('敏感词处理完成')
        }).attr('class', 'btn').find('button').removeAttr('onclick');
    }

    // 读取帖子的页面
    if (window.location.href.indexOf('/read.php') != -1) { // 有时候会有thread.php, 所以加个"/"
        // 页面加宽一些
        $(".top.cc").css("width", $(window).width() * 0.775);
        $("#head").css("width", $(window).width() * 0.775);
        $("#navA").css("width", $(window).width() * 0.775);
        $("#searchA").css("width", $(window).width() * 0.775);
        $(".main-wrap").css("width", $(window).width() * 0.775);
        $("#scrollBar").css("margin-right", "-" + $(".main-wrap").width() / 2 - $("#scrollBar").width() + "px");
        try {
            // 复制发布按钮并修改为预处理
            var btn_box = $('.btn').eq(0);
            btn_box.children(0).attr('style', 'margin:0 0 0 0;')
            var pre_btn = btn_box.clone(); //预处理按钮
            var pre_btn_html = pre_btn.children(0).html().replace(' 发 布 ', '预处理').replace('submit', 'button').replace('Submit', 'prepare'); // 直接改type改不了
            pre_btn.children(0).html(pre_btn_html).attr('title', 'prepare');
            // 点击预处理按钮后的行为
            pre_btn.children(0).click(function () { // 点击预处理按钮后的行为
                var textarea = document.getElementById("textarea");
                textarea.value = go(textarea.value);
                GM_log('敏感词处理完成')
            });
            btn_box.after(pre_btn);

            // TODO: 有的转载的带一个表格, 没法处理
            $('.replay.fr.mr10').eq(0).after($('<a href="javascript:void(0);" class="replay fr mr10" id="beautify_page_btn">美化页面</a>').data('c', '#FAF9DE').click(beautify_page).hover(function(){
                $("#beautify_page_list").css('left', $('#beautify_page_btn').offset().left + 'px').css('top', $('#beautify_page_btn').offset().top + 30 + 'px').show();
            },function(){
                $("#beautify_page_list").hide();
            })); // 美化页面
            $('.replay.fr.mr10').eq(0).after($('<a href="javascript:void(0);" class="post fr mr10">下载正文</a>').click(function() {
                beautify_page();
                down_article = '';
                storageAllLeafNodes($('#read_tpc'));
                down_article = down_article.replace(/\n+/g, '\n').trim();
                if (!down_article) {
                    window.alert('网络问题, 请刷新页面后重新下载')
                } else {
                    var data = new Blob([down_article],{type:"text/plain; charset=UTF-8"});
                    $(this).attr("download", '《' + get_title_rm() + '》 作者：' + get_author_rm() + '.txt');
                    $(this).attr("href", window.URL.createObjectURL(data));
                    window.URL.revokeObjectURL(data);
                }
            })); // 下载正文
            $('.replay.fr.mr10').eq(0).after($('<a href="javascript:void(0);" class="post fr mr10">下载图片</a>').click(function() {
                $('.floot_right').find('img').each(down_imgs); // 表格右侧的style是floot_right, 内有图片
                $('.floot_bottom').find('img').each(down_imgs); // 点击后显示的部分不在同一个tr里
            })); // 下载图片

            // 美化页面下拉菜单
            var color_list = $('<div id="beautify_page_list" class="pw_menu tac" style="position: absolute; z-index: 1011; visibility: visible; display: none"></div>'); // left和top临时定义
            var color_list_ul = $('<ul id="beautify_typeChoose" class="menuList" style="width: 70px"></ul>');
            var color_list_w = $('<li style="background-color:#FFFFFF"><a href="javascript:void(0);">默认白</a></li>').data('c', '#FFFFFF').click(beautify_page);
            var color_list_y = $('<li style="background-color:#FAF9DE"><a href="javascript:void(0);" style="font-weight:bold">杏仁黄</a></li>').data('c', '#FAF9DE').click(beautify_page);
            var color_list_n = $('<li style="background-color:#FFF2E2"><a href="javascript:void(0);">秋叶褐</a></li>').data('c', '#FFF2E2').click(beautify_page);
            var color_list_r = $('<li style="background-color:#FDE6E0"><a href="javascript:void(0);">胭脂红</a></li>').data('c', '#FDE6E0').click(beautify_page);
            var color_list_g = $('<li style="background-color:#E3EDCD"><a href="javascript:void(0);">青草绿</a></li>').data('c', '#E3EDCD').click(beautify_page);
            var color_list_b = $('<li style="background-color:#DCE2F1"><a href="javascript:void(0);">海天蓝</a></li>').data('c', '#DCE2F1').click(beautify_page);
            var color_list_p = $('<li style="background-color:#E9EBFE"><a href="javascript:void(0);">葛巾紫</a></li>').data('c', '#E9EBFE').click(beautify_page);
            var color_list_k = $('<li style="background-color:#EAEAEF"><a href="javascript:void(0);">极光灰</a></li>').data('c', '#EAEAEF').click(beautify_page);
            color_list.append(color_list_ul);
            color_list_ul.append(color_list_w);
            color_list_ul.append(color_list_y);
            color_list_ul.append(color_list_n);
            color_list_ul.append(color_list_r);
            color_list_ul.append(color_list_g);
            color_list_ul.append(color_list_b);
            color_list_ul.append(color_list_p);
            color_list_ul.append(color_list_k);
            $('#menu_post').after(color_list.hover(function(){
                $("#beautify_page_list").show();
            },function(){
                $("#beautify_page_list").hide();
            }))
        } catch (error) {
            GM_log('暂停对该界面的美化');
        }
    }
}

function down_imgs(index, img) {
    var img_url = $(this).attr('src');
    var img_ext = img_url.split('/')[img_url.split('/').length - 1];
    if (img_ext.includes('?')) {
        img_ext = img_ext.split('?')[0];
    }
    img_ext = img_ext.split('.')[1];
    var img_name = get_author_rm() + '_' + get_title_rm() + '_' + index + '.' + img_ext;
    GM_download(img_url, img_name);
}

function get_author_alhs() {
    return $('[itemprop=name]').text().replace(/[\\\/\?\.\*\:]/g, '_').trim();
}

function get_title_alhs() {
    return $('.post-title').text().replace(/[\\\/\?\.\*\:]/g, '_').trim();
}

function get_author_rm() {
    return $('.readName.b').eq(0).children().eq(1).text().replace(/[\\\/\?\.\*\:]/g, '_').trim();
}

function get_title_rm() {
    return $('#subject_tpc').contents().text().replace(/\[.*?\]/g, '').replace(/[\\\/\?\.\*\:]/g, '_').trim();
}

// 美化读者页面
function beautify_page() {
    if ($(this).data('c')) { // 如果this带c, 说明点的是美化, 否则是下载
        $('.floot_right').css('background-color', $(this).data('c')); // 背景颜色通过data的c传递
        color_list_ul.children().children().css('font-weight', 'normal');
        $(this).children().css('font-weight', 'bold');
    }
    // TODO: 用jQuery的过滤来处理
    // 末尾的购买结点不处理
    var buy_node = $('#read_tpc').find('.quoteTips.f12.mb10').remove();
    var hint_node = $('#read_tpc').find('.mb10.f12.b').remove();
    var hide_node = $('#read_tpc').find('.quoteTips.f12').remove();
    if (GM_getValue('modified') == false) {
        // 递归处理所有叶子结点
        modifyAllLeafNodes($('#read_tpc'));
    }
    // 购买结点加回来
    $('#read_tpc').append(buy_node);
    $('#read_tpc').append(hint_node);
    $('#read_tpc').append(hide_node);
    // 记录是否已经处理过
    GM_setValue('modified', true);
}

// 递归修改所有叶子节点
function modifyAllLeafNodes(treeNode) {
    prepare_node(treeNode);
    if (treeNode.children().length) {
        var childrenNodes = treeNode.children();
        if (childrenNodes) {
            for (var i = 0; i < childrenNodes.length; i++) {
                if (!childrenNodes.eq(i).children().length) {
                    var new_text = remove_space(childrenNodes.eq(i)) // 移除空格
                } else {
                    modifyAllLeafNodes(childrenNodes.eq(i));
                }
            }
        }
    } else {
        remove_space(treeNode);
    }
}

// 递归存储所有叶子节点
function storageAllLeafNodes(treeNode) {
    treeNode.contents().each(function() {
        var $current = $(this);
        if ($current.is('p')) {
            down_article += '\n';
            storageAllLeafNodes($current);
            down_article += '\n';
        } else if ($current.is('br')) {
            down_article += '\n';
        } else if (this.nodeType === 3) { // 文本节点
            var text = $current.text().trim();
            if (text) {
                down_article += text;
            }
        } else if (this.nodeType === 1) { // 元素节点
            storageAllLeafNodes($current);
        }
    });
}

function prepare_node(node) {
    // 过滤文本节点, 封装入段落标签, 方便后续用children处理
    if (node.contents().length) {
        node.contents()
        // 文本节点改为font, 4号微软雅黑
        .filter(function() {
            return this.nodeType == 3;
        })
        .wrap('<font face="微软雅黑" size="4" style="user-select: auto;"></font>')
        .end()
        // 原1号字改为4号
        .filter('font')
        .attr('size', 4)
        .end()
        // 原宋体或黑体字改为微软雅黑
        .filter('font', function() {
            return $(this).attr('face').trim() == '宋体' || $(this).attr('face').trim() == '黑体';
        })
        .attr('face', '微软雅黑')
        .end()
        // 隐藏字段全部删除
        .filter(function() {
            if ($(this).attr('style')) {
                return $(this).css('display') == 'none';
            } else {
                return false;
            }
        })
        .remove()
        .end()
        // 段落背景色去掉
        .filter('span')
        .filter(function() {
            return $(this).css('background-color');
        })
        .css('background-color', '')
        .end()
        .end();
    }
}

// 移除一个叶子结点内部的空格(用的是text)并返回处理后的文本
function remove_space(node) {
    var nodetext = node.text().trim();
    nodetext = nodetext.replace(/\s+/g, '');
    node.text(nodetext);
    return nodetext;
}

function go(nr) { // nr: 输入文本框的内容
    console.log('处理前: ' + nr)
    nr = filter_words(nr)
    console.log('处理后: ' + nr)
    return nr
}

// 处理敏感词, 感谢如梦用户jepejpep的帮助
function filter_words(nr) {
    // 解密后定义了一个ref变量, 相当于
    // var ref = {low:[['', ''], ['', ''], ...], medium:[['', ''], ['', ''], ...], high:[['', ''], ['', ''], ...]}
    eval(unzip('乀妑峌又帹呖婺泛养攺奫媈愑敓塨寍埜争嚤奆予处噄妢朐御挛忀柆婎垆嫊啱欠怩劉忁怌媺咆晨婦圯忹侑暌垍徊崥囪哣剤兹沘栌嬎仐婧撠呣帹拚亙桀梌欰櫦債噑嘹兹圶椌杘欤娆梏匆呡掛墜徘朙挜孆囂唗問弸攙曄悌垘暯梷妣圸弱朚樶剚曊楨汎呣垑循垥槈枘氞桯泈呕彐冑昘櫌栙侊塣外娹御掱昱侵敉垈术內婣塥抚唛侐榌咪匳曇悦卺橱昛侯兎囀嬴偿岒敥旙望徧兯媖杵桩擖毠弽廌孹悎囋剎峑棴偓御帙忏卹柖張惞媙毇兓倜塦檎岖廨敓慖椽涩哂氐榘寉丠氘昝悡斄姴慐柁寨儨暡壹否克暃仂惧欇医娚壆嫻攝彡慡桊呕匸樶嶴存仯喚劋儎噠呗宱挦寤帑拇仉攊儙乲步唱剢宲汆刜昺圩夘晡側掸伩巐宆吳卒刁彾媴涹恌桫例塟戛徐呑樝噲兠柌呪侨婡抣擁垐嶗刿啧囎偀傠毆怺俐媣恌匒儚呑杢僈槇堺俔婃卌亲浐栥戻担咩暵优娣冈回哱掦傧捈暩浐棉叕孚庄庱憌沔国尫嘝棪悋墢廖咔晘帱夓咐峵劬哣咈檤槠朆呅巛戞唵曞唡恵娥佈檬杲峥昦勛嚹浰憴宔戱徆响敍杦拀榡慴侚幭岧伌哔忍洨嚓哖槷奶倨呠槀掀弶仜峍昡傌厝寳崫圻忐媫埥歸樑扗柅槂儉擢崜婈婆勷圩核悾拄兙樯吰晾因候廛丒扣吷廐柈崌愕沓悽圣傪凐傆楗州娰帚槳妡榱圁昍嫛僁愣敊堦慃宧樕妨啥嫑宕劆杘憎惭嫇曆冁抆偲吴慫奜嬒敆喇扖挎債哤掰檪寊妨杨嘛廤媭悚幰儁忯氠敲槆娛嚪洕垺乲吙徹昱岋涃厫欒季劺勹審匌峏忎掸撤尦棐则擋喱忖宀壭摟徦嘽塘梄橨批槱搏墾凡担泶峲柧慾樝攌斝梂敗暼斋暩掌抉梐梬搿汃叱拚擟侱俘敋宗汞例檭晃侻呟唡柫敟嬡匊厚侲扡压柅妷嘍仍昗浫氖侭曘椉洟堜刘毡挹倹椵昇婦槬咒巣叒汶捶壾攉嬙丠椷檩揂氡歠暤梛悇崡孆栖扤庱愖有實憨嚘樘在呐朋歁殭撨堣怮崃娙丶希涰枓扷战买杁徠昃仳奝弌欤擒欸嘲嘬椳垆檽汎婇庙櫢奘恣曡嚾涣泇庖媕慤嘆冘匝允劣噰愩晅僀嫗婩善吷撋倍暆仨兹吁攫氝橻孁喇戌栌曈勄櫢椪儞檘惮堐冄杚坳昛掘尐咩怠倍堄句慤扠唢搎悭勳妧擁攥僠向堇春嘥孷擄梴奬傘擔杯匕晧态斋偖掼彙塮伿有凵孈朐嫂带丙挾媙句挃圱弟仒媓旚欆怢儴峬恍噄尘抏劚凇憢妈劤戼従挆境匸檈哨斒泡敟伺咩偔搦弹复忂尾審媠捎戜今儌扦彂條姼卵歔尌剚伀戆榴剭战檽樽急槒孙束则晖在呎暟櫂倁巵弤槛椷暋勪嚪兩捌伓杈憞唣嚋庈呭埤悜峏嚝噱桷呞剚休奏佸偐柪婇丱挏憖娴涆丒傖氃幰捉晊拈暞櫬幑嗤减孮梅塭塝傓榣愂姂恕唙柡張悧朦嫽傕徭昙刊吖彲嬢呦嚚棉哈唓洗恰卲娕掷刋杔俸喜峳橊宠儩孍奭俈冞従峃摬沌媨掺櫆懘拠槐幌桛撇斜帝怩惙廗嘳侚悒恃卍叏嗸恤歯敕曨冎揮四壍嶈尻柳嘱卦佁攏挜嘾栈怃挶挔斪彤將沛栍圹哪已擎儆哞儖櫢丧並梄柝屢巓半殦募傋伣嶬伨卍垄巡椋旉扌擤僇倸嫊偋啋叉峅崃廊悦朼墄擭椖昣扞嬌坙協橌岄弁僊沬僄櫖捽忙斌摋冓榩僫傼晭嫉夹拮劬剭彈俭兞交怬媈圖奡攣塯幑槃没宫昰杍媼暋叢崹搟姢垨哞枯桒冈巵充噞奍憖嵝島劁広欇掩仪乸償攀掑搐毌乐崆屺憧忻梨弽傝欝仂槂揝浏嫲榬庎唑城擴倏侔捧扫堹桸樣哅崹徺晔室彲劷打嚦暋擬嚾孆弸啅役侇匌愊咣儰桎徼倩泤奨憩仢押彌夆呅埏宖崰棔剧毦咙桢戤斤厠廅嬌慚嚛垦拦撍廝嗵凍殂朩刱崤姞暐塸擰橖摙埓佧墘寨囡儅屌咹嗔柦杚殄寫梯剅亄惊剳抆幭淇涮池亃晖墹各嬭梾嘻以櫨囨偹慗姁二嗗愓掴朓楔往嬋倆曮嚌俞櫩毂哈必宣尃剁帧勒叐垨咕劰墝榏寤曣涷棞弥墲毩擸柏啞挒挱劮俐侭悻寖墁柳播劵嘷十浘幩嚈搷慌榫吘井乿橌匇彶幤榾沔抅曱咇樷嫫戛噷恛恎兴喖囕擙搨亃坒歶徔氖妌弆动嗕挅剏棳涾櫳嗛嫻拍歚帜庸佱堽垃忔棯仙仴嚧佅唼儒惥噆嗂國婁吺从戺及廞幦僠占曶殻坣楔泮榻帅嵳惔侷尻徇妹嘻毰撦孊搢朖乤廥奯桏境桼斪兛搦嚭榵抁咇恝冄刐弥嫆昸囎偧悼哧唾杨廄傘棯唹栎枎揈抚昄媬廚夒敦憎幡吤櫩崌槚揧嗮壾櫰幄叅汘朞況峮奪屺埯崥仹奯媑枃彗憷懋梔惵戒桌椃乌儶塼慹惘欦榙募步凗殧捩婃施丿婈拋媜梷棜敟哥涘敀擖哔泣戽伲殺婩擴斝坛坈孮泺厝侮泧幥嚠咯娭朚査可栆洎拆吝榟儚囑俼后嬘侊怖朼梊勞幬冚曄巼峅暀幈榠嵚劦殐嚠掩坂核柜戕伫實噙俴僒嘍桍傷夆婒樜帺乨幜妴嫤刵斮徆嚘嚂交勠曪写嗪仌寨兰擠存怠挒怖橺棠晒峔欝彚刑忦授事呲搸捧嚠常庺呅梐僦忎测岒倃攍晚惿侷僚啐寨摕惉栉殊汽噶厪儼敧墚坞兜僰啠案椰堭匃媗橅形弛伝檜囁堉宆嚂億樉柟囪僽弲厈偐务唠杏洉朜呣坩愌慓屨予偠剐塢威吾樑引橚帥徚仆注撐唰媠氄昃愫刣倯嚵乖亞伄垀卧概妣儋堆倍婷婍悠再儹汐开嘠掣嘁弜嬚橚弪乧仪侺哂槈埃榣嵇亍昌戝侚晕倾壄嚘歁幀峣抎帖刮创昷嚉儚曬媌嵖泌噆沃儆帍创彔僅仝仸垄帀吲仁徃妐挠橚帱幬基俈扐唰媀槁撺愆欝偂些弃仯剚囄復冂梤娃宍氍刜昺囐卂侶圼嵹卑欁斃愇不帘嘼月卿勒垴憉倀樣樃捶堳掆曵忏塬弨注消姄姈暊挵撕孯俬喝忾俔冐啠崠暁斃劓帣樘檪杗忚俖啸惩奢暁怃伆戍刞嘺幡忀剼儠尀孁椥掇侎娨则嘸乯怀俐儈咐峲楤忉夑洯仢嘴坼惽厴幤噙兲壅捋暗挰昚嘶幥仦歌儜征吓伥毌悙嘅桥暴垎想召冄杈扠朦仌朇估戝勒嚻噫吰夐卆数垣攦戞櫗嬾娖信嫦啌楸朐媢坚朓浄橺呑什偤勪恐寜槹敱乆劈损氯宑圾丷嬒啒屰倩昇嫀栝伥嚿櫤兗僐崢洵消暱哅帄晏偣弼揣櫴傦仂伲哹壩氓檅挖库氌匟亏柷仓嗤夑嬁加朏吭嘥兀乊欁冡先咂嶰吙歮朧擐侠唽咃売埬懏噄园仉歩氅亃吆暣佪回幦仚今厼妙淢侣戃圩攰嘈帳乲往仮录僁婀柁広嬆氷卌暒悃存榬寭兪唏咥哎啣奈傍欜往嚀嫤圻劲嘔宁材倆欱帝昷干仗呖嫴极凴戩坒戃佊樜欭垠傃囚壠倠嫥媇光殦堌嘚侷厓劀伜倘剆斉恆拓挖戌標丸嚥僮仭氡媚埠栥库冧做嘙歂吸后櫼暒撊嘑殁憺愞擅怡暨乣垔勀儽圚悎媪娦悦奒咤曆掦僟塼塭垰寔桪恀枩嵓咞捈最惛厞捕垪搠株柋嬆嵆播檶梚俥墪嘀浒嬂妥椈庪慕屐塾彌捩壮恽埂刌太噕墩桦低捧棔探擜妲殊朕捑媙嶭啙加亷捋岏奺擕塪愵搫劑桀杙撸廩戌崵奞扅嬁浤廋夵庭楞治捽俏巍売操嶊汢嬫愌微彠廫卓棱傆囐妕崊殂歙块抰兖僀朼夔搜姶晨涻俣庬乘嚯楣毄梙椝搲抾晥弢伦京囗撱廽墵掋墡摠娈妭忋卣泬曗亳啘沿宝椆摍嫤堥慡咖墬旖圑岜樎殗夂撒叩剑捫喴栫槚堾坛惈掁楖摁妆柍掻劵柭壚庮拫法厁慕凝嬶暽媛嬖媭嫛媪奦沿厳楱咏孶桁劫岫嵬凘殶楕棙孍幯囶侺媴擪嬈悁栁帆欳梱帑乇慻傮橸昃坯差唤匧曃希嘧墂僇伸埭枢朢梁戒嵽怣注橈杣嶼剀兄徉抲掁投圓位汭媖榮仭峀挨戛掕墁歈侻刞峯临们僅岰冤掙媷垊淞咕捍幄労幱怄侜冝妀寠极梉帆捘嬑丸廭捕嵎搚拋梡汅彞嶽兺娚媟榆斳冹屘晻榗斯伃庽椓橉塪噧倡傆常呧坷氮嘌弄擳劻姓忓悞哶嘭折攇樰凑呬丨刚昺乶姀岤徛沱晣浝傤栙儭哽嬣伟昶劮涵梠剘嗄堍楋嶄廔毽樢儴挘庒僨壎嶛冯很捿师廉樴喫廅宮儸忘孀村參榇勵曋斎晴剐将兘卤楅妍嘖泑柴偼椚僈坑櫡梒啇崖昁往傒洏刣幡嬎姥岉摋悮光檯杛恍坍杸偂峐栍帞况叩浰墠坖剤殀战冁勚庴朓柶嫨嫉唾歓撧佱惡想冞栤塝浱旂奋媏圣惊柨榝檂姞沉櫣桚忬僱嬪孟偃店坫婬暠抷勳棴嫹勅方殁僕洠暕忑朔昐悂旊偌撉婥徊摭晣汚摧媡怓亪弒匔唅宎卛泘橧朜愵悢坁浚櫓櫋桐掃媟栍洳櫼幸斢勃呸尜栠桳娃明杖扚摧杁枬侤嗌孀剙映抈淌氟刜毡櫟仒俔圬公欹槳暮凎殞們傇櫠哝众哸啜椳涳拧暖刪婻摫扼柽圦倸兂栠椳涺叐构嘛國息徰唫嚥树嘴圄悊放棇橞俎啓乮哴兪彫憏攇卩哒圙戙嚅并匹哒夐挡杚头敝朑不战嘹平仂壯嚰冽啚崴洋壓怏咅僞悛喏挗堸楔咺劁抃嘇堌擡撔嚈梣捌夐哝堓檄嶃嬎栍举揆歚捕捆伨倭姚朁棧寑挨五偪位梴在儖擱婀慰並拓涮毡沢乭幖殘対堑倀慁嘊擓涰帎咺幐冽搛婘播幥嘶呂忘殱埱拚摳椩捤凌杼栺巶嬕夆暏丘常殣仢忴掐泭抛坅捋垬兗僶卡摟楚円洤帡尻姯摭弆営嵪泚殮昽擀尰哩丛峅仭娆嶶楯泜寁榏攒柵墪旔攫侁戓楕嘸叆棈捵填岖歀嫻措毘旝位其昝幮榭娋峎欛殛拷恮氖匯唳毘弟拻峐坶洍哠嚁旍分殬岀帲圬偝旫巢兑婔掁恈凜勴帛擿嬱敓均帹夊摻榁拦崢厠偾帑圿権嗧咑姽毀樯垊怓与冇楟吁橂厫嬝欽啗夯妈淢慗僷泺傢僅撏你槴嚹咆沂愄刦乽叚劌僕僬兰唹宛嘄已僤囗朶昝殠檂堻坹垲斀嚢毊搢儔嶒弰汁仑捎沙坸旀栃拲儆帞壵洭孓攇夻悟厰寀欹匋曍橣拠氫僢农勩嚧啈壎峳倯吇唫嘚帼枖仞歌児唁斲嬁杞徽夗昜啄夃剶叠儰搠岓浸凈斥娦冤歡摐国嶳拟坢忢梺埋宖椲峡敌沝兓桳嘧垰宼晒伐栵噮摶佌幩捩档奐呋樕彺圃掔串崏暦悙俘楑悷刁嘽嬬汶俫槙喯加卋揖事摅扪揢幁梃咙尦况帱汮晅兼冯剀娠椦怃惧楰榷数峢匝僾啱兎寢暴斃怇憴婌啸傟坕槌搝妫斲椮儃旫掼帙昽乵槍槤具嶽樽涯搪嫰宪嗁亠幷剃拦坑囫掓勮傣槍冴崴攋形仮俖奎愀剀毃歋圎庐噯楏伻儣慒推忼榜樄噹媇撄構涙樢仱捋呸意唁桁摫姳傶優檠柢汖嬆习槝囒嫺僰婯戥啑比朴僄俤兀咰嫀沣嘥堫刧旕嶫彪仳刈儦摮泂塽幹洂叫沪新浘泉殧椷撋桽嵽掁榽槮亱斯圂杸匴凍殡廽墇汐夔凭互急旦泷嶱倧墢噊岽槼垯懯姟哲嶃峑歸凄亳伞檾墉哒嗫枽愇嵈傪拼怇晥方堆嚃棕吆喊帷串倍尘凕儐察塪橽姺栬姩洱坭浪剿歽楁償封敽挖捷敔昳杩槃峷殇橞悟宮比垖晀殶嗝榳桤墇奈吟栟愫槎扂孷时慃娢仴侨岍晑浍捔抜嚉呪侵塇晈淊仐尘擿殤梛墖柾弩察旷挽淤屹槼咯每橿椎啭壦姾淵巯啘倂且毨歍摕淠嵑憕塘嚀擑天哨擔撁侌樰吀嚈栰幕涞两戂买厼宐姕唐暐淬寥柨咬宩徸永噜惔戠劔媺乭惬泈屨在噩淜庴劥墍天佭徹怴喱弤嚀什擜怸昈卡樉戩喙啌槨旼哅丄暔幐枌撱地廹搄庰幔寙廼娼恀搉佘嶨呵彑戹檴撖佢侀懬尽嘽喞佸嶭彑噮优揱弘师憌單仔棙愂佞佽巕囬喐杊侬古水幒侩徸寚倀擁涥哦倐暄椝华倌梲俕太倊侒俥婬楮偄孂佀彤斤憭亲俺偤威廼嫤只偲倶偸古妹商傎偈嫊伖側掸沺倮仢侕幠沔峆乴戡恴剔揙两樼棌勐氌旦僵伜暌埬懰嶴埡孍弩唌恜暉侀旸昈幄朴永庸橍檪佸幅啰抐恩徒伈幄櫄幒兌擖偘摸嚄往攸朲冐囘提昉丨槸擂偩困朴嵖佈欔嗘嘄叮佬弪儡怀悘埞余揸惕乴嵔根們愨射守叨宠弎公春徬匑淜埈來兜墄埄恕巖剌栌汴夭庩柤堑掹悤庈寘慐娀埵宖劀揰尨憬幌嘚似尅幌撀泠淌姌噜朡值娔哖冼匌媄朕幘於揆刈岤噍張佘幽巺匍弬杠憒勡太倽悀幞佬咲凨擶區汸浚偝忤嗸咴扵圑姡年扁丸嫘折屸尡忼嗬技憐无很嶘沐椥幝奅啠喬召幑彈孎伌寤侒厼匍檠呔尢勬唔崊台曨屜檌嘈旤惱徥噀坾僬媵丰單儎厈坐桑凸峁彴沘敠佀宺呈庞仌应嘄帤浐埈峨惀憑傒亥悸匌契啶卤怶侶伈涬栠奼深丼椚咞吘恌尤棄帊俜咚凌淩委慤椨峵揎剼吂剔吀侅徘埆唜怨坝侀椠嚬什晑侙惘淨侐孑中淜嘈揔樴巴拘垀憘泤囤幔屒啺剒卥僝倔撸槠厔殈侄桬吀埌年戹侎傽娸柭佘嫰唉傎乮嗠區埶伄剑唈昐挒嗝侕侈堊倨啤搨栍欈剔扤呖唺嘬戬尔噊匐淶唠埬囜旾嗊嗝侀惍惤泙惁幈嵕檨擂啁唍曤栎嚐吵僠廄匥恼孚劖咜檀區慒凸嚀惒们哔帤嵔惒乁挢园佚厠嚁墴劬扤涬恁噝债卄听埸擀撝佚圵噖哨嚀唖冖啌唠欉基坞圲傄惦勴埍弊儂哅怹巕囼栍弘嶸家咜彄周劶囄擴嗠擲喬怨柜嬵忙恶呬垌宲卐岲侠梔昺凼徒仼彐昬淖乍唤却沎嚘噱怤循刬浕姨枡屝啌朥伒坝浬呶叄噚坅彍幕妸唈庎咘奜嫴啌最姢塼汨扪唾乐埘嫚喸埘弨浐层唌擵剸宂嚠涞叄嘰孤埄娬剨嫲呭中乜俖夀威楞哄嵢坥庀杤崠唂埶勄崠尼崊凴嘆啁彘尦塞伌擜扦哆匄怨慒叡太哰娚傤彲圤匢奐噘坕唄开扵淁塜搱噠呔柶咸泀古崄唸檼峴噞壐圈棔涱中怾墰嘊娄妚一哼掮坔數桐徼嚬崚傚嚄吀掄呄佐伵埕欱椂婘厉梍朙屵充斑榄崸嚰奘夼懰旊修午樉函剱欱彵冼剡吴戂劼恚喵從垼局柄慚厄楤婾傺嗼埲吊咜樀哴佐伸佑允椂嬘慤梈單俴圁桍囐剾孁囆嫅愄哄愄朜噉圸奈佐伄伶嬠喺孺停巴怾呀櫰欥寤尴吐嗠旈櫴往尤往噎宴岰吔守墢咸椠悦啠庢傚嘠厐暺侒圈淈欺卄哾亾古巰沠峉弝匘未墈巖寸恪乚堰孼周只匀埞坜嚲宪圖婄匠听旼妸帩侐櫱欈圊嘎嚥幌喲劌惤噈仉姼嘁佘攸樴憨周慑丄唌樂嚈埄尽卄妾哄姤庄吴尖墼厔喰揱埼汨侊墈卶冶圕屠區叞叶崈婂宸汪嘘埭唒坨屮嫾嵨嚾崬挵惠擨愪冤殐斦墼吾嶒唑庪嶔扶嶪仰娂啖夠廸嫤弝匾垵嚜忍嘈恘恠嫾儮付唶尸囤孮坴岸呔弚坌妦宠场呬仜塭彮丞傚垱嘞啖实媐埰嵴城嫾幅埀宠嚆尼啴嶴惹匎带崆傄更嫂嗘姢庆婀沖喈庂佒厴埚仞廀峴勬廄唎嫞庰彝嘾剜屸埞嵚嵼曅喚寍弸囂姍愔拮弄匢喵彬峆佬埲僒呤孀厙嬔剐寕俼捌姎寤泈淄埱惀噰恪厪墰垌搚吞囬協叄拚庎嬵侀圑淜扖創丬岄夽彮寰哦妬嚂埬朄奔揚崹夨柌朲嵒尘沔剖墼孈姴攘嵼垈孮佥恩嘆幔怡欉柊刬尠摼唈圌报俚妆崘娼戺幦哖媊叞嚜殈桴囤株劎埬嘱僢各岤嘜匔戥惠囚尜妦偨歮吰泊忥嫩寜摦惠朚恜槙斬左嗲咝兤櫾卄垎妴悤崈垾囘剮恎婎嵆惘埬墂厨敔噱塠擰啁挺徴扵俄夬栂乖壐剖尬恜沜嚭凨吐市慒帬嗬措底丮凡忙汊愺弁恼孮庂嵐匑哺参崀斺劦恹氺佺弌姰娴存幵东暀廄梈嫾懨恪妅孀沕楞垾嶦恪堵徖卆懚帞喚弉匜令嶐囩弎弦噠枑京年旨搞凔棐婪垦刭徱忨弎抲埨柒夨娘呰杺妄愊悤崈岬攼廼峴只剴嶾惄摄楀噊慎奅仡囲幌姄涮憑淪悌扠幌擪慾哒兀嶠噰坐宠埵嘼擾嶌檮剄奘囎垌垔扐哘怨恂扒応圸岔憒哌匡唢悞弬听槸垈挬浐哪墼巖揌刞啠椈惔檂捦囎俲扁廼掮咨憸檈喒搄憸尌決娔抜奀愄恒坞彔懬媆劺徨嚬吼宠噺庂噖墶噜延廬匌喲恨涽徤勪媐嬭孆嶀埆彲匮恨尪刮摚婂彤栞擀岊啠浈嚂双回带挄客伔喆尀崺掮巂傚彪夶抖伊抜欦唾慰淪崤淶圀尞壄弖岢廼剜旼摰尺悌怶愨垜曰欽俵彶令嵆却影彶嬀抐搒怈氺围啦斤摺斬榾斢崱弐幐攄喆旌寎日懖斶旵愆唔妤悪峲妽嘝惈恌嚄敄懶孢忼唌來塞嵸涱惐樒寊弨岰地摄嘎崲攜嵡唙沑涼娵徆恠徝唆帚敀幆掤呖囔挔侔旼妾佮僼噰提栔怞從厪凅傈椴姎暕傖巜泊劢忰悘唾攀単嫊只屚尦撾彘岈娼嶝彬媘擜嚆忀尌擜曀懚塨圀池伌勀污埝庭凤朸匌婌徂嶈榺嬆妑仂宐唹塢拂巾擶峢撒嵖刦嵢廼旌恚惐哝为媖帥啔撤槚墐峎嫬孶攜嶝涰屦帎帚惌沖塾剒嶰妶忮嵦嶼吾拞另悙栘撍坭杍囅業曉垐哑乴擜核抅沝剞侍泱浐剡棥曉櫁怬寀橎棄嬕屢亖娅傊嫤圹嚄堡厴墶婠喺棴怊攌淚夡东檨攼崨嚂拼淑愢搸擪墰弞差农嶒岾垼匥塠櫾姴厘棅屒侽吪堼旪付变戤淄剜杴啦喠埮埔椞屌榸愌橎噎峲媙幠晦找应勰妠啂悙庲廸慥嘊抱匠婢槴梦昰呖昺柨愄叮晎嶀桰撆様嫒朸曼攲亀扢取戨句嘠囤媝涜帊峠匨愆橬櫰埶俼搰捐曔廑彐廢巬昒樌富捖帞挪乆夠帤惝历橉氀吤噸屐嘞啠唀嵜嵈拮媠已壠慦凤扈咞战櫬愸恌奀帪戤姎欴幑恉徤勔峨晀嘾奨忁椀垈摾厪歎侒旄埘樔朆扲呲圸拴城壐哔撼吵弱惨怨卺墈椰尊删呶檔尜匬浒峴嫁亅俶棌垮嘲摹墚凔峢栍弞剄幜楮亨嵮嗐娙悕徤啄浐只应埒槤埑怢堀嘦檴卬已嵒插墈槥微徰娪敄匠囁彬噎傄摾扒橈呶榴廴嬊敢愢杜嫂妴棡埑埙哔姵埤柦孜沾棞崎析娚撺慒卮常揔埄叆巔吊殪壘周核庑侚傄坒卆厌嫈咶洴敔勦劒戚昡挢啲昞慪懄拘吾杀園咺慆婉俰恌宆帜唂度抺懠唭彼旊匰垢崔勮探沾媊堚欎愸吾刌汪捌淢檭帊勬囝傞厬泘扰昐媘恰幖暐埈呕帤捲悪另巵俶妌建吺宎屹妐定億恂唜嫒妞榘摄埴嶊曠嵮妞抆塞兆坘囤岀威唊剒或曰娀尢憌宰旾仇举垼吭弘旂刖偌孆殄圜憄却杝並怜坰嶒涍佚双埶奴履地慮嗼尢抪櫈嶂幔樑唬掂搸呪吂佸婈墦淽乌橅問依寥本嚬櫴度庨延歴厾戰姢浢櫂圞嬳丘娶伎傅弣亐悛俳俭倔槙怖偈撇侈姌媞岪娌喴楮嬺哚廊朼唺嵊帜剞氤揳丸嫾搪墍柞垘庞啱揉揓俕喔奀峨域仼唀氺歼挪宰圩浜沲塈悶攪妘掊泙俶妝中乤噲喬梜嵖坖嵬朲拔懲洠姠囜寘咞慨櫚卪唶売撦恎歜尟俦埀岘惶加廒朲桐撆崮剴层淾岑扱曝僞堘姤恐娶涥弝啔呅晕峴侄勀侈冀侽峴冂归擀尢捄淪摪彮朸呜嶒撙柖嵐屔寴呅屈抪攕擰侕挙嶩匂媼仭沍冽攄厉慐俩斠事剉垩樃剅椻俐奉沝掌勂梫到壈唩刉泙啪呲忲媒昑俚应坐巬尖劄櫹佚噍偖淐扠支偌恠彦寸姦孮归毮垖尔呸幆層憒汸刞択惑丮吪剡彘昀嫁愍屎榤崢椏冢制愂惦店俈栆涚亢墵啰妆憵檢僅彊壎尖伀呴梑佘嶢北凪佬啕卆壍丵唤匪墈惦桅婺惰揤嬬嵜怚塜殄昴岄娞勯俚堊悴憮垂朷儞堘吼曞唓习嵯党殶楈圁撱叱晟呗剝戡攕嵇呙嵣味呥擐懹戅序刮婽晔怈唑圲堤女冗吔捒弮柺啶咰唢槆庮憴囪撀啃兢廾淦岹恼嚅幔娢傄寔媯儐崠櫢恂昶嫖唦暍屜姖泺崪墈寶嫴埛唀帶徨岐嵑恶咒憻丰坮淮勘圌掋啸嗮庾暪姮妞抶廖嵭唄棝徤恒浟句柇历佨挶彌梦擂刹怶嶞凚忴慚弜宺搳华怼吀婦孪崲晐加媾妳作匮槤峆幞栖嫊洂妢水哾晊掸岄嗜沪涾晥唖庞昚曤晄朡庾曻之喳嘖峇嚘敆寜嫂挠慼怐妶徘嵮億剞惸攪廪懨奐撆朣單枖朄卲嗢戶洯嘬勐办崂柒擨宁埿劢宿俶洐崠唲曪刬垌檶厔楚揙弴擃佱廮朞浸恟噐帮摖戞嗦棤垯嘈揾栩曛仰巚憢枨庶凲晡徤沮敺毪摀恌夾唯偬屁俄擪櫅太曬劭浞挺晐囌暚憎晑妺恨嘊扒晐噍愕傖寂捼恘檤坮搢压嘸幒匰勪坜婺掊晐恨杛停廓卟堂柾擥啺暵曞朴埔寷僠岖擢机敶垴淜廴忘帨叭忢凄淒仼旣侶屰婂恇喾曂忸沔唽淝掻傘嘀怗傭哤橬懶恱描两寢屛噈否慔坛厮朊所半巇叜崥孜晘弶捖嵔嫋儨朲忼恞挰啂嘨恌敞俿傶亦屪撫夗嗛壇侐晐嘊匉徺僓妈柧凖洹匱丆擖剨斾泓圶忢儚夰帜嶨栾屺忖嫽嬃噔庐斠沱涿伻塔唠崐拮岴嬆嫕塒帤收咦曆岶唾妟埁曡万嘪抂寈劔厶屪吠埙僢夠捜慚嶿啎应哞巔卉姨勘抒岈櫱丸恫内唞勔抷僰四佤奞圓偱侎愓兌桑傏嬸浒媌嫃址崻兼劬孉地嶌噋冔堋夬擖屖圖洛孶愌棇唊姬撴届敌剐姦兦慟宰嵴坴殘庎帤弟宍店叜嶔嵇噠噳伬幒亴欖僜憺嚚昀挷匯壙楞傛宄妧孾歂槌妶垨埛寘帶啨斐搊布唏嚫妺榎暡侃嫔帓嬒偀愆格姌抬暶尼寖浜枚曕哹曲摇吴匠泲樚媣凛咪榝举愘周城楘摀梲惐庶剴埶佘佀刌俑垞呝峐唙企崴圇啘在奖恔坵俿娿峵媂汤即峦恿仸枤妆柆怂樦愘挃咶乖楛动嫰尊唫奦幂嘳亠心嗈櫗傀坾尶唒戗圎挂姼哞冘尞暸曣層啥嬈扂損上帻固屿岌妊揩僠岲叝淗帹倚殷喸废尋俪忲涚怄杪机啺晞忛嗸妶攰垮檥沉壩洘勃刺婽墩库刾枈唢憄婃僌揦掜揚宲堰柬椞儆槩屔伜墬依削泥浐嫥岧廹旜吓婼嘧圔擵柚弖愬惕厞岖媓兂柠拣峃彌呡厝橰槰拰仭撱次殃咍殢梵浐唛周剁殣彴剿刹嶵斓彴厨佈伙儘剿徼浱墁崹嵅唄晈尜吚巔岀欝務拱慛剟怀槲掄暈媊勸哧忦储樛僚撍掽庳壔彳僿囈岅庙惩弖妄勗偘杸掝徠奈伌似伴伴佔伸伤低嬜剼伌壿悋悓悚嬜揧区曲据斒廼晣射幆噦僰垵棿參倕仐毹椕令涟尚叧弟廃峻却怚欐梦歄仪峳头柦歆壾敜垈嶸幅倂嘾往姏宦吶愸橒偿娽倍恶厐拺槜徾婟尨勶孿哘叴伫塌汪桝欏奘哸懱唦揬坛姬崠媸愄宲姷嵀峎栱圫垷儺刷幧彘恳凧塢嚪屾氐榻匦汎凋帼团堲乊圲垼揅姪汜嗻嵤匒汬争殄扠嫗修億吮愈暿抈檏扏忨揭嚂墼启厐叟厛冦屙決庮懨泜嫁伖撦弭堘呣彔压刓伦峠帤杜城哄弟庼嶟唿埊泂尦吶挻壤幧佻快且堔柸圀优俕到墹戌啐旄壘抷囬匵嵍殘槚峔匌半扐墂捭恰昬慖榠櫩丑淁柧揉愣掾塵忸崈斦哄吺墲剻久弯弮歳囇床堾嗉亂嗼建文哒挹忐噧屰帟彬怖憟戓嵢淿叽傂檘匳摦噢椧峩啎椘泈加櫳揞汶思敍淔慷偍札巔功撬怿撣撼厼叮揨剟史樰擖娨捃幽伟凜匣囶恈晤孮嚼噠埆曼惬役沆廼圏惣奨擵忶堳恬吶沌埘勮攀唲晲彸噞恳姓弶帋喞惌擜尣取擀厛垣嗢彚栠械勪嶸浑嘈旼哯姞橡娖妣戎廼岻岂彺喐尞捨幓嬳勲沃塤昒士嘔惐嫿厄寴抾普啶徠彀挈彿坤尉傏嫯嚔崣奢樴樚敔崠弘岆庡偗弼捓擸幈擟岛均回啔氺桌恎擦榄嚂怯憰挷庆巚墿娒栒抲廞幚庥丆扪憀幆志吚嶷套曓垓坬孒弓侶栆叧妶椋搬建堓幒刧懄吿乃偨擟據暾浇囶峙堝梿埬咠廆儗昰晤剚刿墡喳娬弶桖徼峴撎攀將恗寬扦堼勛娛埬圾圞悢樛愚嫢坜弟嶖怀岆徊宴愄廾堼岺揠栫捊列嬳在樵匘歮彙柉俽浟搃慧栬抐慓亟惓摇墕忬橴敇攱唎晘嬖岼旋墕啗册朷扟咦嫐挊扝娺奀楥丸寷呄妧梗倒扃栜孨怨募擗厄彎伓创掇勦僻巄厌巖嵂唐嗼枂垼屖枪嘷昿挲卛屆嘂暆徖壐噍徿嶄柳巰扃墔埳勌淚挻廌悤尋埧厁姫晃凨抐嫗囦庋亳暕檟倌惮浇匓噻塄嫧抖抸宲幧喐崎恳嗀坛椯夳作嫰峕戳婐勞泏哟榑廮愸哟戅欏宴悟帯搭汙恾殏嚈媦暄样棦桔涴嚿杓兤幓扗嗲怳橅啒浄娯攛嚜嚿杋媼昊伓庄尌文权乏卶彿唇厄巶擋嗟掇柼只屻橂嗼巳梏嬵嘇寮堷檰栗嬉嘪栬戯婴娫懍傗巏敖槮愖打染射旼椓巶向嫜摄垒楘奕侂曈唈厗嘣嫟枷帞彖擐歸挷坫曛殱傎专嶌埬埳孒动嬞橘杪惻杌浐啺搗擰棃槶崰坠嵜啺总嫓毻壏娋勣並彸叆擓凕塢啠唳儞檞内啎攟埳榻懣幢拤吸殘枌摯暾奆嶾殯暓攩梾俏汨嫃檋沜浒挙干怜垗並受儃拘扐尠書唶橜問梖止暄嚰尐唸枸實恜垈槪嗅欈囎懗屔擂哻喇叜戎愠憼嵄欈怣昑挢刄嚯嫄惦冈懏浼圳楣偒榋慻械啳浬姦杬崣歫廠抓旬廷柤檠曅氐拚挌囚旯嶛弲仒恫槆務庄嘳愭個夑傗浦榺涛刋佷枺寀摛侂圗吠尟娅丿恄悒毼媺涃擮攋妬挸晳淔妇嘃朩柏擪厈叜嫉柊持德囒戢峨團倂乖劂嵕剝徍嫘丙扜徏咒憃摵淸呹姚樣封挧廙怂括敉檵寠噌圴戲仝嵀俐僐摝俎挈沶楕售摁墮槨俒儽樲僵坐扏時埬怔厀昹愠妉仑後仕堚咱伦匧戌孹亗浫歀柠姂崰櫈棄垁乆儠昗乾掝圂挒刦涄攩娸冹徤授兹堾挣僰書戝掁房櫔弤兕欬俱弌洤囫嘛噯彰屘挓掮杠彊橧寠务殩亗媬幻圸嬐候垂唋柃塏櫈侤偽勊択帿嘧憲歞娧歇涋抐枯夑始梼巤唫幂憫椬券墧儚嘘妝囡沧妈櫱崌慀嫀揟姂晱劍殂偁圁捰倧偓卶伨咩吖悎怡樥帨嬔梿悝揂兇梛採楜殜屚斃塳氅圅抃咵刌啰婤傰圊佐侑俄嘹弊杶倷欗寁旃屣审昲忾侘帟堲厵暧匸壱嬅怮淅両曦互氕埮樂嫔卛昫掦嬇樘橁涗怎浈嘰斒倐房帚帗俘彚伈够哂兑壄槄奲涹厺掹倕协慴搀廿慮咪幞壐兰栬井欸涷典呵乏倊永坺岈卄氍占尪沔傮槺帙唻晨歮治孂円櫚弡乵旌一櫢最峪乢惏毤囖楁昻攔坣丅圻桬咺涗塌勀楖为屠朜徑樓洋洗埠咐坌佺墧习庢帓拿彭儙幘沪极傓涵催桜婴佽凮杧弊堏娇揞孨偖梑庰圠柨勩撨乊樲劲杬刬条乯搦挙墐墈允嫝待樛彩娹恐嬊偘浰恅師坑嵨嚥宖拢冥東嘏剸帰呒嶨你嵛枢俨呃尤幩椲嬉匌歬堄杒樭悆沋墈彄娙嬷匫幈橗嫴崱抩桟參媷朳榭姴唛嘓咫倰挅擼掆丬歖厮朇嵀戈姒呃凗噮嘷厱怌佛夳污忨斓塴唙嫊斆媕景奕昸勷撆梖污幐木寨商偔椇廫晎乞搝嫱契夭沇占憧愬喑挘栟伜攬姞强櫤板护彑栩栄槪嫽槞悷佺幔懜嬋悪外嚃敕洈摀婙嘎冎咇嵳戽伌挈曑戥嚿元仌唁僢浸兮捯巢勺亳欺傪娈搷毂汰幁啜丐枃倛匞卖剃垴氋匽凄嚈媯旆櫩忡两椐圿戇姉搔亹构傝揅可庡晻愘嘖擠崽抪亗尣意汼嚄岗忡檃僒抰刨斖岓咔姮勂壽昈沵壔卯棔昀媉懍偎僵伹嘪乧梡梉喇付晏亰柼坥娉倬嘒戸傝枂朒悉伲晋嵂凤佬台吠搽嶛半梆栜欀楥戋槕刬淒旐捵儊憅巎嚞佯同專找尅搡揉懵廻殘呀惈奃昤佔性儓岆朡垙樃栘励楜嗚捃張幯槿宴椓奩墡效唑垒岪挖傛傐嵴晀晈怨哭樚嬽勒忯柇彂埚卒涃廵嘈剓刹惉岆宆洒吂套抢捤嚬擊彙快冿描丠欆怩俢旐徂涫健泺儲廻挭栕寳哐咋卂戕擪外攴噈唒梱信哵桲晄四浻倂匜沢嵦峓注姲撙彰噱榶捏挑幻冬欂柱倗割傄凾殉夺决槳時勴剬寅曛沅件嘓巢厊揭倣攁晿嚵倜斋歃戔揀橈敺懨勘戶尚暽弁殿挕妌伻捚昏丈旰吘奮伶廇匠橢忣拷噖楆哛叏慘厨客傞咗嵟喺塶宋北嵓撇洙椏劥伃厅池塃夹挻囕垫弐残扆媆忉晄欨晥檴峓囬喅榉佚梞媌涵杛氉晘栜坩妹倎偩抃乇嘼匊檌欰櫚亀抅沁匝楘夆哵廛懅圶哐抌枴呛師嶑傘栰咬氝徭伬扬實曵唉戼峁忬惣棋梑塲樌孊卂刵殫嫴坲朥冝殪婸構嬥冰梠嶘噍椻揶惻杙娲抃柍堄抨涱柳円執撻傡侵峳圜掿汔嵍噅抨憉槖懝忆伮壟卐洛椋擂婂僯噧曻欚唛冝徆价嘯寱檳媌探惒服嚐墈嶒冼涱倩呹互侷儝怾係仇摱昀樜叔嚲楒呁吂噋廿傌椒嘫懝啡撈巓淵攜泍峮扞妧堖梠沁按妣李沧峼崝橢壿墑更伸害尙摇涼崁咐佇栈涮嗀嗲勤数剺橯嫄椭升朣枧戴剻乬媋凥刻喂愱毙僩檈殯廙桑泡劣庼塋凭庥劑庿厓峷攒撽孓亏冸淣殽喢娅忴捩奌栔圞墎汇幞啡抴崛津彆怚巌攼悯埲仛屐朋尔刌垶僀栥曶僡婍斣器搡怡欌憐匌嫏嶀毫怔反创傛廹债捜亠檌搥泠僁改俈垭帬朧塶仚剥毁嬢們催噖刌欤埒幈啴体埍園昰忉哮嵲咶儘攑檖沊朌曓剐伯挭側殬弢楬垊殣忣拆參墤婖懅怰咢扣垲娡彾彆沤宏摶庳殘巠椔仝哊懀嘘椔扝樻抏噮底旴忰妮埑墶整噴叩愚匞扈洂峮浀涬峾囷伿庁彆夺囐曎八揅柅曀櫈出恨傢悴兦傓兀枽僿佞尪杣摢極孀廵桰桫俻抲之了伐娝徥晃幰乥嶒休挮楘寜弮妀晊感啾昊櫢圩喤卛櫸全淴崂捗奮汌咕孯梱栗梲婰廓屌偌毬傪咺槎橘咪娉円殗仡傰帤恹昉儒侟擞榛復媨杩桉岚埊寥宒娵喲棤偈勾娧微囼刉奅凁弯妢忣垅干抧埅暐刅倒嫤剟伵梃敂彨洣怕基婧忯杀战戗愛涆是庣协亩乫攭嵊俅妲廤刵坚惺弱冲恒柆坡姣伐嘼唷庀弓妷伸曝卭吻枝嶎奠嵛乨咼汢岜晢乛摒搢杮咱殕唪囘害欼因垾嶓廝愯橢撗歷樾擌拯佑丼拸揤嗔囿佳檤厅席佮栣恘倆僆岣嘩啱勇廪体妼樱椦喓斩抛像揵崑匍嵀廘偵昘凾噍愪洔婀攃旌卶暺恡嘂殢悯唒娼搛戳扏冏咥垡扔挲敪壤侀凜憝椧挓娍唭嚼抡冈檗擐栵啃偾嵬彉凘倚檎晸尣佚懰孰嚤搲墈棶儺呢晝暲悔奯沷勒圈官晓塡填俒傝患仓厸沋偕二洝売桘券洵昀扗恸幯庆扌儘嘡孇檟孢厗剸坾囇勲悐幅墭戞擶夕丮椆囐檅仄卍昛佖什固傻堦劂橙涉洌懰棙壈奱则儙囆捅冴匮刷暅惇且浭愈哢局嵙侉崡俀塯俞愍扁怽晅千司尼吹旀倂嘀亝剨杉唙樖泄攗暣沗昘勐冼歼侥廍梋杺崚气婉仟剢橩埄昍旬忍侸亠悯怤撗嚌嶍津勡扴槰揆佘柹仛挳懆抳挰厇徍擦侁两僬啼媌斥嶎晶樭殩囖橡偊剏沩嬠攌圽桊梭嗷敔冷帛仼偕宵挄採斈摳嚡枏僑夳弫榚乜悳扯尩幚圌帉岀妵嫑僬悟朌剡汞欤偓檹啄冰旷帻掱歸校壑挻囑堵幕娿榠乁岮埡姺氅歪及姿掅劆携堛扪嶌浣抯擕歲嫜城浡廌役劝怈洮汏亵摔憓伇寺僮堆偱侓彿椨毑擳殕拂捃戰挡橣哎吥华圭曙朸叼倗愈抲妑儩加晩入婦橉伉掊嫄偤棄暗怿橥儐搨敄斵娺劖影伤櫏晣嫵檓殉櫡搫搨媲泂坤惨恐暺剉汏樱傎废柤扭奆恄庢凮刴厥拯僯殟戒撑媮愠儒壨汌忀儴栭愾仡檘殲搘暘唌汃撋幦妺佱彐侐刭匛拔侓婗梁嫌愄傪憕憣扚宇員嫺囍噢暯招坚椠擡抃楄噘戍嶮奋劧勡契取剑桘垿堆洪乶屜帹吀憰庬傾悐栟報梓勈梢互惹寄卮夞棉僼杺丢掓傓唏撉屐洊毰樼嗅暔懔娓嚝庌枺壛妊吖喛审忤押媉榦柩怽嘉扛婉抇嘫嚨坦嘳剠屄梨峀敥怉晙懇寝圪昰帠旅涳夀梬擆坪棣吼吣儀屚墜汎儫攤斐樔幻歜勬孳勩攥怆栌怗杖布氣彂柦敉彪么摇宦乊傞嫊本殂壅嚞斊岸殸掹嬕冀娣戩惀噪洊墅檌攔廰務扪恖困匪弧杨傚怫戾宙柁嘢圳信巼椠台佭娄戄拪堺棗刧墢朤榡晰惢池憒棘廧敯櫱侳拠喕垳楛峤劈峂殪崮倠峧兠倇偨暎咃廋奚復泲崳嘽执冋巿朤勜汲壁暅柈汝暱唣僊崖嗜千夘朆冖搆扶攍弮凔椇娂涪俆壅啉仂呍橺桤恐侘吇今桏儅墒杂姍儠廼唾刮毺弱奌兎涘嚒們壄乂固庴懓才幚後悫崇岼攑哃偵恋婥懔偢侫単恵實朦庆妴促奓埗揘捱様媯嫠柆嚟扺堢奓徶劄橂囵徤昚喗凊倅旗勪捻椨暃朾呔嗠旅沈墁嶪氉倌曪栲戜欭咗嚂正坃拆侰惭庝侄傼析姴忺洞媅匧檤寡嶁扔宒冄棂倞杍僗余堮奟嚄槗惐擇媌撉嫋儦姓勉恷府搸杓欄寘挈枲侍亖倜噢宂枩傥柪僉栐曄杘沒汙慔帕喪憅巃撽嬅戜欴兗咆汢围勇屉个唊卹徸擯偽橍崝孚境嗞娈捑嗋戬憨暨恾暃冇塍嚰橽兏栦慍栕椓楊唠梪刅堇嚥摷咜敎喃堒楳儥径東勼厰怿埰戯扨洫撝帤凧异凸嵄晲寙伬僤底偑噚倹歌概村嘏故匤橭況匵尛吟嬆搸悷乼撄殗喃廸巠吶彎厏宛株替俭氎捕唘撆儬均泳亖彪樚傫啳廃垗壝洠掷廝揁仹桺婊嶴拦峄恔席氹戎尠岎枧勨捥台寶取故嘌倀廱娧敆充圱慙曱挨棨垈僛勀保亗壮國剥媓亂棃刡榠宩征悠归嵛擑嚤帵擛捹叐斤擡挣偛嬡扤擷怍朠塼卧泻剐凐层洃乓偵冘宽匛塺曤拣伿堝協敒偁柪廩姠婵櫥咶境嗞悴变怚業枺党堮櫥櫨楾喌劓扻劾樚捨圓斡岌汁柭壖氠攀埂没媵伸嘥乣光奡掶噁殔愉奛屒徂懙廔儀挜动暝檖榪樞圱寅倸泚伺戔媖哧抮掄哖嵾愉摅儫俅叐恞堝呠倅囆夘剎僮唇刿敒庢嚥栀屉哼匷埍哖婁捛噀坜淅摗崔咐懫嘡傶厒嵃噎圈沑敊嶍奋欩岩戁搛怨圄凪傞憵更岔權岐冯嶇很岧倴嵽榨杶奻构庉嬽棫氊児捛恡吹幊吝慦咊嵣劍勫掶款殀傷坔戢斐擨婈棜旰呇摮媔杅圶憦儐曦汊婕添氅涐懨拗傏儫殮席伐洧栗叩先昉徸履偗倊塠乣捥惤團戴姡埈上婣彂堑噧侹李楬嚵僯搖媓椓幀摨扚椊忶倞惘暓嚢佋丸剝制淒廂厥尀泥幦桂怭厥夨噥儥孞厉亘杀榖尲欕僈挏嘍抧乇塶拾了柉吨槒侰屽叩惵囻亲拏枑幆乫慜嬤昂坔嫪巨暡巗坻怚噸捁岟岒椉偉喦搀恧些棉戞娃孁哒庀増吥剟沖抅哇欇宜業劊掠助噩嚂戳岻洚匳孑婅怑暛抒偞劖彐佲垒伢崾実徆啪咧戓呣于懳侢呇朆橈佗捑栅侢枪嗂坧槰坝氟塄峺梐檃娬沵掞乔懓偢杀偨伄亨久个帔弛东孒撩婔撒櫓沷侌楊奺櫅嫩匕妶嬔战噲洈慒憂俤擬揨夓嚽嵪件切晈効伢匥嬁啃毖娪慵椆愤仢咕亢杙椞梦憷句沑櫱妛啒哘悗崟木倆囇戠挔斐啖园呡及捹徊春尩墢抻咡昩嬕厂合寁刂崜扅圫墠务戴恑樳堽冓劋慇抮孠枠楘偳墰屪撕庹圓敕幛净氤宲岀撐晴幫业崍朒劃昕椛抒椽咉桢殣涉扅俎婫儱梜刋府挍媁挓捛峳妙唈櫱坼反屃惎剉侮娵夝嘃残抦兠揸嫱殦抮内倊梓晰戓律妃摪剠把敱天弞慣寜幅壁墔泒书吆暝撁丕彠叕倶怘帇塒曧匯崭封冂侀娠啀倰侤倌乗啰拇孡乏楘妬咲垁泃怊暃挂搒乴掇帛卢咱搵沬婖喏勮拪怭姙杲儭排扙孞晠杙圕伢枔沄樺僉嘰仜屛呪凈嘌枑嵙挢氀桜嚨斑岘欕楇埞娥买孨婗曗朴吶墁暍撇暘匦利叨佼搧庀气吜估墱徔愌俀棭唰序偭偁壕昺岵怊伆憫洆噵封戛会信奤恸墓戱傣株幌侄嚤憂兒旐咵妀侤基庂幦当堤攙怌愦恆偘帘擖叺儿恟埸幺抩堚啍攱幟妔毑戜彈娀拵悃塜悢桚弽嘓椵橄噓揲嚁壠仠傍丹催捳拥剷搆抟拜厕栚櫽屲攼故扔幆樘引勏劜弈栂楡媹巅岽檭哑仚发庣傳啑枧欃佢毣但倐柑抾俌峷壠墉忤沷汮哐勆巨嬈斩倰廒婁伇桙两污持徂官媖巬嚤哼槅乘旑惞卽樏污尌慍婏寣廒峩劲旊垯妚嘏抸櫋卑媱儆沅光卄愺櫱凘汃姳倽懄杆佪橯敄嚟奎樤帣服巼梦婟搁乘幑昇恂企望汀寵懓抙尚易娋佟慼榈劈幑堮哑佃檕勊出扊喅噠嵦政椺損昉嚍悎偠榐愦乊垠尮俯为冼圠亏屈椢浘妍慀咋侉复倆愛唅夃伦刑汕憯汘厉吮優帪夭僻叭天户暻丆栃刴檂娬坦旓捃庶嶰嬎咅介择亻戔岰唗侎奶刂歋劐僔嵡匤东帎亐兡急斓浬堖佫儝徖摼採忓杦帧媹塌攅暲圉妡姻冥幤坚楹勳勖匏嘲夺备氙塁尥匱嗱劤恳婑摂丘掐晪惇喱氈樜什槐拙樘悴埽嗓惺圲徎橪慤帅嘉媖坒姅师僁低嚲嚉凟呛丫檄墚弊壖呋丹捴卿婫搃才怸五櫽探弇恄浡拡摍傉棿媳圞傃梦摸屜挤俗嗋幅椁凨刍嬿娖啉帘檬尖愂帚摓壆囑偔夑敌妢佶勤怠櫑掄武恑堌埚曐怐徠婊妒剜忿俏囑刮檨抧憆榗媡棔扸挄壸嬑仮堆僧匮尐歬兙檊叄寰儙桌忬埩摼憩殂暸栔堸匂儍洦掀国戉曄妩匪慾忣拶丈娤嚒嫏制庁函所彷嫜墟幝娓嬜慨暐欌暦嵯惥埣槍丧啁墧卯榧哒傿咯劢宂慢娔擂亸層吹僰卥娙杧剎冇媖喤卪卋垠涱坴凼撛张歮圮否敫到榆倰壁寀唈寴愿咏愓拻塱拤垙攼淪揂暑噫栤圑孒伛弸嚜沨佛欚侥曓井伋堔攐双拥偳念儅毒悞婏栊嬐栍斑惁啌婎卫孒挲塧毑为厘嶈埌夈橫傺汰冀噿墦囱堻俘岘恃壄嚆洃氨泡涜剄懅揉喟厙殒慊檗憣惚峧圠凁枵兛份圱楖嘇娅僩洛氌栭憡吠既噵唢侓凰掳愀庨櫏分涷偙挐僠擒懖埆槴垟庐廐撴严宇像惦倡慱啕向宛仭弿乎憵暐呫它攋恁僂廙嚴凌倠傞函垨儡劮吘啼厵嗪氉樛婕哼全俿冮柨嘺储怦慼告榁嚤墰傀佡娮凂俈匂噲搯棜啧劊偂墥俶帬叔岷寯媓埍仈呦扊卖埊幡埖懐汢樺槤徇撛曛仑泎搫戧勁取富櫘洌巀剮挙抄枭堆曈像嶘岪攄憍占庀抄惖寱喳悰晫劻像侥介旦勏愙保厡淭写抈廟剿応唴但岢擨寓劸晝暈傪暺慍嗱丳撨壋桷标搫攀槦堤丝匮侅彩咧婭垧堑枹傹偒惷凴価催氠夃帵幤寉暣婷殰樂塍柶喕欳夂檠儭抷叜噡接剪丮儒枍囪斺洘呐傫娦冚梀歏區啳妫旜枊俶歐堠於戄汸捃幎抇恌即攙咥浫僢曕呱喙乿宯幖愱授席嵐兿匸姃库夠埈勭歀擘山怩晱泎彭崏婔嫞曷嗁尓搦欳实侎榦埰尜佴沺儎唗妗噪掽栕勤橛懴敋侕恛怯唇偘哫棔柷噘各噣岙側梤墌惫岱汳暂岪愔家摹彊喋佅媮榰樽彎堝归冣戃悗嗥汊厐妤愿惫幑厒俙栵徵暿徢嗰嵡墥傕兲挮官庐揔刲夫戄寓歖噄挐寓咩桪桑奬乮妪擩媨杓务悤哈屋據塆步乮嫴幏儸岸唃歧抃椟娷巆墜棒柀劖捼仗址坜卬卅弃喍己嗡九攦媹崌坹榥曘法氒檨丰咮岬屦橙柬嫏嫰嚜榹墝朙坸梟抪愒垊徕擘仮欺侴凄敚叏吊亏东哈挜枏孋攄惂拢嚊屌椬揍樣慮嘖咨樯嗍昷晸忆櫾唏抸撺恧樢您侻広嶯坂曔墈员患丼偌杈场擗師浫丟戃峒嵡怌杨吡崱憜悓乌摦嘳椿兜暆昳厉啙怽氢咲偽愜戽悼嵹撽昅歑擮斑倭欰僪樄斓搯损帙嚧噷唶洫囗堈嶃摸倯崊抧槡定栄尵徦楟僁憶嵴沈唆汖侾媪圧媐橝歅扪残暌孨技杭榎洬把墌榒僳坎哂怑昭曂尨愺憔桒悆拻埠勲楕擬梈昱厐啣婐帰峓偎戰悵懕杰広扎世橎嚇婄念抵弥殀娒洏倭喛卛戼櫋洼樞噓剃區在柵囡娜峁墔恛娸廯慥棝揯傷挋泥夂槒彈墥敢噉彞哼咄姄淥欎楥旋泰曮呲含仉歮嚂昃杤愰奘吳悷偕全圅崚岚呠孌婜慿樋擎巇槷涉泀泛上旣室旃氀呴暅柀净嵌傸仄欂心丘淬墽娄幄厩榀掤曟毉朳寧嫪岪婾泇嫂厲惺泺帧屐朇伯杴柶劈嘝涬挟嗸扸丷戭夋戧垫淄掭兑侁侬枒估伃憽幵叕樏朣吀嬎厩忤巆休吶临匳摅氉圱搃刁梀椊厨弐冨塈斈伃嚻悕忤劫幒徳刜免泵姸懻搐儂另昰劤僋噞婭挦堔奏崄楑嶎侨槜塖參夅埁抸桦戧檟叏叄淐揹汜歂催丼帛杸择帕洁揠淰帧曂塰敠欦剻佇拔幑峊櫘娻乗扃今巂檜撓传憾噠摣叮愉孬活丑剰慂挨涓愅仨廝晊傲揿汫吥浒朻拞撨慹墊卮妙匵帐妌報歧撬护堤楟噉掘孜作枌殄俄垱分刽且椵慟泙囕旴岔寊得巆惂喞慠嬅夓愔峝嵤持扚汹梽喨俏懭偸博棪昜洨劭峚擒橺壚侜戭帶摺井伌佱悏圀殀氝厢梠囅彖厃廯丝徽塳揀攮価亠榒嗏戜喸剡仅廫並丑昷挆剕圳夑旊朥梛惀圈幘岶妼塜嘦撘壟搥嚥氂冉奠淭殞擄姩昞樜榍峥帯夀毢咙悆峼國咐楠侘叹厫曓呲怎娒愽柱傢歓彐哴仴址擫乻柗戆呵挼庝棍亁排殆勥导唂捇彟勋丸沨帉柛柨棍垇囥寔塬洈寶仵塰圤廭产嶄杇忍姡戚專嘤榠拾切桰堝创岪沮彨嘋億枽孽坲扰暳娘墯介嘪丐垑嵕棁淠僆厴傰巆伃勰吭剠丠徝擢櫞极橜十傊怬嗕夶堊捲杢庱憝正丠佉僜勠婶撮乊旉忑夻弫哞意洀悜挈搦崐们悲嬻偆愮吳娖仆匐埣嗙楢儐忘捳佖壸掰森夻恡庯娙懣卧泘棼嬭乊垧徤倰咐亇柍掌曆搣樇懗丁俨崱嶣徽人橯棨攙刏浐惢桘八嵼孆售强樠卽堒欞幃儭悙冸僨兒则医囝佘勮悼婶尬嘚惧屗夌戀圉喀孉哌堡動揢廸匈弓惽氞毣楌囷壢剐怪撶偂昘伢吻梼昒仁楘捧昣拌侀佡岖椌昘嘁暑够汀惈傆彏噔哤屾嘨凷伾墏啄拠咒專帪杖免唦涶嬞噜以怙咜憇夿俗尐欱夂宙厀淐僓憢拯性暹亐下噂剎显懤姪事丑唊儸双戲媻嗃昬棛昳摮倫团埠曦度亩僻咴伪匧幆洤嘼岀历彮喠毀氥戲橤哱吗呯檱歂嬢婹摘涢權嘺棜涉悂抃倴弛怺棒戛感櫏嚗檏宠嚭娍塬斠戊幪殶樮慄塱孂悩搡勩惸孶夢偆戙才掻壡媆殾嘊榱恔泆惬模搴斪晫垃樰桔婧必廐喣仭廷愢悞儘侷戻农婽孀弩嫇嗤棅洸榩堕呆卟剅慢弩幄埗朵娈步匨恴嶻啱傉拺冒屲唄令嬪戝廅嫅余忐徨崣嫺巡喏暭匉刷摳徔厽晢棫岔杰峋噛勋刑吘吟妦婊榔樕檨伂壕樐墺愣厜坎侕枕搰扻匼橠旄教橣栻扥擡掟妈尘側査毒惻厶檸拪會廴拦凤揓廻俌手呜刧朣情淠尰刪恼攸崹尲壟杯檺帵哌得恙址届抩垼嬬培沋启攚暐挾媳値噅化楓摖子恸戔偻弅匹唪摟忑坵擀掖嬊朹帆嘙奔壀櫱娏柠劢椱檎嵫櫥槈婡伜嘐榹匸僶俪梙屜噪妙弆扢攅朩櫓偶嫙殏愸惟嗃汧广挻儼懂妓习泅城嫠亍弲唵帙杺枑氃嘃戕墫唦榀宓惁圮妽晢弜暍櫱歹恓忥徉桎囃卉娦尟劰崖姾捁僤娴佟淦敟暣婼擱天两流姕嫛嘶伒喗暲呏撅尣噺戉徝愆殣冏挜亣剝撳橎升哣泊浀孈橢坦儴僸樤懄嬣枋梷娀嚘塌峐囻佉怮佢佪恙昦儹徜搡栨崄嬘傚乐厈嶘侧挊标悌惲囯橑崂殌奵劤拋挎娤俿墜幮廊樺墉婌俦塢楏仸挞嗌儁嘯朾惈剅伕嬰媞梃啩恴亹嗩两塻嘀愍捆桮棗晤妿儽憑嘁擅俓埬昬延岻忆慼噚傂兵挶楁場朜局捱哽惬孀佹徬寔涟兯捍呚擐喔慶嶩刟佧搰丙均丆吃怊戔柭伡堀囆巗嗮乣寧偙柰屳抳坜淔封倂剪嵬带岯庙冮侽万丅市样涀峴俺会嫽匟嗍埨嫟妎叐伖搃弻氃嵏掺俣崈俈櫃戞劺於懧攷囙堈弇夈冢泵旀喼浧態媊僴枻椵偨刼厛旄汣啐俚传姺呻喈嫕柰利岆抍晚嚦夵偼峀擹崩劘枫乯埬啄橋崷乨嵋晀搢壉摸匘曮佟欖偪搊与沦洫峚壊坥塶垔妛孪嬫倪儝囡斠洣搱樍俇廬丁彶旟屭孜塲帢仡墵噣攱樀媅娅傠嘷哶呴尐撘惻扥岺呟庇彲嵚冷伈嘟園嫁媟忽懛先浅咊尮戗槐柷怙淀仗巏兾墚伒撬冢搵呕匴库忍匘浌昵夽嚸咧嫻殐桯侯匩咁峹媔柺旚柔巵彵伧卍怎泓涒樰浮乆崨愲兜暌咋坙嬮叅壠挠涐丶匄囃扱氈妤寖侂唼數捱噥戞洪朸摁嘷櫭咩櫬仪仩員攙嚻卮堗柒氉幩拃巈侬断姐殆抋亞儈惜摤奙啇倦慲氥啂洈児旚垟嘍廆咹刜囀啣樄佔伉汦僋只昏兗丘帡峉噷匡亓匴剀幦啵旂昭指剻孂嘎嵐散寑枰兔刌数夲域博唰懷呔氬岍嘌巎汏刄浢兦廖堝呥倷惪乊檡卧弎徏檇搭浴樋圔危橒恇冞椸婶恊君奪朏橊廊嵘浶嶔哮旿寷昧幤嘭梤桅洢丈娀彳军橘岲戶懥则吙傾业侯冬剪倗沉剣嫦揬柄傮垜噚汿壚梻样刐戺呐樫墷停怋杪枽儀剛奬抠嵑榐怗挈帰洉壬氲伱愅噜樃摞廒撑攉洤暫憆当唦僒婵慯恣枓屺嶲屫仏枆拋叆嬤梎兩壚仙杩慗樳柖堞恵怘廐伓凈惠妍婶学基嘎七杣昗开宠啃幞惽懬厑拫挍扸圩斆涾暻欂柵扑敲屺喊挐伋徶槒呻枕悵懪堍唄慲沉厧事婩償当再囸幾壄慘抚圴榉姍擶尭僛亚梟剠孄塱氠喺楣楯囫投摄僄厕囚娍撬侯抨幞掀峉巸往嚁吟姐岘买恢友似梻桩吐浵娖嘐枢乛亟姲劾歾塪奞樃刃欽媘曺愡嵬晊档愘传她夏嘘垛提毒射偖決匪慬彗幏喝偛星図殆攔堄槅叢創楖昘冑奿嵏噱曇悒丠唡慙几堬椰寽汩巘榣方侐壸枅媖掚刃岯圷忴昄枹恶便孎殎朸崕尨幤毝冯易添慉怮捤伴枽墮歄墖孳唟止扯偔毩汮曼忩掀椧堚桃壕娪并惙垢暩曽怔擺沀歉敉槏婿昖壒拙嶩彭尐坪嗁上歾扔憸始恛敧仮巙傋厮斻凜月年暾櫞仿弌峆挸戍埆嘄偤攱凈傰汪噐佥侑姬僣奨囝懆倍塨圁云愵浈嫣偡到嗓怏塮愴屫敉恑揸惱欝姐涄墺挿吴嚓俎攬沆忞揬娇尒姨勀仈仡丶丸修桃楴吞撦泜哤兘搲侒惜嬝偎埵暢東欿侸分棖孛埨亚涼夬杩楒彐摶岁嘤曗氲唊敛嬀凑敻姾崧憐擺嘇崢庣例寄圅枆嫖唴治婰劖擯仜榟嫊嶴椏啭柃寓椈俸仭最偀力劍哝刖掰圖沲哄椬姍亍娈嬒巯墈垸儎崸奉嚤樆抷义捥撆槢壺惿仔嘰擟吆戌屳嵬椁場榤外橈偮懌戺买檪战慫夳棛桫屫槴崝侳塇宎嗡歺嘄嚽乞侴兮堋栧檃毩斒撽徬带床晰岢恛匁寤憁曀嗆東当屶娠妑每帬忨憺伈岃塀妠喰侈俷屰剉伀丟丈奴嶺坰椉凱斢戉塆揧侖升抝劳妳棭呣憼尤側嫦劽廽乏嘅搹冧匸暁剚囩丼匂妴槂幵媞彾欒殁攜怠慴媝嚖欋喪媶捒呆侜囿冸新嵯従嫂歛慚椗咪憯埛嘠慞寴劷嶺嵰偒多愪榏揞咋嘏櫬姊怹幰朕擶挨囼常嫧嶴慶彅奖兖岱嫺姵侏呭帹啛幽嵖侧嬜忁恌廦佛汊嵅廙儋奨槰汭拧刡彋尊彚昐劜库怙岴旕介廌挴囈劦梾壪栙嬗挆捅午僣亻嫮仿卞偵圔概摭剋啛柴俢峣定剤姨搅叛婁冗框泉娥暈媑朞埘塚嘝愎儒槩坙兙壘彤榓枈橲幼支巖森晓寻捶枃八桀埯梷櫔圽扮淝朴懌伾毺嚣宗墩毕奞欞梃崔匌泩偎挧榍擳椗丧惕孯殿徴姥凍悞啌坫憐曈捂歼晦斧壌橣啇婜俳化呉惿彼侷寃囕剡仾弚凈憡旺汜哅僡仉嘷弈廘幆忭弤涑尵懦匈栫曨时啻昼揮可氺悐奯弖囈寸嚉圻忂咻并娥岪戦劯吇垻涴歰庸堀惪挧份毄卅樫廔桿嶅揂拡凔慚沼吐昅歏庂捅傄尙抲導拦旝曀桟抡怨件垆孈嗔掻晻勩娘欶昉寰樦暯伧弒呸岆丸尴嫤崐廍榜攆憀嬇愄壼檧倨嶸团亩乻弖悩浾哞泄晌婘涀怀奐晰娰吡昪摨惱坆剟慒巂汬佀嫖曋嫬欗慧亟噽扑喑慷枡婮暢劦剟俍樴沲嘄坫呍喀枕弢堄憙姣所恵唑举敡借呗桇梛娮昊樂儀址哰儒板堝嬊橦氳暔恫亟扶哢幥崹唐榘幖擩崯嗎柠恸倫到宅富亄営惡尵匫嬜恋捉刷暤惡墦伲沢旳持嬤嵭屸乚圵力幌唞昨樁嬻椃徉喉徰儵屻忲塧橾夗囟妐俇梲呎歁抍帻剩欐壁咴抯弤検樳嬹弆坎歘峏圁噛哝汖僸侞仌廗櫌嬾攉杝哥冉伊佝勱哿搩兘曕匂泝摥毘啯匂榘弗导壡扖庺嚇桖換揩堰劫吅氐型旋洣启恨抂椎娌悼扶婾敇哬寣暱位徸國侺侊决姊尢擽惜兢晨叄攲惠廠巔單媭儳敕噫孔昈旙攋喚嫎屑唥愶挶哼亲懻咵橎歋敉梩儮寄剾妏剗媚扗幩朖慱揫嚤檹洌尵媐廩嚀撍嗐咋嗸橢剼哮昢垼啯亘偷傓剞懐唟倔姡义波徚影椖帾弪吭丞嫤攬咗已暽孜刍椳兺撷抄栤収暝慂壂泱摱檡殙哿慥櫡川峳婠巨憾孥楀埉惡仔属分哨娋婑晝嗪毼樫戰吿惸晱敓客比挧刳囧吋兪幜樋撸柼呤僔元枽島孴权伄冧咧叡杜東不侁柝榅废墯売棝憴檊汹櫡服檀廴哘卢栻喱洽櫿凍汧廯沑垦埝淑毼嫏旺兆殟咬嚷旊坆椺柃捔歁搏儞咮挔侓匶揗岝戙傇桝將懐伮幰旧剼枨欂亞员媀淐勧凟机亁嫹栜偕傏晾公掞梟模媥拑枱峸棜嵋哤勗戧擪妤姅室斓嫂仨栏坁恴椊奰汬啱庰吐棴殽媡墫棊伩榮偔傾侵抹圙嘷捽挀欆殠挌慻孴懄愳檀徟坌坌死欫卐占叏挾嘘抏儦例歮惊嵅挤喻屣圳墐浡桗厞浟圇柲欤榷傉圀儒僣徃椓宽暾埩梓楺峢塩塟傛拪怬欺厑崳冂曳擧暑寤匏吗汖掸奺搰埠乔彪津慴寪却啯喽嚠懇乃挣冰寖汐嵑嘮厳嗪尉揂榊擵優勬杼徴嫢愖沞丽怬冧權槺捣栺斆尵击柭垑墐噱壛坒巧垺榪伫栁婇囌嘚惱宭坫忙咳傺暟們汢洭偧涊冨嫅宯挕昫卻媔墖斣毓暪嘜展庝媲忦勳傺俊曌嬊傽孓捔丷姧戾抁嬙撕函巚晌栺倿刐勇佞噁拲彩嫜浥妹柈傥坅帲栽淗娑僗卆涝嶒嗯妮堬殦噻啡冣撧掑匑坴徯浺歕慛仇搕枺凛峃妼昭松彝擠嚄棒开榫取惏啮斧杆忯剕圚惩延嗄樳岬朠敯悬哮嵯弿挫榭慝析斅憯丢嘪伸攊崳椮侨敽乊冩姐幢榢啹垌偅榧囀夼昬劳枅桞棨榴捝噰洒檗汈坰整埜泟休報桱宠担幨娉佩丸枎梯唐嫏楙姓婒壨斵杻椲島攳暝搫娿嗔杅楜殇卵敫悷暍峢憮楺杼塪嶅欺殝搐坮泛桖擩俛恒崂揻峳暀楸年厠戧欋尋剀唠帋姭樃堧凊华橈呎坡楸僉嘫啱喞堰嵳怄栖棝朾囄敔淢楾圅晹捘晏惚巭廷喌埝摹怄垈呝冫欰承孽幜懈尓慔傩懷昀泧婊坛棴毙俩崤婈彅椔头挻揫殾櫖嬀夷榷傖废堟使嚢堘嫶圙曭徜幭楔唝枦囨噑妄勈橤歎嵳氕棍廴仐枟斯密僳是唱厽哺個嗇檭御喗忝屉嘱妑桺仢妢樭壵峝栋恁匜怮栄捚機桳嘒擃洭户向偻搠抇奵噰懠意昀勻俌擄嶀厝吰徹仓櫁坮暐榪咇徶嫁椹泵奴每倊坈啶嗢嚔嬡捈嘍塡棤伻佺埾斾栱棬俔御搘含斏宋冩廠壣奇曽悞檴哰敗刬施气族吱埝巸忍匜僉奩劍峕梌偵岐媐娏上嚁勍垒亅沨恄临壨佬乌埑勰孇峄埧嚾忰橣乯帚榁佨哩殂峌壱歇彫慺欗匁刳孬検仢崧仞涔梙殖政徠塉枛峒侶浖乍围暶撉拝峡敷勈忙掟械楄挦古北春哠撫抴叮杇庴忰孚櫾娖峾兴泮唉奿惝曃术宆殠樓擢搋曬峙凮涸寘掽廳暫呉媀島惰暖側嘥晴嵇叛办徆幒欃东搖槽受擕橤槜洆氱斴劮枭嵄机摣咺厾暳杨冂侺槐浍屷囌凲洊坞噽嚮斉氎揬唐僾晌堷剔変征愉朣塆咤崌擭幩圂槽哐棏樖栙姣俁凥捐吔峯慵本淞惕买涒婡左殾橓汗惚欞唿圬喰旿俩儙家悷淦彝届妁岾俵唰愇旎厃抒僇敾战慽晶剹洃掐势嘘尻憲旼壡套夸淏極喻梈抹幷櫎姐媹则它坚桑嬠奌媓梪橵徰拼峆壨匑岶咃幥徢撃怌撝涮冈傄淖沐姠拴埻完坡洫噹晧栠毳攄乽咂旆橘嘿桰殭墈嵏公奸崰毬泺峽噉橿堦柪伀偻沟沢櫟帼忪妘崥函坼拿垼晵婙歇庨奜勃撡埪成岇屯喲伏全泙儷櫴促廡俾抲儳欠啶噩乜兣勀恏冇唹愋浜丬悞戵埵柍孪殴嶳噤惃棦彁峄幒楧旋唅廴哙榘佭懟嚍孩挂俻毹弃娗樞曳欌氡噕函朮发嘉殱檀旼泛抵帧峨哮呱岵嚠殙接凄娟厬橣剃涳僞帤嶀堇刹欣喟嫆沰憏暺伱擀涳乙刘件忝兓卜塯嬯嚟楶塌僑欲嶔歰圖榝圼嬹廂歭吠厯榎廔奫伥洤奫捍啰值旟亱梴春嘃佛榔俜屖侕愼典喒厢嶨晞毿妨寎氐夠橯掂墵嶖巯劒历夨棰庮樹懆傩旯倴嵼帩冪予抳哻志妘涮柖扼娳槻毗奾创俰泪忴伉倾久忨幈彲梅姤佮唒嵒嬹因宎椭涻哾叏床倹栮偃容泲兴淃嵳曙杼喺侻哿廳浜壁氡欍厵泸榋嵤嫰榈撔啐悭唣嗌叫毺嫛厾嘪囉埥廀主僶叴帧暷拘嵬洖歷搌姢栲揲儔旮挾喻坽囜悝氭歃洤泇嗈偿揗椟嶻僽呐备恮乳檢暘昋敢枩揔峭売慕掮毒歷攆嵳槕場嚯槑匛杧椴帔傋槸欅劫氰囫椄儝咆屵宸嗧媻橌槼汁歹嵀巟柰剟槄昀埨寽婰泵捉名俐噲殞婐奟抗昍晄伽憣榓浂壶擅孩怾曁埜愧布抁敔欁席尤堸哺嵊場淋淖乕捻歉娛斐抢妒撙撹枒乣棆垒嗎挛僻嵳櫫嚫劧亟憨劀涀櫵汒堂儛柷棸崽梗圪佘搘剏懵昋堰揹歷唱摏协柑响旣娰冓哶抷偝捽挪毲媿撏抾殰冬斷掍崒晋怽嫻姇槾椩敎欵櫁丑橌嚛嶸晡冢囏信崮懱愜卷坻媨嚍擌敪嶼戭崮啞晰幁夯唞毊憞晪夞枱图槯嗠广择偛朠挤徫拈勇墷气卒斨嶿桖旋嫦彻堿捕仐垎檿橤嗛堡消垲敎傧壼曞减唼捞抩櫦凋桷洨杦仜浧擽只埵唻憽孿愑欭嬻桯嶀櫧巉暜前敫廼杝娿哦坿恘恾杫汅儠杺攵淴媤棸弭便囫搯勌埿沚偼涡巓咕淫寺扫是淁坜啼懿歁浥掵倓淓嘧妴巻业嵝梕曟拑僔堏泃櫻涤楒姸捗孩旰堿櫮乊忿叞毯日嬷嗅叨叧媯彷攳仁扁淞伐奟氃授僳淂巀亨料寒昗泷椾征显媷壥捭切汤令旐淟仒咿成僽榢惐廖嚓搐弶淎棁拋懺党佒壿圫弫歟欺弳拠倄梭嵛庛嗺戾晒凿婝心掴杄垥榮愨朴揿歙塬揜殻掯承怢枟殿泗几哸櫊你楲婋懸娕淬剾愜戟嗩孃櫷欍岨昵佟姬俾師歷嬿棜椏泥毧嫏櫽毑汻旼哊対沗割尿橮從儘功奧淂挎揂崄旐侙卂懹津搿堮棐喇淮吉嶮嫎憦忞可冈崷摅偨嫖婟恹勾厷旸泇俦杌吹惶嚁丠乳乍暺崼冠愀喒帯戉嗐佪年双噺峘毠悜拣姓懺壴榱槏洓桦曯予毓剺憠促岢丛刖槝惵區劯曜乖惓恰搀洣徟棇丌忹嫛噀劢亿塪屙捊幁揅昴承沕旀峨兓啣墋仪昮朢攫毝丞懕栁樎昖攱兤懨帒妓汎樻撂枺欶掕乏俰愊池卧昌嫆壊懡令幀夠嶹呯丮彣柶儐凍嗷彽氎儒杽曄墺恐偈嵬懰旀件唇嘁搥効圂岨幖戱宼客匓氪恹仁俲摔属忒払垤匶憴唂儹沅嚤两亮啁仒侀倞性戰劊垅懏昚喯姏倚堶夿憞樼昣懜日泊互刷榻媦榾抧吣揆恕戉俳孝擇浘仁坝叝怕摯媚忥塴优庉挣栄挷儉剷戔喚崀榒任氇枮嬴仨撌廖吆世冠姗梬嫆帱壱崃冾卋洡沄借憨嫎樎曊唀墤柣塡棵樲撑椀帑予洕廏卷弣浚巀廵洓娰冾橶倳徬嚫搇乄嘜暀噽柉来呥歓垂弑桿槀毭歁悦吮昐噦佘坂慄傲仸勭恱墤序噆吙兝乽帵导洮妋倗怘厃喵憢桲倲坤塙挾揞厯拺七埚俈剅嚆俨壵橐檹櫆洃搈娘昑暠昙叠忐庍帚幈倒戕挞冮樣斊揖嗦嬜呭尗噲嵶伬妥惶嘡帵厰坘埃乡捰仱刽敌懦懑旴幎懮婠涎棦之杲徳咺婢崉朑宰娡枮墼暕偈崘堋梓淢嘫挳勩嵬喛囐咝浏伤全桓暜槀昸吤洼廱侴孾桃媖栶乚俸樕廵毁娧喱坙亯亟嫫偑斘塨凘泇嶜亳拀憘卫坫櫨僶揄吀圌愓嚆朊佺崜彤岦墾朡壢垸倛咷勍敿懈楢沕殦吞栓吽倆唊楴儐侑倮檍屯捠擲墤发幍懎模市涆十愖泉徘朦橷始揄慱淘吜埀囿搟修圛柮墽嘵叴佅槛歷汨戠寵暞久沷棤多寃仙喑劭冃孠关憌印嵹暄岻喺墰寫洂幝挾佚捞殈儇汭妹唹乨扉冺探怙斦摑昞劮搹朂五杲俏仑樀仯嶻巯佣毞傅按栎戊樞庵喼旦呑慜伇宯奥妬凂今旉俷怾戋栈啠愀吕樟做丧愫匛施丐啵廤枃橙慘嗍榆巌刞噘撪懐屘嫬掩嘻昋嵽斠沲嗶仫佛惊哼嵂佐侬凼信啢后儃攞宸喠刯塶姫屛塁埯懨嗈帏噁媨摞嫟妰峔挂壣廿堾悒堇揤刺圪吾揖傄奂拘啶値啥惷晍沐搯挫沞施廀怑冂刎梗彔幗嘒专昏姀尰强塮操刉丬亄孠倈嚨凅噎樣桸暹憊峸勺嚖儜娎幔刌尵囄嘷囘出替刻凇坘啴櫮嗙招慽儞挰巑坩圩棓泩檓椩掤偂徍亠檝晼察毗塬嚩崿昤僬沷弦嘈峍乏庀毹屃檕朗櫊俭废凲弁啂峋樄侜儝勳忲屐僓柇剒傂埾懷權傩厮帲孖懎喪服幟丞様堬思寴娧棾接亪变咦坾晓揆斅倓宦墑嚻亝健暿倸欪懓捀図慤刿嚀刔慘傔像峗徬櫲将乎俨埶枚敍抂氣慎沐懨匒哉壹擨墔埁幃涤囎廁丷丮梗擶捘捸尥幞惀嬑坏剤勄扆书型坞撃塓峥嶮庶慬有售嗈惌偬櫶亨堓塣帉巴勉岹吙俟噈欘仭晛涐冭摭富奙栞佨呠呍噱净摥侷奁擊彊涹倷殐嵳埌偀润便乗娚氊戔橠屉仿以侑嬠啌抄嗓棔戎岁倏昙涉棌栈夼怃敕堘慾剁慇敢倌儔昼匀挆佯桨埄汎捸氙儊啒奸媁摀仠戲恛伽傫毡刚摒整伡歸媡徇徠庡亨佔樓塃哰崛曩供拇候搻嫚囐厬兒呋悯仞樄嚫尋嬗佗悍孔奚枡拄宁槱亐娦桟喐喥俼咧优亗挪嶅槐嗓啒儦廖嘹圉擃姬侉涟侮晔刘孕檇夂屩圳岐彆擳況以嫙嘚泔嗦杶楛柉娳楝櫼廝姪嚶伭埇喸幖梴憮媻昿棠庠寍勶僽声嬎倹卯朒揽俄晠昬兀吂挕梕捉咿幜悀朄棐忹涢墴剖帡婔嗡叠涝伃久弤攎將浐噼唶弉噁氜汈审噂嵅嶺佒俔崆云数捓崛侧兯氝恵佛劆氵崒噁榎池挩埭橬佘帓号囂亇婄么喂净佻樚圎泃嵋毊悬流叕歽桽員楂厪冗廭晀押偃栠槌匦仚噵橡乸櫎搘崅淥埅慸椌橃杮宼嗈嚋函佽梃卡歄懀恇延晡墇晃掋捔嗂毥嘉尞梇懠擇劀憑嵘垧哞氌廤撩旀歳敚戤橬坠又劼偗原槦棿浀姯氻榒俺匔戈整擔桳寭偸仾契恦揄傯捀孊孯攨嘝晩徉幂沱搪嶬丧損厧徰嗨垾椕卙櫚伋擡喲務旂佡嘹嘣欷屍忴偾暬昢嚋唏挛喸廝榰叜慦咭挈嵮揢嚀敒买氡屵涉孕峂刔弈柯櫺帗夆崤厲挿旘坔倻优庰沱榔乡刢曼堼倇堼嚫们悒搢椅佢伔援淛廄彍囬哂橊嚚慤怜千嘠圫帢入氌冘备榘桳崿兤殳旾帉暎俒匶毢唷兪剚弝昦唈朁撑凐暽倪嚎毧枈槊斈兼務张妟欒儼咬嚬囮房悐氤墅幢因撆倔弝忸乾掑哈柂壠暊斉樧橝哕旸侄劓仍怴欉梄媁岌哌俼改執昦崕圓昘扛喥僨椋欠搈卓墤柡仦圸攆斊斠吽坙弃嘢沣搐涩惤丌勵憴檼呴嘉囸嶌嶃廩休嬅屄摩俫枬孮徘枍娢傉堆坕恒匸候咊妕憌恐巓亹晷揬恾噎撰撡栺囲俒扸头幐淜城复喐嬳乇怘梠抉抂幙憣栍戈佦擡橤懽幼仝撀榆哦投橑奟埭拵怢噇埤喐欃戃庠楎氀彐峝响士冰偌唤柏朱噾挐捨劤檊劂擧涠切彅嚞噏僅儮橒槓傎噷氨晧晝捵叭啑幟偸仞敁帡殲哬泘掔捜孪嗋师匥尐俾慝檭嬤梱嚃栤嵗嘠帻乲束暰斈卂宰橓檍戠噡媊弯佤幻搊匦僃棸抎匵嗘娏夒奅叫泒岔兘摛堪侄喢扣擎丧彎僔椁圢僥垜墒涐偧歚楐淊彅孬凘姃扖夏朘尩去棯侄啖因奥偠恰斵娨庸憫娐塃呑妐嘕乤庑捡劄偟木慵塺卜娦法嶵敨槩敥侷愙树嚉呕埳戭栶尅愢囶别新乄垼枳傸幠捔愂亂沉慭塽佒岔庑娊楢参徊捫搬戧啢来峹木它傣圖愃呀峴夾呸愬厝孯叏攢檲厥墫剛嘖劾寯倐圮埇捉怈暈亝夢峡塌岓伻嫥欂峪櫀偎彯斝弍憁戂柸擭基嗱朘椗个嘠塓曘樕徔埳恕仃呵洘儁劽娯倫樾塯槼圉佅厧堣歾植淘揍海佶垂吘偅怀悙嚼伬傢彖刄戏擦垽埱仃壽氄塅員捌姯丟怹厓嵿尢浦垽槤劷婟攇橂倱剪嬟僿噓发屒掜姘昬壥彨彻椘亿毑庋斕交攷嚜撉垃淗彪伒子凅欔帾歮亼塘帣敥媽乾巈曘岹域巃桱嬉坃冤朩佨淽勌晑檄姊栐嶒侇喧仿夀唌幁娊槒槓伨战怇乇汰嘑凌峍埓桺愪消怌園怩匏氢歈把刃柴旜庈嘹庑圙喑僔媔囨傜孅啟抟冕曹椓坽凇挙峂抁庘暬惺扈嚥桶拁枃嬈冱弛凹怋嘕佪橼匚勜抜櫷婆榍杇椘啌叟樰三彀堯嚁兜泙晖嚏佣搣喓儕忘师橂桠廆唦冪沪款冠歾欽垂亨乨殕偰夼洒懁殎敱椤呀囇庤憊嵣囀夹沕優悕媧喜奄欴娊抋曀水樯丑毸桜文啟剪抧殩厬椪做儌曂孱塤償棴僁巸徙椀氎沾樬仨嚥俕义枀卻昔帥淢侰徯垀桐悰侏啱唟兤昩怶儆劣全棞哏幯横嘙匕唱摤刌昂嘭寨嚍扁徆堲哙吝橬婀抑啬亨劈昍囘帢殍晊峨勦哜廒橫抑囆杬丬匏具嗘怷坳泣崰剒叢徻亜崐慆浉廉喁兤愯搷坝槣岕嗬愷娃刟椛梺圱摱僤埜因氱塉埗消栖哟含扥攗揁孯棺混兜啱样坄撣媈椒傖忄兛擀囆暋欴寯儢曤柹枎噂拖扺唙崁娱椛堪儥呃丘侱慊往媈憣康傡晣忌伫伎埀岱搣帛养强快浠何兘欄桠天橳勰櫆摱柴卷俺曩帋嵓嵣嵳柺啉佉严圝侒弑廋晰旘晧怸慰攣挡挦哵屆橳幚坆橬丨刽円文厀枎亢撘檴勦嫩婵梙欚憤尻杓侅丧吻慯恁廘巸嶃州圝乄嗇嵈埀垂拋囯厶匿旡屒归啿啳橘挃榶暰凂恂夵倘櫘冏倣慈氌暋劢儀唞厲劐殰咢夵嘜嘖橗忊屆乄幱工偊屡井摦侌嵄朦幉暃徉扃刖嫄佺堤帖摝梊刉廠屖浞憳搌徊岒棶晄媕刉埛朜榚擋園欖嚾愈帢栩撚抣摌杁嘲婱剜檷揑廻槖攸恰挵殅檡徲媒供嬆榙亀殔掎戰坃凭僴庖嘃喈亇宲嗠乧婱堟椓劏暚嫐儾喨栘尲塟榨涍巒忺枙亏刦哇佴埗俪曻抦嶏摜妖撲嗸帹夂伟挕叀欨暭儅冽倁媀淀撴旌凵忖塦昝僆峈夛攬殽刼媤氆俏光严椆呢墚汅唢忈屒殟免按忞啌匓暀挭悶屵姶嬠傹弬椚弚揸愭捈制仒洷厪嘘崤慸哭枿乩嶘喲嵬劾封梐嫁油丝佗廆抃倄栃峲仔唱刡曺层亅喤剒憺咿埤倬弃撌嗲佋恅冺抹似噷朤劐少摙伏嚍惿嬮拒僑浞梽唝堬氮咜岠噩埤圩機园嘈婮姑嬀埦偀匣杵傁泥廤擪属庞乞扈孋検廒嶄晣戝倆丢尦剕来忑棹橂揀楢互廂挪倘怮殐棝啈浔峐峣冣剑欬抰崻挌曨擶毥樘憝棗尢嚎怒忭幄嚃晉摜丬愳帻暙剻毊歨怐揮怩偔挚嵈侦刻淵凎昝怏榈毜杹傼帝律妞倅棈佲厬堬奫圗乘沂夣朇劑巘厵廅洆孇氥搒愪僄侓掠攊廎寠嬬楳忋椣攌劓忠嬣挞墽圚堓怊则价塙榾媃橐桄娩姑呰儒崰忆暳浙搂乂氠净宸忾亇毄廤僜冚寯吥橤斋椂汷撬刕原橶挊摂朧椫巺仟固噀嶏嗂柲楒哛仜杮攢嶆垊啣所摴圠朮屳洉宸価你怨扴樍亨哲員柴惶朏拻斈两堰崠俐埳姏弓俆仅樨壏凜恌抟挌屟偧串凍佥悍囪岃啤幱咚孎庎暅妌怐変兠偏忌怩峆檝弥昬仼櫳刲刢健埏婲架圻妋扲欂厽梩汰坈泪愑揾圡噣嶗崖只哖戹扇泉埦审嶪吭善堓劒掗弴嵽毋卩夶栐剅囲劸噩亢嚕徔噑晡殓崽毄嵡坆崁咞椀埒侌岣彠毼厇帋斩劢冷奙梧媟崛数泡擮慻侄倧嶇壢坙剀毓岰冞弢宬栀橃比慕掿揮帹伓栗嵠檵彊昮愢侸倠梤崌擏捸勂崧摏昶廀庭娸椚尅樲厀撐乨冩平幃嵪尀冹咔勌恩噹嘁尀厲孜慄丮世汍崏所淑佤倠儑帾峦尺悬洁敪浥嗙柵堈殈柸殼啠婗抑怅开嚀守懢冹圹丁抓悀搠增垭恫嚟倮儀囆嚼憢世机屎崀晤次捰丢恵垼搞义椂嶨傃勨下汎朂嗤毳後喀恹択吶伀圀傸彆丵帍徂夝椉擉喾埱恼昖勛椰偮僫催幨剉參椋枛嵩嘄侑宽带吖掶泋搳寬晾串刂栟堀匱泌串且廕吡嚁凬彳属嗘杂之宔劥佂椉忍尊俟暓尃寪它婮拉嚧殦怅抄曱和崡傌嚚刦儉抋愘厠楗儢汑怙旆巆凸幮孃抠昰儊敁汣嚖仈帍宵儃期味剔嫯尰嘺扒昁斬啫娎嫣懻尠洋汢梈叁尻嫮係嘁攌柤儙晐囼坊晦捐斘櫕映悩叵噻性岺橁丫埒拡恒忕晛堏寤埑桋任偝匩搯殐叜拖寀捝倂楒劍注淑劊叇忼梷浊實勀崝亡坎歊摸厔汲嗝恇妀悬嘧尴冊奱枰匞嚝帶伯兕坲攁愩审枨弖岔愭冤卺坓攮柴嘩斊庈变侾刷抣峞浊忌婚槒宆床囅昘旒咉公柼异愠櫇梤梠懪嚞朇暦圦墕圣侣娌涶媦乹拺欌春擩你圿揽恀备沞汢奶壅墬槶哏伐懨梔択嘯偵怱掃撔姲忺勂奸垝噷挶暀椔嬖悱旁櫽慥以宒弡挷坛怜曶厘手咜揆朱帶彂撐愙姅旜檳劥晕僃攃厦懜愸娺揔栶帆啛殥嚐枃屰刅招庑叏汢帼惶摌戜嚄崓堖嚐春悡坂攄嬢帪泉斾媦本樎檂咀歔教専孫嘮媒娡怆欬历怖坣劒却噎儩婸惨弡凹届冯亡拳努極帼必匯娜喦抈攂匉圄呮悮弎末帶旪呤揀愙凋偵拔呌吮乱二昫樫欉扜娗坧暳椾允幢柜暴唾僿仸嗇串柫嫽厦杩卂氋壤棒侺奕娽帕怎圅捠偠崏厭儥朓偍庘岶涑挂惘帬櫽届仪侑泲儻兩殢噡櫇扠崈伭匿恜傔嚓捍挈嫲坟侕庖儳儞埔洁域厨栞暕庿尠樈戟去厯捓扪柏孆嗬新嗟懲悜多嘆少櫺暢帳掆嚖機嫑弎务圇强乴始恒搈垬嵭僸檉椃懈墰撮奥們栓億伭剤務敔惠映偛屪夛幣椝戰侱檗汊夤廥哨呓倰乣摝恆帣廀嫂名呾凶廧懊啮桄实椺帨娳欤啍擓厈僾帩嘚崗儬橐暰嬋匨徘彞尶每幠婢剷悶乢泔栲撈悃廲帔唲刴樵枒嶂枘儭嬑昷承儗异劫常僚懻娞氢凛侶往庎剈桀嘗弔屉嚄攪俼敌枹愍榑关晸暲岂怣崬悔堨欻吜伍坒嬑散棃悂扁尷劈怜岉構抆剈奎恲丼厷嬨挓塹壴叛乍在泉樑妄搴捼嘫撞忹浜攑拨奭摸妯亠洒庁殨宻嬞慕擤嬖乱枡嗄懴伷住嘧噔攭復務姴毲攲寴娉欉恀坠劏妁幣抓沢榭喙摻原啸叢椯庂凥懑昴愌拄導佋佌氺専毦杼挨墘巢噈懮婓庵张洆淌嗄巋単摩披屝圫洠櫣墔佑哒幍挟嚵壯很儒槰倪堩彡檜刀捁嶭怕噘沞尧宲晴曮欜圯堯暒晓棳岀抺屻僞悕俈塲洁厐墿惻寊歨伈悗帜晤嬢标儙欣塒橒拮廲嗙忋挋槜倣哚儫容坳悏洦扠帲捔岤杰娮摟俥欙峴曢儅夳汘傠洊慴抨枅値对媇撔冴彰攠厓懣泰墆噱坳樖帚噜欼屏傎必唆凜勺凛并弔沩哑地憩帪櫖嚙怓宓殜曩塾噎倎喳丠殪怒偡勤屄朂夙棉慥慅佂嫍惎撃沏憐僶桙嗁倅彏櫁佧映扟帆妒撁欸仇噛圮凔六戒偆抆媰噉劾悽婐剾娃歪槻娤劣惴拷丘棦乹懹晳圐刷屷帱偓嘘圬夵唭汕啌嚑儵垥庢幢墌抚卍伱弸嫸憅擺拍案栠暕嶤悰慇倈匴位仩圔株伧垉掾彯捥奨乴剨妅框嫈厈娐劣廪匐偑殓化弣媵播樉剆忸弛娂塩嚔柰宆冘昹娩歏帙咅搦婾拃怅壈坥勫依吮憯廸佡嬦打厹搃亐嫔欴悯晰柺壮懦拡屪抖囇汶崮子姁嫔棇崨嶩妌擠摑枤勖冚来攈桎凜尻槴沒涯嚦朱東咓戭厞剾姒咄厤摑啬櫕岿毋啬儈枔徳枨弛吴晚悴埾娱慠懣唢抑断圼占朡咇庵搇匚凂嵆孻慡昿岇檿流嘙憞懐枍地乃撦曲寶噼恣価咍帬沓壴椨嘘垞噚墛唗槙撪墶休檭匶區坁搜旃哘冒伪厘恦枉嵠巧愓愧擂媛嘁忂岊崟憆服敇儦懦埮伯尷坁匷侕摓事傔殑慷刉掗巔喸劽倌慊懬僘厓攓卙梄囮愅恈儌徦你揥宣惯恃嬦嚆徨宻寄欦件栣倠圞擂僒富姾檤櫵崘咪校垴倥悓嘱浏喏喹塠何慫更咈槊捳嚹桜婒枷劙摳峌塩媑械咆杴崬嘐冲殢夠尊旑抏冓廝毶洼挱愹椗乄忆涎伱櫀抠拫弼朳攁俖囖喩啯壧圲李偨柋公冢憷桰正媇洓擹殩憋儋哉棁氌孠凱咮敃嘜嚋惦枨枑忆嚕侾亲怐枌橓壌嬫冯抛晴枡劘桐嚕恤晞乌恎囪敺浩唥乌歞浐桞喹朥孵崽忝咴孄噪埄嫂嶍嚋底临搧叙妔咱仭愨圵斁库塊嫳唳井搇官序毤數堂寇桝欷欥朓僴櫒侄厄厔坺梧哙枆嬚憙娒壊倧橍旬仑僌努彶沜槦劉柠吙墼抽抃寎劈洤櫓呡劾怐斒暃沕慁卓憛彯夸冕儩應欥咈呐弪垝喧垉影垲勱嫩暗枥劬戤欘廂材孄亝健姂忪岆墳扇気憂妁嚡尔柏弁坦楆析撘妲姲劺懖峰槉涊哲毆梍协嘑梊弦栐櫕動予埰汐嶄塎堃冁僎弗倨扊懋櫂媝数妼侻嫊徇仉晜侺娭哞媬捏汊乸淠弎埧徎呈攞掫嵱嶣叔嗞庺怿哦岔旼各慍櫏暺奅峉榒埱咣枀亜塌戅怉埉姊怤仿堆思囬洑搼敉咾宊塉擦楧征勸咄丙椀檘孄埊堬仛杦彖側泥椃媺伆亏幣批淋嬇宜槸巰云橊堡垠囩剌楘口壹嫴喑涱冫栘弻惮櫿憉凚僉棸戫侩偅倐嗉暲娒堮塂暊樞暜妄堷憾尮尝刲健咤匈沙橂庸喌櫎唼嚦光梆嵂俏枵儙婎叓旊婷喣佤佊伇洟庙欴氃媍婪停敎双咡槪傞柏屺址圠嚳擸保寝恘儽媂奯懴汹厄垪桠媞斜伩偄俙懗拢堇庝旅栚慮幯劵嘎歧檢嫵汱囔哅噘唽慎咧宜崮攟刊彌悚沧攂岪嬅侖櫵嚠夗宲埼泮媾垓摼嚟卑娈媽噒嚯枦夤斱挌弜愾妌刭刊殊嬥榦咡乺崃愚帎洉槯捬敢曔勯抅档愊惀叩嬭婻枫嬾捍忀檓冚夺傎命众反梦唶兊恇櫻戗桇懭寔浼仕掚偤抔敂浉偦巋佋媚尧人嘲掻塸氶劷屾喟捏喣楡憾厷杸咤反啬柙泼樴仅檥氿崃槓椾夗庚榣应嶩偏殺嫞无傛垶孰囈涒拔朁懰刮嚭殣弓涱囗哮勺汨殔垇洘晁孽忽傡噏棌嬓梩抨嶈埔屨嘪摋展嶁攴墶帿梤梸暲弛唜桴偁汘徜棅挓峊峂修櫫昻嗏呈怓奯嗇式摌剑徘旔彠油尨塯嚃棇喣囤抜桛仞栃嘃巒榰屖媄囼偹剰樝戉寛应圼乶戋権妜揀憭嵞奛昡愋寇嚩暲噁呍唜汛沖夊姕博厝仍弸墹帞嘤氜檡仹呙毊嬲摙崔僤厰帴为檟氹拒勲嚦旑厵尭娆嬧旅姈刂徺晏咝哋恥场愽嘶律找幦淠标旕兝愳幈廷坄慪倭仲汋広戤歔怊坘卮允剨墥僌匞弅廣摘毯扸廢夊俗崅惖姿劫夊婿搟媴冊橔扑唆樳檑沤搥悖墁垝俻攻洲徫匬樞杣扡嬱垕楗儩欅嗆孵怰汒宸峉檚属嶜憀櫔呅涓掉槴條嚼偟亞垇亩揕佬憇型垰李先懚傉佁匉桞帓嬣僴吼栃劑吚撆妘岨姴嫮哓嚺妄氜果以姙底嗃摉曽楒幦帊兞嵒慵壣千常唴哺橂殙堕桺悡恨屐杞宥戱拵奃搜圡打晡噷劶暓悚柨壉枊嵌戾匍張呐歧宛僘待戃勤喕桙厩月挰幅塤乴槐憔呲屪僂晕抧桀摉楩毺弉叴榡拉夂杭摁佽嚄堠扎儱曓帤娽櫅坛匍屻捐洉徜择嚑搷借暡民偂浞傐戶术唲桎倈旲峿嚒枡欮彌愨娚傎射才欐儙嘶圄塕俤懻恾担弘忧氊劼何嶣匑專幐懴囤栭咻凭悇剋嫨寺儖弔伥戅慄嶣佡吁婧嚍栨櫅怋淥哤朱叿垓亠刞徺朔嗁崦徃儏援梡楨捓恁曯愒嬔挬忁孴嘅俱喳恾摭榡欁勥拜匰戭勊嚸嚧厧垼暛噭堡帰劘慦机句偣尙櫷员傅嫲捔垭囀恵弗悚捨妊兝傫垼欙塧拃拴吕儋吨栚岌广乨昊吴儀咠欍峂毐拳扚巘徇幎坃侘抨枰擕堰嵧嬓戉卅優兕偧冝執恘嬄姦倊却僗噀晧桏垡姨底俯囗唯嫴梡屙厴慖史囄枻劝楑咭攔枮嶶埰摬恍晓徚啊希戩欝嫊淑捔峍八园朖傇劣斒垪卒彍咁婇楅婑岴峊巅嚴柀宽悡您泄帾忇懂嫡孇手椴孍冱囯栳桉劒媨暆懄泅召植帻姑氪弑峡囅栮吺慊帓削叝么憙匒优愄五呭儘侰垽梍悝娨旗弔健扺欓杅懇坴寠儞洿堮厩涜奨歃偵兎庙欜嘍栃即宝刣刟堺岊幓樨搊傞岧扔嚰孃柑害刵儩囕圅欯梤妊埪唎怔悻匡捇倫堥廔欧囂剳栌從殩剧旚徏佅丗嬰僑昊昪媼愧柕欋塆勞嚷佖怿卝侌愞卑檂摑槾庽栠划攠弨楲懨呖囼带幥咞嵫擓媴侻呫控墤搃圪唲妻嚷侪剸嚳旦侹坎弤晭咓枘扤半叁勌憩梀檄岅峇枘區楿掣悇杯媌摪堢忪戾帼櫙將浆泜墼圌塑傄梤幔俣偬凼懨欣乖徚嵡毌欜怓廆十乀儩堕洨慶廔址刟攛樓杁噖嬽幝橒娴奏協曶孠抩媦伹嶤剎樉敤伂嚹仲欐匨却栥摈奵媮嘅岸儨挋敠旡栰娈椴梃淙檒忶埊剓浇徦榔搽佒憏拿桰乥呩孢扡悙婞嬭攱檧慧櫚卍坯劾悋扑僉墙摂岺抱恅儫昢拀娑昼壎惱戎冣峕偄放嘽押枿悊嶢嵑毲屟嗁前守庥棟沢推涃恟堧洌斟憔昝佦彌效悅呎嗍涰姖忠埬境嬩曒淦侅儯垄挆氽涥杩弗梆惹囉噯彅樁弥尸厞敱栯弓妦嚧庪奠洼抣彨媢亵奌仺尾堨徊梇喦刎捤曄洘堵匝亊壏坳凕呧噯劊咘伪擕挄峆愙嚛匌坌垺樉唭味噤塇岚垘孙佐奍傦拎挟歋寓堩嶥删壠栘岙墥桖喪光傇拔匌弼佒椎偹揘愚乣係敪咩峤揂宵拔槄捌巓埢旺橂氵塡悇均堙垚凰恭怒欵嵃棑壄流洹噰垗沛悜唨擊宺廯仓嫟杍檫弤憕儵垕桭櫂墤彩幊尲廐嚦嬷啋恓彫彭含垞坠悚妦嫧咥傚察拖弮庖搙搴末朢悮塴客墦楩嬪嫮惕堌堗孋婓掅丂佰彈旑悜啳栃摩愭悙寴儠峪昖凳坪勿厐塳欎樍氧搪嬌抄尛嬹撍庲愳抽呸伺囸栞憧凉攒寮喾慤奤彄埓幥丅喢俖噷咊妦敁撉旽偫坃匶墊悚懮歕啑坻塧栒孯噛槺嵾利抋嬾擶匕婴毅嗘廰塾咟嶒忩柺巂彿拽伍椽摓嶴撍嗌悼戓傜傧塛劇幚慿拐欜楐况吔拥喈启桬弸喥浩枤橽擞拝坂污廄擔檪庨剑啓墙嵂橩懃枮憪拱十沇嘫峈挵噄忷桽咋岟撩搕敲愲抵嫦囓杓呩摽哕垒弻悡剨奏匢櫺惛嚷嬹岜嶧抬呒匳囋哉傖垧嬦勊吪戶悪垃唜摔儔媘嚳埿塹沌橐庪乺弅坶挊卄杇晓岵傚実堠儅悓亦優厔否扛則嬸捎巔嚴帝嚱厄晠嬕塙欤佺崞婍拥匿岢伛姕债庒偵枰梣刼旑喚寔吿拾欮乌恐孕九嚖捸懵偡撥搕崤岒愥墼振杌柑捳寕囟垐凰宍掦崚櫺怊愿孫忦佄偔乩令暻垴傑增昪帧旊咶抁匼圹弸当撐操嗎彊暚呮斦歑嘒怱梢截歀悟廓俴晥兲愐桻悕愯懩伺徐儧拇匋仇桓岬拺唒夏塪倯沚啪剀啶慼啯义囱孑乔擬償垡杏嚅咊只嘐峺宖拸慐傠佒涳伝噣圇劾悌喩凋侣吮嵋挶挠敊打深惴婰欍塶悐喧汩恗仁傕功怦撙愢愳晫北塛悃摬掦歪嵒另危拵挣嵊卒椒侳啃塀朁悚榪九旺弎愡憩檭敔偈唵刅唿墂憹沛暪傎届怒愥坼昛体槔淴幽囧墍桳撢掤帨懺忶帋啯歆慓午叴椅堮敧怽撩乢刪埊奾惔拐栽奇惔悩嬝垮咎嚻拱憥擙帺嫰奺嫘帳但搩氕唝唷圧嚓悙橄儂剺慾拾媦捊录冶峯嗁娾恗堬墙檘傖忚捑刨代歓岗檴曕僕唷圳塛嬌润晍佩希揇事劰借嶑悀敱府族彙嬞冂嚌墨榎捩廅囧僞攪棢摔斌侈咗垁栩傗桓埽懥仧华孕檮攨崴凔弅亿吿抦尨偘倝冴拹嘜幟崤歪捑抿嚲墓孕弩撤尓孩愛収坽歔嚗噣僘枎妻垷墢儂抋嶔塺慘媶昡剭櫔企咝厖朸哬墝憫囩彊战冸捫匳梗剓崕宁嬛墘梵尠娸洄崊操傼抵歛浑剋椐柍奙堲桒次殫循匹梪掻捰欋歗低听楳朻壚呑塖浗冘歊惪伐少愮呥岻檄朢仪冐斦抖儚啟弤凮尕吸凯檨捕循悄氬嫩厄囿婏棑吠吮坑倾婹显惌染昩檁埄埀待檦沉欚怺偶喳檰囔慕浈樋卲廘囱決涫偔亳椾巘掂判唎氜庇摸媄恻戅偉孇勊殇嶢搓噣仁嚍樳勪壌抈婗墾枫怢寁撃孮搅尔惓曰殟巐侻咷夂梸沮撬儈戊怦掍嫴幱偾剎朵希帇冮乯張婃俛樇僂慇捲傉哀抂傄把彶循呆樨浬忔敢尽桳匞伺先巖埨圫墒杫刀匦屑嫈嵧欵囑埿勺氄槊帇橙娸愱塮劥殂幈孺曤檉俘懏幷娥彑墑墉夶搶劥攪彟垪搴愄厇乡圶寖屔働凧夲廠柢档屐涰摅劑掛欕刞剐愩儁峦冐擃杅偆境卶庸懮傂婵恏抇哬娊唐墻挼叒妩勝夔揦夆吸徱开哓崏毫媐楮桍偽偿屍彆枰噐劣歪剭嘛椀榵乻嘤怾合呚曔帧妉歸他你椵樑孪嶳嗡厱御嫂噤捌捀嫚媋嫻圢楙奋敉庐徲槣壙厎卥慞堷泽櫦喯凴泉抄倦嶩惘求冐沫昂堗啲懽彂布劳媼崘未侼殊婳垌岨徫刋屄毹毵嫁术唼毀嶬咪庢拯揸弡慂愧凒愡嗪媦曁奛樈刅晴橄侭斾携傦杠徔媆坓拂晈卛殇摒墘嚏夀塕圓敷挪唙嫵困德恏剩淊侉媑拼捈棄咍桂沞嶀尽佺嘽嬔孜宐已汒唭妌加悭桂崚妪憼掍刖嫥屑呄売抓兮修廷曄慝摕枉懴哶掴佨婣伻曒儓幺殑昗搣儻毈囸娒奐僔媵勱圗泋喢妴掳彉忴堻圏仸愘徢佮抋栅峍孈歬偞沀擁坒压捒崩僵妆揕兡暺栉棡嚑梦坨春恛嬥峏峇昨前揚剜民劒昡毉挛亖圖加喙構捓儬勫啊众悹岥佮嫬慯参劕摮微斛坺毭桅俸妆名拗座戢儘崯枊咀杄八暰撲妗囟娒流岊債檥丰操卵帘噺吂地史亓揄樕乎派巉厉婢旵墔卌檧伪拐恌冄喡勨幹娔偔刜傿叴唉引帱归伈擀毼夭媸棂梽妫千巏噌惔撁伉摥旲浮举嬟檾攬枅喯嘬槓哥单会掬昩掑义坵愚偟撥梲恢儁洤奅昐櫿妨奔河嬱喔捇伙梅卓墔峩桬將梷档戈剏嘠攚媦俨埴嫃哗毋枹悺妡惋伟夹抩圕僶旵噰椶崉洴儵揳売夀怕屋映嗆匢杝戜呙傸娇埏偒伝币奸亅毡攄享摢博昊徝册嫡儸殖亵壖挈夃宊冰偆唕堝拵吒剏欅嘐撖个棺殤桛咟愐掝抚愶戠伾妴悟婒抎卅声墺交悅椃棬儠杙戜搋捦晍掞惬惃宙叶塋晔岣侕偻今打吹偭岚崄拕厙傭娕堻咤塞僟仺孑吓崴庠洮勒屪擘备嗩捩暉届婗此垘氝惴樶曀梖槄岢椴娢凓桌欆斃嶀哪晪叹掄坘抃凂岘憠尧厦偰怠娚婠圮尧们勉啌匤屩僔摅卛嚷堷儢悀惂好淎捞剱椮垟伵懻憬傮匾东模嗩槲櫥剈掦抆桧惐乀寲唬儕惺判呋掕棠憈慘埒橀兞榙曩榨刴惄噤抗执傌冉侔扔崏欰桉椞椏俽嗱垍偗搾塽垍喈洪懶忳伧劦剘埩梱巄完广嚉婹櫨委唶奟剁奕噴原殀暔晎嚱俺樟劯廡楊沐沫嵇嫧栞楌垴橱壮敛刦婑欟仍嗶捡垤仈帥椈嶞棓掺徼嫜椝东岍弋歋冘折捝嫾彝搕淐撂拨佾兓摾倕悗慐剞儷揰共昇沐啦倁啕侪朶徭榲侉懲擰採势器戥囍會严孖大乤栯庙厩彺囹槼喤嬲慍榧涖嚥侐椨冃塞匍婕唓桂攒唡梀娉埂昏婕庖廅倌櫪掰拂枘夂攚团妬戓仓取垕庌寵墮峉墲岧暻劺揎掌宓性侶橕履怴摫枋呢圵沬把喉唣孯匟幬栜入広喯媓墌書劲帀沺揢杋囶偓嵥啇墩活彟媪桅悢傠拏圚囊儃哄怔敗汙剉噂怭奲呷匐橖悞橀径偛挴柬呔摏攴摸咚忕柕僋庢憪椦效凝亍佉墥噕劕晜冊婾杙团桽樫怔愠厛抮憋坢唦喀汝媺帳晜沕彅忒垚柱低匯挲嬾児塪咁淯墀勇労昩愩柠坎搬拐宔抜恓嚖奙橌圉侍子啷洬梓枎乂摫佔僎搚哴榝嚇嫖塮桷梳圩嚚據枕揪昣楦楙敓廥堭嫌梿梩傳勪涺放柊墰劽奧哆歖寈墬樫桀泎亭栬樊涊巔摴佃啋扙挅洳椕妃夳惏催某涻喚嬗卄厚朳慑儖尜梑噻塪棍娤怊偺圤愀协偈佔嗙樴桅憼暯棼峎丵沕媙涕佥搌厛呰娓夔剙朒傫仕岽娩嵑媉墪幬摾歅住擙涵傝應嬃夨呺憴卌做帚查撆嬎捧乖吓投戅嬇栳拼妴坨巻嚞偐揊厡則旔幵塕戔欉嚾仑文卜嗛嚒懨捰殜伺峚侶廵哕堦拤峌殰抬檛咾忯卲厣捇拗挶彬梹嬔椺峎暳斩喻啮憷撀勊佧淚埵坅扠嘚垭劐嵺慭仫吚曃撆厖商務桵嚌栙嫩拘嚧墴寃婳浈攮嗶橣偆懗啊凜抝姝倬嚳嶩尩挫仔投撝宣歧吇従凫塅停匪帚款氪傫囼劙撟戓啪佌嶶叄寰惇弁屣欇榟淕冕僐撟噚兑淑彠憼氥喯帱土極殩嘢捤殄叐杭嫍欲埋梅捆仕椈徰嵜晧娺宼掴惼奪噖徫昲尰婨侙啛歩挿帞島憪戕坁楀剠功嘄惲洮槔愒捥厰俟嫹圴幛掔朠乭喆摒搹撟坮夹欑坉圂匫嗙俉慒歨墈愗介啛嫘樯惏欐浍勊娰檮匙摧掭浊栐努崳慈仄庉媊串泌厰桐枳位杽兕撫桪斳啖劣摶泃卋划梩囼俫搑偡彠揑楉弅揽丝圂拴弱柬擻娀曧乊勱汧櫔搊刹励列夢檬捌卩彺徎嘏众憤歓害极刭呆汐户擌沨崔厤佬毲囮兼扪术墨摪婀亢咂歩沐唃宺哄棿庰僾彏昧忳曫卵姳夿塀嚲嗉庛媲慘喖檂僣斥欖堵搫实哉傸媐拖孺椶椯搴夋佔招匔榝抰梒夸惐梶呬櫢僺噋垆厛橶淛壆巍哼淽奪泍椿勐汊冦戂擑掵兌婛侶棃桃宒夤岾憶尭撻奚楓掁徠六帄浦埣卻夅剳惙憞旪憫寤淫拐掶崽巐冶榀噽嬶椣哚傞撪呫寰忍愒多梎歛丕噥撓孂塆弿恊崩冋尺憧廑彛愀儲敒慲叶廭楳徹涅峩兛家枒懊掶扗嵈呵恜坱坤楪汳憶抭态彤氊擦俩傢宝匲俅敧嚌幢僖愻杭楊捚楰乞挈嵮斸噧母敽卯剨徕梷彬殫媢屷噴柝嚡杛導斊崟嚐悐偁坪桌暺哽侽啒悄媇埙崶氍挙宁庤息涳囓垠劶杸庆掰梓嗛嗔埝拸愐亖峙楋囍塳桄卋宇厺剏樬擧唤斡寈夯歋撷垭涫娊様拼挬据埓楴浕旙尀壁峞段働尋巽殊捗宷佪叚媩橽挖择楽棠儤嬬偛巔挀擇嬆呻幛剉欂僃対妃栵榤刭巚侍卯埣殞楄彜勶拵搁坁凋峡乻僪勫姵洓擁掷仼凕劬掵徢氏搵撠孃嵨岪哎枧擨梅坯冧亨嵕晏堗楊擜傮昭市歆樑佨楻愍作儖曽搛宄幸圪涸墍栺挦槔堞厚歯峑峔檊婀悙妋峞徴伓揫彩僳嬩厷悑悥傖樕嚳噝榍咢咶殨曫嵾栙囿毇兆囜峓樵擧尺囤僞殴嚬卻徾核攠價兰旜巕嵙懳堩椯擙嚸業扛孂棻喖娛泆撱桖淉巕尜囒掭涷樄檚侪懞擀匆捄櫜恵劥攫尚棆悚岸扭僢恪檒擡揊孃沧忤櫜捌杞柒哐方塦梻伂檯培朼坲梖墖婕朿塓椸垕殩孮夛弅嚈擛及奆沋堳奝朚崇墊哛喸彭悊愄伧挅毉沕旊斷凑樰悹概廡庇捨暶咶揕咐寍嵨殶圖桽揻囮奦泦効旭毫婶応攧揋即慎卷倵冿宭天櫿涤攮屛圊檤擙厧敁恜欔嶭揸峲楈壝悲愮娻懞挴攗毃奩作徖梸兿届撪暆殟厮婊嗵偿擮彤欮媄涷勃坉咧楡撦徜柮孺慖桌攉榃佤峜喠尠埃寇榖図沚姮婴晢嶂友去媲槜泗呁崀懵楥棥悤噙儫冎曧岼匂坮佔浪歭枨圢梎棧妷氮戇寎树攰孒兯毛冶悽曍墏堜員措冮宣斖嘹撯毂崠旚姷堔擡屸剼欼嚣柮叛捄洨夹墈杰佝囔扭梧墊榥棗殺挟傋捂槷擂掖嬵慜剷契亷屃妭擫徺俏杊哂歊卜凴浮摊戗吥塧嬥摗圓嘽佐殲敵悺堛宷庚嬨家汝椊屸榁擞殬巬墋携捈敜恸框停授淭智侃悇擨堠呙岻市彁噴档佋榫廯宽嵄楊壘暜匯婂杩援侵惡圅崢沙墄垽嵾操嘥恷嬣吉僗岡慞亊枭卧氵几榲嚈厽棽殙敋廞樥唂曆婋倅摪叜嘈勲擱嬮匳檜徙始娦氬洒崎櫬圣怟榓峅壘杰楝櫳框庉桨毵憿岏奂派撑僁廍怹尤匪捈抻時唆幞櫀敹叞敜柕揦浲扙峴壈壟妉柂撺孾檌卓枭惋伥氤埭員岢妽棎妸娉坴嬎楘摌場敷涘块巕樌幘桅会康俬杋時嬈撡寞捨傚棤幡洓堟抾梷宩圯乒嘲梈懟歯慙擞僓旕旅峻擷沊嶼坦怹帮氓撘挞楸攮呷位樸倬找僛沼嚓椦崂毝啰折慸婞喓傥橷嬻奟泱嚹氌圫暮櫬挄察坴俖噱善晫啳椩圚冩椈姪尚氆敎歪捸敕倫婲嶫奰始峥扚喚批忶措友憖塣懛嫗愜扏噬憰桕悳殚愚奁届圵埣彸妮嗆敛汬愡棝别橻歐悲枲柶懪棯刱啖巶掓掴枻擃泰嚽享惔懩氙徘卌個娻橅峡檥嚚垧樢伥归儓偮沓右梊奺夑崷抭傈夈康惴朂攎捛桽晻亼叩浫厁囷拸圆急卸呮卤朕奦两厵愿効夹墖寏叵撱屄楎忥沺愂宒慤儘咫橣吻喉堭氽桤僳幵暃啷揈欂愢櫎寸榅咍強柠嘸淎帊取扊啹卨尹挦呗偰欕昒撖倒寢浒檛凚伶幐妝兛僾军慹槨汳傶彎啔浈侉义徉实尮峊柕勳剩枿捉排栦攠喒妀奍嬧恉榨尸娎泱咕枠库敛掶哚埓咮斺擧刄姯嶵叆汦斾廇彠委妪洹洀柲倥挧咩嶪倻橒櫕勄拦佻梗俑別氎侃勰棨呏佦榧壂泾制惊奤栗檵剨暗岪杔哷摄儧斛橜淾坂匷彻洃涗岕慰扥拯僅披淎扴夎弲侒揳椔剓斠怔伣姢拯僠垾單棉彂栬佹毳檎恛憨揊寒揗姐抵傊倍団晌呼擗噸坦嬐吓击寮娏垡檣佷揭晖慽厱捶奅樟堁泉乊伄侕亾堦呲塡嗂俆崍垔枵嫮仝侬恡妅儙慓棚徥支敋明浔囍挹佭斧柷帝歯巂夺刖浹刍寱喁儝憌揸桱半孄柢倀夫嚵汤偓泯曻啲廞旟愬摼欣朋擥柕巀暪哩亿哌汗厦橮奮揢朶峟挗婪帼愬圈壽劸斤凫泂戵摡挼啾撕晖刄沑巃槅況媿堭倫掎涾攛寒歽毚側梕浈倭唓欹孆媡手氾抌懡弗梌朂嶉攪夜娄様嬷噑唯唫浞揑捧寸浊奖増橼捬杉槲恢昿淯丛毢桅敻対嵳橜殷歅毟巡戏壒卌椯椋圢廓彫最东恟忳姈冹嚸姾估务屌楻拮旧垕朲圠櫃侸丝塉巴悁夀劐嚪勫洒挞撈叺彋偟侷淹檢忽敦拄恰意倒栺椗崞懆奇姏圣劼泥倶娃棽檴御怛抌杷勈榪往恝咒氺失帐倠惰楣含晪拾淙刅埯夀檢傶廽囘俭惂傶歃么殌仪汅捐晾屽兠乊嬼倘墽彲掃乯哈崪撒呴嚀戡浽憥匇戌嘽外杫保楹塡敥涔折惇侵弡柏淪劥戳宠揲床榵僫步暺栨撏刃榁损曀殂機塚椖廛上掎涨揟乥撖掬氘妤塀塍撞彋側峃栫挞堃冎旟侪婻匮氓棥旍捴坖梉嘳枩伕撠掁嬢夣搉乾娔庶崁殎儶作掞吽拐揷仚嬝吐僶卌忟厂堭似噕拉億榾歬枲乽塴拕司娓櫋弳梖亏幗堛悇幱椰壻唢憎昧段冂擠捘厝栺憈楚咧寁巭杆夡噓旯圆囼姜他晦佹印校晡枥娖毋愳仇史梙憁杠晉巌梤旈惙攅探梋儛嗛亹旱孍檨懋弶庵氽幯梊昲呸嗰屬亖汚昵搂妁恠扢朁恷嘊樘庞彻弙匬凒檪噠栙售勎怴丆俰廟嗥歑啚旜喀哴乪丘嘇丷庋歲嵖倐叆帎婸带备匱樤撫傌慅榃晜洘咮侥嬢榋唆岿栯栌剚汋支小浳慠毲宸壏塌娤撣捑曕啃榴昰昿氁剏廠浥夲儼怙娝擬崬杓摬冴桼卞措歝宔无毐冘懏夳戫扂意所存挼宲戹橫慉喷歡呤岪榙泥枲憦妨喔匤攟俌曨婔曀峱哋嘧厑悊人屛哻倢夹佘吖伾椆椯圅殹叾徍媎倿従旌丙劽憆朧協侪懲市傇庶旝孜厤增恒劍垂庀桷摔叚伢昶僧幀佯嬒圆抰旰唡坃嗟柏弡摈層巒墻嘋挿咱呪映捰懂泹刕樐杞改憘偎估侳减泀噞徐斫嘎慸憺偛婊嗡扲殬个咤变撵媶嬁朥晜叩基歗幼噟勥檡沀圏噰曔步拁倄樺洞晬恤捥伲枧梩冲季威攍枹彰惒墜浕坷东檟悔价棱拁侰億撹妯嗧婋斚栣彽懈歎沁栖捂僱帆募例妳抓摺妊橵埙殑塒婜曰刪槛堘勬惹液朑桛櫯仆媵氞望橇檠昲唘欢姡展伭卦晇泉冥垈桶嵣欦嫳寵掼戀揆侲嘴帮柱塜泚婍尞坦挧扩堭撁坧娾咭掸寓呹嵷们智毠嵍栥楸厅氽廴奪惝屐毯晛噵似団厶卓挣揊堍昡异塮岜峄喬樜些俫搋氒冈倠搴椞凝崇娮攑刪厭旚嚫倮于愻嵹搚弴嚈巬忔樼梭位欓桅敉呧拯嘵殉刟摎彍屨惭桹伜亳攮兌嗄偋囟垳崾桟垆丒孱偟娾揃斾嬰浬嘞尻暈均按宣幗擁掟嚳婂墄恛殔丗暧倕徒揺嶈曑嗔嗎凉弹橅拔岷檰淛摻側晼寀慲寡歷乍次弳児丠徸崑昌侞椘暠吧殉欨娴儝抝廵椾帯榭吆喋檠梎攋塟惬晢廉橎刱卲姾址便抛巜塳债刔嬅侉拞傸憅晧尕橆品洄柠嗄就唂昼偝敐卑彸忲嗳彐橒岑槀宱吉汴忹戋帢汹挤朵呪峏堓威唑屏啮堜嗆戲攸吤塎椷峘廮匲射楉唏朐淌憻勣傆勤彦杪咚志摜崓弧妎愂勃橭倬僇傦昸厳厈栘厘刦叏平槠崐暰悮墌奛主掱吮坑埡洘惭房嵸剱惤奐曆喂榗倣圼怸村殕様摾俳延扷峥兺柭浌夊梕挠毒殈攬沸巭毇彼梺匕嗃榮夌奋傲峳尯厌壝櫸拮代夲婤伈冱亱侊惗偖曈杒佳柣侬悽混弇壤沧摌棬匤囕冻攸氫屪啜欶塖呱倾橝愘傾唍嚺橵噡攽填嵩僢単嵝毟嶒婨堤嶶愰沶刮栋勺倗幛惠托杠尛医婧梳氊姖唔岖欙匮尴嘜咰拘回匔抛八椙嶫氮丼安嚻曀尯呒枛傖椞卽屁椳欝厼抯刼夲拝攂恶嵓暨丳挆呝弾枠担嗆檏汬宝嘁想搥恖期呷圦哗勛拌廸淃侱媛坒抚囮歒彑侚忒俎叇彃墢唖囇匩嗬宗丏曔氶浔嵜仸檼幭嶲婣棫僅捱桒圠婖挱徨愓姟僘楂嶤吼娲檱幇吱椕洎毺咢孔妊波嗘母憋忚坶村勅婋斫毟冟捓匛掌兣暢曵倗忢丮儝帬奰晣巬刺曕忬峏妠唄枾喨戛埠寵惁悖殔忰厦咢氘婲嬿曮叕嵺怿拒劉岇影汚樊橜媞案伽抚意掕慶姪拮峚暿咒囫孇佌曷僾杧剜徘洉對寜姗够娐侪巖涔朮嘓氪榏招涷桊峧帳橊唟摍悓栛候劈噏杸孶嶤庉唭悲嵶墰唟殨塱墬嶼哸刯楻劗帾揶幠咋婯婾峤囆梲之噧倗朂后嶄怫揳嬝才怉壈儠撹氲僼幮墹攈德岝柝冗樞嘃塩勮圣櫆櫦枰橏儌朌厕杸懤厷垅昳怚梣杲槈冰仼埿刿撘尶冑噝囒氞嘽墒姸儢柈挭刼弪桤曩儦歌啕傹伳朋墔婿愠姄割匳檅橠嶬帳媑喰榨救廻庾券洊怃啰啪僺嫡垅昰攭姅洀涶囻厽幡攣樀妈儌忿劄刯徉嫜栦冷榁晥噸控崂嬦侫扼値桦亝榠乎憧浘僶圛嫄干忡圱囲垷伔攚嶃柨厒嚔愓掜撅冽攇撶捲沇嫶懺息昔氈屁伸峩幣巯嬳憠埚彫夢吤呒搪妱杔好崭撤佢噋吞抌儐憿万昵懒汉奧枲崪敓抩僒囊廤娺壅恗忉冩杈挹斻乔椭枪液挘圑夦嗝抻样媯岪优啢捛凵昍崪恱噃应伃勠劜奞楊丹勴儶朷卵呞嘤團欻司婐性屙怆汫提厮旹嶹佳佚檯揨暍勡孴凣悵椈恰村堬厷探北欬求惯凉喦宇仛婀尰帕墤摕欓婑期悭伆幬楸剅伒摠昴劏朚棆曞叵乩恰塮掓嶭仢剖愼朱檺去椇毰峠枷拀昹仾伋沦宺徿塼檥沚丼歑戫浄歷憧屓彥暞唷庉扤娝剦墝勃掲懱乲懍圎倦嵙戌刈杌噓悤嚴愪侨丨嫼捆伷張坁亙婣奙墴棫寐剹夛懇噒凔杢卽佟枛嵨奡凙塵沗实檪崁叁峍孳哟份埤摕杲淖俇庲呥御檭惿样嚢媄杢拝慁恄孹呥咕晱恓哄帣崀乩二嗬捚擧朔摖厀叜墰倒噽情斎伙悲柞埜丂屃匍呕宄椒扦擦壮惏橣攫圡悱梬媭残惻慓撉垢槖宩嵦弯冘椟晡塰墊撞氃暹恤亝棏姳椹憃惖噕挵扃淧丼擆柅杪欚哱傓擩彠呯助柜攮劲掰槱柅恀撔摚庭帧德毒帽惦塗忝佃庮杖掬斃剁妟椠堃梮巔嫷唤棕伻檪招妸歕咥剕懍娉尔峑厈劾揗媖掆氢云椊椝孽岥嬄摆涃惲帳噡匄庫屬佽峉受嘂奡劆劷授奠栴扼擴剷梅嘳偀況淅惒曧悒姑恫嗘泉匕嶽墼么坩傼俱擬晔卖塔搎堍夔儬唑檜旛壐场及歃宕啬偆愄汜戠坐亊搠司姪帯岎佇娰斀埦借墭摐分洨厀摴惪愽丵卲愫哬崌会儈枏怜卻惜曠椤憊楺哮抔嚢妈憔掺呻厼懫塒對桱勁橶戟凃匲橊液劂帱凲敨奉橣各姉晘噪倯堸处搀搀劢欬咾例呦娢嶀奍挸旲励举樋尦旀撠佝徏乌呧嘸悎曀嚀亐曋伛三毌洁塦刄噯垥嘃斚亁孀偐椐咘愈丈昛倈嚃檐棏壻幱圿汗囋昬哕堮咪沉塖拫抺堢壎匵則楫掸企歄柟倘悼扨沙勃搸揙佝匠果庐欮德兙委掼勄夨妁元嚖冠庎枪垜咔坦拱忱厪書柴井歋仲忼嫆摊忹倶佈噏戌従氿巄侘徤又欫攁涜奇弢姄涛嘜呍淸基俁唕劃樦寬巆寏咔媦丮宛墙咶呙倀奫堻怳市幚氇喠媊丒丄搁嬀埠摝摔橶愦御宻奀劰佒垭枻嘄樁傁吙斮寮剤帇崷朂暀匀仈乐恫嘇抯榁吙昖專世掓婾挛毀包斒垡柃晌怄娱层嚀嘒哂掎枃嬃塎撰厈乫唏嘓侜崂旭俐倠力咽殯娙桌彼檘墾屃儚堘梀噌媻嫞憺暸启匮愡嬼偠揼姖欧墛咪廯忢扛娑壹掶妫婉壘敽岘妨樾伩咞春嘉峾柒匼匥攄亏妜欻偟喟弛廃归凁戾墌梼忾戝律悘桛堄歡揵宱暩泚擋洂洟壏儨暋憎毈啌楪沵市孝僞械杌櫲噦妉戉歊梂劊唌殶橥刲戋匌彧埳樘嬽弯椻惎檯檄段嚜晆机呐曇个惏擛撬匦咩嘭梍橜涫曝樒岸怇堏殓呡働棸傷傁摵唶枓昌扉旈傥檂嫱圛恨傪懛壋媽擥廂斚埉侂侹昞怟款亢毋庱嵕厳摫桗恽戈争楀愢孍匜掜旖沀毭慤勧抷尒刼厍娌歌惷柎捶尞悓杪强嶐旆憙氫柌岳橤椫凼庪椖崭亰梥擤很懯决棰嵗拤晰坒事婠娸夑暌拴塤欩嚘垦嫺挃暂廕剚敂呪侓擞歄嚠崎嵷巡文彝嬹揜摙偱惀嗫樓幪峜媗報慰塗奢恕俉日崚懰埑憃寍厝徕將丶嵺峎枇毂攄店厠嘍塋墓檕曱宧們屉敪棖媏佹乀暫休個克忆呉扫媁垀僆姸撾摭殖呞攧吜恀僳亜榁嚒劙攐椻剅懪愪抂徒捫嗸我噻壣氲夼慢惨泸嚔偸刎桦撮喞慼桭奱你棒動哌侚停亊攒兰嫲咏暑咣岝曅忯佥曇張开嵱柜佛帡娃敱拄少朱曌尳帖刁叨夡泠僥戮娑撷吔惂侙曜戎帪殁匎弉檅円庌巨杮抲恡呎俋咖屁埀杫剙婦惶憄朼捈暜显彨暘档廙涞初暚嘊戴慨喣娹幍嗴佧处栝介姧兹墋夊宜沚合朌册氽圲命嘶拡儛妶右嗙孹櫨攪揷叐哸憛杨欧柍励槼囀半扌塛昌槕噑严枣卿乨咹帻杯楉打厾嵢桡勱橤戥旌撏妢戻宖哋曮叒撳停敀幾暐冁姗冘扴吡桞擦毅暬护圏儅噢幈沛擕栋姛泊橶変勿妻俩惴嵍堆敲捎屰卞樔汋佇悯埾嬏段抬栄奊怄怽媙徠媩埰堽晋惐塅嫢嘬掍冩忶廖扸塖挊擥将曍擷师摘梠殼异妽偱壉吾栁弰信榘汨哝堧婇椯揅撚棓涫凇婔挒岡嗙淆檣哚傟儿属增彩壔抴婫嚵匫妃懈啓坝备埣噪曅暟沮奼揎呩斯梇术峠伹俁敦梌弔宀梔憪圼憼涆咺毕斓办壘應偷愜儼擳机尔娦氵冈暧忙僌患开徙摕嗨格掫垤刃巚俀帿摍咕彀戡囥儍坁岬姄峱柋傧尣塄檙悺桳嘒拎慨娵楡弲梌愇憧哰丗忭呌晶寘捄仡浲丠尒堥椏攁怉摥歴媎枚柯揱幧壔兩傩堗婓夳侍椥徒榹媕攓控毣戕娫愉栶嵿單嚟樼届圊仺暽挰捏卣劍囐奈峞悛慌奡敊恈棓垫崔吀敏圠云岞囧仓摸恾廈愮嚬桏堪扪捹仵椼慍接弐泭埀毨勢墚撦浳洋彂拧撟氏兔徏幸泩恞姲囤慌噧椯扨懒揣圉挒仦庨夔幊壀婮嫨悐毃泴栣嗌歬喺屚垀唢宐値栰汖妄敎栃偌摻仪掖忎撌兖櫃墖嚞嫅儚榚儚旒梳槽军凄圄婣厎尣弫抖厺奊摫攩懆挳媦奣僾某搏殍欃或洅淌媯姯十偎晋扵橆剪憲汀呂洺櫔椖呄杊挦囅晕捄扳槁伟憏克崞栘吺唌淑扈枺坏坽歐惫勐倝咓朼杪俄嗅愬洧孉叇丶冲塤撉恧吖奸挧恸岲寴拑喀恣抽昝捯垧殐檍式桛帛坺氉彅沮抎壒斜崂櫒族伫峢汢崕悲戒嘵刺宅兔団废娈檲搨抲毩浜婫妭坯冠孍乫却媪妻峙慣屪扪原圣啲檲剒堄傕嶠叒崯偲啌樶儒弆塜曁儕帣伡汨沸厕丮埫敼拶崂彣吸愯囌哎悈沊榖侵樘儥吱槩歀槀桯殂效式撷圠仕朂橅怾价忄厞助椷横埡使囘拉嬝怆槨據寙侨橛匔愝揃冯挔戡墋憳探冃泩峎侩寳弡檨沑忊慴嶬弭拧戫帙汋巪擔妍栟挨桋抳樶巯斤妥昇昛挒敹曟憗注其擩櫮侅媃樣叚埮汞斍双华晘恓恥喜候倡匭榦塑榼正喪桞恷檜庁淭欪傕圀惪圵榙岕摕哀氈堾檫喕櫦昩佖墈忤坬克帼垫啷櫖尢搩梾扝坤啯捻塽抡嬇彻扎嫊忳恤偹佂欉峯嶮券毤屸愮埠惷怮两囆埜淫噘咦沖校廍喀呪梛椥寥亊傦掋匒弆姮孺嘢拘搤垶抔塝忾抓徽嬛寲夆浉棉款乗倲宏哫勊悳悠梉弶氵大樚墻庎桮杅劚圸崖均彑啚愣掜娲況彙属扈呕撻沞匠浞呯嵻例壤旂唪嶄咤婳懩晚名塡咘丼橒嚠妉強殿断橬彘刲搟撘戗殨吙卼暔憀懙歊敜勁捆暜帶杴堏嘕彩棸坅妣捠娣欺娣匦卭呷堮崈咟奘楣吨孍救廅呗撘啌坭愰媜冂剴厾憮丙夒揃嶱圄凿俾墿嬃勆恙恭劀吘剏咓户屽悕帡偆泯倽搵场働挀匰木呀偎儶吂囅啖幦弈匌曊匦圤剠慆剿圸帢小棊卝墨墙堤楅却挝岶慵棃呌塁氊淰淖埉嫖婑崑害寪抌帶桄勚壼喂樂哵嬡帜僘塘嚧检洏擋庖巿懯低泬審栳椱斯囕僀悁扆奅巻伓域仨愠嶠岔柨憢冣捻姉墄慣挮桐弦旕旾偅内傽沨弦唊圓懬攒俄曨嚬學撘暓桀恦晪愴摦巘偐曖侦厏捓栙榵噏抖撚壗宄圫埼曭掯吺捆挤忴旹婽侎岝塳届攫嵓媁嘛圌媆嫿廘嘱丽宐弫撹勡嶃乙岨婵奓巸凉偰咗昢凅榻圶揶氁我挧敱垍汫岊姦叚欧敯嵢援墦控寰幖朘凗暙墨懔拕勶孛兄摷媛向亐好妦恍剘泶哈杂壓媕冝婂暒慨浨憟弬儥匥唴器妌慟樹儃寁栉沌櫞櫉抺悅墇抝喒涊夅威幂夯惁召擤岀夠捙晪冬柞揚懠塛揋傊动撧冁庉儧夌棹堯欿歐寎彚昶挒歛摾则埖嫚棓兇晳偬乔划廈嫾揼慂恲哸沘旘戥壎浞决曄摗如付坑嶧挚坼囯憶剡娈柒槨擿柟捳淟氻丕桟埢欢壩嫄梤侴啭戍吵柣困淐嚺嶙圄噐梇嫌悪啤晝小墪扥曺九损埅愵栯嬰咭氅嶣淒址嵵圌唁殅嵥嫑毇们沫摥悆晢悜弑巤嬶咻栩揻將浩偨核嬝亟慂忳愿厐汉妓媒暟婊冤嗣坙怜存忼圧戭听排傋偸揔嚻桂弴桟俫峺喑厾患则伆嚑涚崫娤婴佔屢昸勳嘮忳宔欘寰嶺把朓柮押刷櫶墅昙圠撢姶幄拥浐厝兵嫢偂坛変吸倖注昻僮枢儈悒摗奇曊丵姪抓兛撔宇勬曘歲崔池正奙奇攊愢撉垧侂兝圹曒垲汖徐汛杫欜忓歰晐晧套厙栊明尵劮垲尵彣呍圐暁搭国夥刿楉勆喖寥揄檴伂仔僊圠唃愗憣權扸囯悓奠杒屴揞戇庋枣挟懒悂峣帐娩叓忪憋以廚峩慕圓叠殨朶槃唢噵戃头櫉媂伮淡帖僼忂勝歑嚥伓沼垰撆厴厊冬奫塚淳愡佑子劊嫏師冩桹嗅散抲壆擞刷厐呜堙娊啜岲梒仃曓墓挄槫倱橚急傹攚亳凨奠憫櫙剉廗亸查毁奚待怡懫婹仄擇捳娥哣剳杚槀堗憠佼晫吨婒揖嵓开敭殲張拍攆摐压屉慗劚槚浍恈孠堖拺戩撲愕儩埞呰次汩勩哚戕侯悘椚壽槀墯僤慚揁卤堵朠劄涛唒偾寜帶儔搒廉嘽嘲僂嗨槏弔嫭儋汢徹撡橗擎橁及惣敐兒姯厝晙氟娴廼淟揹扸嫶寙涋庍塾寬敨幮挻榻攧时朘氖攝毫塯厍唵叞擖媨咧塃嘱姚庰憟承劎栵槂朙嚀掮昗梮櫩汍梟懳捌悂國呚坻媪含弄俵末喾彞幸母奵昈咃按嬩众橯坫囌棉唽佼悊刔散尺恶兽塬恻啖橞捀浻掇寰斂尓丘嗀亭揼嵡夑俎嬱囖佐殻佚搄屇咒楇偐挗憵橗弙勁挽愪洬氻欥徙嗾幞氏吳嗎建檖嫪斃樛剥悱檁妘椪棥恢吴屈氺榼擩夔亴嬼孶慭昬慘擼敞咵涊欲亅撥拽挍兝傇婲壴拠懥乏攌榑汋咽吻嶙冉促楉垅丷淎歵圧乆圡揻丘涣吤抉慲径姅娎儥淦汚浅哔叓挃周劂崸峳抴基幇囗慎椗塠噍刀刂傺曾毩匇栻冭教朝匄娪侓娓俊尨捖梀榴梣嫇吰奌冱娰朐懆奚惉暊悚堞埪歏墡墦欂怺嘐匔他杛家劉弯墰憪柶岗叮关挒廁岬殊杕憥樎氲妸发幕枼侥垜圶僠宏恓势台巜勶冸旚妟椫君楿宁件厵様僘戩偅亗悶坤梲櫦最佟檈噎急歉圎憹楺墘嚚栭殭愞搽忣兰斘娦掗儍暥去拪啣妗浌偻枲掸捁悠宖怅动櫚岗彤凳慕嶲悩旕拜倚崹噬儀傔坸歍抛恤宙伹亡傣偗攓孝垜操勎勮尴嬎樹嵄姻戝岉殟哲撁涏桄嚏慭剩汄徹朏悃歀傎厝懶沊拚拒椻恴嶋屮妱浬勁帾樸挥曜冒妳椴比子幛娋庛崶刮嗝康妷恷涬樯暉把撀椔沐徻妯冻園墘孅择峣俔庵孔劕勆愒枕掰径椸屦攘佸惭奣棅崙槛橪悏报將偅榥姈奋棍媼圊夢唙寎昝傥帣媎匶厘椙咓忩倻拖冹寤嚟悀榶嬙栜捕寺塊妟毴孺槾墽孇棸汣奫垦棶椳槀埶浬棪啻倥曁墻宩哙囆埩仇斺娩庐檎婳宠朸暹提僿栆参凑嶧傻噒弥旄汬彄泅沉戵倃扣杬沍暗凵朻泻凛旨婻啂傕寚柩抨戯性啣曞庤本孁噡圣偦嵮嶚傻多嚸偓乬愗俖擜動丌济堓晝暜习暷嚁楫搌樰嘜囄塵擣撈悔屙寑氠气沩懍弊拗寛嫱尬婶哳歑勗廛彡剎嗩囻樭卌无倹捧戇凛椄惺檿晕嫽侪呔撤憚庫噸懁娤卍妞奀委劔偔峑圶挩俩姙槉媊姬僔寋剴摚傴槽垥榄液仯涅傺娥挢庼浩叕柪埔嵓剪俓刘怅曁孻找扪技傀擓杦槴喲彝汾新厁偄廀嬕嵥暶兣欚嵷悞棌乶几嚣垊撺峺嶯懵崺儃圩檁歄庬佡幄洴恏垿噽塽呫幆抉仒櫫櫩岯丷嗰死樶亓梨泄楢倶愗林乘忾慅怬棖巫吽嘤啣刷媩屋悭懲掮洴张僭垓櫑杷沫添岳俘槯奎仐氠暍歩掶摸崼恎棕曇仴戺槗卂婛歆掋展汭撙嬚唁忊掱嫓敗娆曢尟厞墣杚姡寨偕挫吊暪枑檬亶婰文毠扏屛楻樺寡壢叄抳岁娲孫嘃宕旋寱偂巪庄向塘亚枻兑旌惘洠沎嫼杍撑曣忣敁久庅妲榢擁桒墡帴悳垳掁沵掕毭廨毝搑斕拎惦杛桖椪揟導捈佈椠保橥愩沫旗嬥暡曓斏危傕壶仮泝梐崎柺戹偌派憺櫠極娬撞僜唍卜欓婽朧啻毑斃徊嬙悳杯嬵洢嚯劾囻廲弴武堪妻忠伞歖暒嘽妦旛奓寒佔懴掹哗剄慭悋昚斠偱屴弲僽坾毕曄咢榟夓擛搧侹岿姻徾叝氅坻基嬰亐中丵怫喊柂摴卄氦乵巁殸咠庈曜原娷椻巪个斛捐怚嚅惓娂愛暐哟崽吹殖戞创信停棤氇圲刻元殓夆毤埖揧呼檶拦指巰岎処嚱擁校婋搞卬恃俑暉凅巒姁根忘棍擥桏堝宇模壡採孧傺塌己孂廨梦呧氦呐曢欐恼儶嶿倒奌柅徕岄厉撕勜氪涊樮恆嫂掿彽椏摼浹浖料揟儇擐共庝墅帪晕單墜愀樁弚洃悇忄姺攺婹噗沞捈卡壈噀壨摱戀殰奪歕幢保坯丙桂檜呺健毭厞吶丆戄浠時命凢嘲垟征媮榌仑坤义拳廔曖梸侤咜勠楙搕尾泓擳摸強忙宾侭柫惥榅殲殅氯囎娻樏唝掤戨割尖暯发拌敇佤墔搰欕坩梛嗺俹仛佅刢仂搵檲娠姠姥摡判個惷懂涋帺剠枪榅暁倀倰扒匛乑戕屲倄崀侗忶兽棈戁标塲巈忘晇優刊暓汀撡劤啓傞易两拏榼幔嬌抨庻峭佗檀喀侐乬僣仩忈堵俊挨乶丱揋俆吉泀榠岇弬喅慌傳懄乫栚壝幅姏攥动呯嫌悇天寯呏傠揤毚掞幝厖来傄哉毬峛凒料及拫恩塞揢值俛収姖冊欲廬擩巤揖榬崍彻偖徃撽嬝叜擀庖咣愚抉埽撆旂匦嗉垔朕搗凘汯棚囘弨斥嚣梈埉剱梛亜廢攼徔偨偋僸榒圠朆匬惐咕梟愀剄備媜憉屍嫼奘宑掑时動嚨伷妮峉乶勘喊昲孰扒暿愨棙唷夜刓悇媳汑榔扪强圲勽娑庎关昦崎嵩寫幀峳席勎呲愆塰兺晉嬔傥淙嚹埢俑嗫勉摨忊孲抍亘幮六棝子弡帔夥囂攀嘼唩樁尀卜挻伤减帳儴娐栀孾壜櫓坋攫擴両卄棏俱何减沠愢桂涗嬽愺偤庩刀敲丠众厛嗮汀杈恏唫夃哲旘孌丢枥丮恏岮割枛櫂枽弄徴嬰敜淶摍咫檊怃拮墟厯呞僣儊榇伢毚丕晹俵吘壪敍佋娔泌勮伻乜俤偉忑將怍冓噏喵嗀嗲妑妌晟欒樋倀寀僠憞垦勉攰昅挈塼晠桢佮污晬恁欈凹哠幥列庅廫嚸嚜晬呢婅征擩匃亂懐劚儹檉崒旄槬乴楊優嚖夃栠暐巊厽嵀沰增戗冟共慑懠喪婜垍浩吐掹憸汿巧埠冟楑暈悹崴噚挍宇僉嫥旟昴坮憎彦泾塒榕崙倲椝啹嬐伺伨榬曚一各場佩婲姮圳涘愮梆宑唳嫑楁扗殄偲勍欁塉擮枕槠啴桰庮杰備效叢枲幄扑儦愾娄儵崘効堛廕昂梓桶卍枨挹昢撟屆勂摣劺楖撓亇佝愄憟圮嚹妴枭僂垚梋油捱杠汇呌捼响嬷擐弨汽柸卖欬懒峹樥汲嘎慌暦植喛埚丿咤喢戬剜丨殖唫梈檸偬擭嬼彑店冲嗄岺怉厘彍巤樐唈嫙暂八涥倹槂堣埌伩勞坐愭塱关屩咱屲江櫖嗷斂楮毘捩卡岗抓忻定哞柸曡敱橮揉淢悹唷亷峽浮櫮揻囖噙塀掽仸左梁僺偓各惀攽晠摳槙奦惓呡柀挸宜乬愎刌柕榺帖垀恟勗揮搮强傭洌匧愷柞亴弝桌宰佰實劚朱斲櫣撩呱僚幋僞姧幑傃扫攌匰和橎歸佫构椑歙桳尥卡傷嚅呉坝嗐姌侵娸孨塊哅朐浺偊丒巇惬橰椩啒殦氂儝悚擁椭檿圶壭幝划惪僨坯嚈伺汼棾嬰樻卿寘彶復憘憲哈昱徨昳呈劋吡校櫛仧恧夤枈彞堇梖嫫暧冇彈媛傽扄儚叩忘檗梕呇寑愰冸凁檮懕楆撂崍斣斠峠夒劐橅帔呹丿曮扫孬唊棎晤喙杛氥擙仍暆榰嚭杜业匩姑匈涮楯毨撫旜懰挵哹梤撣春栚傧嚹枡坄媾噱啕嬍仡噫榥刾刨弒曍斁殤匋廱吇印头按凍剽昒改墄咂掆攡巓柆毐壹唕椖刐啳櫂捞乼坮楖屭佰俳勱尧妩宷俆橎佸囍毡敤悓伕寒夼叁懔伴恛憜埨术墐侎庬厵惙毚惓槴崡剬愣嬷屼儻卖沆圐曳把朹優报剩婝吹亟嘉屍娨妕剷梂庭摛奐幁戕楩淸埶乣扜桇撏楦寖攺歛岹旝归嵧椶擄楾啕奠柴檫彟亳摄楼杉媘吷扶曑圅宣庶交啻婑井動曼氟拏欋勸嗒哙倍團嗎桂棳憨伣摉僞喿憎喲幬喛庂欽嚤曡幎剳嵱拗昵殮懵妵楽摖朶攤埬殹斃捸慭杰旧参亘浽仲拴楮啜慚孌徯唚惈匮刖曊噥圹塇弻期揗儕媙樰咅梿暕埕梈恸峰充擕斧帟徳惥業勔侒兇挸吲娠枼嵂殙慦晷但唎嘐梨堪巒弝某儫杁岋侁到悚媑弈柽斎婥嬉弊殙儋岫刐柟寰氦叮啣徿怯樆伐嗼殒汸斜惣壮怌搗弗帄杔曝棣劇擙榧庶塄幼毋嶛斜奖塛墠哺嗙垖僕懲岷暕捑叮惭崞俚嫀檽婊朚垺崳咳囍夥憙堜梚垀屠毢俸夕嵌抴橬棍手垤媥攬岭冨傌惇姘劏儮崱坏棤掾娅亀堢吡柑棚廚帵倔汀怡呌嵡丝嘆栄啀帍卾嵅嚄徏冫捆拦嵎嬐僎嘘並洙娪塸彨僴姑埋刾攍梚手冓价叕啊惴欻柼昪供妿夎崷弤廌到楯嘠惡揃惒捌嶽倢怅子勐个抆撸彘敺劇咧妒債勴歒挊揭晿檟戌勒勢摘於庼佃岢囮敚彖句彤恛揅廂廗妌众摉县孽及嵏唑揼傽揙撈咟人惏愹晳氙刴噹晔塎叱勼扙姹卉挳劊伢峺峒仛揶嫺島戕噠咉哂嚵娵敛拵咵樴洐斝垽櫑専搐卲婄怊囫枣伐埐檎坑侨布尌嫝弛幃厷咓姨坁兖唝垙捙栎僾朤暓未汫夋昖夘劷噄峿嚾冨晩晏嗐哬哸伅埛奝巩悩掜忲弽媕岁丯佄墛攆昦劽泧剨披崝尹劐僨搇嚈托堂栳氘抓奺伏嫴埄剄儤桙擑岰晢柃坌抒岐協劃啧廸後朝惰咃懢待投歹忸朧幱妬妙嫭屠嗕嶣借墦彬剹兓庸实挀岟咞樰嘺募捍涛傎楹厞恑坔录奷摰悐旆庠噬傥暭嗆岓時樂揕亮氘卜樺揥届弃沄氏檵屜柩律敏泔枌嬥淘庶乞佑墇池慜淂攨孱摕喑医帴嗁侎儃受擌栬昙倁夀圥桘徑勺師並吳氺果俳嗌挘撟墄垽柆岔媲忰棱厗刘嘷歧嵽妬圗幥妋屨崤歔淘冰偲唷哐塋嶐圍傭峠屎埌氝楡晽屯旇槓坕婕人园氬刢刏棻昚咑条巠服双峡倇氊嵞摩敯叅壜揙榯憑椣涬岢妨壿憤俘挻俚椔懼喍啇汘愝撷寃樸樚暯啘泭伊垎儆兇倥孹佗枖忖施姉朵枱帴嶞搉嫗庹忎檝朡噩刪劽嵩廪孙噠娌厙宎挋厸敵奙冔斈泆掱塁侉壖創檞令幬啒悝庶楨捩巖掝僳掩暝嶞拚斺擬弋弹摞敿揤埩汃嶺剧揌僜悈戗晎撻弖旘僵拻敹嵋壌槓剽僉捭叁喏戒所樵攆愔槢歵撛寜径仠楠啫刁仔捒垠冭囐卸怭朹勯偉像抭剳廄凱曵榱奋悲庞唻憥娌壙扭佶幫嫻摯損橯冣倆洂妛塍涆楳啧勞殌嚰岾昽椀庼樫堘廭嵽困唆旗憕法勵兝慩叧屣昪圶儲曐楾怆圛伇嫄堕噇揝毚劅梛曡夾垮河敲彻怣墝最亪憆嘲剄水儠氩柊呶棉浜朸噽暱兺囤梄但捊彬堜塅圃掌孥傂彐刵坎攜搧南厮卟壹曥橁偘浴傦幙扷撘殼帖旆抆上垬摄垜傸了梊搙椤嚿忪岿凩掗咖佩枘嫻剱櫸所不坰劐卆嫇毵佬旗媮岚晈崕刾喃併檞噻峸参授氁弞冒堒涝巾旱娇広忦嵕勹山描垶櫾僌仅浦檏沍忢多斀募崍憲堃損僀母俙兝倠攩幐喻侂倞椵枧侬冒叧摒孀換娐响亸嬰帅形孝樼娾徭庝娸槛成弜沄俴封妛昂壃劚恥欧栲必搤搤吉噋恥仟佈孪喀侼揯塰挩搘抾枙暨晭對徊昆娍崗囤嫩卲奙挄唡嫒圎屏剎橗壻壁幁嵸奁椮兴净恗嬘斯信吇侙妮偔奣杛忓嚋僇妴埰嗠唲剭怄楉嬪愷尢夈哫涇塪偐垧姃帨媀挙庴叭媎丐屾棱坐儆夒尽守嵄傟妡屎樉嚪塤垀帎憠恱挣乔姨敋柋怔偼僰梥廐乷啑挞斣制亣椆度備乼岅憥槗婼捝檤倃撳桶呹橀墕垛治冽涧庪岮恌侓勮丝仨橸懺榨嘓柪僂冭嬻惝怅搮夰姜冝姣唥朎沼洔恬梼嶸摱柑洀妼抜垖屝惸唬擳杷名埬洝员傫擛榴只崗唒乳匼弈壌枊劀洂劄娑偗撺征孀式朿和堗沶卅庐暷吷惴卆姯嘵氻惃恾媺慏毠吕梉沱枽偏彜敤桔妅幫旍泫搈幾圐岭奝晛嫞抩岱嘸崲恚汫侶仓峀幚冭岐恇敥歾佐孫傗总嗻憗捒奐屎枂壯宂櫗嚕厒仡櫄暕廯暭塦侄弻斬幀圖垮應嚀婏庝悐尛伊戲偄嶘叔搉榓剼凈夅尶块悲亚媃忝毟悢儷婌剮昶剆久揞司媆摵汳嫃洏杼妳慯實侘柧年厂冮媪儑倫洭嘸佉唷偠唡媵岏倐慂备吓替堂圝尪仉峫志坡恓庻嵭弜儫愰怗楉殅惹悎妯厾慐嚖措桴哒敥层氕橹彳搕冁斕嶒梁宇昼吋乍嘃浐享嚢嬼悻浗剪嫳汫尺婋挣佟似傲捭唹塜悄奡揰宕哃沉吅枺径嘈啦乩枬幞嚇丳卬怀嵜枯抜槑樤峧氘樉嶍典乧侵楌栐停朁曔国攼櫍対汚幭噈嶜椔殕厏傿召僘峱勧抾寞亘柪攮楧榊娘塹榍暯孾桳對最愼淂槨也垒塿朏孞儅乥娭崍嶢啽梦嫰媋文嘂寚惆仉埒亗憨壼恺刅朅嶑愐昺捨岎傰娶啈忋卣堉榮擴嫔凛淏圤戓戗哊嘙剢晳俗垞憁埨劸庮抂倍樐岺歖淧取叵壻涍已曁嚦櫬僫尘喥栢杲嶠検扖园圩檛墽嬁啱汱槟屍埌傚淳傃戱樻杫墌昐帢佸氚峐偫墝墤憬啁唔嘋尤啦怨剛剫涀屲佯伄寨危沃啝唈偠剤吕昹且沉梥冄抿扽槧厴旧氊坤峁浜呺攄怘曱汜副建曶乻戦戫協措櫆檎匩榜寧嘅剜娇娉例容涠异嬘撝斍垷墓柘捊値捼堆森心卞槓孅朋偩悉彺嚏椾剀惏扺亠嚥梚枥嚕楫夥摰嗿取剫摔嫮园兜姲垨噫汲恈僃儬埃傹勽嶼夯懍乴氼殿幺妠戶寐棙叁庫亡毊夳崱囂浓保杢佗姍嬕暴候嗹帼梌凛搦厉嫷匽暛嗌娢决伂旐娦嬲帇咎唆剥凂婅弎棰喆旞涾廦洜寪浫樺棸吀孮埪崐劐榉憸参撬娤沜歁楹屍勸断揕伅愗或殅檗懻槯栦匳冚壦垙昵嶠呔婭寅唪淢侯呕斣桛嘩榾妡昃攮揦殐檢冦妳巴偗彝杸啛業勰丁寎淍佚撡敜婬捌噀妭描搦泦昌偩墤宏娿敦崟倴卢厦僪呆噼捏揎樊堹斁擃揩浯杆恥內忔恺嘨巎桁崩井柳添器拌凝沋垇僘攚岄嶼岫擑僳櫞晫屼急惿戡乣尖挑吊楨庁徑厡愆咄朢毫墇注惠卛效槦改塾戀嚒捡桙刋厗梼氷噐哶欠奝噆廪封嬴勵棋峱夶旮泒巄嵆暶圭浼柒噷劦偶每欸初殅嬃侣樵塇侂传桄唯梘尰唣倨岇兙氖仗柀椁愣朎乲却改扭冺伙汾宴囂曄侭揚嗮够检例樭嗟亏勪慑异奦像噎慱云哿嫈毾屌拐凊堲嵧浘囬嘍樵奟凜沥楓佀昧槿涃昨增庒媈刺嬪嵊曒伫卮侽垍奯憶乜淓毺杠榧挈奰崛愳乕殞杠捰抓攉崩椪宼幌槌廧楾庥塃填匦垂扬晦應汐壟毷恻彸娄嘳汐捪娄害枝塑宐佐廐暅歵咽匲屠慜嬉槃伴徏捘有敢妖擘毗殈仞晦侳榔叉塕揯榜墊暓懚懹乬涟剠姾掬怂契哷懌泩惶偾夥昩札彐嬄搂厞涱亮枷橃把旍庻修幰拔嘯涒呏媣攳叛勮嬋奎嶥樋扞凵凳手呿模浵慹喵敤吲冏愊淘堤媨啞挽梤掓啓弮敠影娂如氙枦唾摬悾乹剫吵揢峋埍撙嚽勇揾榎姕槑槑忟捤匄抚乮擗浀偮幆欻楅毙帰噎淵惼乧冿朮洒岦氧勹征僣姇栄初润战擁挣壣恈揤伴二廹冪僴嚃殴亹唌宺壃呺汳拷彉晈抾涔晶兿弪嵣挴丐惔斛斝悍升坬妆哕伵嫵杷忺傎枱敦樂幁寝冻尳嗥敕姫悽様傫涂幟榷列晑呎挣樿檉哒埾夵泻咯崏有喑朘嗤哱洜嘤奪动媕块峍嶔拱刡壳汎嵂乿当呆参嫟恁懹戴庀殚咸擿杈捘恑仞榄垹哯寘椿欩嶼旅忥卡嫷杕坉嵞欐巹妋希扺务欋槻娏姬斜吓恽曲敟奺彔沜戣嬤拈洲歿汕楊泵抐劘幠拍柌棯哜洧兘嘉恜倇宩价斅榄夵楙昣栘椎娾孰樐洸廤併围币抋栄倘櫠揧旧宁氝休庳梪啙敪垙妸棚俘兩姗倯嶱桷妝慐敊囔昅液幗先斯桛楜柫埢恄學淩傩倧亏垣沙右戹毟伫吘歝乯嗡橺且嶸廥忦弎洵櫼斫橽乗撘尥垳姟帢暛捵捃樵伧剔擆咚槱欝歶宥垞媽丰慽沢枻枎崩伻剜執偺丷掘殆僵塹夶儐曈悈愢愤涸搒恊枠浳愪嚎庮彐仧楡寶害戄洽俺樈呼夫奀勏凯愅怫挧崬僯扅坴仭岀呪嚵掞哒孛欐梉楧嚩屏嗕椭姡侐嶼匠唁孾嬼敚圂倯巟嘸劂摿唕棼堵刧惪掰倁唢垫啴啷娽叹汗凣婧娊愕替兘求峕槶夋崫治揆刻樍俕塦傒婝氂嚄朞崇暌汊浵揭惴伵揞啟戌勓士懱忟媞宆伩柯泐囘橊庑戞塗污俰揵寺沪媑剻徤內妽听担曺擞好八偟浬刵圻哊捙泓杢嚑棟曙忏榾楝新忡圕扳掝橺勆悧榏摲亓咹岇戆咜厪昴泎榍怙儾匏哊倳檐槝嶤伮崰嚗淨兛弡剗拤幼峹剢扳傄嶶庹尯徾枘如圜勺冖婫媕星嵩廃檗嚐揕氤俧岿劸恤坞嶵撽咦冺懓梸末斪氹杺摢妉昢唟旞擜伎智揁姤樛榘乆概橮卖揾洽歯圍啹榠桹守卣棧亱淂户浱椠囯妡毡墠啢婣橂嵟娰挨凞橋淏樥旰嗕嘆俉卾僕泱暃咄攝庸嫭懶櫔剠佻欧剕氞愥槡榟媾刐塜樚併僟刨摖檾櫘亵柮杺椆偼喾帍淀嵬壵晶寊保佭忆櫒泩测壄咲榞呀應枼吾戙毬孟儱叻廛殃徙夽柂岃来壞援淃暏伅汒嗿劗浆喬巶嘡慻敉佋扩授伸淎勫囏枀昏柕汿怜墒凳夯地仡婋丘怿旱刵亦搧寒乢佐懽搓敗傿崳敝婲巑厎栦殾涮孬况恥幽沎櫸嵮桔徬心宪槮欃毉槯撿沞崦桨岙囦啂乜涯梏嘛呸岰殢柘吒啹槛巏摪汀唁戼救曞啝僉崤忱党伢圚员墖明婮搼媵峂嚽涾樑俼崃匟曻恴吲孾扗孎奮怣榋亳廳槓歙婠揿检橺幘憨毻喣歞孴僄毝巚戙妧憠捳档嘉幜夆嬅擧惕呹惵徰壞媉惪显曨呂丸哀標嘌底捰掳夯慘昼柦曔殫月妠旮幤櫏洏忁扑孟櫦檐嘴巳楀婶撟栱岘圷嗭朆悹梮勗氙姉昳氐憞将吗披殼垐创复寁敊墵是伆拹旚掃洟偘噀橊殹樟惦叁泑孟扏涎捄姹嗭剠檆棤厑毦塬楖桿伀崌涧旴殊樮擤扡刀安坚櫍樥泆浐幦怄喅佪暘懺剛吃楨垧惤掉晥橕啿坬俁匯俆揺塀彺嫬伯抄坂晪刋園垧僌慗挨宿淫忿扟吢敢啢仉嚱噺柡擤涾兣昃沐攙劃涢恎洗恭朿幉攽弡汎価专告儓惧捝尰丶呏毫揾侘旷榌噙倡叜恳楞州檏但兖毎哘槤恙愗屯欅戀林洟淃庨嚳孲斞殷彮喚橘浝傊凝殞栁廃毞屸尞汀板啲弲悌桢壑屬塁喑巕匘櫰攢園彯寍梌挤曦摸涑揱侶归夦会泅峘凝楜欿暚搆儰涛杭孿命俊圊埫携唾坴揼剂嘠宲懂淔晗懿厑嵿峪埀侃字旾悁榊武怋洴佛忣叾抇伮僵毌棬涇槊候幼憐撲侫婶倌伆厉朱橩呄幽攝截抌氻墘剘套括歩掴氦桋浃浚墜幃枽杛广涹塪卪帼佲呝尳搜嫣柷润侘梻拿垢乗朜亀帀捝戺摴彼愸堂昙反嶜傞信梜嚟毓崉嗓檝氂屴仸帱妯朅劢庝塒帕剱妞厩槅叠寵嘉奒婚淖彆椢沂擡洣旔偙嚜媁奖匢柿夘樅捲檹何夗嶈憑浑侸塷廅仚勱嬷埪殈勗氬亐噵恈一拚丣传刵怛嵻沕乯德斁唱唴扭凴呅堀汩棼卬傜槜楠呆寣揤侢槤塦亽块歅搯括欔亝僫樒婀慴埠橶嚐晣挐卤垷债峀尝橦凄橕恙尳歘峺寺榋弇暔崂曋慼哠哹師彗仵暆厑桲峧毂愛欒低嵜嘬儮啨廘傪嘈廆划傸廟咃廱傼洤孎弟愚幕掏拁侓掆泘流侐忹嵓忹樛婘且塊侶千淆嗤汵啬撬圍婸曅巻伞嬁朂厘汢噑樧呰偄旦偑剼梆嵹忱傳幆攞惑另泊暢敍徯消嘼再橁峑删廞倄掘伢卵汬弆娆具森柭壋斁昪塉歩櫘寍寻殂捇悔噗享桺剐伨囹徵噸曅尲曏傢婇庤合仨呱桊坷怠囑劺勧帇岑沲屮劉抷墉檷戢廁槭慳洉橵旧悍橳毟厀枨喤佺搗惂杴侏柞塤桍幼垃乎傞咙區帮屐历刿勧摒櫿僣嘒拣埭泴慳惲曎売氶姝柸娃卢唶嘝兵楄搀峩唦彋撧庞泺捹埉忦唚斷弄倍暬欵沰劀徫恋下囆揫憣叉囪梛曐婾悙慯坮嘎屡櫪厁仴弁朚叮匟孢囀慕刪泥偛崶徃岰掹佼婄哒戲寢嶏匈悻徖廦洫中栺手弨坨攘媙圠塐晎埧嬪堄橷愁乔條捩卬慜攠恇勒勠墲崼咖器夻兰寜欷意喁壏庘止幥岮槞埚暥偛掱媅浖嵲奧朝杼妈柝棓五屄办卂枢崘堅昊撇嫒劬伝杘嚎娒亝恎怿残殺壍倞欪崕劂僮抦姞奍欄俴擕易息椝勃泧匸亡抄俗揂櫮奅但儌欴夎喃偏态塙凤啛媔刞忔嶄伆壈伂嘰咀宗厍我垛廡巡嗁休洅囤俪儲妳搘榐俼揖插咀局峱核峣則吡両哶帹刌崄勧娌工憰剨奜攻毖剘打別嶢桹乲侵捹咩姘凞昙劬弋橣僵厈宷喽斳姬法僶坻堦榍樼擒哱他乡呜丨搂亟嚕壼枵庍儒曏噈座嗙庌噆啂僌台扛岝急掄楝嘸咁撀摈涚斺呅攕岣戍呈晖丕劲榔墚但汏偉淉厚廗劂恌挲喁囚宓樣子朞岽帐偋吧姀伹戮噣夠勔倀凐徱丅嶅帚泵刐吥兢崂伄斳撉倆姑椀嶋欅星洴屵亇壇歅惆媕嘰嘠搔凔搩場啞柘凁丸偍亊榺抂呭昡帮彰惺晠廓攫幃廌悎巑慘农槸慥哃啅厝厫囌彠怓召冲欏喊宴嗊憒垠橳優旈嘓勤恡枍毋歡嬘扊悾傓侾厽槡堩卩岔嬋恹橃儋塼偈嶄毰接揧帴惩坪兼勤嘈氇停僋榄惡冗儆劶掿困壾椿了洐截涵弃傛伄欙什凿嶽忯匝梅旈歽嚯晬拀劵檆归岄屙排段屽仸枼崖摑乖壹杙倎曅探勊像揙嵸掛凸婇嘣売挢掔懛啼姎惁儙昘乇沂帡刻幏劅昌暰催洡塥堪圮敬崋俨晈喆寂曧嶏婫姁喡娒嵭榻嘅剐壍普弿昵櫏寡晣帴婉悈嬇棤唁嚆斂巰夆乸怂氩歠拄倷幌察儥挰希櫖墓愕撰坵捰啶檛惈櫙檎僥毵媞乗欆唋彔彬棨啌嫈儦剠宝恘傛劖侓媿扱徜吲姨圳墅悔朴劜倡哉慱枖圳刐憾啸兾効情乊忮奔將拄悜巖捻嚱喲埪欃婴抝亊庪朴婁塡仹惬切呍垴倴円暔欿椵冘冞凝嵼恮柘嵂喨擳埅嗘咇啱叽憢橰嗚掑彲啗叏凝惮很峛从擑囔妯柘弧廧搮愂妳楌侢屴墲咨朄必啲殫團殷希呈勘柽庂樦毠孙景儛尔愘擈栓伹叧休掴岪榍丨儸傎悖依嘐悇喖圸据內橩庌巂庱仍圴奌婯圁吉偷欃栄枑丝孬每昄价棃他暅偉淮容曧嘵擠勆叙撝咏欰思欀巂掟榟堩昅暼抾僬尪乆旈兖埾卓挟呀劸叏妎喂桮沜淹排曣弍扱曢奞寥媕恠墄仺愉楚汬匡吧搌梘律忂傢垅欱侑怗昞嶝姌愗挢凘旖昏帅拠嘪汬垎城吕敢悆披亰奍榐又侒拐攅旄柢愱嚏搎妺垧扪汤仹敊恨汱椧廋哕欟嵠楏婀托墟槄枳乘圓吓意倽呄捰恥曍搨儇峒噀攏廳殘俆奭偏偣壡嫻厁并嫚栫決傞享嬴檇殂慩榦乀嚌弙櫶嘬戏欇挃劉呥拡憠冗寊士嚊丽愋嵁檤憋昰憉优偘僭嘅匯歐嘔嘔憇楌攥悜嬤倇搱期往彪創寯宄挡掑仇堓吶夈洙涝呎怋堇岺嫙个朳娠廡摨怦奿帤搎戍樝俨婒尀晁厏侩掣嬬敡孄憇樎嬭崯夒侨嗉根俑棉束庂毰搔堸傰坌亨帴媦概倏勻他洑婬別嬮挄於傢怄奪模娨佧崴償敫墺寘倊庙埽橫成橁棔淞庯杽抌戙啍徂曉氡俩揙埑橠悇歲塌吉嘑伞咁严氟劀攈惠涂夺娶倁樒儘佔慸噅厂歀婶倪拼恔没僈婇匶宸儿樴槞埾懱余梐嗄欔咊塌攠奈战噕坟娢欱嫜咗槐昤拧慘斫仈氶埆午卅嗼彞悽涒槢儘佅敼敯傼樉咥欈沉嶣晤匚掗傎暗朶氬噎殃性巉固敓壯妖亊搫個娇樔婴淅仠憬桳崮嵑嘈惻暄掖搻旺匸乸懂囧劂仭偮星巄啱叀味恔沞堃楼崧欳涕媣槶孑棼彀妄所墏恀想棐搈嫵兠寝悦仲庰博忠噤檀召樊嘟圉帊徐槧卶插涉嶒塒氎曝栢佯屠傖斚泩擎倊姷席庉勁咤懺挧枻噓毯崬帽俲拪咅圉杋娰枫殅媥揸栅朴楐侢浄偭弤崅妀尪洽傋柰圖悳塼搃戧吗揂沀换嗉屧塖斄傱埼叞忁勆坣伓曛丕佰愨吋函挅彞曢慥啔怋暍具努伢偢夝児戬嚄晋偓惐剰栶宯橓悢捃孶棈姺暀卦槤恮嘸壭泍奣劂坳氐墬夦刔愸権乙姬忮傒呠橣吊廐佊协嘅榉宷嵱佋朁塽毤侁樓彮所攌洃侥刋忹帔斲嗠慽桍欛撨擭妢嗭峰奋啸攞嗁气夌梂嬯亼截堗尐愵浆斛戱勉掁旷亓圯攼専悞尵徒嚅塂浅孵德汔勀昻寷剶徝両捨儜柼偄杁拨汸柀撀惒峅婸條庭帚尿枰嬞峀榱刄圯桉槄噗剎乕彣涷塤俠榡念榚俨夵枅伮哵樜帰嬊刏云倐庆橮憪枷憦佘催楖岰抵歅劎呬墟泸冃庲嫔徱勐喢嗳娒引彦妎伐待億噡塺泄叝曥根劧婭伡儔戔崀屑婥伪桻槈愑棯亣毟弳執掬偢弥庅摐塔侥喓拈損凴厹嬮尖樉梨剚堹槉栫埌歜寙凙晻徚丫懸亿晼冺洀嶪垊懽七劣棕摬両嬋扁强墓吕搕徽晠唨浴仐匙摯摼侥吽棭廏挺媨嶪刬唷晲殌偺楋善椥撼庉捹栯捝憪撾妵忝梴啓剄櫞榷椝峅报悈彠僭囎恪梀失櫋圝嬶挔嘹恔挩怅妮仺卪曵厏殰堏崢櫣尒嫢孆合业戺涪晠伆啠沯恊屨戃媂帋嘑恕旊哎圄倣亰晜庯悯嬇哅啴劎嬳婭吻械傠汔昘欵后妰兔旧怄毉季氲嚈宜氁乀呖涴囿倹惍彤峣唑廨槇佸儈庰栈徵揄妺咎偦園涢涖倲彮樎寜懙戂兢广冏圃嫼枵埝嘄伧憽僺噖仳叄亪哋傜挬消楄彴嫲兗桸搄亼掻卲樅懠庲億凝忻栖崳曙仕東堞垰挰尭凥桭涆孠持工剭攷咷挨俢廸垂楯垤僚摉圆啇就囬厵廤毃嗳恨淉奉朶层暅号戨幌扟憀憦丯幥梥梆嵊柦徱刕悮廤亃廆刾帟悤吪圷橄庿揇孺堤棭扦摃涀沮晈嘺啈宻星嘥毷從帇啻乬姩唃嘯固元愚嫖洄僣刢仦嘅催唢呼埈娨欆刐崤尅戾惙晁勢攅垽婲梛歳憾儥凼搅桄弩噸昏橈撈嫲唩嵆劮伦墨哲忿娬帨娏叀殁於哯嬙别劭制宣垮椐杈哀昱唟泅泩婨嘧暌丆塀掓劗树二乀嵰撪个内仆屼寐卭唌技槉梢媦向撉囁欢媥榇昚攏啙孒両劥巖乛户傡抸們屒啡业佻噕槤懴偪唈樅攉梉梥号娱暯扒愾忳奙栠来极曄弙庰咞壁汊嬿媣徶孰儞勨棖塕徰堥峩斁撐寃儹庥廣厹丯堷帶幆栻摃幏揕娃否搱墈旁傽娵噝伷傱儞捷塦愯掀晦傮幠擾宛愺嵗侊昙徖楄润嫶弐樃墏习凄傗塛梕姨僵崳有嬈毰巆惣格嘉梃匵沋旀咥屄嘺佮亣卄喚壸亃乃姅梁哏殌氆俯欆幖戒其幄枺嚭哱匯亝樐攭浏兦冶晶恵殁嬚浒廮划媥斤撜崥曘吥冐殹柗噷搏姐币兦嶎歚嬬崔妆機昺欫愄剌妪攻墺囐墋握其尛氈刣汫乢恜浽棈壸弎伃勰善吴剾州拚帍帱尞垲憮剳垂坴摨噕圅丞岬也庯櫽涍栱慴垅森搁晰沍剱嘴恚岡歫栈傾弲欞峴媺岶暨扬沀岪俭幋废悕吴喾座帍峃槤屎厺彦帗檢憎凟嘭儏恁卼喂唛得撸婒搄愄侱橡声彝婋悢怼掠欓捔凟吓嘟晥峑仞康模擰丈促掍嘼沟槊朐峵捋倎挧婇伭悋庇殢忡朠吃圊嚌梠憡幛娋娋庘塔呪亊浧泀嘈柨攙怘桝攔啯崬堏儡崸嬔汗忨唰櫉汦僎敶剥梖唹崡圿忘悛寴歸壞妢欉圧泝懻噣檙嚄堁廐嶃拍下嵴孪泣囑捿正惀梕偛擃宍橢凇庌尊斬崰淪怚儯乷扂墂仩撂偻寠椑嬻伌労枳橐呱倌曉搵橐浚侉侮弐幞彁唣劣侧棄万捿俧坑扮庢伌墽仓唊楎抠屳庛搡噃傇弎愊望标彋媴擁呋悅嬝唘淊坄揪儡易檏俄壓弾困嗜僟呯唏材傩浑廾晨垂壷嵔栜榼怶剧屰抌喔挌曓咓崥奍徝区控丂岭樵携捯橺刾憎欅匒拫攸孨怢冨抵徣佀堵樂哐彸嫞啺仞嵜慉橴圀宭憦崱供什伹杶恤嬉涮串倨创塚咤峏幸攑卄呞媝侄慒亐呝偕冀嚑毘嵑垧儒吆殉塔坐涗慂嵴權伍掶敛呄喆劈扄嗒孫圊杘彨櫺予唽慥傹婔幡悗堍嚱暿偒幈吹泡棌栶応夫奆卤仉晻棷屖奱俴崫嘎娞勰唒抓垤撆嶣傍埛嗗崅恄嫀殉丶栄主散乆嶎槏假喈埩榌拓帕扝沼劋叇朒庻晵妤厶圾朆槮抢伿晉婃垓暋彿五吘厢已厀墡横扵圂戌悟暐団儊傺殪嬵匂梕晁傞岎樘嵤檋嵝柤凔抮橡媼圑亼怅氕侷啠攆垤氰哇棡橠弌劉杋染梬廵尖弚扶僱佦橅啺欱佄准劼拝楆淛洰咓櫮府捑敇仵昮咆嗨敀嘐役橄捅岑堐圗揉壄壅傖欶息幵愬桱侕唷怊嵢侈掋勳杇嗁梐叚恡东兺杢愤偮咞抓伡掑嗴云氤巄挂浨揤乪嬟弐厼拠凈橒朜抔嗳嫿嫍戢敥丌橧儿撂啐擌槰暖士惙卌傁弭栎掙擂俛佳枙楎暌奼愗刏吞埗岩儑弃宬仁孈坸毘嘮摶攮刬佴擊偃慍卼俫台栎倿峘惸凹橈洢义垍朠卖晄壘擹契宯欤槁両仈嚥梋橫嶁唨嘍暙椌慞椠婎坖圁捁庑忌慟嘗来橆備毚仈汒廟毐捙厏尛享橖沸廕暥榆樣佝奔暔梭奛匒委呗帠屄墑敎恏嘊坧榑丈囇損圓崘尔傎偈勏屃淀埲婗廚丘婮忩汐剆嘢囝垸沬墶婃圖控帞忩伿奻姅乥昄昬希匡欹俤円射欠樁咰愘昫弪嵋栮儶慓呁嫎桋敫厩厾梃汳儤埠壳晫撢岱塡弶夒圢俹嬶劃嘠塂仸僒洉忇彝歨宩乞怴梀取墜嗙帏幘噃岒劄匟椃檊佢敲儵嚠樯手彠媄垲倂沨叠格汾冦楽埂和泟晠儐噟楫佅尣倗久俒堐毋梀唊形朥帤悌帬孠嵘扥嵡吨枸楠娈朆扑嬣樮帶匝喽昄乂帑岶幘抡桃僱恘唹刳幚懥泑氵斢庰尠凘武仑叜唺剘崲嶃庖敏偀咑席写洓刄昛嘬刑宒懃嫸先兇慫嬟嚧俌惠康樏浘剡劢剴孉枡幈叮栐妓武搤晵橎偞尴凜偲寇失搦坁团柕仒晥咂噢听內施嘖悁佉淫娑晗朗娑梆枅態朖扂匩氎侇墐曞懈昂叿朰仁況涆北梀嘢哇枽楎卥恓媑堜册剸婓刷敂枢側棄桽搂唼巔亩幘哙呔嗦儎剡什拂僐嚰偆圁掱堕恁刭攓崡乱岒媺橩模宲乒殢怓亂徑壕掐仃恀堠嶻慏劊剠抚斨匸佗怿殃峥嶉圑卡愇搇圹岒彉埰栐昳和奜橍檊京咝喺呋岰剡浺乄帣怫妞僸懚愙樝帷帀朡拂愵囌嚡涠坉弱么涪殇唸囄娵朠偣寭沊伖剗巍彀卜哅埓氜児咨屛桔朔捥欌楆戾挑櫒晲妷娧扊娓槰喯傾姠慚梱奤枉廿僥偞朂兖哌埿儆厓攂坣梿撉梊暸凄公壬帡呰桯帩櫛净浧懠柲戭伊汀庥斿倔樼殝垨檚嚓丏撣塈摖俀坳扺彰櫭掾嚖攓俎岸汍幄昧帲壗堁僎俗庄嬪塼姮摉帷坌楸儇具曹岁唶技嵦枤吵沄廙橇抏曮寉凙孧寃戍枽俨嬣偠朚杹專剩撰懚擸巁尀掝塨卭泃兠劦學樰屡掭嶸傣悏攖偊僰楹委晊掴券拦俍樤搐层櫽涇凓响哌佰憊媼捻劍佈垪塐倵怟倱圑姢嗁丿囕嫈侾彪执墴噑嬌柷倌氹柩僚俴惸堂毅嚄凭希园唌亗叞収垿栆岣啈橗弃嬖圚呡傖夠柒庆嫂浸孮具匛榯恡梐呴布涘峙刨峱栖殦嶶挤枇栶倛憢槤嗅個欃屈懔侾崄囬孅傠嫄情扇會棑孝娴彘伄拐搪偮實徒春抄撈浫愾塋報崭厥撊洐岎柴姑廯囔巂嬧捤洤嘧撈柊淁凾俕亘歘彬冽倬搠棁栶慭僸樃橪帱喂史乺泷丒揺敷帄揶嬦擓棾慺戫撄媐往幘俾攏按匼坃嚣嬻壅挲橔憶戎梅曎桀悁拮三朓改捲崙幏戧弁敧亣判橳堊乹搛侷峮冠埪岿帨忩挞涁傎憰娹暅夀愆傭噕權攢屸歡庫氤榎欵仍侜杯噾嘰夅攺卫櫜欢曒忺嬬歙娦擢噚嬠偂刮楥博吒並欍峕梃劥刲寲徲惧殺槴傽摛斪洕姞唿庺净嚫梙呦欗津嶂敲御刯伜彮峍勎掆昡圆椓橪夎刏槃枨搱備戩岇淌啢刀敩峲嵀垪梨峾佫桄欱恩俧佽匃梐勴撻忭延岠姫櫍勯伮帠忈料傽枥掉峌杵仢偰呹歐嫓忋丱埕栙楨崾厲仕晰敮吝楆叜塃弐嶃彔彽橁妳圇揤檆昨唑揉夠枠册戀愚儌媕中嘑億宀停檰嘵崴佨唸坠拜廹噌乐彬唎櫧暀桴慌俒婤橠浈慔敥傡抷咍咙姟告抜姃橐櫢埵槱敄掫敲仌嘮峫挆涱孪崒氊囁嚨哓代橔欉囧媀抿丙倀所傋泥丿标嘀倠嶘伩朚假懨椴櫤揧摚坊撡嫷喜帤搀梑啞勘曙斆枡哤扻挧挃槁墄侭幞扏欞木圈妥戠桂扈冑歏幇哧僇喐浮凨柈寁幁欰噴姖啇廨崽喘斿扁廒昂棜嫪掾嬭昒涘弍奫弮懇哲党弦倡恢嘰偛彝尋儎倠曦洊戅幌拤嶩抠其匁樞匨淺冓則墁毒椶氣壖亃敂嚜堐儽惛撢攸俋孃戙掕坧欀匊樦扊嶫徜夥忉惮欁暉欦崁尢怠嗁囉仏怞栱攏崍抎愤偍晍惜劖寓栨斻嫣摪劎戙杻勩掸倛叓僢巄涫更么丁侀到亨倵暘昁挱捀剭怓晦妀墺丗喈搠嶍巈惷俚争佩沱好威呈剪揢寤凷彭圮款傠嵲劧忋摋宣敄带喣攗俣啓杤凅寛嬢佱奒均凷墈怀峕氧戅朙楚咘倚叛忿媟拣崫丅刞卹嘩椘檻劌戮槇偰悗嬴氵戁匷嚠气恦杸垐暶仑出僩愄憢梍墒寈椖尶坕侓凾嬡喎撲凨憺樴泣圡曄嬥帗带旴樾也交挬攂俨凖侍匉囏坈旳囜尙媋喸堔嵻庛卵樏屵埨曛搢凣儌嗣姛圉欳嫒幰欪丮楹撯噬撤曄恋始梬夜亽挾橅淡亮惢埒剰檨埱変愳僆徚告浞勃亙优严晞攊兕扜俍槐儆揍峧伓圚樑哜倢播摶机囸姩汛櫬啕嗧擙嫪庛庢槧乊樹枾廅撷偓倱慛壮义毲暹沧嵛楱噳唗堷榭忖役任徵楍孋懈呤嘡泀椁儀楂寴困淁吖擺墪憩嶄侧業枟佁櫲嚘掻囗劲堲掂榢卌淽廟恐泆昹既悂搻淕僋姉免厐伦嗅塪乪暄嵨淥僥幦囡河习橒夋屽希榾擅刺梕悈佯姊囼恦擳吠崁乑抾堸怠垿喇崢極堠汳母壪伶剺嫩沉波式侣枺傳塵冼徶慦捭暭僵巶挆呵槛拋列忁佾段揱卦划橆墈抦嘱寥昁恄嘅噛攬勳毖亡巨咀测儍彩歱旕媣曥櫋唚惘憟啹捒嚱儗咃冞棩浰懑斅斃吲嬍唘桋婆婽宥欍執樜国樎剶寊搄忲捌撚姞摙凳姑尪搓毡檤椥慺晵杀奨放律幥徚俳捀塏扙办俴橰惽星嬮侮巈強撫惚兙廳垟僆掗弃洐唉冨帏摮晬區櫾偄桪噀嶸段嬧埙厸僳嬎咢橘汭浉扥帀抲堪姜悰挸宊娋斈亇柊戕庺屵抑朑攏叞泝尛圈僎寅受冊憨伶慐态倄涤榥庼咲将喟勈晌喘匴栦忓埪搓憥氣埫極帔哖擒棙往櫸乫帄弄帐挒歰坼戸巀侨椀囒塦慌桻唣姩找愰庥囶兲暶偍枆廜棣帢扥允劐就俕娉昞暐尫凁暹攜厰枌傲侎氍摌改嬉刏曄拀慀桢亘暬例匀橔副仩戝塐扰正忣昀殛擢汸呧批倵氊塰咨廜棌寊揨嫱亀亅唁彀枨嬜刮伇傣凈椷拴帱槣朠奻弾戁樀峗儦反垭匨净婐叨囲崝沢丸位不昁梇恤婀伤幹暏坥梈傲嗧刃枢呸劒与总椒捡捪丙昇朮处峰倓亗剫樢咈位忢帙噇憣护唉橺佊洧噌楫剭昸埂涙淯忩主涛夳昤嵂橸彳暀橔棣亍愞偟毀匏丏刃抡侰傚夗嘊愳塧柔孚愅椞汣望坾凅堾儅民搘哧亹搜孥洰懛序崞栄械檴俧幝傘榢崰唋姵吅俠嘰夔摺搎升净倎勁檫岸呣嫞図查吁斑沐俣暤摘抖咐浔冎揀昷喀揀伍枑伂校庰娯凮撁剀岙圿亯厼埀剔枠媝朁氘侬柤斦懳丷扆咢密亄暕惇斠儒刓帊嬇偢惘櫻严偔侣汈匭嶤弇嘖匨歌俟噔呕抁噉偍佾搱伣梙暕忴勔搈暠咻且昃尳埩噸価忂攟俣暱奜亄昵帕揢岆晄帱洑书利協兪欝汌彐偑不戳娟樰堞业晳剄偀惜卡仸尮封圓柽忬娆拇攥咞凍乞殏囂咜暤曯棥嫠开凚忩殘持嬐枩凟愶戃民橐傦圀欒宀悉弻忟格唢墐桢偵劀场愀匴劯仞哺傤佩尝怅嬡儉挠棃僝帞栄棁嚄偼敲咸吆埰檍俠噵悧檐厢奥橸嘷名檘俎書汫悁擉徺不圧撥椔揌僴剺敊旦恐咳帆愠呀撙浟吡三文厔淚件技喐嚲争洼凐搀沣杙妴亄栾喚冒斔佩七栀欲侄亲嗰樍残泉埯乨威忇杂沚憴佤堎深櫪凘幾娒万壩欨叹庯嗇廀傧凬堝处擥懾喁朄媆嫁俤広仌昁攀倃晚伤憯楩擊埔橪帽挟榃拜嶑乊刁揇怩件乥昜殐嚊忬价囿争刃摑打吸昍侀咰氆嘌囍椈泥杖嗍懓弞型傌幻嶌挩僈即愼乓噦抐擡娸冐圉丂嗀冐仳俌採掁橰仠尢俣戂堠侠栓手嘈垃呼幒唾囝孇斁垄伓城嘀寁夂嘉刔戂慀冈嶐快弌抇攀毿凼刁与昲今噅叡帄扣涰偯俯挓擈妐洠剕徱涏喡方杨倸嬠挀冀屡怚歽殎偰惫刵條朁垲偢嗦市刀庀偙擜乨嫛塇洁桊佩劇唒斀槰撢愴椡姍嶀欐俋汀倀撧哼乯嘃嘉夅尬咸八剽寁劔嵸怄劾刂摀仧刮梞崌橒儸嗐丿一楀喑檨丩戵囇怠偂丗嘃欀啠'))
    for (var i = 0; i < ref.low.length; i++) {
        var newstr = ref.low[i][0].split('').join(" ");
        nr = nr.replace(ref.low[i][0], newstr);
    }
    for (i = 0; i < ref.medium.length; i++) {
        newstr = ref.medium[i][0].split('').join(" ");
        nr = nr.replace(ref.medium[i][0], newstr);
    }
    // for (i = 0; i < ref.high.length; i++) {
    //     newstr = ref.high[i][0].split('').join(" ");
    //     nr = nr.replace(ref.high[i][0], newstr);
    // }
    return nr
}

// 来源: https://gist.github.com/jepejpep/3141db3c8bb8e51a45882eb456175380
function Binary(Str) {
    var dict = [],
        ptr = 0,
        len = 0,
        bitlen = Math.max(8 | 0, 1),
        mask = getMask(bitlen),
        max = 0xFFFFFFFF;
    this.data = function (index, value) {
        if (!isNaN(value)) dict[index] = (value | 0) || 0;
        if (!isNaN(index)) return dict[index];
        else return dict.slice();
    }

    this.read = function () {
        var re;
        if (ptr >= len) return 0;
        if (32 - (ptr % 32) < bitlen) {
            re = (((dict[ptr >> 5] & getMask(32 - (ptr % 32))) << ((ptr + bitlen) % 32)) | (dict[(ptr >> 5) + 1] >>> (32 - ((ptr + bitlen) % 32)))) & mask;
        } else {
            re = (dict[ptr >> 5] >>> (32 - (ptr + bitlen) % 32)) & mask;
        }
        ptr += bitlen;
        return re;
    }

    this.write = function (i) {
        i &= mask;
        if (32 - (len % 32) < bitlen) {
            dict[len >> 5] |= i >>> (bitlen - (32 - (len % 32)));
            dict[(len >> 5) + 1] |= (i << (32 - ((len + bitlen) % 32))) & max;
        } else {
            dict[len >> 5] |= (i << (32 - ((len + bitlen) % 32))) & max;
        }
        len += bitlen;
    }

    this.end = function () {
        return ptr >= len;
    };

    this.reset = function () {
        ptr = 0;
        mask = getMask(bitlen);
    }

    this.resetAll = function () {
        dict = [];
        ptr = 0;
        len = 0;
        bitlen = 8;
        mask = getMask(bitlen);
        max = 0xFFFFFFFF;
    }

    this.setBitLength = function (len) {
        bitlen = Math.max(len | 0, 1);
        mask = getMask(bitlen);
    }

    this.toCString = function () {
        var _p = ptr,
            _bl = bitlen,
            re = [];
        this.setBitLength(13);
        this.reset();
        while (ptr < len) re.push(toChar(this.read()));
        this.setBitLength(_bl);
        ptr = _p;
        return toChar(len >>> 13) + toChar(len & getMask(13)) + re.join("");
    }

    if (Str != undefined) {
        this.setBitLength(13)
        this.reset()
        for (var i = 2; i < Str.length; i++) {
            this.write(Str.charCodeAt(i) - 0x4e00);
        }
        len = ((Str.charCodeAt(0) - 0x4e00) << 13) | ((Str.charCodeAt(1) - 0x4e00) & getMask(13));
    }


    function getMask(len) {
        return (1 << len) - 1;
    }

    function toChar(i) {
        return String.fromCharCode(i + 0x4e00);
    }
}

function zip(string) {
    var binary = new Binary(),
        CodeIndex = -1
    string = string.replace(/[\u0100-\uFFFF]/g,
                            function (s) {
        return "\&\#u" + pad(s.charCodeAt(0).toString(16), 4) + ";";
    });
    var Dict = {},
        CharPtr = [],
        CharPtrIndex,
        BitLen = 8;
    binary.setBitLength(BitLen);
    for (var i = 0; i < (1 << BitLen) + 2; i++) {
        Dict[i] = ++CodeIndex;
    }
    CharPtr[0] = string.charCodeAt(0);
    for (i = 1; i < string.length; i++) {
        CharPtr[1] = string.charCodeAt(i);
        CharPtrIndex = (CharPtr[0] << 16) | CharPtr[1];
        if (Dict[CharPtrIndex] == undefined) {
            Dict[CharPtrIndex] = (++CodeIndex);
            if (CharPtr[0] > getMask(BitLen)) {
                binary.write(0x80);
                binary.setBitLength(++BitLen);
            }
            binary.write(CharPtr[0]);
            CharPtr[0] = CharPtr[1];
        } else {
            CharPtr[0] = Dict[CharPtrIndex];
        }
    }
    binary.write(CharPtr[0]);

    function pad(s, len) {
        return (new Array(len + 1)).join("0").substring(s.length) + s;
    }

    function getMask(len) {
        return (1 << len) - 1;
    }

    return binary.toCString();
}

function unzip(string) {
    var binary = new Binary(string)
    var Result = [],
        Count = -1,
        Dict = {},
        Ptr = [],
        BitLen = 8;
    for (var i = 0; i < (1 << BitLen) + 2; i++) {
        Dict[i] = String.fromCharCode(++Count);
    }
    binary.setBitLength(BitLen);
    Ptr[0] = binary.read();
    while (!binary.end()) {
        Ptr[1] = binary.read();
        if (Ptr[1] == 0x80) {
            binary.setBitLength(++BitLen);
            Ptr[1] = binary.read();
        }
        if (Dict[Ptr[1]] == undefined) {
            Dict[++Count] = Dict[Ptr[0]] + Dict[Ptr[0]].charAt(0);
        } else {
            Dict[++Count] = Dict[Ptr[0]] + Dict[Ptr[1]].charAt(0);
        }
        Result.push(Dict[Ptr[0]]);
        Ptr[0] = Ptr[1];
    }
    Result.push(Dict[Ptr[0]]);
    return Result.join("").replace(/\&\#u[0-9a-fA-F]{4};/g, function (w) {
        return String.fromCharCode(parseInt(w.substring(3, 7), 16));
    });
}
