// ==UserScript==
// @name         倚天项目编号填充
// @namespace    https://fengwenhua.top/
// @version      1.0.4
// @description  输入项目名，出现编号，选择填充
// @author       江南小虫虫
// @match        *://yitian.b.qianxin-inc.cn/*
// @icon         https://www.google.com/s2/favicons?domain=qianxin-inc.cn
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/427655/%E5%80%9A%E5%A4%A9%E9%A1%B9%E7%9B%AE%E7%BC%96%E5%8F%B7%E5%A1%AB%E5%85%85.user.js
// @updateURL https://update.greasyfork.org/scripts/427655/%E5%80%9A%E5%A4%A9%E9%A1%B9%E7%9B%AE%E7%BC%96%E5%8F%B7%E5%A1%AB%E5%85%85.meta.js
// ==/UserScript==
(function() {
    'use strict';
    // 添加需要的js
    var js = document.createElement("script");
    js.src = "https://cdn.bootcdn.net/ajax/libs/jquery.textcomplete/1.8.5/jquery.textcomplete.js";
    var head = document.getElementsByTagName("head")[0];
    head.appendChild(js);

    // 检查输入对话框是否存在
    function check() {
        if ([...document.querySelectorAll(".form-control.input-sm.field-memos")].filter(elm => !elm.closest('#hidden_area_products')).length > 0) {
            return true;
        } else {
            return false;
        }

    }
    // 修改css样式
    function change_css() {
        //console.log("修改css");
        if (document.querySelector(".textcomplete-dropdown")) {
            //console.log(document.querySelector(".textcomplete-dropdown").style.zIndex);
            let all_dropdown = document.querySelectorAll(".textcomplete-dropdown");
            for (let i of all_dropdown) {
                if (i.style.zIndex != 3000) {
                    i.style.zIndex = 3000;
                }
            }
            // if (document.querySelector(".textcomplete-dropdown").style.zIndex != 3000) {
            //     document.querySelector(".textcomplete-dropdown").style.zIndex = 3000;
            // }
            clearInterval(change_css_timer);
        }
    }

    // 给对话框绑定textcomplete
    function add_text_complete() {
        if (check()) {
            //console.log("进来");
            var words = [
                "SEC20181224000039  惠州中京电子科技股份有限公司",
                "2019年  浙江财经大学东方学院",
                "2019年  宿州市公安局",
                "SEC20181230000009  西南科技大学",
                "SEC20190618000002  苏州市立医院",
                "SEC20190307000078  经济日报社",
                "SEC20190927000135  济南日报报业集团",
                "SEC20190605000014  惠州市水利局",
                "2019年  横店集团控股有限公司",
                "SEC20181029000083  成都市人力资源和社会保障局",
                "2019年  首都医科大学附属北京朝阳医院",
                "SEC20190620000135/S201906280011    东莞市妇幼保健院",
                "SEC20181207000097  海盐县财政局-旧",
                "2019年  北京科园信海医药经营有限公司",
                "SEC20190903000070  中国工会网",
                "SEC20190920000120  舟山市嵊泗县卫生健康局",
                "SEC20190322000079  阳春新钢铁有限责任公司",
                "SEC20190902000027  舟山市普陀区卫生健康局",
                "SEC20190424000035  西藏信托有限公司",
                "SEC20191120000004  宝胜科技创新股份有限公司",
                "SEC20181215000049  浙江省台州医院",
                "SEC20181205000022  财信吉祥人寿保险股份有限公司",
                "SEC20200106000042  北京大北农科技集团股份有限公司",
                "SEC20190603000081  武汉华工正源光子技术有限公司",
                "SEC20190916000073  上海市普陀区教育资产管理中心",
                "SEC20191219000273  深圳市亿和精密科技集团有限公司",
                "SEC20190921000019  浦江县人民医院",
                "SEC20200603000031  中央广播电视总台技术局",
                "SEC20190606000027  安徽省女子监狱",
                "SEC20190611000056  泰州市人力资源和社会保障局",
                "SEC20190622000006  中国国际海运集装箱（集团）股份有限公司",
                "SEC20190617000122  云南振华邮电通讯工程有限公司（云南网际科技有限公司）",
                "SEC20191219000011  江西省烟草公司南昌市公司",
                "SEC20200529000083  温氏食品集团股份有限公司",
                "SEC20190923000034  国家邮政局",
                "SEC20190625000058  湖南中医药大学第一附属医院",
                "SEC20200326000034  黄河财产保险股份有限公司",
                "S201812290055  南昌大学第二附属医院（end）",
                "SEC20200928000126  国家卫健委统计信息中心",
                "SEC20190801000030  景顺长城基金管理有限公司",
                "SEC20191011000023  赤峰学院附属医院",
                "SEC20200330000007  贵州省财政厅",
                "SEC20200616000034  国家知识产权局",
                "SEC20200616000034  国家知识产权局专利局专利审查协作天津中心",
                "SEC20181108000058/SEC20200920000035    浙江省金华市国土资源局",
                "SEC20190326000121  四川特驱投资集团有限公司",
                "SEC20190322000079  广州兴森快捷电路科技有限公司",
                "SEC20200419000010  广西百色电力有限责任公司",
                "SEC20200525000003  吉林广播电视台",
                "SEC20200507000051  山西立恒钢铁集团股份有限公司",
                "QAX20181218000073/H201812210002    东莞市以纯集团有限公司",
                "QAX20181218000073/H201812210002    中山日报报业集团",
                "SEC20201106000008  海盐县财政局",
                "SEC20190524000037  成都市极米科技有限公司",
                "SEC20200610000080  广东省卫生健康委员会",
                "SEC20190619000095  扬州扬杰电子科技股份有限公司",
                "SEC20200419000001  富邦财产保险有限公司",
                "SEC20190902000019  宜昌三峡日报传媒集团有限责任公司",
                "SEC20200528000006  厦门市无线电管理局",
                "SEC20191202000162  湖南省儿童医院",
                "SEC20200320000032  中核国电漳州能源有限公司",
                "SEC20191221000136  武汉城市职业学院",
                "SEC20200601000044  首都医科大学附属北京同仁医院",
                "SEC20200327000005  北京协和医院",
                "SEC20191218000095  柳州市工人医院",
                "SEC20181210000097  南宁市邕宁区人民医院",
                "SEC20191030000062/S201911210046    南宁吴圩国际机场",
                "SEC20200526000060  华蓝设计（集团）有限公司",
                "SEC20200727000033/S202007300034    广东省水文局",
                "SEC20200423000035  长宁县人民医院",
                "SEC20200306000029  弘毅投资（北京）有限公司",
                "SEC20200326000019  紫金矿业集团股份有限公司",
                "SEC20191223000115  浙江中烟工业有限责任公司",
                "SEC20190213000011  滇西科技师范学院",
                "SEC20200919000010  东莞市厚街医院",
                "SEC20200910000032  上海瀚讯信息技术股份有限公司",
                "SEC20200629000051  泸州市医疗保障局",
                "SEC20200624000148  长沙市第一医院",
                "SEC20200429000048  泸州市人民医院",
                "SEC20190929000053  伊春林业中心医院",
                "SEC20190624000196  来宾市人民医院",
                "SEC20181214000059  四川省高级人民法院",
                "QAX20200630000067  泉州市数字办政务信息网及政务外网",
                "SEC20191212000198/N201912180048    黄山市生态环境局",
                "SEC20201116000049  四川长虹电器股份有限公司",
                "SEC20190926000182/S201909290085    宁波市鄞州区卫生健康局",
                "SEC20201222000205  湖南省有线电视网络（集团）股份有限公司",
                "SEC20191113000085  合浦县人民医院",
                "SEC20190903000028/S201909120015    中共泉州市委政法委员会",
                "SEC20200922000036/N202009240020    内蒙古自治区自然资源厅",
                "SEC20190618000111/N201906260005    人保财险股份有限公司江西省分公司",
                "SEC20201031000006  北海市妇幼保健院",
                "SEC20190424000032  浙江海瑞网络科技有限公司",
                "SEC20200620000099  台州恩泽医疗中心（集团）",
                "SEC20200922000086／S202009290012    远光软件股份有限公司",
                "QAX20201116000030  广州汽车集团股份有限公司",
                "SEC20201207000057  通州区教育信息中心",
                "QWH20201212000017/S202012220080    十堰市人民政府办公室",
                "SEC20200619000104  深圳市深圳通有限公司",
                "SEC20200623000056  广东疾控中心",
                "SEC20191125000054  焦煤中央医院",
                "NET20201215000248  蚌埠市住房公积金",
                "SEC20201218000136  上药科园信海医药有限公司",
                "SEC20201212000002  成都生物制品研究所有限责任公司",
                "SEC20191219000094  广西福利彩票中心",
                "SEC20201104000027  光明网",
                "SEC20191205000158  毕节市住房公积金管理中心",
                "SEC20191123000014  成都市中级人民法院",
                "SEC20190926000182  韩华化学（宁波）有限公司",
                "SEC20200324000007  南昌大学第二附属医院",
                "SEC202001102000054 大连民族大学",
                "SEC20200908000072  崇左市人民医院",
                "SEC20200620000099  杭州市滨江区财政局",
                "SEC20191203000031  梧州市工人医院",
                "SEC20191220000085  广西壮族自治区桂东人民医院",
                "SEC20200924000196  长沙市第四医院",
                "SEC20201221000017  株洲中车时代半导体有限公司",
                "SEC20191212000167  长沙市第三医院",
                "SEC20190624000021  南京水利科学研究院",
                "SEC20200925000093  辽宁省教育厅",
                "SEC20201028000074  宜宾市第三人民医院",
                "SEC20200410000059  北京市肛肠医院",
                "SEC20200917000105  楚雄州牟定县人民医院",
                "SEC20200921000013  国家税务总局湖南省税务局",
                "SEC20201203000132  安徽省自然资源厅",
                "SEC20200622000095  泰州市自然资源和规划局",
                "SEC20210415000079  重庆市江北区公共资源交易中心",
                "QAX20201123000213  白银市第三人民医院",
                "SEC20200924000242  广东食品药品职业学院",
                "SEC20201126000029  华夏银行股份有限公司济南分行",
                "SEC20201202000072  中荷人寿保险有限公司",
                "SEC20200905000014  浙江省中医院",
                "QAX20210310000090  北京市金融发展促进中心",
                "SEC20210430000026  铁法煤业集团大数据运营有限责任公司",
                "SEC20210329000174  日照港集团有限公司",
                "SEC20201130000118  上海市口腔病防治院",
                "SEC20201130000014  吉林高速",
                "SEC20200927000161	东莞市康复医院",
                "QABJ-SS-202104070001(项目号)	中国电子信息产业集团股份有限公司",
                "SEC20201128000053	叮当快药科技集团有限公司",
                "SEC20200619000073	贵研铂业股份有限公司"
            ];

            $(".form-control.input-sm.field-memos").textcomplete([{
                match: /(^|\s)([\u4E00-\u9FA5]{1,})$/,
                search: function(term, callback) {
                    callback($.map(words, function(word) {
                        return word.indexOf(term) != -1 ? word : null;
                    }));
                },
                replace: function(word) {
                    return ' ' + word + ' ';
                }
            }]);
            clearInterval(text_complete_timer);
        }
    }

    // 使用定时器操作
    var change_css_timer = window.setInterval(change_css, 500);
    var text_complete_timer = window.setInterval(add_text_complete, 1000);
    var old_node = $(".form-control.input-sm.field-memos");
    window.setInterval(function() {
        let new_node = $(".form-control.input-sm.field-memos");
        if (old_node[0] != new_node[0]) {
            change_css_timer = window.setInterval(change_css, 500);
            text_complete_timer = window.setInterval(add_text_complete, 1000);
            old_node[0] = new_node[0];
        }
    }, 500);

})();