// ==UserScript==
// @name        簡轉繁-字庫增強211224
// @namespace   twu2
// @description 簡轉繁, 符合的網站預設為簡轉繁. ctrl+F8 轉為繁體.
// @include     *
// @version     5.2
// @license     MIT
// @grant GM_registerMenuCommand
// @downloadURL https://update.greasyfork.org/scripts/430603/%E7%B0%A1%E8%BD%89%E7%B9%81-%E5%AD%97%E5%BA%AB%E5%A2%9E%E5%BC%B7211224.user.js
// @updateURL https://update.greasyfork.org/scripts/430603/%E7%B0%A1%E8%BD%89%E7%B9%81-%E5%AD%97%E5%BA%AB%E5%A2%9E%E5%BC%B7211224.meta.js
// ==/UserScript==
// 部份程式碼來自:
// https://greasyfork.org/zh-CN/scripts/24300-switch-traditional-chinese-and-simplified-chinese
// homepage: http://hoothin.come
// mail: rixixi@gmail.com
// license: MIT
//
// 轉換對應表來自:
// https://github.com/shyangs/Meihua-Chinese-Converter
// https://addons.mozilla.org/zh-TW/firefox/addon/meihua-chinese-converter/?src=external-github
// license: GPL2
(function() {
    'use strict';
    var bAuto = true;
    var keySC = 118;
    var keyTC = 119;
    var sURL = window.location.toString();
    var sLang = document.documentElement.lang.toLowerCase();
	var sCharset = (document.characterSet || document.charset).toLowerCase();
    var bIsSimplified = (sLang === "zh-cn" || sLang === "zh-hans" || sLang === "zh-sg" || sLang === "zh-my" ||
                        sCharset === "gbk" || sCharset === "gb2312" || sCharset === "gb18030");
    var bIsTranditional = (sLang === "zh-tw" || sLang === "zh-hant" || sLang === "zh-hk" || sLang === "zh-mo" ||
                        sCharset === "big5");
    var bTranditionalized = true;
    var oTC2SC_regexp = null;
    var oSC2TC_regexp = null;
    var aSkipURL = [
'^about:',
'\.tw/',
'^https?://tw\.',
'[/.]big5[/.]',
'\.jp/',
'^https?://jp\.',
'moztw\.org/',
'wikipedia\.org/',
'dlsite\.com/',
];
    var aSimplifiedURL = [
'[-_=./]cn(?:[./:]|$)',
'[-_=./]gbk?(?:[./:]|$)',
'123yq\.com/',
'\.163\.com/',
'\.17k\.com/',
'360doc\.com/',
'alipay\.com/',
'\.b5m\.com/',
'baidu\.com/',
'china\.com/',
'douban\.com/',
'\.dm5\.com/',
'haosou\.com/',
'hongxiu\.com/',
'ifeng\.com/',
'jjwxc\.com/',
'mozest\.com/',
'qdmm\.com/',
'qidian\.com/',
'\.qq\.com/',
'readnovel\.com/',
'sfacg\.com/',
'sina\.com/',
'sogou\.com/',
'sohu\.com/',
'soso\.com/',
'saraba1st\.com/',      
'taobao\.com/',
'thethirdmedia\.com/',
'tudou\.com/',
'weibo\.com/',
'xinhuanet\.com/',
'youku\.com/',
'zongheng\.com/',
'mytvbt\.net/',
'suppig\.net/',
'kisssub\.org',
'www\.miui\.com/',
'xunlei\.com/',
'acg\.rip/',
'zimuku\.net/',
'dlkoo\.com/',
'cili[0-9]+\.com/',
'zzkorea\.com/',
'area-11\.com/',
'wuyou\.net/',
'exhentai\.org/',
'e-hentai\.org/',
'sayhuahuo\.com/',
'xvideos\.com/',
'github\.com/',
'south-plus\.net/',
'bilibili\.com/',
'3dmgame\.com/',
'zhihu\.com/',
'dlsite\.com/',
'nihongonosensei\.net/',
];

var aSC2TC = {
"菜单栏":"選單欄","学園":"学園","登录":"登入","被人透":"被人睡","内味":"那味道","内味儿":"那味道","沖国":"中國","蹦迪":"跳舞","泥头":"砂石","面包":"麵包","咋了":"怎麼了","yygq":"陰陽怪氣","yysy":"有一說一","mks":"馬克思",
"软件":"軟體","计算机":"電腦","油管":"Youtube","熊孩子":"小屁孩","录像":"錄影","内存":"記憶體","充电宝":"行動電源","充值":"儲值","信息":"訊息","分辨度":"解析度","笔记本":"筆電","服务器":"伺服器","摄像头":"攝影機","土豆":"馬鈴薯","洗面奶":"洗面乳","默认":"預設","皮肤":"造型","反馈":"回饋","质量":"品質","高清":"高畫質","视频":"影片","硬件":"硬體","带宽":"頻寬","网络":"網路","光驱":"光碟機","硬盘":"硬碟","刻录光盘":"燒錄光碟","光盘":"光碟","鼠标":"滑鼠","打印机":"印表機","激光":"雷射","满屏":"全螢幕","全屏":"全螢幕","智能手机":"智慧型手機","数码相机":"數位相機","U盘":"隨身碟","优盘":"隨身碟","知识产权":"智慧財產權","数字娱乐":"數位娛樂","博客":"部落格","论坛":"討論區","在线":"線上","关键词":"關鍵字","文本":"文字檔","程序":"程式","拷贝":"複製","卸载":"移除","音频":"語音","短信":"簡訊","掉线":"斷線","联系":"聯絡","调试":"除錯","端口":"埠","加载":"讀取","水平":"水準","纸巾":"面紙","卸载组件":"拆卸零件","洽飯":"吃飯","洽零食":"吃零食","屏蔽":"隱藏","屏幕":"螢幕","whl":"我好了","挨个":"逐一","牛逼":"太厲害啦","牛批":"太厲害啦","咋样":"怎樣","互联网":"網際網路","猴楼":"holo","丈育":"文盲",
  
"抵捂":"抵捂","紧捂":"緊摀","捂受":"捂受","卷著":"捲著","卷着":"捲著","咽著":"嚥著","咽着":"嚥著","布著":"佈著","布着":"佈著",
"干著":"幹著","干着":"幹著","系著":"繫著","系着":"繫著","怀念":"懷念","念著":"唸著","念着":"唸著","著干":"著幹","着干":"著幹","扎著":"紮著","扎着":"紮著","借著":"藉著","借着":"藉著","斗著":"鬥著","斗着":"鬥著","冲著":"衝著","冲着":"衝著","貴胄":"貴胄","華胄":"華胄","遐胄":"遐胄","胄子":"胄子","胄裔":"胄裔","裔胄":"裔胄",
"乙丑":"乙丑","丁丑":"丁丑","己丑":"己丑","辛丑":"辛丑","癸丑":"癸丑","小丑":"小丑","副丑":"副丑","咸阳":"咸陽","咸宜":"咸宜","咸丰":"咸豐","咸和":"咸和","咸池":"咸池","咸五":"咸五","彭咸":"彭咸","季咸":"季咸","阮咸":"阮咸","阿咸":"阿咸","巫咸":"巫咸","碧咸":"碧咸","赞同":"贊同","赞成":"贊成","赞助":"贊助","赞拜":"贊拜","赞普":"贊普","赞理":"贊理","赞礼":"贊禮","赞善":"贊善","赞翼":"贊翼","参赞":"參贊","依赞":"依贊","翊赞":"翊贊","辅赞":"輔贊","论赞":"論贊","宣赞":"宣贊","传赞":"傳贊","像赞":"像贊","象赞":"像贊","脏器":"臟器","脏腑":"臟腑","五脏":"五臟","内脏":"內臟","心脏":"心臟","肝脏":"肝臟","肺脏":"肺臟","胃脏":"胃臟","胰脏":"胰臟","脺脏":"脺臟","脾脏":"脾臟","肾脏":"腎臟","腑脏":"腑臟","肠脏":"腸臟","五岳":"五嶽","中岳":"中嶽","北岳":"北嶽","南岳":"南嶽","西岳":"西嶽","东岳":"東嶽","岳立":"嶽立","云南":"雲南","发小":"髮小","○余":"○餘","只余":"只餘","只兔":"隻兔","只字":"隻字","只影":"隻影","只手":"隻手","只牛":"隻牛","只犬":"隻犬"
,"只狗":"隻狗","只狼":"隻狼","只猴":"隻猴","只眼":"隻眼","只羊":"隻羊","只虎":"隻虎","只蛋":"隻蛋","只身":"隻身","只鬼":"隻鬼","只鹿":"隻鹿","只狮":"隻獅","只猪":"隻豬","只猫":"隻貓","只鸡":"隻雞","只马":"隻馬","只骡":"隻騾","只驴":"隻驢","只鸟":"隻鳥","只凤":"隻鳳","只鸭":"隻鴨","只鹅":"隻鵝","只鹰":"隻鷹","一只":"一隻","二只":"二隻","三只":"三隻","四只":"四隻","五只":"五隻","六只":"六隻","七只":"七隻","八只":"八隻","九只":"九隻","十只":"十隻","百只":"百隻","千只":"千隻","万只":"萬隻","两只":"兩隻","半只":"半隻","余只":"餘隻","那只":"那隻","首只":"首隻","数只":"數隻","几只":"幾隻","大只":"大隻","整只":"整隻","某只":"某隻","每只":"每隻","捉只":"捉隻","牛只":"牛隻","船只":"船隻","犬只":"犬隻","换只":"換隻","舰只":"艦隻","猪只":"豬隻","鸡只":"雞隻","一伙":"一夥","一周":"一週","一松":"一鬆","一游":"一遊","丈余":"丈餘","三周":"三週","上准":"上準","上周":"上週","上折":"上摺","上梁":"上樑","下咽":"下嚥","下梁":"下樑","不余":"不餘","不愈":"不癒","不斗":"不鬥","不系":"不繫","不舍":"不捨","不象":"不像","不采":"不採","不干":"不幹","主干":"主幹","久斗":"久鬥","之余":"之餘","之准":"之準","之游":"之遊","也象":"也像","了望":"瞭望","了然":"瞭然","了解":"瞭解","事干":"事幹","互斗":"互鬥","五周":"五週","五谷":"五穀","些象":"些像","交托":"交託","交游":"交遊","京沈":"京瀋","人干":"人幹","人游":"人遊","人象":"人像","什幺":"什麼","仍斗":"仍鬥","仍象":"仍像","他干":"他幹","他象":"他像","付托":"付託","仙游":"仙遊"
,"仙范":"仙範","代征":"代徵","令媛":"令嬡","仿佛":"彷彿","仿制":"仿製","仿徉":"彷徉","仿徨":"徬徨","规模":"規模","模效":"模傚","摹效":"摹傚","仿效":"倣傚","儆效":"儆傚","效尤":"傚尤","效法":"傚法","伙伴":"夥伴","伙同":"夥同","伙夫":"伙伕","伴伙":"伴夥","伴游":"伴遊","伶敏":"靈敏","伸卷":"伸捲","倒卷":"倒捲","兜卷":"兜捲","再卷":"再捲","包卷":"包捲","卷上":"捲上","卷了":"捲了","卷住":"捲住","卷入":"捲入","卷出":"捲出","卷到":"捲到","卷去":"捲去","卷向":"捲向","卷回":"捲回","卷土":"捲土","卷往":"捲往","卷得":"捲得","卷成":"捲成","卷拂":"捲拂","卷款":"捲款","卷毛":"捲毛","卷浪":"捲浪","卷碎":"捲碎","卷至":"捲至","卷舌":"捲舌","卷袖":"捲袖","卷裹":"捲裹","卷走":"捲走","卷起":"捲起","卷身":"捲身","卷逃":"捲逃","反卷":"反捲","去卷":"去捲","吹卷":"吹捲","呼卷":"呼捲","回卷":"回捲","地卷":"地捲","席卷":"席捲","快卷":"快捲","愈卷":"愈捲","越卷":"越捲","急卷":"急捲","掀卷":"掀捲","旋卷":"旋捲","暴卷":"暴捲","曲卷":"曲捲","流卷":"流捲","浪卷":"浪捲","潮卷":"潮捲","狂卷":"狂捲","猛卷":"猛捲","疾卷":"疾捲","直卷":"直捲","罩卷":"罩捲","翻卷":"翻捲","舒卷":"舒捲","被卷":"被捲","卷来":"捲來","卷个":"捲個","卷动":"捲動","卷扫":"捲掃","卷拢":"捲攏","卷涌":"捲湧","卷滚":"捲滾","卷烟":"捲菸","金发":"金髮","灰发":"灰髮","黑发":"黑髮","蓝发":"藍髮","白发":"白髮","紅发":"紅髮","焰发":"焰髮","卷发":"捲髮","卷帘":"捲簾","卷纸":"捲紙","卷缩":"捲縮","卷绕":"捲繞","卷缠":"捲纏","卷翘":"捲翹","卷卧":"捲臥","卷荡":"捲蕩","卷袭":"捲襲","卷轴":"捲軸","卷进":"捲進","卷过":"捲過","卷开":"捲開","卷须":"卷鬚"
,"卷风":"捲風","卷飞":"捲飛","扫卷":"掃捲","挥卷":"揮捲","扑卷":"撲捲","横卷":"橫捲","涌卷":"湧捲","滚卷":"滾捲","烟卷":"菸卷","激发":"激發","发卷":"髮卷","盘卷":"盤捲","紧卷":"緊捲","缠卷":"纏捲","袭卷":"襲捲","连卷":"連卷","风卷":"風捲","飙卷":"飆捲","飞卷":"飛捲","伺奉":"侍奉","低迥":"低迴","住扎":"住紮","余丈":"餘丈","余下":"餘下","余事":"餘事","余人":"餘人","余位":"餘位","余低":"餘低","余僧":"餘僧","余光":"餘光","余刃":"餘刃","余利":"餘利","余剩":"餘剩","余力":"餘力","余勇":"餘勇","余匪":"餘匪","余匹":"餘匹","余名":"餘名","余味":"餘味","余地":"餘地","余天":"餘天","余姚":"餘姚","余威":"餘威","余子":"餘子","余字":"餘字","余存":"餘存","余孽":"餘孽","余寸":"餘寸","余尺":"餘尺","余年":"餘年","余座":"餘座","余弦":"餘弦","余怒":"餘怒","余恨":"餘恨","余息":"餘息","余悸":"餘悸","余情":"餘情","余日":"餘日","余暇":"餘暇","余月":"餘月","余杭":"餘杭","余枝":"餘枝","余桶":"餘桶","余次":"餘次","余款":"餘款","余殃":"餘殃","余毒":"餘毒","余波":"餘波","余漏":"餘漏","余烈":"餘烈","余物":"餘物","余生":"餘生","余缺":"餘缺","余羹":"餘羹","余者":"餘者","余裕":"餘裕","余路":"餘路","余辜":"餘辜","余震":"餘震","余音":"餘音","余香":"餘香","佛象":"佛像","作准":"作準","作崇":"作祟","你干":"你幹","你象":"你像","佳肴":"佳餚","例范":"例範","供制":"供製","依准":"依準","依托":"依託","侵范":"侵範","便松":"便鬆","便象":"便像","保准":"保準","信托":"信託","修浚":"修濬","俱象":"俱像","倍余":"倍餘","倏松":"倏鬆"
,"倒象":"倒像","借以":"藉以","借口":"藉口","借托":"借託","借故":"藉故","倦游":"倦遊","停制":"停製","停征":"停徵","偶象":"偶像","偷梁":"偷樑","傍徨":"徬徨","傒幸":"傒倖","像征":"象徵","元凶":"元兇","先奸":"先姦","光念":"光唸","克夫":"剋夫","克扣":"剋扣","克日":"剋日","克星":"剋星","克期":"剋期","克死":"剋死","克苦":"刻苦","克薄":"剋薄","免征":"免徵","入伙":"入夥","全象":"全像","八周":"八週","公余":"公餘","公布":"公佈","公干":"公幹","六周":"六週","六欲":"六慾","共制":"共製","共御":"共禦","共斗":"共鬥","其余":"其餘","典范":"典範","再制":"再製","再干":"再幹","再斗":"再鬥","再松":"再鬆","再象":"再像","冗余":"冗餘","冬台":"冬颱","冶游":"冶遊","准些":"準些","准准":"準準","准到":"準到","准定":"準定","准度":"準度","准得":"準得","准星":"準星","准是":"準是","准有":"準有","死准":"死準","准直":"準直","准知":"準知","准能":"準能","准被":"準被","准要":"準要","凝干":"凝乾","凶嫌":"兇嫌","凶徒":"兇徒","凶案":"兇案","凶犯":"兇犯","凶猛":"兇猛","出游":"出遊","函容":"涵容","函意":"涵意","函洞":"涵洞","函濡":"涵濡","函煦":"涵煦","函管":"涵管","函蓄":"涵蓄","散伙":"散夥","分伙":"分夥","分布":"分佈","分象":"分像","分量":"份量","刑余":"刑餘","初愈":"初癒","初斗":"初鬥","刨刀":"鉋刀","刨削":"鉋削","刨花":"鉋花","刨子":"鉋子","推刨":"推鉋","利欲":"利慾","刮倒":"颳倒","刮胡":"刮鬍","刮起":"颳起",
"制丹":"製丹","制件":"製件","制作":"製作","制做":"製做","制冰":"製冰","制冷":"製冷","制出":"製出","制品":"製品","制器":"製器","制成":"製成","制播":"製播","制材":"製材","制毒":"製毒","制法":"製法","制片":"製片","制版":"製版","制程":"製程","制糖":"製糖","制衣":"製衣","制表":"製表","制造":"製造","制醋":"製醋","制面":"製麵","制革":"製革","制鞋":"製鞋",
"刺准":"刺準","刻象":"刻像","剉冰":"銼冰","剉刀":"銼刀","剉工":"銼工","剉平":"銼平","土剉":"土銼","扁剉":"扁銼","板剉":"板銼","剩肴":"剩餚","剪彩":"剪綵","剪除":"翦除","割舍":"割捨","力干":"力幹","力拼":"力拚","力斗":"力鬥","劫余":"劫餘","劾系":"劾繫","勇斗":"勇鬥","勤朴":"勤樸","勾干":"勾幹","包准":"包準","包函":"包涵","包扎":"包紮","包谷":"包穀","北回":"北迴","北游":"北遊","匪干":"匪幹","十余":"十餘","十周":"十週","千余":"千餘","卅余":"卅餘","升官":"陞官","升平":"昇平","升汞":"昇汞","升泰":"昇泰","半干":"半乾","南回":"南迴","南游":"南遊","博斗":"博鬥","印制":"印製","去采":"去採","去干":"去幹","又干":"又幹","又斗":"又鬥","又松":"又鬆","又象":"又像","取余":"取餘","取舍":"取捨","受托":"受託","受雇":"受僱","口干":"口乾","古朴":"古樸","另辟":"另闢","可象":"可像","可采":"可採","台凳":"檯凳","台制":"台製","台子":"檯子","台布":"檯布","台干":"台幹","台面":"檯面","吃准":"吃準","吃干":"吃乾","吃茶":"喫茶","吃面":"吃麵","合伙":"合夥","合斗":"合鬥","合府":"闔府","合第":"闔第","捭合":"捭闔","辟阖":"闢闔","吊信":"弔信","吊古":"弔古","吊唁":"弔唁","吊奠":"弔奠","吊孝":"弔孝","吊客":"弔客","吊影":"弔影","吊念":"弔念","吊慰":"弔慰","吊文":"弔文","吊民":"弔民","吊祭":"弔祭"
,"同伙":"同夥","同游":"同遊","吐干":"吐乾","向准":"向準","向午":"晌午","向往":"嚮往","吞咽":"吞嚥","吟游":"吟遊","吧台":"吧檯","吮干":"吮乾","吵斗":"吵鬥","吸干":"吸乾","吹干":"吹乾","吹胡":"吹鬍",
"周一":"週一","周三":"週三","周二":"週二","周五":"週五","周休":"週休","周六":"週六","周刊":"週刊","周四":"週四","周年":"週年","周息":"週息","周日":"週日","周期":"週期","周末":"週末","周波":"週波","周游":"周遊","周薪":"週薪","周遭":"週遭","呷干":"呷乾","咀咽":"咀嚥","咎征":"咎徵","咨商":"諮商","咽下":"嚥下","咽了":"嚥了","咽住":"嚥住","咽入":"嚥入","咽唾":"嚥唾","咽嚼":"嚥嚼","咽回":"嚥回","咽食":"嚥食","哀吊":"哀弔","哪象":"哪像","唁吊":"唁弔","唱游":"唱遊","喂它":"餵牠","喂羊":"餵羊","善斗":"善鬥","喉干":"喉乾","喝干":"喝乾","喧染":"渲染","嘴干":"嘴乾","嘹亮":"嘹喨","四舍":"四捨","回圈":"迴圈","回廊":"迴廊","回旋":"迴旋","回游":"迴游","回翔":"迴翔","回避":"迴避","困乏":"睏乏","困倦":"睏倦","困意":"睏意","圈梁":"圈樑","土制":"土製","地志":"地誌","均沾":"均霑","坤范":"坤範","垂范":"垂範","型范":"型範","基准":"基準","基干":"基幹","塑象":"塑像","墓志":"墓誌","增辟":"增闢","外制":"外製","多余":"多餘","夜游":"夜遊","大伙":"大夥","大斗":"大鬥","天佑":"天祐","太准":"太準","太干":"太乾","太松":"太鬆","太象":"太像","夫奸":"夫姦","夫役":"伕役","失准":"失準","奇准":"奇準","奏折":"奏摺","奸凶":"姦凶","奸夫":"姦夫","奸情":"姦情","奸拐":"姦拐","奸污":"姦污","奸淫":"姦淫","奸通":"姦通","她干":"她幹"
,"她象":"她像","好准":"好準","好干":"好幹","好斗":"好鬥","好象":"好像","委托":"委託","姜是":"薑是","姜末":"薑末","姜汁":"薑汁","姜油":"薑油","姜片":"薑片","姜糖":"薑糖","姜花":"薑花","姜茶":"薑茶","姜醋":"薑醋","娉亭":"娉婷","婀挪":"婀娜","嫌凶":"嫌兇","嬉游":"嬉遊","嬖幸":"嬖倖","嬴余":"嬴餘","子姜":"子薑","存折":"存摺","它象":"它像","守御":"守禦","宏基":"宏碁","定制":"客製","定干":"定幹","客游":"客遊","宣布":"宣佈","宦游":"宦遊","宴游":"宴遊","家伙":"傢伙","家俱":"傢俱","家私":"傢俬","宸游":"宸遊","容范":"容範","寄托":"寄託","密布":"密佈","密折":"密摺","密致":"密緻","富余":"富餘","寒喧":"寒暄","寒栗":"寒慄","寡欲":"寡慾","寸余":"寸餘","射准":"射準","射雕":"射鵰","尊范":"尊範","小伙":"小夥","少干":"少幹","尚余":"尚餘","尤如":"猶如","尤疑":"猶疑","尤豫":"猶豫","就范":"就範","就象":"就像","尺余":"尺餘","局促":"侷促","局蹙":"跼蹙","局躅":"跼躅","局限":"侷限","屋梁":"屋樑","屯扎":"屯紮","峰回":"峰迴","巡回":"巡迴","巡游":"巡遊","工余":"工餘","巧干":"巧幹","巨制":"巨製","己干":"己幹","已余":"已餘","已愈":"已癒","已松":"已鬆","已象":"已像","布伏":"佈伏","布署":"佈署","布兵":"佈兵","布告":"佈告","布局":"佈局","布施":"佈施","布景":"佈景","布置":"佈置","布谷":"布穀","布防":"佈防","布雷":"佈雷","席子":"蓆子","常干":"常幹","快干":"快乾","干一":"幹一","干上":"幹上","干不":"幹不","干了":"幹了","干事":"幹事","干井":"乾井","干些":"幹些","干什":"幹什","干他":"幹他","干件":"幹件","干份":"幹份"
,"干似":"乾似","干你":"幹你","干假":"幹假","干冰":"乾冰","干冷":"乾冷","干出":"幹出","干到":"幹到","干化":"乾化","干吏":"幹吏","干咳":"乾咳","干咽":"乾嚥","干品":"乾品","干哥":"乾哥","干哪":"幹哪","干啥":"幹啥","干嘛":"幹嘛","干嚎":"乾嚎","干土":"乾土","干坤":"乾坤","干她":"幹她","干好":"幹好","干妹":"乾妹","干姊":"乾姊","干姐":"乾姐","干姜":"乾薑","干娘":"乾娘","干季":"乾季","干完":"幹完","干巴":"乾巴","干布":"乾布","干干":"乾乾","干式":"乾式","干弟":"乾弟","干得":"幹得","干性":"乾性","干成":"幹成","干我":"幹我","干才":"幹才","干掉":"幹掉","干探":"幹探","干料":"乾料","干旱":"乾旱","干材":"幹材","干杯":"乾杯","干果":"乾果","干枝":"乾枝","干枯":"乾枯","干架":"幹架","干柴":"乾柴","干校":"幹校","干梅":"乾梅","干此":"幹此","干沙":"乾沙","干泥":"乾泥","干洗":"乾洗","干活":"幹活","干流":"幹流","干涸":"乾涸","干渴":"乾渴","干焦":"乾焦","干熬":"乾熬","干燥":"乾燥","干爸":"乾爸","干爹":"乾爹","干爽":"乾爽","干球":"乾球","干甚":"幹甚","干疤":"乾疤","干瘦":"乾瘦","干眼":"乾眼","干瞪":"乾瞪","干硬":"乾硬","干窘":"乾窘","干笑":"乾笑","干等":"乾等","干粉":"乾粉","干系":"干係","干耗":"乾耗","干肉":"乾肉","干股":"乾股","干脆":"乾脆","干花":"乾花","干草":"乾草","干菜":"乾菜","干薪":"乾薪","干衣":"乾衣","干裂":"乾裂","干警":"幹警","干起":"幹起","干路":"幹路","干透":"乾透","干道":"幹道","干那":"幹那","干部":"幹部","干酪":"乾酪","干醋":"乾醋","干隆":"乾隆","干面":"乾麵","平准":"平準","年余":"年餘"
,"幸免":"倖免","幸存":"倖存","幸幸":"倖幸","幽郁":"幽鬱","床席":"床蓆","床第":"床笫","店伙":"店夥","座象":"座像","康愈":"康癒","廿余":"廿餘","弄干":"弄乾","弄松":"弄鬆","弦歌":"絃歌","弦琴":"絃琴","弦管":"絃管","弦索":"絃索","弱干":"弱幹","彩牌":"綵牌","彩球":"綵球","彩衣":"綵衣","彩裳":"綵裳","影象":"影像","彷佛":"彷彿","彷徨":"徬徨","征了":"徵了","征人":"徵人","征信":"徵信","征候":"徵候","征兆":"徵兆","征入":"徵入","征兵":"徵兵","征募":"徵募","西征":"西征","东征":"東征","南征":"南征","北征":"北征","长征":"長征","出征":"出征","亲征":"親征","征去":"徵去","征友":"徵友","征取":"徵取","征召":"徵召","征地":"徵地","征婚":"徵婚","征引":"徵引","征得":"徵得","征收":"徵收","征文":"徵文","征求":"徵求","征片":"徵片","征用":"徵用","征稿":"徵稿","征管":"徵管","征聘":"徵聘","征象":"徵象","征逐":"徵逐","征集":"徵集","很准":"很準","很干":"很乾","很松":"很鬆","很象":"很像","徒托":"徒託","得准":"得準","得象":"得像","御侮":"禦侮","御制":"御製","御寇":"禦寇","御寒":"禦寒","徨恐":"惶恐","微松":"微鬆","心系":"心繫","必游":"必遊","志哀":"誌哀","志喜":"誌喜","念佛":"唸佛","念作":"唸作","念到":"唸到","念咒":"唸咒","念好":"唸好","念完":"唸完","念得":"唸得","念念":"唸唸","念成":"唸成","念法":"唸法","忽松":"忽鬆","怎幺":"怎麼","怖栗":"怖慄","急征":"急徵","性征":"性徵","性欲":"性慾","恂栗":"恂慄","恰象":"恰像","悒郁":"悒鬱","悚栗":"悚慄","悠游":"悠遊","悲戚":"悲慼","悲泯":"悲憫","悲郁":"悲鬱","悸栗":"悸慄"
,"情欲":"情慾","惕栗":"惕慄","想干":"想幹","想斗":"想鬥","想象":"想像","惴栗":"惴慄","惶栗":"惶慄","惺松":"惺忪","愁郁":"愁鬱","愈合":"癒合","愈象":"愈像","意函":"意涵","慢咽":"慢嚥","慰借":"慰藉","懈松":"懈鬆","懊郁":"懊鬱","郁懊":"鬱懊","懰栗":"懰慄","懿范":"懿範","我干":"我幹","我象":"我像","或松":"或鬆","或采":"或採","戚嗟":"慼嗟","戚然":"慼然","戴表":"戴錶","所余":"所餘","所干":"所幹","所系":"所繫","改采":"改採","手松":"手鬆","手表":"手錶","手采":"手採","才干":"才幹","才象":"才像","扎上":"紮上","扎住":"紮住","扎囮":"紮囮","扎寨":"紮寨","扎彩":"紮彩","扎成":"紮成","扎裹":"紮裹","扎起":"紮起","打制":"打製","打斗":"打鬥","打谷":"打穀","酒托":"酒托","当托":"當托","托了":"託了","托事":"託事","托交":"託交","托人":"託人","托付":"託付","托古":"託古","托名":"託名","托咎":"託咎","托大":"託大","托孤":"託孤","托故":"託故","托疾":"託疾","托病":"託病","托管":"託管","托言":"託言","托身":"託身","扛丸":"摃丸","扣准":"扣準","扮象":"扮像","扶余":"扶餘","批斗":"批鬥","批注":"批註","找准":"找準","承制":"承製","把姜":"把薑","抑郁":"抑鬱","抓准":"抓準","抓奸":"抓姦","抓斗":"抓鬥","投准":"投準","抗御":"抗禦","抗斗":"抗鬥","折子":"摺子","折扇":"摺扇","折痕":"摺痕","折裙":"摺裙","抬扛":"抬摃","抵御":"抵禦","抹台":"抹檯","抹干":"抹乾","抽干":"抽乾","拆伙":"拆夥","拆斗":"拆鬥","拉面":"拉麵","拌面":"拌麵","拐子":"枴子","拐仔":"枴仔","拐杖":"枴杖","拐棍":"枴棍","钢拐":"鋼枴","铁拐":"鐵枴","木拐":"木枴"
,"双拐":"雙枴","拓朴":"拓樸","拘系":"拘繫","拜托":"拜託","拭干":"拭乾","拼力":"拚力","拼命":"拚命","拼搏":"拚搏","拼政":"拚政","拼斗":"拚鬥","拼死":"拚死","拼活":"拚活","拼生":"拚生","拼舍":"拚捨","拿准":"拿準","拿奸":"拿姦","挑斗":"挑鬥","挖松":"挖鬆","挹郁":"挹鬱","挺准":"挺準","挺象":"挺像","挽歌":"輓歌","挽近":"輓近","捆扎":"捆紮","捉准":"捉準","捉奸":"捉姦","捋胡":"捋鬍","捍御":"捍禦","捏准":"捏準","捏制":"捏製","捻手":"撚手","捻指":"撚指","捻胡":"捻鬍","捻花":"撚花","捻香":"撚香","掘松":"掘鬆","接斗":"接鬥","揉制":"揉製","揉面":"揉麵","握准":"握準","揩台":"揩檯","揩干":"揩乾","揪采":"揪採","搏斗":"搏鬥","搜集":"蒐集","搜罗":"蒐羅","搜证":"蒐證","搜购":"蒐購","摸准":"摸準","撬松":"撬鬆","擐系":"擐繫","擦干":"擦乾","收采":"收採","改采":"改採","放姜":"放薑","放松":"放鬆","故布":"故佈","敖游":"敖遊","教悔":"教誨","教范":"教範","敢干":"敢幹","敢念":"敢唸","敢拼":"敢拚","敢斗":"敢鬥","敢松":"敢鬆","散布":"散佈","散署":"佈署","整周":"整週","文斗":"文鬥","斗一":"鬥一","秤斗":"秤斗","便斗":"便斗","斗上":"鬥上","斗不":"鬥不","斗久":"鬥久","斗了":"鬥了","斗他":"鬥他","斗你":"鬥你","斗倒":"鬥倒","斗出":"鬥出","斗到":"鬥到","斗力":"鬥力","斗勇":"鬥勇","斗去":"鬥去","斗口":"鬥口","斗命":"鬥命","烟斗":"菸斗","斗嘴":"鬥嘴","斗在":"鬥在","斗垮":"鬥垮","斗士":"鬥士","斗奇":"鬥奇","斗她":"鬥她","斗妍":"鬥妍","斗完":"鬥完","斗弄":"鬥弄","斗得":"鬥得","斗心":"鬥心","斗忍":"鬥忍","斗志":"鬥志"
,"斗快":"鬥快","斗意":"鬥意","斗成":"鬥成","斗我":"鬥我","斗批":"鬥批","斗技":"鬥技","斗招":"鬥招","斗拳":"鬥拳","斗掌":"鬥掌","斗斗":"鬥鬥","斗智":"鬥智","斗棋":"鬥棋","斗法":"鬥法","斗牛":"鬥牛","斗狗":"鬥狗","斗狠":"鬥狠","斗眼":"鬥眼","斗神":"鬥神","斗私":"鬥私","斗草":"鬥草","斗角":"鬥角","斗起":"鬥起","斗趣":"鬥趣","斗酒":"鬥酒","斗魂":"鬥魂","料准":"料準","新征":"新徵","施舍":"施捨","旁注":"旁註","旅游":"旅遊","旋松":"旋鬆","旗幡":"旗旛","既象":"既像","日余":"日餘","日制":"日製","日升":"日昇","日志":"日誌","日游":"日遊","旬余":"旬餘","昆山":"崑山","昆曲":"崑曲","昆腔":"崑腔","明范":"明範","易松":"易鬆","映象":"映像","春游":"春遊","景致":"景緻","智斗":"智鬥","晾干":"晾乾","愚暗":"愚闇","暗冥":"闇冥","暗劣":"闇劣","暗弱":"闇弱","暗然":"闇然","暗伦":"闇倫","暗斗":"暗鬥","曲酒":"麴酒","更准":"更準","更松":"更鬆","更象":"更像","最准":"最準","月余":"月餘","有余":"有餘","有象":"有像","夏朝":"夏朝","商朝":"商朝","周朝":"周朝","秦朝":"秦朝","汉朝":"漢朝","晋朝":"晉朝","隋朝":"隋朝","唐朝":"唐朝","宋朝":"宋朝","元朝":"元朝","明朝":"明朝","清朝":"清朝","天朝":"天朝","兲朝":"兲朝","我朝":"我朝","面朝":"面朝","朝干":"朝乾","木制":"木製","木梁":"木樑","未干":"未乾","未愈":"未癒","未斗":"未鬥","本周":"本週","朱喻":"硃喻","朱批":"硃批","朱砂":"硃砂","朴拙":"樸拙","朴玉":"璞玉","朴直":"樸直","朴素":"樸素","朴野":"樸野","药材":"藥材","材干":"材幹","杯干":"杯乾","杯面":"杯麵","松了":"鬆了"
,"松些":"鬆些","松化":"鬆化","轻松":"輕鬆","阿松":"阿松","松去":"鬆去","松口":"鬆口","松土":"鬆土","松垮":"鬆垮","松塌":"鬆塌","松干":"松幹","松弛":"鬆弛","松快":"鬆快","松懈":"鬆懈","松手":"鬆手","松掉":"鬆掉","松放":"鬆放","松散":"鬆散","松晃":"鬆晃","松松":"鬆鬆","松柔":"鬆柔","松泛":"鬆泛","松浮":"鬆浮","松筋":"鬆筋","松糕":"鬆糕","松肘":"鬆肘","松肩":"鬆肩","松脆":"鬆脆","松腰":"鬆腰","松解":"鬆解","松骨":"鬆骨","果干":"果乾","枝干":"枝幹","枯干":"枯幹","架梁":"架樑","柱梁":"柱樑","栗冽":"慄冽","栗栗":"慄慄","栗然":"慄然","校准":"校準","株象":"株像","格斗":"格鬥","格范":"格範","桑干":"桑乾","梁上":"樑上","梁下":"樑下","梁折":"樑折","梁柱":"樑柱","梁脊":"樑脊","械斗":"械鬥","棉制":"棉製","棵象":"棵像","榨取":"搾取","榨干":"搾乾","模制":"模製","模范":"模範","樵采":"樵採","欠准":"欠準","欲壑":"慾壑","欲女":"慾女","欲孽":"慾孽","欲念":"慾念","欲望":"慾望","欲海":"慾海","欲火":"慾火","欲舍":"欲捨","欲障":"慾障","欺蒙":"欺矇","正象":"正像","武斗":"武鬥","死斗":"死鬥","母范":"母範","每周":"每週","比拼":"比拚","比斗":"比鬥","毛制":"毛製","毛姜":"毛薑","民制":"民製","氤郁":"氤鬱","水准":"水準","水干":"水乾","水濂":"水簾","永志":"永誌","污蔑":"污衊","沈淀":"沈澱","沈郁":"沈鬱","沉淀":"沉澱","沉郁":"沉鬱","油面":"油麵","治愈":"治癒","治疔":"治療","沾污":"玷汙","沾辱":"玷辱","泛游":"泛遊","泡制":"泡製","泡面":"泡麵","泥象":"泥像","关注":"關注","注上":"註上","注失":"註失","注明":"註明"
,"注疏":"註疏","注解":"註解","注：":"註：","泱郁":"泱鬱","洪范":"洪範","洲杯":"洲盃","洲游":"洲遊","活干":"活幹","活象":"活像","流干":"流乾","浚深":"濬深","浮松":"浮鬆","海函":"海涵","海干":"海乾","浸制":"浸製","涂制":"塗製","淀粉":"澱粉","淑范":"淑範","淫欲":"淫慾","淳朴":"淳樸","混肴":"混淆","清淅":"清晰","港制":"港製","游人":"遊人","游仙":"遊仙","游伴":"遊伴","游兵":"遊兵","游冶":"遊冶","游刃":"遊刃","游唱":"遊唱","游子":"遊子","游客":"遊客","游宦":"遊宦","游山":"遊山","游巡":"遊巡","游廊":"遊廊","游惰":"遊惰","游憩":"遊憩","游斗":"游鬥","游方":"遊方","游星":"遊星","游湖":"遊湖","游牧":"遊牧","游狎":"遊狎","游玩":"遊玩","游目":"遊目","游船":"遊船","游艇":"遊艇","游蜂":"遊蜂","游行":"遊行","游街":"遊街","游豫":"遊豫","游走":"遊走","游逛":"遊逛","游遍":"遊遍","游魂":"遊魂","湮郁":"湮鬱","溪壑":"谿壑","溶岩":"熔岩","溶接":"熔接","滴干":"滴乾","漓水":"灕水","漓江":"灕江","漓湘":"灕湘","漫游":"漫遊","激干":"激幹","激斗":"激鬥","濛松":"濛鬆","灌制":"灌製","火折":"火摺","火拼":"火拚","灰胡":"灰鬍","灰蒙":"灰濛","灰郁":"灰鬱","炒干":"炒乾","炒面":"炒麵","炮制":"炮製","烘制":"烘製","烘干":"烘乾","烘熏":"烘燻","烤干":"烤乾","烹制":"烹製","焊接":"銲接","焙干":"焙乾","焦干":"焦乾","然象":"然像","煎制":"煎製","照准":"照準","照干":"照幹","照象":"照像","煨干":"煨乾","煮面":"煮麵","熏制":"燻製","熏煮":"燻煮","熏熏":"燻燻","熏熟":"燻熟","熏肉":"燻肉","熏蒸":"燻蒸","熏黑":"燻黑","熨干":"熨乾"
,"熬制":"熬製","燕游":"燕遊","片姜":"片薑","物志":"物誌","物欲":"物慾","特制":"特製","特征":"特徵","犁牛":"犛牛","狂征":"狂徵","狠干":"狠幹","狠斗":"狠鬥","狼借":"狼藉","猛干":"猛幹","猛斗":"猛鬥","猜准":"猜準","猷豫":"猶豫","玉佩":"玉珮","玉制":"玉製","球台":"球檯","球果":"毬果","球童":"球僮","琅嬛":"瑯嬛","琢制":"琢製","琳琅":"琳瑯","瑞哲":"睿哲","瑞智":"睿智","瓷制":"瓷製","甘薯":"甘藷","甚准":"甚準","甚松":"甚鬆","生克":"生剋","生姜":"生薑","略干":"略乾","略松":"略鬆","番薯":"蕃薯","疏松":"疏鬆","疏浚":"疏濬","疑系":"疑係","疲困":"疲睏","病征":"病徵","病愈":"病癒","痊愈":"痊癒","白淅":"白皙","白澈":"白皙","百余":"百餘","皆准":"皆準","皮制":"皮製","皮松":"皮鬆","盆吊":"盆弔","盈余":"盈餘","盍然":"溘然","盍盍":"溘溘","盍逝":"溘逝","盯准":"盯準","盲干":"盲幹","直干":"直幹","相克":"相剋","相准":"相準","相奸":"相姦","相拼":"相拚","相斗":"相鬥","相象":"相像","看准":"看準","真准":"真準","真凶":"真兇","真象":"真像","眩耀":"炫耀","眼困":"眼睏","眼框":"眼眶","瞄准":"瞄準","瞅准":"瞅準","瞥准":"瞥準","瞧准":"瞧準","石制":"石製","石梁":"石樑","石象":"石像","砍准":"砍準","研制":"研製","硬干":"硬幹","硬拼":"硬拚","碑志":"碑誌","碗干":"碗乾","碗面":"碗麵","磁制":"磁製","磋跎":"蹉跎","磨制":"磨製","示范":"示範","神佑":"神祐","神准":"神準","神游":"神遊","神祗":"神祇","神象":"神像","祭吊":"祭弔","禁欲":"禁慾","私斗":"私鬥","私欲":"私慾","秋千":"鞦韆","秋台":"秋颱","秋游":"秋遊","秒表":"秒錶"
,"秘制":"秘製","稀松":"稀鬆","稍松":"稍鬆","稻谷":"稻穀","稽康":"嵇康","稽征":"稽徵","空余":"空餘","空蒙":"空濛","窒欲":"窒慾","窗台":"窗檯","窣悉":"窣窸","竟象":"竟像","童仆":"僮僕","童婢":"僮婢","竹制":"竹製","竹席":"竹蓆","竹框":"竹筐","竹荀":"竹筍","竹藤":"竹籐","笆蕉":"芭蕉","等侯":"等候","筋斗":"觔斗","算准":"算準","箱函":"箱涵","篷松":"篷鬆","籍口":"藉口","米余":"米餘","米谷":"米穀","粉制":"粉製","粉干":"粉乾","粗制":"粗製","粗朴":"粗樸","精准":"精準","精制":"精製","精干":"精幹","精致":"精緻","精辟":"精闢","糊口":"餬口","糟塌":"糟蹋","糟遢":"糟蹋","系上":"繫上","系乎":"繫乎","系了":"繫了","系住":"繫住","系囚":"繫囚","系妥":"繫妥","系引":"係引","系心":"繫心","系念":"繫念","系手":"繫手","系指":"係指","系牢":"繫牢","系留":"繫留","系累":"係累","系腰":"繫腰","系膜":"繫膜","系裹":"繫裹","系起":"繫起","系踵":"係踵","素朴":"素樸","紫姜":"紫薑","累累":"纍纍","縻系":"縻繫","纂位":"篡位","缺舌":"鴃舌","罔然":"惘然","罔罔":"惘惘","罩准":"罩準","美制":"美製","羞赦":"羞赧","羡余":"羨餘","群斗":"群鬥","群象":"群像","羹面":"羹麵","翕辟":"翕闢","翦彩":"翦綵","翱游":"翱遊","翻台":"翻檯","翻松":"翻鬆","老姜":"老薑","老板":"老闆","考征":"考徵","者系":"者係","而象":"而像","耗干":"耗乾","聘雇":"聘僱","肉干":"肉乾","肉松":"肉鬆","肉欲":"肉慾","肉面":"肉麵","肖象":"肖像","股栗":"股慄","肯干":"肯幹","肴撰":"餚饌","背系":"背繫","胡子":"鬍子","胡干":"胡幹","胡梢":"鬍梢","胡渣":"鬍渣","胡髭":"鬍髭"
,"胡髯":"鬍髯","能干":"能幹","能舍":"能捨","能象":"能像","脊梁":"脊樑","腐余":"腐餘","腕表":"腕錶","腮胡":"腮鬍","腰干":"腰幹","腰系":"腰繫","膨松":"膨鬆","膺品":"贗品","自愈":"自癒","自采":"自採","致密":"緻密","舂谷":"舂穀","舄湖":"潟湖","舍出":"捨出","宿舍":"宿舍","舍去":"捨去","舍命":"捨命","舍己":"捨己","舍得":"捨得","舍本":"捨本","舍死":"捨死","舍生":"捨生","舍短":"捨短","舍身":"捨身","舍近":"捨近","舔干":"舔乾","舞娘":"舞孃","舟揖":"舟楫","般准":"般準","舶船":"泊船","船夫":"船伕","船梁":"船樑","船蓬":"船篷","良游":"良遊","色欲":"色慾","花雕":"花彫","苛征":"苛徵","若象":"若像","苦干":"苦幹","苦斗":"苦鬥","英寸":"英吋","英尺":"英呎","范例":"範例","范式":"範式","范文":"範文","范本":"範本","范行":"範行","茶余":"茶餘","茶毒":"荼毒","草席":"草蓆","菜干":"菜乾","菜肴":"菜餚","蒙住":"矇住","蒙叟":"矇叟","蒙懂":"懞懂","蒙敝":"矇蔽","蒙昧":"矇昧","蒙混":"矇混","蒙瞀":"矇瞀","蒙瞢":"矇瞢","蒙瞽":"矇瞽","蒙蒙":"濛濛","蒙蔽":"矇蔽","蒲席":"蒲蓆","蒸干":"蒸乾","蓊郁":"蓊鬱","蓬松":"蓬鬆","薄幸":"薄倖","藤制":"藤製","藤椅":"籐椅","虎咽":"虎嚥","虎斗":"虎鬥","蛩音":"跫音","蟹螫":"蟹螯","血斗":"血鬥","行凶":"行兇","行游":"行遊","表店":"錶店","表征":"表徵","表范":"表範","被干":"被幹","被褥":"被縟","裁制":"裁製","裕余":"裕餘","裹扎":"裹紮","襁保":"襁褓","西昆":"西崑","西游":"西遊","要斗":"要鬥","要象":"要像","角斗":"角鬥","解象":"解像","解雇":"解僱","警剔":"警惕","谷子":"穀子","谷物":"穀物"
,"谷皮":"穀皮","谷神":"穀神","谷稻":"穀稻","谷米":"穀米","谷粉":"穀粉","谷粒":"穀粒","谷粟":"穀粟","谷苗":"穀苗","谷草":"穀草","谷道":"穀道","谷雨":"穀雨","豁壑":"谿壑","豆制":"豆製","豆蔻":"荳蔻","豆鼓":"豆豉","象一":"像一","象三":"像三","象二":"像二","象些":"像些","象人":"像人","象什":"像什","象今":"像今","象他":"像他","象似":"像似","象你":"像你","象其":"像其","象在":"像在","象她":"像她","象它":"像它","象已":"像已","象往":"像往","象征":"象徵","象您":"像您","象我":"像我","象昨":"像昨","对象":"對象","象是":"像是","象有":"像有","象水":"像水","象永":"像永","象片":"像片","象甚":"像甚","象素":"像素","象要":"像要","象那":"像那","象雨":"像雨","象鬼":"像鬼","赤坎":"赤崁","起哄":"起鬨","起干":"起幹","超征":"超徵","越准":"越準","越斗":"越鬥","越象":"越像","跖骨":"蹠骨","跟斗":"觔斗","跳梁":"跳樑","跳表":"跳錶","蹉陀":"蹉跎","躁郁":"躁鬱","身分":"身份","身系":"身繫","躬敬":"恭敬","辟佛":"闢佛","辟作":"闢作","辟土":"闢土","辟地":"闢地","辟室":"闢室","辟建":"闢建","辟田":"闢田","辟谷":"辟榖","辟透":"闢透","辣面":"辣麵","迂回":"迂迴","迎斗":"迎鬥","迥廊":"迴廊","迥避":"迴避","迷奸":"迷姦","迷朦":"迷濛","迷罔":"迷惘","迷蒙":"迷濛","追凶":"追兇","追朔":"追溯","透辟":"透闢","通奸":"通姦","通浚":"通濬","逞凶":"逞兇","速干":"速乾","造象":"造像","逼奸":"逼姦","逾年":"踰年","逾矩":"踰矩","逾越":"踰越","遍布":"遍佈","遐疵":"瑕疵","道坎":"道檻","遨游":"遨遊","邀斗":"邀鬥","邂怠":"懈怠"
,"邋塌":"邋遢","邋蹋":"邋遢","邪欲":"邪慾","郁卒":"鬱卒","郁堙":"鬱堙","郁塞":"鬱塞","郁巍":"鬱巍","郁律":"鬱律","郁怒":"鬱怒","郁悒":"鬱悒","郁抑":"鬱抑","郁挹":"鬱挹","郁暗":"鬱暗","郁林":"鬱林","郁沈":"鬱沈","郁沉":"鬱沉","郁泱":"鬱泱","郁火":"鬱火","郁燠":"鬱燠","郁症":"鬱症","郁痛":"鬱痛","郁蓊":"鬱蓊","郁血":"鬱血","郁邑":"鬱邑","郁郁":"鬱鬱","郁黑":"鬱黑","郊游":"郊遊","郭朴":"郭璞","都象":"都像","配制":"配製","酒曲":"酒麴","酒肴":"酒餚","酣斗":"酣鬥","酥松":"酥鬆","酸疼":"痠疼","酸痛":"痠痛","醇朴":"醇樸","醮墨":"蘸墨","采伐":"採伐","采供":"採供","采信":"採信","采光":"採光","采卵":"採卵","采取":"採取","采拾":"採拾","采挖":"採挖","采掘":"採掘","采摘":"採摘","采摭":"採摭","采收":"採收","采桑":"採桑","采梅":"採梅","采樵":"採樵","采水":"採水","采油":"採油","采煤":"採煤","采珠":"採珠","采生":"採生","采用":"採用","采石":"採石","采硫":"採硫","采稿":"採稿","采粉":"採粉","采精":"採精","采花":"採花","采芹":"採芹","采茶":"採茶","采草":"採草","采薇":"採薇","采蜜":"採蜜","采血":"採血","采行":"採行","采金":"採金","采集":"採集","采食":"採食","重托":"重託","重游":"重遊","野游":"野遊","金杯":"金盃","金橘":"金桔","防台":"防颱","防御":"防禦","防范":"防範","阿腴":"阿諛","陀手":"舵手","陀表":"陀錶","附注":"附註","陡松":"陡鬆","陪吊":"陪弔","陷井":"陷阱","隆准":"隆準","隔周":"隔週","雅致":"雅緻","雅范":"雅範","雇主":"僱主","雇人":"僱人","雇役":"僱役","雇有":"僱有","雇用":"僱用","雇舟":"僱舟"
,"雇船":"僱船","雕梁":"雕樑","雕落":"彫落","雕象":"雕像","雕零":"彫零","震松":"震鬆","震栗":"震慄","青棵":"青稞","青笞":"青苔","非涂":"非涂","非象":"非像","面店":"麵店","面杖":"麵杖","面灰":"麵灰","面碗":"麵碗","面筋":"麵筋","面粉":"麵粉","面糊":"麵糊","面茶":"麵茶","面食":"麵食","鞣制":"鞣製","音准":"音準","音象":"音像","食欲":"食慾","食面":"食麵","餐台":"餐檯","首周":"首週","骨干":"骨幹","骨松":"骨鬆","骼膊":"胳膊","高升":"高昇","高干":"高幹","髯胡":"髯鬍","魁悟":"魁梧","魂游":"魂遊","魏征":"魏徵","麻病":"痲病","鼻准":"鼻準","鼻梁":"鼻樑","０余":"０餘","○里":"○里","一并":"一併","一里":"一里","丁当":"叮噹","丁铃":"叮鈴","七里":"七里","三叹":"三歎","三里":"三里","三丰":"三丰","上冲":"上衝","上签":"上籤","下摆":"下襬","下冲":"下衝","下签":"下籤","下里":"下里","不并":"不併","并入":"併入","并力":"併力","并包":"并包","并合":"併合","并吞":"併吞","并图":"併圖","并拢":"併攏","并案":"併案","并叠":"併疊","并砌":"併砌","并科":"併科","并负":"併負","并购":"併購","并赃":"併贓","并采":"並採","并除":"併除","并陇":"併攏","中仑":"中崙","中签":"中籤","九叹":"九歎","九里":"九里","乱斗":"亂鬥","乱冲":"亂衝","事迹":"事蹟","二里":"二里","五里":"五里","亚里":"亞里","仙后":"仙后","仰冲":"仰衝","伙众":"夥眾","伙计":"夥計","低荡":"低盪","占士":"佔士","占有":"佔有","占风":"佔風","余劲":"餘勁","余势":"餘勢","余荫":"餘蔭","余庆":"餘慶","余愤":"餘憤","余数":"餘數","余晖":"餘暉","余岁":"餘歲","余气":"餘氣"
,"余温":"餘溫","余沥":"餘瀝","余热":"餘熱","余烬":"餘燼","余亩":"餘畝","余众":"餘眾","余祸":"餘禍","余粮":"餘糧","余线":"餘線","余脉":"餘脈","余兴":"餘興","余里":"餘裡","余责":"餘責","余贼":"餘賊","余载":"餘載","余辉":"餘輝","余钱":"餘錢","余闲":"餘閒","余韵":"餘韻","余额":"餘額","余风":"餘風","余饭":"餘飯","余骑":"餘騎","余点":"餘點","余党":"餘黨","佛历":"佛曆","佩环":"珮環","佩饰":"珮飾","佳里":"佳里","来干":"來幹","来范":"來範","来象":"來像","侏罗":"侏儸","仑背":"崙背","侵并":"侵併","信缄":"信箋","俯冲":"俯衝","个象":"個像","们干":"們幹","倒仆":"倒仆","借机":"藉機","借词":"藉詞","假发":"假髮","侧冲":"側衝","杰伦":"杰倫","备注":"備註","佣金":"佣金","佣钱":"佣錢","传布":"傳佈","伤愈":"傷癒","倾刻":"頃刻","倾复":"傾覆","偻罗":"僂儸","仅余":"僅餘","仆倒":"仆倒","仆地":"仆地","仆然":"仆然","仆街":"仆街","侥幸":"儌倖","侥悻":"僥倖","僵仆":"僵仆","僵尸":"殭屍","僵绳":"韁繩","僵蚕":"殭蠶","仪范":"儀範","亿余":"億餘","俭朴":"儉樸","优游":"優遊","兀术":"兀朮","克里":"克里","内函":"內涵","内制":"內製","内哄":"內鬨","内斗":"內鬥","全里":"全里","两周":"兩週","两里":"兩里","八里":"八里","公历":"公曆","公里":"公里","六冲":"六衝","六里":"六里","兵签":"兵籤","兼并":"兼併","再冲":"再衝","准备":"準備","准儿":"準兒","准则":"準則","准够":"準夠","准据":"準據","准拟":"準擬","准时":"準時","准会":"準會","准极":"準極","准决":"準決","准没":"準沒","准确":"準確","准线":"準線","准绳":"準繩","准话":"準話"
,"准头":"準頭","准点":"準點","凛列":"凜洌","凛栗":"凜慄","凯里":"凱里","凶惧":"兇懼","凶杀":"兇殺","出籴":"出糶","函复":"函覆","函义":"涵義","函盖":"涵蓋","函蕴":"涵蘊","函养":"涵養","别干":"別幹","别扭":"彆扭","别拗":"彆拗","别斗":"別鬥","别气":"彆氣","别脚":"彆腳","别致":"別緻","刮须":"刮鬚","刮风":"颳風","制备":"製備","制剂":"製劑","制图":"製圖","制为":"製為","制炼":"製煉","制纸":"製紙","制药":"製藥","制馅":"製餡","制盐":"製鹽","剃发":"剃髮","剃须":"剃鬚","则象":"則像","则采":"則採","削发":"削髮","前冲":"前衝","剪发":"剪髮","创制":"創製","划来":"划來","划去":"划去","划子":"划子","划拳":"划拳","划桨":"划槳","划步":"划步","划水":"划水","划独":"划獨","划算":"划算","划舟":"划舟","划船":"划船","划艇":"划艇","划龙":"划龍","剧斗":"劇鬥","劈里":"劈里","加里":"加里","劲斗":"勁鬥","动荡":"動盪","勘乱":"戡亂","胜余":"勝餘","劳骚":"牢騷","北冲":"北衝","北里":"北里","匣钵":"匣砵","汇刊":"彙刊","汇整":"彙整","汇编":"彙編","汇总":"彙總","汇纂":"彙纂","汇萃":"薈萃","汇辑":"彙輯","汇集":"彙集","十里":"十里","千里":"千里","升华":"昇華","升迁":"陞遷","升阳":"昇陽","卒发":"捽髮","南冲":"南衝","南里":"南里","卡里":"卡里","却象":"卻像","反复":"反覆","反冲":"反衝","取谛":"取締","古迹":"古蹟","叫于":"叫于","叮当":"叮噹","台历":"檯曆","台灯":"檯燈","台钟":"檯鐘","台风":"颱風","史迹":"史蹟","右冲":"右衝","叼扰":"叨擾","叼难":"刁難","合并":"合併","吉里":"吉里","吊问":"弔問","吊丧":"弔喪","吊场":"弔場"
,"吊书":"弔書","吊词":"弔詞","吊诡":"弔詭","吊贺":"弔賀","吊钱":"弔錢","名迹":"名蹟","向导":"嚮導","向应":"嚮應","吞并":"吞併","吸烟":"吸菸","吹发":"吹髮","吹须":"吹鬚","吕后":"呂后","告侥":"告饒","周报":"週報","周数":"週數","周会":"週會","周岁":"週歲","周历":"週曆","周济":"賙濟","周记":"週記","咨询":"諮詢","咨诹":"諮諏","咨谋":"諮謀","咨议":"諮議","咽气":"嚥氣","品汇":"品彙","品尝":"品嚐","哈罗":"哈囉","哈里":"哈里","哥里":"哥里","商历":"商曆","商铺":"商舖","啷当":"啷噹","喂猪":"餵豬","喂马":"餵馬","喂鱼":"餵魚","喑哑":"瘖啞","单于":"單于","叹服":"歎服","叹为":"歎為","叹羡":"歎羨","叹赏":"歎賞","喽罗":"嘍囉","唠叼":"嘮叨","嘘唏":"歔欷","噪动":"譟動","噪诈":"譟詐","噜苏":"嚕囌","啰里":"囉里","嘱托":"囑託","四里":"四里","回佣":"回佣","回復":"回覆","回复":"回覆","回历":"回曆","回冲":"回衝","回环":"迴環","回纹":"迴紋","回绕":"迴繞","回肠":"迴腸","回荡":"迴蕩","回銮":"迴鑾","回响":"迴響","回风":"迴風","囹围":"囹圉","国制":"國製","国历":"國曆","圆椎":"圓錐","图象":"圖像","团伙":"團夥","团子":"糰子","团粉":"糰粉","地冲":"地衝","坎顶":"崁頂","坦护":"袒護","垂发":"垂髮","型状":"形狀","埔里":"埔里","报道":"報導","坠胎":"墮胎","垦辟":"墾闢","坛子":"罈子","坛酒":"罈酒","坛醋":"罈醋","坛騞":"罈騞","坏签":"壞籤","壶范":"壺範","寿面":"壽麵","夏历":"夏曆","多里":"多里","够准":"夠準","够怨":"搆怨","梦回":"夢迴","梦游":"夢遊","梦系":"夢繫","大历":"大曆","天后":"天后","太后":"太后","夹衣":"裌衣"
,"夹袄":"裌襖","奇迹":"奇蹟","夺斗":"奪鬥","夺杯":"奪盃","奋斗":"奮鬥","奸妇":"姦婦","奸尸":"姦屍","奸杀":"姦殺","奸盗":"姦盜","好烟":"好菸","好签":"好籤","姑负":"辜負","姓于":"姓于","姓钟":"姓鍾","姜汤":"薑湯","姜丝":"薑絲","姜葱":"薑蔥","姜饼":"薑餅","姜黄":"薑黃","姣洁":"皎潔","字汇":"字彙","孱杂":"羼雜","寒仓":"寒傖","实干":"實幹","实象":"實像","宁舍":"寧捨","宽松":"寬鬆","宽范":"寬範","封后":"封后","专干":"專幹","寻准":"尋準","寻麻":"蕁麻","对准":"對準","对干":"對幹","导游":"導遊","少冲":"少衝","少里":"少里","尤带":"猶帶","尤怜":"猶憐","尤里":"尤里","居里":"居里","尸位":"尸位","尸禄":"尸祿","屡仆":"屢仆","属制":"屬製","峇里":"峇里","峇厘":"峇里","岛炼":"島鍊","左冲":"左衝","巨细":"鉅細","巨须":"巨鬚","巴厘":"峇里","布个":"佈個","布坛":"佈壇","布导":"佈導","布岗":"佈崗","布于":"佈於","布满":"佈滿","布里":"布里","布阵":"佈陣","帝后":"帝后","师范":"師範","带征":"帶徵","带发":"帶髮","帽璎":"帽纓","幡间":"墦間","干个":"幹個","干儿":"乾兒","干劲":"幹勁","干员":"幹員","干哑":"乾啞","干吗":"幹嗎","干呕":"乾嘔","干坛":"乾罈","干妈":"乾媽","干孙":"乾孫","干尸":"乾屍","干惯":"幹慣","干搁":"乾擱","干晒":"乾曬","干桩":"幹樁","干净":"乾淨","干涩":"乾澀","干涧":"乾澗","干湿":"乾濕","干热":"乾熱","干烧":"乾燒","干瘪":"乾癟","干瘾":"乾癮","干发":"乾髮","干尽":"幹盡","干粮":"乾糧","干结":"乾結","干丝":"乾絲","干线":"幹線","干练":"幹練","干声":"乾聲","干叶":"乾葉","干号":"乾號","干货":"乾貨"
,"干办":"幹辦","干这":"幹這","干过":"幹過","干错":"幹錯","干阳":"乾陽","干饭":"乾飯","干么":"幹麼","干点":"幹點","年历":"年曆","几出":"幾齣","几周":"幾週","几案":"几案","几净":"几淨","几里":"幾里","底里":"底里","店铺":"店舖","厨余":"廚餘","厮斗":"廝鬥","废后":"廢后","广布":"廣佈","广征":"廣徵","弘历":"弘曆","弛骋":"馳騁","弦乐":"絃樂","弦线":"絃線","强台":"強颱","强奸":"強姦","强干":"強幹","强征":"強徵","强御":"強禦","强冲":"強衝","强界":"疆界","弥弥":"瀰瀰","弥散":"瀰散","弥漫":"瀰漫","弥蒙":"瀰濛","彩带":"綵帶","彩楼":"綵樓","彩灯":"綵燈","彩绸":"綵綢","彩线":"綵線","彩缎":"綵緞","彩缯":"綵繒","彩头":"綵頭","彩凤":"綵鳳","彩鸾":"綵鸞","影后":"影后","征个":"徵個","征启":"徵啟","征敛":"徵斂","征状":"徵狀","征税":"徵稅","征粮":"徵糧","征纳":"徵納","征缴":"徵繳","征诏":"徵詔","征询":"徵詢","征调":"徵調","征财":"徵財","征费":"徵費","征赋":"徵賦","征购":"徵購","征选":"徵選","后冠":"后冠","后制":"後製","后土":"后土","后奸":"後姦","后妃":"后妃","后梁":"後樑","后稷":"后稷","后羿":"后羿","后象":"後像","径取":"逕取","径启":"逕啟","径寄":"逕寄","径庭":"逕庭","径砸":"逕砸","径答":"逕答","径自":"逕自","御敌":"禦敵","复亡":"覆亡","复信":"覆信","复函":"覆函","复列":"複列","复利":"複利","复制":"複製","复印":"複印","复句":"複句","复命":"覆命","复壁":"複壁","复姓":"複姓","复审":"覆審","复写":"複寫","复巢":"覆巢","复式":"複式","复复":"覆覆","复败":"覆敗","复数":"複數","复文":"覆文","复方":"複方"
,"复书":"覆書","复本":"複本","复查":"複查","复核":"覆核","复检":"複檢","复次":"複次","复比":"複比","复决":"複決","复没":"覆沒","复测":"複測","复灭":"覆滅","复叠":"覆疊","复目":"複目","复眼":"複眼","复种":"複種","复线":"複線","复习":"複習","复舟":"覆舟","复色":"複色","复叶":"複葉","复盖":"覆蓋","复苏":"復甦","复诊":"複診","复词":"複詞","复试":"複試","复变":"複變","复赛":"複賽","复辙":"覆轍","复述":"複述","复选":"複選","复钱":"複錢","复阅":"複閱","复杂":"複雜","复电":"覆電","复音":"複音","复韵":"複韻","微须":"微鬚","德里":"德里","忍饥":"忍饑","志庆":"誌慶","志异":"誌異","快冲":"快衝","念书":"唸書","念给":"唸給","念经":"唸經","念诵":"唸誦","念过":"唸過","念错":"唸錯","念点":"唸點","急冲":"急衝","耻夺":"褫奪","闷郁":"悶鬱","恶心":"噁心","恶斗":"惡鬥","愈疮":"癒瘡","爱欲":"愛慾","惨栗":"慘慄","忧郁":"憂鬱","憋脚":"蹩腳","凭借":"憑藉","凭准":"憑準","凭吊":"憑弔","恳托":"懇託","应征":"應徵","应象":"應像","懔栗":"懍慄","怀表":"懷錶","悬梁":"懸樑","惧栗":"懼慄","戊卫":"戌衛","戒烟":"戒菸","戚忧":"慼憂","戚颜":"慼顏","战斗":"戰鬥","战栗":"顫慄","戏彩":"戲綵","戏扎":"戲紮","所钟":"所鍾","扇动":"搧動","扇开":"搧開","扇风":"搧風","手炼":"手鍊","扎实":"紮實","扎带":"紮帶","扎营":"紮營","扎稳":"紮穩","扎结":"紮結","扎紧":"紮緊","扎脚":"紮腳","扎诈":"紮詐","扎辫":"紮辮","托梦":"託夢","托词":"託詞","托买":"託買","托卖":"託賣","托辞":"託辭","托运":"託運","托过":"託過","扛龟":"摃龜","批复":"批覆"
,"抉别":"訣別","折冲":"折衝","折叠":"摺疊","折纸":"摺紙","披发":"披髮","抵砺":"砥礪","抵触":"牴觸","抹刹":"抹煞","抽佣":"抽佣","抽烟":"抽菸","抽签":"抽籤","抿灭":"泯滅","拂须":"拂鬚","拈须":"拈鬚","拉炼":"拉鍊","拉纤":"拉縴","拉里":"拉里","抛准":"拋準","拗别":"拗彆","拙壮":"茁壯","拜占":"拜佔","拮据":"拮据","拼个":"拚個","拼劲":"拚勁","拼杀":"拚殺","拼经":"拚經","振荡":"振盪","挽发":"挽髮","挽联":"輓聯","挽词":"輓詞","挽诗":"輓詩","捉狭":"促狹","捋须":"捋鬚","捻钱":"撚錢","捻须":"撚鬚","扫描":"掃瞄","掉发":"掉髮","挣松":"掙鬆","挂彩":"掛綵","挂历":"掛曆","挂碍":"罣礙","掠冲":"掠衝","揉躏":"蹂躪","换签":"換籤","握发":"握髮","挥杆":"揮杆","折云":"摺云","掸子":"撢子","抚恤":"撫卹","抚须":"撫鬚","挞虏":"韃虜","挡御":"擋禦","擢发":"擢髮","拧干":"擰乾","拧松":"擰鬆","摆布":"擺佈","摆荡":"擺盪","拢断":"壟斷","摄制":"攝製","摄服":"懾服","摄象":"攝像","挛生":"孿生","支烟":"支菸","支签":"支籤","收获":"收穫","故里":"故里","整并":"整併","数周":"數週","数里":"數里","斑烂":"斑斕","斗来":"鬥來","斗个":"鬥個","斗传":"鬥傳","斗剑":"鬥劍","斗劲":"鬥勁","斗胜":"鬥勝","斗场":"鬥場","斗将":"鬥將","斗恶":"鬥惡","斗战":"鬥戰","斗擞":"抖擻","斗败":"鬥敗","斗敌":"鬥敵","斗杀":"鬥殺","斗殴":"鬥毆","斗气":"鬥氣","斗争":"鬥爭","斗兽":"鬥獸","斗毕":"鬥畢","斗舰":"鬥艦","斗艺":"鬥藝","斗艳":"鬥豔","斗赢":"鬥贏","斗输":"鬥輸","斗过":"鬥過","斗鸡":"鬥雞","斗饮":"鬥飲","斗闹":"鬥鬧","斗鱼":"鬥魚","斗丽":"鬥麗"
,"斜冲":"斜衝","斯里":"斯里","新历":"新曆","不断":"不斷","断发":"斷髮","于嗟":"于嗟","于于":"于于","于归":"于歸","于谦":"于謙","于阗":"于闐","旋涡":"漩渦","旗杆":"旗杆","日历":"日曆","早占":"早佔","旱烟":"旱菸","昆仑":"崑崙","星历":"星曆","晋升":"晉陞","普里":"普里","畅游":"暢遊","暂松":"暫鬆","暴冲":"暴衝","晒干":"曬乾","晒谷":"曬穀","书台":"書檯","书童":"書僮","书签":"書籤","会干":"會幹","会斗":"會鬥","会象":"會像","月历":"月曆","服赝":"服膺","木签":"木籤","木纳":"木訥","朱矶":"硃磯","朱笔":"硃筆","朴学":"樸學","朴实":"樸實","朴质":"樸質","束发":"束髮","东升":"東昇","东冲":"東衝","东游":"東遊","东涌":"東涌","东里":"東里","松劲":"鬆勁","松动":"鬆動","松宽":"鬆寬","松气":"鬆氣","松绑":"鬆綁","松紧":"鬆緊","松线":"鬆線","松缓":"鬆緩","松绳":"鬆繩","松脱":"鬆脫","松软":"鬆軟","松开":"鬆開","松闲":"鬆閒","松饼":"鬆餅","松驰":"鬆弛","松齿":"鬆齒","染发":"染髮","柔发":"柔髮","栗声":"慄聲","栗惊":"慄驚","核复":"核覆","根烟":"根菸","格里":"格里","桅杆":"桅杆","案几":"案几","杆面":"桿麵","梯冲":"梯衝","梳发":"梳髮","弃舍":"棄捨","棕发":"棕髮","栋梁":"棟樑","植发":"植髮","业余":"業餘","极准":"極準","极干":"極乾","极极":"亟亟","极象":"極像","榔头":"鎯頭","榴连":"榴槤","构陷":"搆陷","槌头":"鎚頭","标准":"標準","标志":"標誌","标杆":"標竿","标注":"標註","标签":"標籤","标致":"標緻","枢钮":"樞紐","样干":"樣幹","样范":"樣範","树干":"樹幹","桥梁":"橋樑","机抒":"機杼","横征":"橫徵","横梁":"橫樑"
,"横冲":"橫衝","柜台":"櫃檯","栏杆":"欄杆","权斗":"權鬥","钦崎":"嶔崎","欧游":"歐遊","历数":"曆數","历日":"曆日","历书":"曆書","历月":"曆月","历法":"曆法","历落":"曆落","历象":"曆象","归并":"歸併","归朴":"歸璞","归究":"歸咎","归里":"歸里","残余":"殘餘","残干":"殘幹","残肴":"殘餚","毁谤":"譭謗","殴斗":"毆鬥","母后":"母后","毛发":"毛髮","毛须":"毛鬚","毫发":"毫髮","气慨":"氣概","气郁":"氣鬱","永历":"永曆","求签":"求籤","汨没":"汩沒","决择":"抉擇","决斗":"決鬥","沈阳":"瀋陽","没准":"沒準","没干":"沒幹","没念":"沒唸","没辄":"沒轍","冲下":"衝下","冲乱":"衝亂","冲他":"衝他","冲你":"衝你","冲来":"衝來","冲倒":"衝倒","冲克":"衝剋","冲入":"衝入","冲冠":"衝冠","冲出":"衝出","冲到":"衝到","冲刺":"衝刺","冲剌":"衝剌","冲前":"衝前","冲剑":"衝劍","冲力":"衝力","冲劲":"衝勁","冲动":"衝動","冲势":"衝勢","冲去":"衝去","冲口":"衝口","冲向":"衝向","冲呀":"衝呀","冲咱":"衝咱","冲啊":"衝啊","冲回":"衝回","冲坚":"衝堅","冲坠":"衝墜","冲天":"衝天","冲奔":"衝奔","冲她":"衝她","冲将":"衝將","冲往":"衝往","冲心":"衝心","冲我":"衝我","冲拳":"衝拳","冲掠":"衝掠","冲撞":"衝撞","冲扑":"衝撲","冲击":"衝擊","冲断":"衝斷","冲杀":"衝殺","冲决":"衝決","冲波":"衝波","冲浪":"衝浪","冲激":"衝激","冲然":"衝然","冲犯":"衝犯","冲破":"衝破","冲程":"衝程","冲穴":"衝穴","冲突":"衝突","冲脉":"衝脈","冲至":"衝至","冲落":"衝落","冲要":"衝要","冲起":"衝起","冲越":"衝越","冲跑":"衝跑","冲军":"衝軍","冲近":"衝近","冲进":"衝進"
,"冲过":"衝過","冲量":"衝量","冲锋":"衝鋒","冲错":"衝錯","冲门":"衝門","冲开":"衝開","冲闯":"衝闖","冲阵":"衝陣","冲陷":"衝陷","冲风":"衝風","冲驰":"衝馳","泛滥":"氾濫","波里":"波里","注册":"註冊","注标":"註標","注脚":"註腳","注记":"註記","注译":"註譯","注释":"註釋","注销":"註銷","泰历":"泰曆","洗发":"洗髮","泄欲":"洩慾","浪冲":"浪衝","浮签":"浮籤","涂来":"涂來","涅盘":"涅槃","凉席":"涼蓆","凉面":"涼麵","凄息":"棲息","凄戚":"悽慼","泪干":"淚乾","净余":"淨餘","净几":"淨几","淬厉":"淬礪","淳于":"淳于","减征":"減徵","渠冲":"渠衝","测准":"測準","游侠":"遊俠","游园":"遊園","游学":"遊學","游戏":"遊戲","游乐":"遊樂","游历":"遊歷","游猎":"遊獵","游兴":"遊興","游荡":"遊蕩","游艺":"遊藝","游览":"遊覽","游观":"遊觀","游记":"遊記","游说":"遊說","游踪":"遊蹤","游军":"遊軍","游错":"遊錯","游骑":"遊騎","浑函":"渾涵","汤团":"湯糰","汤面":"湯麵","溜达":"溜躂","溶炉":"熔爐","溶销":"熔銷","溶铸":"熔鑄","满布":"滿佈","渐愈":"漸癒","渐松":"漸鬆","浆划":"槳劃","润发":"潤髮","潦阔":"遼闊","浇制":"澆製","激荡":"激盪","浓发":"濃髮","浓纤":"穠纖","湿发":"濕髮","滥征":"濫徵","沥干":"瀝乾","火签":"火籤","灰发":"灰髮","灰尽":"灰燼","灸热":"炙熱","炸毁":"炸燬","为准":"為準","为范":"為範","乌丘":"烏坵","乌发":"烏髮","乌里":"烏里","焚毁":"焚燬","无余":"無餘","无梁":"無樑","无欲":"無慾","炼制":"煉製","炼子":"鍊子","炼锁":"鍊鎖","烟商":"菸商","烟客":"菸客","烟枪":"菸槍","烟民":"菸民","烟没":"湮沒","烟灰":"菸灰"
,"烟熏":"煙燻","烟瘾":"菸癮","烟草":"菸草","烟酒":"菸酒","烟头":"菸頭","烟鬼":"菸鬼","烟龄":"菸齡","烦郁":"煩鬱","熏烟":"燻煙","熏热":"燻熱","熏猪":"燻豬","熏鸭":"燻鴨","熏鹅":"燻鵝","荧光":"螢光","荧屏":"螢屏","荧幕":"螢幕","荧郁":"熒鬱","熔毁":"熔燬","灯彩":"燈綵","燎发":"燎髮","烧制":"燒製","烧干":"燒乾","烧毁":"燒燬","烫发":"燙髮","烫面":"燙麵","营干":"營幹","烩制":"燴製","烩干":"燴乾","烬余":"燼餘","争斗":"爭鬥","牙签":"牙籤","牵系":"牽繫","狂冲":"狂衝","猛冲":"猛衝","奖杯":"獎盃","独斗":"獨鬥","独游":"獨遊","独辟":"獨闢","独钟":"獨鍾","兽奸":"獸姦","兽欲":"獸慾","王后":"王后","玲胧":"玲瓏","球杆":"球杆","琅当":"琅璫","理发":"理髮","珐琅":"琺瑯","瑶签":"瑤籤","璀灿":"璀璨","璨烂":"燦爛","环佩":"環珮","环游":"環遊","甩发":"甩髮","留发":"留髮","畛怀":"軫懷","亩余":"畝餘","畦径":"畦逕","画象":"畫像","当准":"當準","当周":"當週","当啷":"噹啷","当当":"噹噹","当郎":"噹啷","疔伤":"療傷","疾冲":"疾衝","症结":"癥結","痉孪":"痙攣","发乳":"髮乳","发冠":"髮冠","发型":"髮型","发夹":"髮夾","发套":"髮套","发妻":"髮妻","发姐":"髮姐","发布":"發佈","发带":"髮帶","发干":"發乾","发廊":"髮廊","爆发":"爆發","发式":"髮式","开发":"開發","发指":"髮指","发束":"髮束","发根":"髮根","发梢":"髮梢","发梳":"髮梳","发油":"髮油","发皓":"髮皓","发笺":"髮箋","发箍":"髮箍","发簪":"髮簪","发丝":"髮絲","发缨":"髮纓","发肤":"髮膚","发胶":"髮膠","发色":"髮色","发菜":"髮菜","发蜡":"髮蠟","发质":"髮質","发辫":"髮辮"
,"发醅":"醱醅","发针":"髮針","发钗":"髮釵","发长":"髮長","发际":"髮際","发雕":"髮雕","发霜":"髮霜","发面":"發麵","发饰":"髮飾","发香":"髮香","发髯":"髮髯","发髻":"髮髻","发鬓":"髮鬢","白发":"白髮","白术":"白朮","白须":"白鬚","百里":"百里","皇后":"皇后","皇历":"皇曆","皓发":"皓髮","皱折":"皺摺","盍谢":"溘謝","盗采":"盜採","尽先":"儘先","尽够":"儘夠","尽干":"盡幹","尽教":"儘教","尽早":"儘早","尽是":"儘是","尽管":"儘管","尽量":"儘量","监制":"監製","盘回":"盤迴","盘涅":"槃涅","盘游":"盤遊","盲冲":"盲衝","直冲":"直衝","一直":"一直","直发":"直髮","相并":"相併","眈误":"耽誤","真缔":"真諦","瞎冲":"瞎衝","短发":"短髮","短须":"短鬚","砌并":"砌併","砰当":"砰噹","硬冲":"硬衝","硬发":"硬髮","碎发":"碎髮","确系":"確係","神迹":"神蹟","禁烟":"禁菸","秃发":"禿髮","秀发":"秀髮","租贷":"租賃","稀里":"稀里","禀复":"稟覆","种谷":"種穀","稻杆":"稻稈","积淀":"積澱","积谷":"積穀","积郁":"積鬱","稳扎":"穩紮","窥准":"窺準","竞斗":"競鬥","竹杆":"竹竿","竹签":"竹籤","竽头":"芋頭","笑讷":"笑納","笑魇":"笑靨","符录":"符籙","笋干":"筍乾","笋况":"荀況","答复":"答覆","节余":"節餘","节欲":"節慾","篾箪":"篾簟","简朴":"簡樸","箫条":"蕭條","签卜":"籤卜","签文":"籤文","签条":"籤條","签爪":"籤爪","签筒":"籤筒","签诗":"籤詩","箩卜":"蘿蔔","糟达":"蹧躂","系个":"繫個","系块":"繫塊","系带":"繫帶","系怀":"繫懷","系挂":"繫掛","系数":"係數","系于":"繫於","系条":"繫條","系为":"係為","系争":"係爭","系获":"係獲","系绊":"繫絆"
,"系紧":"繫緊","系缚":"繫縛","系绳":"繫繩","系缆":"繫纜","系脚":"繫腳","系辞":"繫辭","系铃":"繫鈴","系颈":"繫頸","系马":"繫馬","纪历":"紀曆","约斗":"約鬥","约雇":"約僱","红签":"紅籤","纡余":"紆餘","纡回":"紆迴","纡郁":"紆鬱","纨绔":"紈袴","纨袴":"紈褲","纳征":"納徵","纯朴":"純樸","纯系":"純係","纸扎":"紙紮","细致":"細緻","结伙":"結夥","结余":"結餘","结彩":"結綵","结扎":"結紮","结发":"結髮","绞干":"絞乾","丝制":"絲製","丝弦":"絲絃","绑扎":"綁紮","绸密":"稠密","维系":"維繫","绾发":"綰髮","网志":"網誌","网游":"網遊","紧扎":"緊紮","绪余":"緒餘","缉凶":"緝兇","编发":"編髮","编篡":"編纂","编采":"編採","缓征":"緩徵","缓冲":"緩衝","缈茫":"渺茫","萦回":"縈迴","缜致":"縝緻","县志":"縣誌","缝制":"縫製","缝扎":"縫紮","缝纴":"縫紉","缩栗":"縮慄","纵欲":"縱慾","繁复":"繁複","绕梁":"繞樑","绣象":"繡像","绘制":"繪製","续弦":"續絃","缠斗":"纏鬥","纤夫":"縴夫","罢斗":"罷鬥","罗哩":"囉哩","罗唆":"囉唆","罗嗦":"囉嗦","罗啰":"囉囉","罗苏":"囉囌","罗里":"羅里","罗难":"罹難","罗音":"囉音","羁拌":"羈絆","翻云":"翻雲","老么":"老么","耕获":"耕穫","圣叹":"聖歎","圣杯":"聖盃","圣象":"聖像","圣迹":"聖蹟","联征":"聯徵","联系":"聯繫","肆业":"肄業","胡须":"鬍鬚","胡鬓":"鬍鬢","脉冲":"脈衝","脱发":"脫髮","脑干":"腦幹","脚夫":"腳伕","脚注":"腳註","脚炼":"腳鍊","胶制":"膠製","胆战":"膽顫","卧游":"臥遊","旧历":"舊曆","旧游":"舊遊","舍弃":"捨棄","舞后":"舞后","船浆":"船槳","船纤":"船縴","艨冲":"艨衝","英里":"英里"
,"范围":"範圍","范畴":"範疇","范险":"範險","茅芦":"茅廬","茶几":"茶几","茶卤":"茶滷","荆朴":"荊璞","茎干":"莖幹","莫里":"莫里","万余":"萬餘","万历":"萬曆","万里":"萬里","落发":"落髮","蒙胧":"矇矓","蒙冲":"蒙衝","蒙眬":"矇矓","蒙雾":"濛霧","蒙骗":"矇騙","苍术":"蒼朮","苍郁":"蒼鬱","蓄发":"蓄髮","蓄须":"蓄鬚","蓬发":"蓬髮","蒋干":"蔣幹","葱郁":"蔥鬱","荫郁":"蔭鬱","荡口":"盪口","荡舟":"盪舟","荡开":"盪開","荐饥":"薦饑","藤条":"籐條","药制":"藥製","药签":"藥籤","苏里":"蘇里","苏醒":"甦醒","蕴借":"蘊藉","蕴函":"蘊涵","蕴酿":"醞釀","萝卜":"蘿蔔","虎须":"虎鬚","虚象":"虛像","号志":"號誌","虬须":"虯鬚","蜡象":"蠟像","蛮准":"蠻準","蛮干":"蠻幹","行尸":"行尸","衣驱":"衣袪","表带":"錶帶","表厂":"錶廠","表壳":"錶殼","表炼":"錶鏈","表链":"錶鏈","被并":"被併","被复":"被覆","裁并":"裁併","袅雄":"梟雄","裙摆":"裙襬","补注":"補註","装璜":"裝潢","里亚":"里亞","里仁":"里仁","里余":"裡餘","里夫":"里夫","里奥":"里奧","里尼":"里尼","里布":"里布","里拉":"里拉","里昂":"里昂","这里":"這裡","里根":"里根","里民":"里民","里尔":"里爾","里科":"里科","里程":"里程","里约":"里約","里纳":"里納","里美":"里美","里肌":"里肌","里兰":"里蘭","里象":"裡像","里路":"里路","里里":"里奇","里长":"里長","裹尸":"裹尸","褐发":"褐髮","亵读":"褻瀆","褴缕":"襤褸","西后":"西后","西历":"西曆","西冲":"西衝","西里":"西里","要冲":"要衝","规范":"規範","觅准":"覓準","觊幸":"覬倖","觑准":"覷準","观斗":"觀鬥","观采":"觀採","解签":"解籤"
,"觞子":"殤子","触须":"觸鬚","订制":"訂製","计准":"計準","计划":"計畫","评击":"抨擊","评注":"評註","词余":"詞餘","词汇":"詞彙","咏叹":"詠歎","诗余":"詩餘","该象":"該像","详征":"詳徵","详注":"詳註","夸克":"夸克","夸父":"夸父","夸尔":"夸爾","夸特":"夸特","夸脱":"夸脫","认准":"認準","诱奸":"誘姦","诱欲":"誘慾","语汇":"語彙","诚征":"誠徵","诚朴":"誠樸","诬蔑":"誣衊","误冲":"誤衝","说签":"說籤","谁干":"誰幹","课余":"課餘","课征":"課徵","调准":"調準","调制":"調製","调松":"調鬆","请托":"請託","诸余":"諸餘","诸候":"諸侯","谋干":"謀幹","哗的":"譁的","译注":"譯註","维护":"維護","护发":"護髮","变征":"變徵","变松":"變鬆","谶悔":"懺悔","谷仓":"穀倉","谷场":"穀場","谷壳":"穀殼","谷舱":"穀艙","谷贱":"穀賤","谷类":"穀類","谷麦":"穀麥","丰姿":"丰姿","丰度":"丰度","丰情":"丰情","丰神":"丰神","丰谀":"豐腴","丰韵":"丰韻","艳后":"豔后","象个":"像個","象两":"像兩","象别":"像別","象刚":"像剛","象吗":"像嗎","象梦":"像夢","象带":"像帶","象极":"像極","象样":"像樣","象现":"像現","象当":"像當","象疯":"像瘋","象话":"像話","象谁":"像誰","象这":"像這","象银":"像銀","象风":"像風","象么":"像麼","贝里":"貝里","财欲":"財慾","贪欲":"貪慾","贵干":"貴幹","买凶":"買兇","买姜":"買薑","买烟":"買菸","贴志":"貼誌","赈饥":"賑饑","赐复":"賜覆","卖奸":"賣姦","卖姜":"賣薑","质朴":"質樸","赌台":"賭檯","赌斗":"賭鬥","购并":"購併","赢余":"贏餘","赤发":"赤髮","赶制":"趕製","跌冲":"跌衝","跟跄":"踉蹌","路签":"路籤","路里":"路里"
,"践道":"棧道","蹒顸":"顢頇","躯干":"軀幹","车夫":"車伕","车游":"車遊","轨范":"軌範","轩辟":"軒闢","轫性":"韌性","软发":"軟髮","轸域":"畛域","较准":"較準","较斗":"較鬥","较松":"較鬆","较象":"較像","轻台":"輕颱","轻挑":"輕佻","轻篾":"輕蔑","轮回":"輪迴","轮奸":"輪姦","辑凶":"輯兇","转寰":"轉圜","转托":"轉託","轿夫":"轎伕","辟划":"闢劃","辟为":"闢為","辟筑":"闢築","辟谣":"闢謠","辟谬":"闢謬","辞汇":"辭彙","辫发":"辮髮","农历":"農曆","农获":"農穫","迨尽":"殆盡","移逦":"迆邐","追谥":"追諡","通谍":"通牒","通辑":"通緝","连杰":"連杰","连抉":"連袂","连斗":"連鬥","连系":"連繫","连络":"聯絡","逾闲":"踰閒","过松":"過鬆","道里":"道里","递回":"遞迴","远扬":"遠颺","远游":"遠遊","选准":"選準","遗撼":"遺憾","遗范":"遺範","遗象":"遺像","遗迹":"遺蹟","辽亮":"嘹喨","辽沈":"遼瀋","还象":"還像","郁垒":"鬱壘","郁闷":"鬱悶","郁愤":"鬱憤","郁于":"鬱於","郁热":"鬱熱","郁积":"鬱積","郁纡":"鬱紆","郁结":"鬱結","郁闭":"鬱閉","郎铛":"啷鐺","乡里":"鄉里","乡愿":"鄉愿","邻里":"鄰里","酒坛":"酒罈","酬佣":"酬佣","酸软":"痠軟","腌制":"醃製","腌臜":"腌臢","醋坛":"醋罈","酱面":"醬麵","酿制":"釀製","采写":"採寫","采择":"採擇","采撷":"採擷","采样":"採樣","采树":"採樹","采检":"採檢","采获":"採獲","采猎":"採獵","采矿":"採礦","采种":"採種","采纳":"採納","采编":"採編","采莲":"採蓮","采药":"採藥","采补":"採補","采计":"採計","采访":"採訪","采认":"採認","采证":"採證","采买":"採買","采购":"採購","采办":"採辦","采选":"採選"
,"采录":"採錄","采饵":"採餌","采验":"採驗","重复":"重複","重檐":"重檐","金仑":"金崙","钉槌":"釘鎚","针炙":"針灸","针黹":"鍼黹","钓游":"釣遊","钗环":"釵鐶","钳制":"箝制","钳口":"箝口","铰炼":"鉸鍊","银制":"銀製","银须":"銀鬚","铜制":"銅製","铜象":"銅像","衔土":"啣土","衔泥":"啣泥","衔环":"啣環","衔草":"啣草","销溶":"銷鎔","铝制":"鋁製","铺位":"舖位","钢制":"鋼製","钢梁":"鋼樑","录制":"錄製","录象":"錄像","锱衣":"緇衣","锦镖":"錦標","锡制":"錫製","锡坤":"錫堃","锻炼":"鍛鍊","锻羽":"鎩羽","锻链":"鍛鍊","钟山":"鍾山","锁炼":"鎖鍊","锁碎":"瑣碎","铲刈":"剷刈","铲去":"剷去","铲平":"剷平","铲灭":"剷滅","铲起":"剷起","铲除":"剷除","镜象":"鏡像","钟不":"鍾不","钟情":"鍾情","钟意":"鍾意","钟爱":"鍾愛","钟表":"鐘錶","钟馗":"鍾馗","铁制":"鐵製","铁槌":"鐵鎚","铁炼":"鐵鍊","铁练":"鐵鍊","镶制":"鑲製","镶崁":"鑲嵌","长台":"長檯","长象":"長像","长须":"長鬚","门坎":"門檻","门斗":"門鬥","门梁":"門樑","闪铄":"閃爍","开征":"開徵","开浚":"開濬","开辟":"開闢","开采":"開採","开铺":"開舖","闲余":"閒餘","闲游":"閒遊","闲遐":"閒暇","闲静":"閑靜","闺范":"閨範","阃范":"閫範","阖家":"閤家","阖府":"閤府","关系":"關係","防碍":"妨礙","防饥":"防饑","阿里":"阿里","阴干":"陰乾","阴历":"陰曆","阴郁":"陰鬱","阳历":"陽曆","雇佣":"僱傭","雇员":"僱員","雇请":"僱請","雇车":"僱車","雇农":"僱農","雇马":"僱馬","雕丧":"彫喪","雕残":"彫殘","雕虫":"彫蟲","雕谢":"彫謝","双并":"雙併","双周":"雙週","双斗":"雙鬥","杂志":"雜誌"
,"鸡奸":"雞姦","难咽":"難嚥","难干":"難乾","难舍":"難捨","云吞":"雲吞","云宵":"雲霄","云游":"雲遊","电杆":"電杆","震荡":"震盪","灵俐":"伶俐","灵幡":"靈旛","灵欲":"靈慾","面价":"麵價","面团":"麵糰","面厂":"麵廠","面摊":"麵攤","面汤":"麵湯","面线":"麵線","面饺":"麵餃","面饼":"麵餅","面馆":"麵館","面馍":"麵饃","面龟":"麵龜","腼典":"靦腆","鞑伐":"撻伐","韦席":"韋蓆","韦后":"韋后","韩制":"韓製","响当":"響噹","页签":"頁籤","顶凶":"頂兇","项炼":"項鍊","须叟":"須臾","须子":"鬚子","须根":"鬚根","须毛":"鬚毛","须求":"需求","须发":"鬚髮","须眉":"鬚眉","须采":"須採","须须":"鬚鬚","须髯":"鬚髯","须鬓":"鬚鬢","须鲸":"鬚鯨","预制":"預製","预布":"預佈","颇准":"頗準","颇象":"頗像","颌须":"頜鬚","头扎":"頭紮","头发":"頭髮","颊须":"頰鬚","颈系":"頸繫","颓圯":"頹圮","题签":"題籤","愿干":"願幹","颠仆":"顛仆","颠复":"顛覆","顾恤":"顧卹","颤斗":"顫抖","颤栗":"顫慄","显象":"顯像","风刮":"風颳","风干":"風乾","风范":"風範","飘游":"飄遊","飞升":"飛昇","饥年":"饑年","饥荒":"饑荒","饥馑":"饑饉","饨面":"飩麵","饭团":"飯糰","饮干":"飲乾","饼干":"餅乾","养发":"養髮","馈赠":"餽贈","香烟":"香菸","马僵":"馬韁","马夫":"馬伕","马表":"馬錶","马里":"馬里","驻扎":"駐紮","骋凶":"騁兇","惊栗":"驚慄","惊螫":"驚蟄","骤松":"驟鬆","骨坛":"骨罈","体征":"體徵","体范":"體範","髭须":"髭鬚","髯发":"髯髮","髯须":"髯鬚","鬈发":"鬈髮","鬓发":"鬢髮","鬓须":"鬢鬚","鱼干":"魚乾","鱼松":"魚鬆","鲜于":"鮮于","鲸须":"鯨鬚","凤斗":"鳳鬥"
,"鸿准":"鴻準","鸿范":"鴻範","鹅准":"鵝準","鹤发":"鶴髮","鸬慈":"鸕鶿",
"卤制":"滷製","卤味":"滷味","卤水":"滷水","卤汁":"滷汁","卤肉":"滷肉","卤菜":"滷菜","卤蛋":"滷蛋","卤酱":"滷醬","卤鸡":"滷雞","卤面":"滷麵","卤鹅":"滷鵝",
"盐余":"鹽餘","盐卤":"鹽滷","麦面":"麥麵","麻疯":"痲瘋",
"那么":"那麼","什么":"什麼","么女":"么女","么儿":"么兒","么妹":"么妹","么子":"么子","么干":"麼幹","么弟":"么弟","么象":"麼像",
"黄历":"黃曆","黄发":"黃髮","黑发":"黑髮","黑须":"黑鬚","点松":"點鬆","点象":"點像","齐冲":"齊衝","啮齿":"囓齒","龙钟":"龍鍾","龙须":"龍鬚",
"０里":"０里","剩余":"剩餘","賸余":"賸餘","台球":"撞球","唇干":"唇乾",

"折》":"摺》","准！":"準！","干！":"幹！","斗！":"鬥！","冲！":"衝！","！恩":"！嗯","0余":"0餘","0寸":"0吋","1寸":"1吋","2寸":"2吋","3寸":"3吋","4寸":"4吋","5寸":"5吋","6寸":"6吋","7寸":"7吋","8寸":"8吋","9寸":"9吋","注:":"註:","0里":"0里","1里":"1里","2里":"2里","3里":"3里","4里":"4里","5里":"5里","6里":"6里","7里":"7里","8里":"8里","9里":"9里","―":"─","‖":"∥","‘":"『","’":"』","“":"「","”":"」","″":"〞","∏":"Π","∑":"Σ","∧":"︿","∨":"﹀","∶":"︰","≈":"≒","≤":"≦","≥":"≧","━":"─","┃":"│","┏":"┌","┓":"┐","┗":"└","┛":"┘","┣":"├","┫":"┤","┳":"┬","┻":"┴","╋":"┼","〖":"【","〗":"】"
,"捂":"摀","胄":"冑","丑":"醜","咸":"鹹","眯":"瞇","赞":"讚","脏":"髒","侄":"姪","㖞":"喎","㧟":"擓","㳠":"澾","䁖":"瞜","䌷":"紬","䜣":"訢","䞍":"䝼","䥺":"釾","䥽":"鏺","䦃":"鐯","䦅":"鐥","䲟":"鮣","䲡":"鰌","䲢":"鰧","䲣":"䱷","䴓":"鳾","䴔":"鵁","䴕":"鴷","䴖":"鶄","䴗":"鶪","䶮":"龑","万":"萬","与":"與","专":"專","业":"業","丛":"叢","东":"東","丝":"絲","丢":"丟","两":"兩","严":"嚴","丧":"喪","个":"個","丰":"豐","临":"臨","丽":"麗","举":"舉","义":"義","乌":"烏","乐":"樂","乔":"喬","习":"習","乡":"鄉","书":"書","买":"買","乱":"亂","争":"爭","于":"於","亏":"虧","亚":"亞","亩":"畝","亲":"親","亵":"褻","亿":"億","仅":"僅","从":"從","仑":"侖","仓":"倉","仪":"儀","们":"們","价":"價","众":"眾","优":"優","会":"會","伛":"傴","伞":"傘","伟":"偉","传":"傳","伤":"傷","伥":"倀","伦":"倫","伧":"傖","伪":"偽","伫":"佇","佥":"僉","侠":"俠","侣":"侶","侥":"僥","侦":"偵","侧":"側","侨":"僑","侩":"儈","侪":"儕","侬":"儂","俣":"俁","俦":"儔","俨":"儼","俩":"倆","俪":"儷","俭":"儉","债":"債","倾":"傾"
,"偬":"傯","偻":"僂","偾":"僨","偿":"償","傥":"儻","傧":"儐","储":"儲","傩":"儺","儿":"兒","兑":"兌","兖":"兗","党":"黨","兰":"蘭","关":"關","兴":"興","兹":"茲","养":"養","兽":"獸","冁":"囅","内":"內","冈":"岡","册":"冊","写":"寫","军":"軍","农":"農","冯":"馮","冲":"沖","决":"決","况":"況","冻":"凍","凉":"涼","减":"減","凑":"湊","凛":"凜","几":"幾","凤":"鳳","凫":"鳧","凭":"憑","凯":"凱","击":"擊","凿":"鑿","刍":"芻","刘":"劉","则":"則","刚":"剛","创":"創","删":"刪","别":"別","刬":"剗","刭":"剄","刹":"剎","刽":"劊","刿":"劌","剀":"剴","剂":"劑","剐":"剮","剑":"劍","剥":"剝","剧":"劇","劝":"勸","办":"辦","务":"務","劢":"勱","动":"動","励":"勵","劲":"勁","劳":"勞","势":"勢","勚":"勩","匀":"勻","匦":"匭","匮":"匱","区":"區","医":"醫","华":"華","协":"協","单":"單","卖":"賣","卢":"盧","卤":"鹵","卫":"衛","却":"卻","卺":"巹","厂":"廠","厅":"廳","历":"歷","厉":"厲","压":"壓","厌":"厭","厍":"厙","厕":"廁","厢":"廂","厣":"厴","厦":"廈","厨":"廚","厩":"廄","厮":"廝","县":"縣","双":"雙","发":"發"
,"变":"變","叙":"敘","叠":"疊","叶":"葉","号":"號","叹":"嘆","叽":"嘰","后":"後","吓":"嚇","吕":"呂","吗":"嗎","吨":"噸","听":"聽","启":"啟","吴":"吳","呐":"吶","呒":"嘸","呓":"囈","呕":"嘔","呖":"嚦","呗":"唄","员":"員","呙":"咼","呛":"嗆","呜":"嗚","咏":"詠","咙":"嚨","咛":"嚀","咝":"噝","响":"響","哑":"啞","哒":"噠","哓":"嘵","哔":"嗶","哕":"噦","哗":"嘩","哙":"噲","哜":"嚌","哝":"噥","哟":"喲","唛":"嘜","唝":"嗊","唠":"嘮","唡":"啢","唢":"嗩","唤":"喚","啧":"嘖","啬":"嗇","啭":"囀","啸":"嘯","喷":"噴","喽":"嘍","喾":"嚳","嗫":"囁","嗳":"噯","嘘":"噓","嘤":"嚶","嘱":"囑","噜":"嚕","嚣":"囂","团":"團","园":"園","囱":"囪","围":"圍","囵":"圇","图":"圖","圆":"圓","圣":"聖","圹":"壙","场":"場","坏":"壞","块":"塊","坚":"堅","坛":"壇","坜":"壢","坝":"壩","坞":"塢","坟":"墳","坠":"墜","垆":"壚","垒":"壘","垦":"墾","垩":"堊","垫":"墊","垭":"埡","垲":"塏","垴":"堖","埘":"塒","埚":"堝","堑":"塹","堕":"墮","墙":"牆","壮":"壯","声":"聲","壳":"殼","壶":"壺","处":"處","备":"備","复":"復","够":"夠"
,"头":"頭","夸":"誇","夹":"夾","夺":"奪","奁":"奩","奂":"奐","奋":"奮","奥":"奧","妆":"妝","妇":"婦","妈":"媽","妩":"嫵","妪":"嫗","妫":"媯","姗":"姍","娄":"婁","娅":"婭","娆":"嬈","娇":"嬌","娈":"孌","娱":"娛","娲":"媧","娴":"嫻","婳":"嫿","婴":"嬰","婵":"嬋","婶":"嬸","媪":"媼","嫒":"嬡","嫔":"嬪","嫱":"嬙","嬷":"嬤","孙":"孫","学":"學","孪":"孿","宝":"寶","实":"實","宠":"寵","审":"審","宪":"憲","宫":"宮","宽":"寬","宾":"賓","寝":"寢","对":"對","寻":"尋","导":"導","寿":"壽","将":"將","尔":"爾","尘":"塵","尝":"嘗","尧":"堯","尴":"尷","尸":"屍","尽":"盡","层":"層","屉":"屜","届":"屆","属":"屬","屡":"屢","屦":"屨","屿":"嶼","岁":"歲","岂":"豈","岖":"嶇","岗":"崗","岘":"峴","岚":"嵐","岛":"島","岭":"嶺","岿":"巋","峄":"嶧","峡":"峽","峣":"嶢","峤":"嶠","峥":"崢","峦":"巒","崂":"嶗","崃":"崍","崭":"嶄","嵘":"嶸","嵚":"嶔","嵝":"嶁","巅":"巔","巩":"鞏","巯":"巰","币":"幣","帅":"帥","师":"師","帏":"幃","帐":"帳","帘":"簾","帜":"幟","带":"帶","帧":"幀","帮":"幫","帱":"幬","帻":"幘","帼":"幗"
,"幂":"冪","广":"廣","庆":"慶","庐":"廬","庑":"廡","库":"庫","应":"應","庙":"廟","庞":"龐","废":"廢","廪":"廩","异":"異","弃":"棄","弑":"弒","张":"張","弥":"彌","弪":"弳","弯":"彎","弹":"彈","强":"強","归":"歸","当":"當","录":"錄","彦":"彥","彻":"徹","径":"徑","徕":"徠","忆":"憶","忏":"懺","忧":"憂","忾":"愾","怀":"懷","态":"態","怂":"慫","怃":"憮","怄":"慪","怅":"悵","怆":"愴","怜":"憐","总":"總","怼":"懟","怿":"懌","恋":"戀","恒":"恆","恳":"懇","恶":"惡","恸":"慟","恹":"懨","恺":"愷","恻":"惻","恼":"惱","恽":"惲","悦":"悅","悫":"愨","悬":"懸","悭":"慳","悯":"憫","惊":"驚","惧":"懼","惨":"慘","惩":"懲","惫":"憊","惬":"愜","惭":"慚","惮":"憚","惯":"慣","愠":"慍","愤":"憤","愦":"憒","愿":"願","慑":"懾","懑":"懣","懒":"懶","懔":"懍","戆":"戇","戋":"戔","戏":"戲","戗":"戧","战":"戰","戬":"戩","户":"戶","扑":"撲","执":"執","扩":"擴","扪":"捫","扫":"掃","扬":"揚","扰":"擾","抚":"撫","抛":"拋","抟":"摶","抠":"摳","抡":"掄","抢":"搶","护":"護","报":"報","担":"擔","拟":"擬","拢":"攏","拣":"揀"
,"拥":"擁","拦":"攔","拧":"擰","拨":"撥","择":"擇","挂":"掛","挚":"摯","挛":"攣","挜":"掗","挝":"撾","挞":"撻","挟":"挾","挠":"撓","挡":"擋","挢":"撟","挣":"掙","挤":"擠","挥":"揮","挦":"撏","捞":"撈","损":"損","捡":"撿","换":"換","捣":"搗","据":"據","掳":"擄","掴":"摑","掷":"擲","掸":"撣","掺":"摻","掼":"摜","揽":"攬","揿":"撳","搀":"攙","搁":"擱","搂":"摟","搅":"攪","携":"攜","摄":"攝","摅":"攄","摆":"擺","摇":"搖","摈":"擯","摊":"攤","撄":"攖","撑":"撐","撵":"攆","撷":"擷","撸":"擼","撺":"攛","擞":"擻","攒":"攢","敌":"敵","敛":"斂","数":"數","斋":"齋","斓":"斕","斩":"斬","断":"斷","无":"無","旧":"舊","时":"時","旷":"曠","旸":"暘","昙":"曇","昼":"晝","昽":"曨","显":"顯","晋":"晉","晒":"曬","晓":"曉","晔":"曄","晕":"暈","晖":"暉","暂":"暫","暧":"曖","机":"機","杀":"殺","杂":"雜","权":"權","杆":"桿","条":"條","来":"來","杨":"楊","杩":"榪","杰":"傑","极":"極","构":"構","枞":"樅","枢":"樞","枣":"棗","枥":"櫪","枧":"梘","枨":"棖","枪":"槍","枫":"楓","枭":"梟","柜":"櫃","柠":"檸","柽":"檉"
,"栀":"梔","栅":"柵","标":"標","栈":"棧","栉":"櫛","栊":"櫳","栋":"棟","栌":"櫨","栎":"櫟","栏":"欄","树":"樹","栖":"棲","样":"樣","栾":"欒","桠":"椏","桡":"橈","桢":"楨","档":"檔","桤":"榿","桥":"橋","桦":"樺","桧":"檜","桨":"槳","桩":"樁","梦":"夢","检":"檢","椁":"槨","椟":"櫝","椠":"槧","椤":"欏","椭":"橢","楼":"樓","榄":"欖","榇":"櫬","榈":"櫚","榉":"櫸","槚":"檟","槛":"檻","槟":"檳","槠":"櫧","横":"橫","樯":"檣","樱":"櫻","橥":"櫫","橱":"櫥","橹":"櫓","橼":"櫞","檩":"檁","欢":"歡","欤":"歟","欧":"歐","歼":"殲","殁":"歿","殇":"殤","残":"殘","殒":"殞","殓":"殮","殚":"殫","殡":"殯","殴":"毆","毁":"毀","毂":"轂","毕":"畢","毙":"斃","毡":"氈","毵":"毿","氇":"氌","气":"氣","氢":"氫","氩":"氬","氲":"氳","汇":"匯","汉":"漢","汤":"湯","汹":"洶","沟":"溝","没":"沒","沣":"灃","沤":"漚","沥":"瀝","沦":"淪","沧":"滄","沩":"溈","沪":"滬","泞":"濘","泪":"淚","泶":"澩","泷":"瀧","泸":"瀘","泺":"濼","泻":"瀉","泼":"潑","泽":"澤","泾":"涇","洁":"潔","洒":"灑","洼":"窪","浃":"浹","浅":"淺","浆":"漿"
,"浇":"澆","浈":"湞","浊":"濁","测":"測","浍":"澮","济":"濟","浏":"瀏","浐":"滻","浑":"渾","浒":"滸","浓":"濃","浔":"潯","涛":"濤","涝":"澇","涞":"淶","涟":"漣","涠":"潿","涡":"渦","涣":"渙","涤":"滌","润":"潤","涧":"澗","涨":"漲","涩":"澀","渊":"淵","渌":"淥","渍":"漬","渎":"瀆","渐":"漸","渑":"澠","渔":"漁","渖":"瀋","渗":"滲","温":"溫","湾":"灣","湿":"濕","溃":"潰","溅":"濺","溆":"漵","滗":"潷","滚":"滾","滞":"滯","滠":"灄","满":"滿","滢":"瀅","滤":"濾","滥":"濫","滦":"灤","滨":"濱","滩":"灘","滪":"澦","潆":"瀠","潇":"瀟","潋":"瀲","潍":"濰","潜":"潛","潴":"瀦","澜":"瀾","濑":"瀨","濒":"瀕","灏":"灝","灭":"滅","灯":"燈","灵":"靈","灾":"災","灿":"燦","炀":"煬","炉":"爐","炖":"燉","炜":"煒","炝":"熗","点":"點","炼":"煉","炽":"熾","烁":"爍","烂":"爛","烃":"烴","烛":"燭","烟":"煙","烦":"煩","烧":"燒","烨":"燁","烩":"燴","烫":"燙","烬":"燼","热":"熱","焕":"煥","焖":"燜","焘":"燾","爱":"愛","爷":"爺","牍":"牘","牵":"牽","牺":"犧","犊":"犢","状":"狀","犷":"獷","犸":"獁","犹":"猶","狈":"狽"
,"狝":"獮","狞":"獰","独":"獨","狭":"狹","狮":"獅","狯":"獪","狰":"猙","狱":"獄","狲":"猻","猃":"獫","猎":"獵","猕":"獼","猡":"玀","猪":"豬","猫":"貓","猬":"蝟","献":"獻","獭":"獺","玑":"璣","玛":"瑪","玮":"瑋","环":"環","现":"現","玱":"瑲","玺":"璽","珐":"琺","珑":"瓏","珲":"琿","琏":"璉","琐":"瑣","琼":"瓊","瑶":"瑤","瑷":"璦","璎":"瓔","瓒":"瓚","瓯":"甌","电":"電","画":"畫","畅":"暢","畴":"疇","疖":"癤","疗":"療","疟":"瘧","疠":"癘","疡":"瘍","疬":"癧","疮":"瘡","疯":"瘋","疱":"皰","疴":"痾","痈":"癰","痉":"痙","痒":"癢","痖":"瘂","痨":"癆","痪":"瘓","痫":"癇","瘅":"癉","瘗":"瘞","瘪":"癟","瘫":"癱","瘾":"癮","瘿":"癭","癞":"癩","癣":"癬","癫":"癲","皑":"皚","皱":"皺","皲":"皸","盏":"盞","盐":"鹽","监":"監","盖":"蓋","盗":"盜","盘":"盤","眍":"瞘","眦":"眥","眬":"矓","睁":"睜","睐":"睞","睑":"瞼","瞒":"瞞","瞩":"矚","矫":"矯","矶":"磯","矾":"礬","矿":"礦","砀":"碭","码":"碼","砖":"磚","砗":"硨","砚":"硯","砜":"碸","砺":"礪","砻":"礱","砾":"礫","础":"礎","硕":"碩","硖":"硤","硗":"磽"
,"硙":"磑","确":"確","碍":"礙","碛":"磧","碜":"磣","礼":"禮","祎":"禕","祯":"禎","祷":"禱","祸":"禍","禀":"稟","禄":"祿","禅":"禪","离":"離","秃":"禿","秆":"稈","种":"種","积":"積","称":"稱","秽":"穢","税":"稅","稣":"穌","稳":"穩","穑":"穡","穷":"窮","窃":"竊","窍":"竅","窎":"窵","窑":"窯","窜":"竄","窝":"窩","窥":"窺","窦":"竇","窭":"窶","竖":"豎","竞":"競","笃":"篤","笋":"筍","笔":"筆","笕":"筧","笺":"箋","笼":"籠","笾":"籩","筑":"築","筚":"篳","筛":"篩","筝":"箏","筹":"籌","签":"簽","简":"簡","箓":"籙","箦":"簀","箧":"篋","箨":"籜","箩":"籮","箪":"簞","箫":"簫","篑":"簣","篓":"簍","篮":"籃","篱":"籬","簖":"籪","籁":"籟","籴":"糴","类":"類","籼":"秈","粜":"糶","粝":"糲","粤":"粵","粪":"糞","粮":"糧","糁":"糝","糇":"餱","紧":"緊","絷":"縶","纠":"糾","纡":"紆","红":"紅","纣":"紂","纤":"纖","纥":"紇","约":"約","级":"級","纨":"紈","纩":"纊","纪":"紀","纫":"紉","纬":"緯","纭":"紜","纮":"紘","纯":"純","纰":"紕","纱":"紗","纲":"綱","纳":"納","纴":"紝","纵":"縱","纶":"綸","纷":"紛","纸":"紙"
,"纹":"紋","纺":"紡","纼":"紖","纽":"紐","纾":"紓","绀":"紺","绁":"紲","绂":"紱","练":"練","组":"組","绅":"紳","细":"細","织":"織","终":"終","绉":"縐","绊":"絆","绋":"紼","绌":"絀","绍":"紹","绎":"繹","经":"經","绐":"紿","绑":"綁","绒":"絨","结":"結","绔":"絝","绕":"繞","绖":"絰","绗":"絎","绘":"繪","给":"給","绚":"絢","绛":"絳","络":"絡","绝":"絕","绞":"絞","统":"統","绠":"綆","绡":"綃","绢":"絹","绥":"綏","绦":"絛","继":"繼","绨":"綈","绩":"績","绪":"緒","绫":"綾","续":"續","绮":"綺","绯":"緋","绰":"綽","绱":"緔","绲":"緄","绳":"繩","维":"維","绵":"綿","绶":"綬","绸":"綢","绺":"綹","绻":"綣","综":"綜","绽":"綻","绾":"綰","绿":"綠","缀":"綴","缁":"緇","缂":"緙","缃":"緗","缄":"緘","缅":"緬","缆":"纜","缇":"緹","缈":"緲","缉":"緝","缊":"縕","缋":"繢","缌":"緦","缍":"綞","缎":"緞","缏":"緶","缑":"緱","缒":"縋","缓":"緩","缔":"締","缕":"縷","编":"編","缗":"緡","缘":"緣","缙":"縉","缚":"縛","缛":"縟","缜":"縝","缝":"縫","缞":"縗","缟":"縞","缠":"纏","缡":"縭","缢":"縊","缣":"縑","缤":"繽"
,"缥":"縹","缦":"縵","缧":"縲","缨":"纓","缩":"縮","缪":"繆","缫":"繅","缬":"纈","缭":"繚","缮":"繕","缯":"繒","缱":"繾","缲":"繰","缳":"繯","缴":"繳","缵":"纘","罂":"罌","网":"網","罗":"羅","罚":"罰","罢":"罷","罴":"羆","羁":"羈","羟":"羥","羡":"羨","翘":"翹","耢":"耮","耧":"耬","耸":"聳","耻":"恥","聂":"聶","聋":"聾","职":"職","聍":"聹","联":"聯","聩":"聵","聪":"聰","肃":"肅","肠":"腸","肤":"膚","肮":"骯","肾":"腎","肿":"腫","胀":"脹","胁":"脅","胆":"膽","胜":"勝","胧":"朧","胨":"腖","胪":"臚","胫":"脛","胶":"膠","脉":"脈","脍":"膾","脐":"臍","脑":"腦","脓":"膿","脔":"臠","脚":"腳","脱":"脫","脶":"腡","脸":"臉","腊":"臘","腻":"膩","腽":"膃","腾":"騰","膑":"臏","臜":"臢","舆":"輿","舣":"艤","舰":"艦","舱":"艙","舻":"艫","艰":"艱","艺":"藝","节":"節","芈":"羋","芗":"薌","芜":"蕪","芦":"蘆","苁":"蓯","苇":"葦","苈":"藶","苋":"莧","苌":"萇","苍":"蒼","苏":"蘇","苹":"蘋","茎":"莖","茏":"蘢","茑":"蔦","茔":"塋","茕":"煢","茧":"繭","荆":"荊","荐":"薦","荚":"莢","荛":"蕘","荜":"蓽","荞":"蕎"
,"荟":"薈","荠":"薺","荣":"榮","荤":"葷","荥":"滎","荦":"犖","荧":"熒","荨":"蕁","荩":"藎","荪":"蓀","荫":"蔭","荬":"蕒","荭":"葒","荮":"葤","莅":"蒞","莱":"萊","莲":"蓮","莳":"蒔","莴":"萵","莶":"薟","获":"獲","莸":"蕕","莹":"瑩","莺":"鶯","萝":"蘿","萤":"螢","营":"營","萦":"縈","萧":"蕭","萨":"薩","葱":"蔥","蒇":"蕆","蒉":"蕢","蒋":"蔣","蒌":"蔞","蓝":"藍","蓟":"薊","蓠":"蘺","蓣":"蕷","蓥":"鎣","蓦":"驀","蔷":"薔","蔹":"蘞","蔺":"藺","蔼":"藹","蕲":"蘄","蕴":"蘊","薮":"藪","藓":"蘚","虏":"虜","虑":"慮","虚":"虛","虫":"蟲","虬":"虯","虮":"蟣","虽":"雖","虾":"蝦","虿":"蠆","蚀":"蝕","蚁":"蟻","蚂":"螞","蚕":"蠶","蚬":"蜆","蛊":"蠱","蛎":"蠣","蛏":"蟶","蛮":"蠻","蛰":"蟄","蛱":"蛺","蛲":"蟯","蛳":"螄","蛴":"蠐","蜕":"蛻","蜗":"蝸","蜡":"蠟","蝇":"蠅","蝈":"蟈","蝉":"蟬","蝎":"蠍","蝼":"螻","蝾":"蠑","螨":"蟎","蟏":"蠨","衅":"釁","衔":"銜","补":"補","衬":"襯","衮":"袞","袄":"襖","袅":"裊","袜":"襪","袭":"襲","装":"裝","裆":"襠","裢":"褳","裣":"襝","裤":"褲","褛":"褸","褴":"襤","见":"見"
,"观":"觀","觃":"覎","觅":"覓","觇":"覘","览":"覽","觉":"覺","觊":"覬","觋":"覡","觌":"覿","觎":"覦","觏":"覯","觐":"覲","觑":"覷","觞":"觴","触":"觸","觯":"觶","誉":"譽","誊":"謄","计":"計","订":"訂","讣":"訃","认":"認","讥":"譏","讦":"訐","讧":"訌","讨":"討","让":"讓","讪":"訕","讫":"訖","训":"訓","议":"議","讯":"訊","记":"記","讲":"講","讳":"諱","讴":"謳","讵":"詎","讶":"訝","讷":"訥","许":"許","讹":"訛","论":"論","讻":"訩","讼":"訟","讽":"諷","设":"設","访":"訪","诀":"訣","证":"證","诂":"詁","诃":"訶","评":"評","诅":"詛","识":"識","诇":"詗","诈":"詐","诉":"訴","诊":"診","诋":"詆","诌":"謅","词":"詞","诎":"詘","诏":"詔","译":"譯","诒":"詒","诓":"誆","诔":"誄","试":"試","诖":"詿","诗":"詩","诘":"詰","诙":"詼","诚":"誠","诛":"誅","诜":"詵","话":"話","诞":"誕","诟":"詬","诠":"詮","诡":"詭","询":"詢","诣":"詣","诤":"諍","该":"該","详":"詳","诧":"詫","诨":"諢","诩":"詡","诫":"誡","诬":"誣","语":"語","诮":"誚","误":"誤","诰":"誥","诱":"誘","诲":"誨","诳":"誑","说":"說","诵":"誦","诶":"誒"
,"请":"請","诸":"諸","诹":"諏","诺":"諾","读":"讀","诼":"諑","诽":"誹","课":"課","诿":"諉","谀":"諛","谁":"誰","谂":"諗","调":"調","谄":"諂","谅":"諒","谆":"諄","谇":"誶","谈":"談","谊":"誼","谋":"謀","谌":"諶","谍":"諜","谎":"謊","谏":"諫","谐":"諧","谑":"謔","谒":"謁","谓":"謂","谔":"諤","谕":"諭","谖":"諼","谗":"讒","谘":"諮","谙":"諳","谚":"諺","谛":"諦","谜":"謎","谝":"諞","谞":"諝","谟":"謨","谠":"讜","谡":"謖","谢":"謝","谣":"謠","谤":"謗","谥":"謚","谦":"謙","谧":"謐","谨":"謹","谩":"謾","谪":"謫","谫":"譾","谬":"謬","谭":"譚","谮":"譖","谯":"譙","谰":"讕","谱":"譜","谲":"譎","谳":"讞","谴":"譴","谵":"譫","谶":"讖","豮":"豶","贝":"貝","贞":"貞","负":"負","贡":"貢","财":"財","责":"責","贤":"賢","败":"敗","账":"賬","货":"貨","质":"質","贩":"販","贪":"貪","贫":"貧","贬":"貶","购":"購","贮":"貯","贯":"貫","贰":"貳","贱":"賤","贲":"賁","贳":"貰","贴":"貼","贵":"貴","贶":"貺","贷":"貸","贸":"貿","费":"費","贺":"賀","贻":"貽","贼":"賊","贽":"贄","贾":"賈","贿":"賄","赀":"貲","赁":"賃"
,"赂":"賂","资":"資","赅":"賅","赆":"贐","赇":"賕","赈":"賑","赉":"賚","赊":"賒","赋":"賦","赌":"賭","赍":"齎","赎":"贖","赏":"賞","赐":"賜","赒":"賙","赓":"賡","赔":"賠","赕":"賧","赖":"賴","赗":"賵","赘":"贅","赙":"賻","赚":"賺","赛":"賽","赜":"賾","赟":"贇","赠":"贈","赡":"贍","赢":"贏","赣":"贛","赵":"趙","赶":"趕","趋":"趨","趱":"趲","趸":"躉","跃":"躍","跄":"蹌","跞":"躒","践":"踐","跷":"蹺","跸":"蹕","跹":"躚","跻":"躋","踊":"踴","踌":"躊","踪":"蹤","踬":"躓","踯":"躑","蹑":"躡","蹒":"蹣","蹰":"躕","蹿":"躥","躏":"躪","躜":"躦","躯":"軀","车":"車","轧":"軋","轨":"軌","轩":"軒","轫":"軔","转":"轉","轭":"軛","轮":"輪","软":"軟","轰":"轟","轱":"軲","轲":"軻","轳":"轤","轴":"軸","轵":"軹","轶":"軼","轷":"軤","轸":"軫","轹":"轢","轺":"軺","轻":"輕","轼":"軾","载":"載","轾":"輊","轿":"轎","辁":"輇","辂":"輅","较":"較","辄":"輒","辅":"輔","辆":"輛","辇":"輦","辈":"輩","辉":"輝","辊":"輥","辋":"輞","辍":"輟","辎":"輜","辏":"輳","辐":"輻","辑":"輯","输":"輸","辔":"轡","辕":"轅","辖":"轄"
,"辗":"輾","辘":"轆","辙":"轍","辚":"轔","辞":"辭","辩":"辯","辫":"辮","边":"邊","辽":"遼","达":"達","迁":"遷","过":"過","迈":"邁","运":"運","还":"還","这":"這","进":"進","远":"遠","违":"違","连":"連","迟":"遲","迩":"邇","迳":"逕","迹":"跡","适":"適","选":"選","逊":"遜","递":"遞","逦":"邐","逻":"邏","遗":"遺","遥":"遙","邓":"鄧","邝":"鄺","邬":"鄔","邮":"郵","邹":"鄒","邺":"鄴","邻":"鄰","郏":"郟","郐":"鄶","郑":"鄭","郓":"鄆","郦":"酈","郧":"鄖","郸":"鄲","酱":"醬","酽":"釅","酾":"釃","酿":"釀","释":"釋","銮":"鑾","錾":"鏨","钆":"釓","钇":"釔","针":"針","钉":"釘","钊":"釗","钋":"釙","钌":"釕","钍":"釷","钎":"釺","钏":"釧","钐":"釤","钒":"釩","钓":"釣","钔":"鍆","钕":"釹","钖":"鍚","钗":"釵","钘":"鈃","钙":"鈣","钛":"鈦","钜":"鉅","钝":"鈍","钞":"鈔","钠":"鈉","钡":"鋇","钢":"鋼","钣":"鈑","钤":"鈐","钥":"鑰","钦":"欽","钧":"鈞","钨":"鎢","钩":"鉤","钪":"鈧","钫":"鈁","钬":"鈥","钭":"鈄","钮":"鈕","钯":"鈀","钰":"鈺","钱":"錢","钲":"鉦","钳":"鉗","钴":"鈷","钶":"鈳","钷":"鉕","钹":"鈸"
,"钺":"鉞","钼":"鉬","钽":"鉭","钾":"鉀","钿":"鈿","铀":"鈾","铁":"鐵","铂":"鉑","铃":"鈴","铄":"鑠","铅":"鉛","铆":"鉚","铈":"鈰","铉":"鉉","铊":"鉈","铋":"鉍","铌":"鈮","铍":"鈹","铎":"鐸","铏":"鉶","铐":"銬","铑":"銠","铒":"鉺","铓":"鋩","铕":"銪","铖":"鋮","铗":"鋏","铘":"鋣","铙":"鐃","铛":"鐺","铜":"銅","铝":"鋁","铞":"銱","铟":"銦","铠":"鎧","铡":"鍘","铢":"銖","铣":"銑","铤":"鋌","铥":"銩","铧":"鏵","铨":"銓","铩":"鎩","铪":"鉿","铫":"銚","铬":"鉻","铭":"銘","铮":"錚","铯":"銫","铰":"鉸","铱":"銥","铲":"鏟","铳":"銃","铴":"鐋","铵":"銨","银":"銀","铷":"銣","铸":"鑄","铹":"鐒","铺":"鋪","铼":"錸","铽":"鋱","链":"鏈","铿":"鏗","销":"銷","锁":"鎖","锂":"鋰","锃":"鋥","锄":"鋤","锅":"鍋","锆":"鋯","锇":"鋨","锉":"銼","锊":"鋝","锋":"鋒","锌":"鋅","锍":"鋶","锎":"鐦","锐":"銳","锑":"銻","锒":"鋃","锓":"鋟","锔":"鋦","锕":"錒","锖":"錆","锗":"鍺","锘":"鍩","错":"錯","锚":"錨","锛":"錛","锜":"錡","锝":"鍀","锞":"錁","锟":"錕","锡":"錫","锢":"錮","锣":"鑼","锤":"錘","锥":"錐","锦":"錦"
,"锧":"鑕","锩":"錈","锪":"鍃","锫":"錇","锬":"錟","锭":"錠","键":"鍵","锯":"鋸","锰":"錳","锱":"錙","锲":"鍥","锴":"鍇","锵":"鏘","锶":"鍶","锷":"鍔","锸":"鍤","锹":"鍬","锺":"鍾","锼":"鎪","锾":"鍰","锿":"鎄","镀":"鍍","镁":"鎂","镂":"鏤","镃":"鎡","镄":"鐨","镅":"鎇","镆":"鏌","镉":"鎘","镊":"鑷","镌":"鐫","镍":"鎳","镎":"鎿","镏":"鎦","镐":"鎬","镑":"鎊","镒":"鎰","镓":"鎵","镔":"鑌","镕":"鎔","镖":"鏢","镗":"鏜","镘":"鏝","镙":"鏍","镚":"鏰","镛":"鏞","镜":"鏡","镝":"鏑","镞":"鏃","镟":"鏇","镡":"鐔","镣":"鐐","镤":"鏷","镥":"鑥","镦":"鐓","镧":"鑭","镨":"鐠","镩":"鑹","镪":"鏹","镫":"鐙","镬":"鑊","镭":"鐳","镮":"鐶","镯":"鐲","镰":"鐮","镱":"鐿","镲":"鑔","镳":"鑣","镴":"鑞","镶":"鑲","长":"長","门":"門","闩":"閂","闪":"閃","闫":"閆","闭":"閉","问":"問","闯":"闖","闰":"閏","闱":"闈","闳":"閎","间":"間","闵":"閔","闶":"閌","闷":"悶","闸":"閘","闹":"鬧","闺":"閨","闻":"聞","闼":"闥","闽":"閩","闾":"閭","闿":"闓","阀":"閥","阁":"閣","阂":"閡","阃":"閫","阄":"鬮","阅":"閱","阆":"閬"
,"阈":"閾","阉":"閹","阊":"閶","阋":"鬩","阌":"閿","阍":"閽","阎":"閻","阏":"閼","阐":"闡","阑":"闌","阒":"闃","阔":"闊","阕":"闋","阖":"闔","阗":"闐","阙":"闕","阚":"闞","队":"隊","阳":"陽","阴":"陰","阵":"陣","阶":"階","际":"際","陆":"陸","陇":"隴","陈":"陳","陉":"陘","陕":"陝","陧":"隉","陨":"隕","险":"險","随":"隨","隐":"隱","隶":"隸","隽":"雋","难":"難","雏":"雛","雠":"讎","雳":"靂","雾":"霧","霁":"霽","霭":"靄","靓":"靚","静":"靜","靥":"靨","鞑":"韃","鞯":"韉","韦":"韋","韧":"韌","韨":"韍","韩":"韓","韪":"韙","韫":"韞","韬":"韜","韵":"韻","页":"頁","顶":"頂","顷":"頃","顸":"頇","项":"項","顺":"順","须":"須","顼":"頊","顽":"頑","顾":"顧","顿":"頓","颀":"頎","颁":"頒","颂":"頌","颃":"頏","预":"預","颅":"顱","领":"領","颇":"頗","颈":"頸","颉":"頡","颊":"頰","颋":"頲","颌":"頜","颍":"潁","颏":"頦","颐":"頤","频":"頻","颓":"頹","颔":"頷","颖":"穎","颗":"顆","题":"題","颙":"顒","颛":"顓","颜":"顏","额":"額","颞":"顳","颟":"顢","颠":"顛","颡":"顙","颢":"顥","颤":"顫","颥":"顬","颦":"顰"
,"颧":"顴","风":"風","飑":"颮","飒":"颯","飓":"颶","飔":"颸","飕":"颼","飗":"飀","飘":"飄","飙":"飆","飚":"飈","飞":"飛","飨":"饗","餍":"饜","饥":"飢","饦":"飥","饧":"餳","饨":"飩","饩":"餼","饪":"飪","饫":"飫","饬":"飭","饭":"飯","饮":"飲","饯":"餞","饰":"飾","饱":"飽","饲":"飼","饳":"飿","饴":"飴","饵":"餌","饶":"饒","饷":"餉","饸":"餄","饹":"餎","饺":"餃","饻":"餏","饼":"餅","饽":"餑","饿":"餓","馀":"餘","馁":"餒","馃":"餜","馄":"餛","馅":"餡","馆":"館","馇":"餷","馈":"饋","馉":"餶","馊":"餿","馋":"饞","馍":"饃","馎":"餺","馏":"餾","馐":"饈","馑":"饉","馒":"饅","馓":"饊","馔":"饌","马":"馬","驭":"馭","驮":"馱","驯":"馴","驰":"馳","驱":"驅","驳":"駁","驴":"驢","驵":"駔","驶":"駛","驷":"駟","驸":"駙","驹":"駒","驺":"騶","驻":"駐","驼":"駝","驽":"駑","驾":"駕","驿":"驛","骀":"駘","骁":"驍","骂":"罵","骄":"驕","骅":"驊","骆":"駱","骇":"駭","骈":"駢","骊":"驪","骋":"騁","验":"驗","骎":"駸","骏":"駿","骐":"騏","骑":"騎","骒":"騍","骓":"騅","骖":"驂","骗":"騙","骘":"騭","骚":"騷","骛":"騖"
,"骜":"驁","骝":"騮","骞":"騫","骟":"騸","骠":"驃","骡":"騾","骢":"驄","骣":"驏","骤":"驟","骥":"驥","骧":"驤","髅":"髏","髋":"髖","髌":"髕","鬓":"鬢","魇":"魘","魉":"魎","鱼":"魚","鱽":"魛","鱿":"魷","鲁":"魯","鲂":"魴","鲅":"鮁","鲆":"鮃","鲈":"鱸","鲊":"鮓","鲋":"鮒","鲍":"鮑","鲎":"鱟","鲏":"鮍","鲐":"鮐","鲑":"鮭","鲒":"鮚","鲔":"鮪","鲕":"鮞","鲖":"鮦","鲗":"鰂","鲙":"鱠","鲚":"鱭","鲛":"鮫","鲜":"鮮","鲝":"鮺","鲞":"鯗","鲟":"鱘","鲠":"鯁","鲡":"鱺","鲢":"鰱","鲣":"鰹","鲤":"鯉","鲥":"鰣","鲦":"鰷","鲧":"鯀","鲨":"鯊","鲩":"鯇","鲫":"鯽","鲭":"鯖","鲮":"鯪","鲰":"鯫","鲱":"鯡","鲲":"鯤","鲳":"鯧","鲴":"鯝","鲵":"鯢","鲷":"鯛","鲸":"鯨","鲺":"鯴","鲻":"鯔","鲼":"鱝","鲽":"鰈","鲿":"鱨","鳃":"鰓","鳄":"鱷","鳅":"鰍","鳆":"鰒","鳇":"鰉","鳊":"鯿","鳋":"鰠","鳌":"鰲","鳍":"鰭","鳎":"鰨","鳏":"鰥","鳐":"鰩","鳑":"鰟","鳒":"鰜","鳓":"鰳","鳔":"鰾","鳕":"鱈","鳖":"鱉","鳗":"鰻","鳘":"鰵","鳙":"鱅","鳛":"鰼","鳜":"鱖","鳝":"鱔","鳞":"鱗","鳟":"鱒","鳢":"鱧","鳣":"鱣","鸟":"鳥","鸠":"鳩"
,"鸢":"鳶","鸣":"鳴","鸥":"鷗","鸦":"鴉","鸧":"鶬","鸨":"鴇","鸩":"鴆","鸪":"鴣","鸫":"鶇","鸬":"鸕","鸭":"鴨","鸮":"鴞","鸯":"鴦","鸰":"鴒","鸱":"鴟","鸲":"鴝","鸳":"鴛","鸵":"鴕","鸶":"鷥","鸷":"鷙","鸸":"鴯","鸹":"鴰","鸺":"鵂","鸻":"鴴","鸼":"鵃","鸽":"鴿","鸾":"鸞","鸿":"鴻","鹁":"鵓","鹂":"鸝","鹃":"鵑","鹄":"鵠","鹅":"鵝","鹆":"鵒","鹈":"鵜","鹉":"鵡","鹊":"鵲","鹋":"鶓","鹌":"鵪","鹎":"鵯","鹏":"鵬","鹐":"鵮","鹑":"鶉","鹒":"鶊","鹕":"鶘","鹖":"鶡","鹗":"鶚","鹘":"鶻","鹙":"鶖","鹚":"鶿","鹛":"鶥","鹜":"鶩","鹞":"鷂","鹡":"鶺","鹣":"鶼","鹤":"鶴","鹥":"鷖","鹦":"鸚","鹧":"鷓","鹨":"鷚","鹩":"鷯","鹪":"鷦","鹫":"鷲","鹬":"鷸","鹭":"鷺","鹯":"鸇","鹰":"鷹","鹱":"鸌","鹳":"鸛","鹾":"鹺","麦":"麥","麸":"麩","黄":"黃","黉":"黌","黡":"黶","黩":"黷","黪":"黲","黾":"黽","鼋":"黿","鼍":"鼉","鼹":"鼴","齐":"齊","齑":"齏","齿":"齒","龀":"齔","龃":"齟","龄":"齡","龅":"齙","龆":"齠","龇":"齜","龈":"齦","龉":"齬","龊":"齪","龋":"齲","龌":"齷","龙":"龍","龚":"龔","龛":"龕","龟":"龜","䴘":"鷈"
,"䴙":"鷿","净":"淨","啮":"齧","埙":"壎","滟":"灩","绷":"繃","艳":"豔","莼":"蓴","赝":"贗","锈":"鏽","镋":"钂","鹇":"鷳","勋":"勳","岽":"崬","棂":"櫺","牦":"犛","蘖":"櫱","锨":"杴","鞒":"屩","馕":"饢","闲":"閒","荡":"蕩","钟":"鐘","仆":"僕","佣":"傭","凄":"淒","着":"著","里":"裡","㑇":"㑳","㘎":"㘚","㤘":"㥮","㧏":"掆","㧐":"㩳","㭎":"棡","䅟":"穇","䎬":"䎱","䏝":"膞","䓖":"藭","䙌":"䙡","䜩":"讌","䦂":"䥇","䦶":"䦛","䦷":"䦟","亘":"亙","伲":"你","倮":"裸","凇":"淞","凼":"幽","剳":"劄","勦":"剿","卧":"臥","厘":"釐","叆":"靉","叇":"靆","哌":"呱","啰":"囉","嗬":"呵","尜":"嘎","峃":"嶨","峯":"峰","崐":"崑","庄":"莊","庼":"廎","彚":"彙","擀":"搟","昵":"暱","暸":"瞭","杠":"槓","榘":"矩","檐":"簷","氽":"汆","沨":"渢","沲":"沱","浉":"溮","浕":"濜","涌":"湧","涢":"溳","溇":"漊","炤":"照","牀":"床","珉":"玟","珏":"玨","琎":"璡","琯":"管","瓮":"甕","畲":"畬","痹":"痺","癡":"痴","硚":"礄","礡":"礴","稭":"秸","糍":"餈","紥":"紮","翚":"翬","腌":"醃","腘":"膕","膻":"羶","萚":"蘀","蟮":"蟺","谉":"讅"
,"㑩":"儸","㓥":"劏","㔉":"劚","㖊":"噚","㟆":"㠏","㧑":"撝","㨫":"㩜","㱩":"殰","㱮":"殨","㲿":"瀇","㶉":"鸂","㶶":"燶","㶽":"煱","㺍":"獱","䅉":"稏","䇲":"筴","䌶":"䊷","䌸":"縳","䌹":"絅","䌺":"䋙","䌼":"綐","䌽":"綵","䌾":"䋻","䍀":"繿","䍁":"繸","䓕":"薳","䗖":"螮","䙓":"襬","䝙":"貙","䞐":"賰","䯄":"騧","䯅":"䯀","䲝":"䱽","䲠":"鰆","亸":"嚲","伣":"俔","俫":"倈","厐":"龎","吣":"唚","啴":"嘽","垱":"壋","埯":"垵","壸":"壼","屃":"屓","岙":"嶴","崄":"嶮","幞":"襆","悮":"悞","揾":"搵","梼":"檮","梾":"棶","梿":"槤","榅":"榲","涂":"塗","漤":"灠","煴":"熅","玚":"瑒","珰":"璫","疭":"瘲","瘆":"瘮","瞆":"瞶","硁":"硜","祃":"禡","祢":"禰","秾":"穠","稆":"穭","筜":"簹","筼":"篔","纟":"糹","纻":"紵","绤":"綌","绬":"緓","绹":"綯","荙":"薘","蔂":"虆","蕰":"薀","螀":"螿","袆":"褘","袯":"襏","裈":"褌","觍":"覥","訚":"誾","讠":"訁","讬":"託","讱":"訒","诐":"詖","诪":"譸","贠":"貟","赑":"贔","赪":"赬","跶":"躂","轪":"軑","辀":"輈","辌":"輬","辒":"轀","酂":"酇","酦":"醱","钅":"釒","钑":"鈒","铇":"鉋"
,"铔":"錏","铚":"銍","铦":"銛","铻":"鋙","锠":"錩","锳":"鍈","锽":"鍠","镈":"鎛","镠":"鏐","镵":"鑱","闬":"閈","阇":"闍","阓":"闠","阘":"闒","阛":"闤","霡":"霢","颎":"熲","颒":"頮","颕":"頴","飏":"颺","飐":"颭","飖":"颻","饣":"飠","饤":"飣","饾":"餖","馂":"餕","馌":"饁","驲":"馹","骃":"駰","骉":"驫","骍":"騂","骔":"騌","骕":"驌","骙":"騤","骦":"驦","鱾":"魢","鲀":"魨","鲃":"䰾","鲄":"魺","鲉":"鮋","鲌":"鮊","鲓":"鮳","鲘":"鮜","鲪":"鮶","鲬":"鯒","鲯":"鯕","鲹":"鰺","鲾":"鰏","鳀":"鯷","鳂":"鰃","鳈":"鰁","鳉":"鱂","鳚":"䲁","鳠":"鱯","鳡":"鱤","鸤":"鳲","鸴":"鷽","鹀":"鵐","鹍":"鵾","鹓":"鵷","鹔":"鷫","鹝":"鷊","鹟":"鶲","鹠":"鶹","鹢":"鷁","鹮":"䴉","鹲":"鸏","鹴":"鸘","龁":"齕","龂":"齗","绣":"繡","襕":"襴","镢":"鐝","䦆":"钁","宁":"寧","㝉":"宁","苧":"薴","苎":"苧","硅":"矽","㐷":"傌","㐽":"偑","㑈":"倲","㑔":"㑯","㚯":"㜄","㛀":"媰","㛣":"㜏","㛤":"孋","㧰":"擽","㭏":"椲","㭤":"樢","㭴":"樫","㳔":"濧","㳕":"灡","㳡":"濄","㳽":"瀰","㻅":"璯","䀥":"䁻","䂵":"碽","䉤":"籔","䌻":"䋚"
,"䌿":"䋹","䥾":"䥱","伡":"俥","刾":"刺","啯":"嘓","垯":"墶","媭":"嬃","彟":"彠","彨":"彲","敩":"斆","桪":"樳","棱":"稜","椢":"槶","椫":"樿","椮":"槮","污":"汙","澛":"瀂","玙":"璵","瑸":"璸","硵":"磠","秘":"祕","篯":"籛","翙":"翽","荝":"萴","詟":"讋","颣":"纇","鬶":"鬹","鳤":"䲘","麯":"麴","潨":"潀","睾":"睪","钵":"缽","参":"參","叁":"叄","么":"麼","幺":"么","为":"為","产":"產","体":"體","㓰":"劃","划":"劃","国":"國","奖":"獎","并":"並","开":"開","术":"術","规":"規","视":"視","赃":"贓","酝":"醞","钻":"鑽","锻":"鍛","镇":"鎮","鸡":"雞","药":"藥","鉴":"鑑","瘘":"瘺","缐":"線","线":"線","裥":"襉","钚":"鈽","钸":"鈽","腼":"靦","䩄":"靦","垅":"壟","垄":"壟","硷":"鹼","碱":"鹼","鳁":"鰮","锏":"鐗","缰":"韁","棁":"梲","捝":"挩","姹":"奼","咤":"吒","颚":"顎","腭":"齶","鲶":"鯰","鲇":"鮎","䜧":"?","·":"‧"
};


var aTC2SC = {
};

    function needTrandotonalized() {
        if (bIsTranditional) {
            return false;
        }
        if (bIsSimplified) {
            return true;
        }
        for (var i = 0; i < aSkipURL.length; i++) {
            let sPattern = aSkipURL[i];
            let oRegexp = new RegExp(sPattern, 'i');
            if (oRegexp.test(sURL)) {
                return false;
            }
        }
        for (var i = 0; i < aSimplifiedURL.length; i++) {
            let sPattern = aSimplifiedURL[i];
            let oRegexp = new RegExp(sPattern, 'i');
            if (oRegexp.test(sURL)) {
                return true;
            }
        }
        return  false;
    }

    function transText(str) {
        if (!str) {
            return "";
        }
        if (bTranditionalized) {
            return traditionalized(str)
        }
        else {
            return simplized(str);
        }
    }

    function transBody(pNode) {
        let childs;
        if (pNode) {
            childs = pNode.childNodes;
        }
        else {
            childs = document.documentElement.childNodes;
        }
        if (childs) {
            for (var i = 0; i < childs.length; i++) {
                let child = childs.item(i);
                if (/BR|HR|META|SCRIPT|TEXTAREA/.test(child.tagName)) {
                    continue;
                }
                if (child.alt) {
                    let s = transText(child.alt);
                    if (child.alt != s) {
                        child.alt = s;
                    }
                }
                if (child.title) {
                    let s = transText(child.title);
                    if (child.title != s) {
                        child.title = s;
                    }
                }
                if (child.tagName == "INPUT" && child.value !== "" &&
                    child.type != "text" && child.type != "search" && child.type != "hidden") {
                    let s = transText(child.value);
                    if (child.value != s) {
                        child.value = s;
                    }
                }
                else if (child.nodeType == 3) {
                    let s = transText(child.data);
                    if (child.data != s) {
                        child.data = s;
                    }
                }
                else {
                    transBody(child);
                }
            }
        }
    }

    function traditionalized(s) {
        if (!oSC2TC_regexp) {
            let pattern = [];
            // Construct a RegEx from the dictionary
            for (var name in aSC2TC) {
                if (aSC2TC.hasOwnProperty(name)) {
                    // Escape characters
                    pattern.push(name.replace(/([[^$.|?*+(){}\\])/g, '\\$1'));
                }
            }
            // Concatenate keys, and create a Regular expression:
            let ps = pattern.join('|');
            oSC2TC_regexp = new RegExp(ps, 'g');
        }
        // Call String.replace with a regex, and function argument.
        return s.replace(oSC2TC_regexp, function(match) {
                    return aSC2TC[match];
        });
    }

    function simplized(s) {
        if (!oTC2SC_regexp) {
            let pattern = [];
            // Construct a RegEx from the dictionary
            for (var name in aTC2SC) {
                if (aTC2SC.hasOwnProperty(name)) {
                    // Escape characters
                    pattern.push(name.replace(/([[^$.|?*+(){}\\])/g, '\\$1'));
                }
            }
            // Concatenate keys, and create a Regular expression:
            let ps = pattern.join('|');
            oTC2SC_regexp = new RegExp(ps, 'g');
        }
        // Call String.replace with a regex, and function argument.
        return s.replace(oTC2SC_regexp, function(match) {
                    return aTC2SC[match];
        });
    }

    function switchTC() {
        bTranditionalized = true;
        transBody();
    }

    function switchSC() {
        bTranditionalized = false;
        transBody();
    }

    if (bAuto) {
        if (needTrandotonalized()) {
            bTranditionalized = true;

            setTimeout(function() {
                transBody();
                var MutationObserver = window.MutationObserver || window.WebKitMutationObserver || window.MozMutationObserver;
                var observer = new MutationObserver(function(records) {
                    records.map(function(record) {
                        if (record.addedNodes) {
                            [].forEach.call(record.addedNodes, function(item) {
                                transBody(item);
                            });
                        }
                    });
                });
                var option = {
                    'childList': true,
                    'subtree': true
                };
                observer.observe(document.body, option);
            }, 50);
        }
    }

    document.addEventListener("keydown", function(e) {
        if (e.keyCode == keySC && e.shiftKey) {
            bTranditionalized = false;
            if ("TEXTAREA" == document.activeElement.tagName) {
                document.activeElement.innerHTML = simplized(document.activeElement.innerHTML);
            }
            else if ("INPUT" == document.activeElement.tagName) {
                document.activeElement.value = simplized(document.activeElement.value);
            }
            else {
                transBody();
            }
        }
        else if (e.keyCode == keyTC && e.ctrlKey) {
            bTranditionalized = true;
            if ("TEXTAREA" == document.activeElement.tagName) {
                document.activeElement.innerHTML = traditionalized(document.activeElement.innerHTML);
            }
            else if ("INPUT" == document.activeElement.tagName) {
                document.activeElement.value = traditionalized(document.activeElement.value);
            }
            else {
                transBody();
            }
        }
    });

//作廢    GM_registerMenuCommand("切换为简体 shift+F7", switchSC);
    GM_registerMenuCommand("切換為繁體 ctrl+F8", switchTC);
})();
