// ==UserScript==
// @name         Метки городов ДКК new
// @version      0.021
// @description  ///+защита от мисскликов
// @author       Gusev
// @include     https://taximeter-admin.taxi.yandex-team.ru/dkk
// @include     https://taximeter-admin.taxi.yandex-team.ru/dkk/priority
// @include     https://taximeter-admin.taxi.yandex-team.ru/qc/history?exam=dkk*

// @namespace https://greasyfork.org/users/191824
// @downloadURL https://update.greasyfork.org/scripts/431496/%D0%9C%D0%B5%D1%82%D0%BA%D0%B8%20%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%BE%D0%B2%20%D0%94%D0%9A%D0%9A%20new.user.js
// @updateURL https://update.greasyfork.org/scripts/431496/%D0%9C%D0%B5%D1%82%D0%BA%D0%B8%20%D0%B3%D0%BE%D1%80%D0%BE%D0%B4%D0%BE%D0%B2%20%D0%94%D0%9A%D0%9A%20new.meta.js
// ==/UserScript==

console.log('Загружен скрипт "Метки городских уровней ДКК"')

const dkk = ['DkkCommonBlock', 'DkkCommonInvite', 'DkkCommonCityLevel', 'DkkTariffsBlock', 'DkkTariffsCommon', 'DkkRegular', 'DkkCommon', 'DkkCommonCountry']

const dkkPriority = ['DkkPriorityBlock', 'DkkPriorityInvite', 'DkkPriorityCityLevel', 'DkkPriorityTariffsBlock', 'DkkPriorityTariffsCommon', 'DkkPriorityRegular ', 'DkkPriorityNewDriver ', 'DkkPriorityCountry']

const city = {
    rusLevel1: ["Москва", "Московская область", "Санкт-Петербург", "Балашиха", "Сочи", "Подольск", "Химки", "Зеленоград", "Королёв", "Мытищи", "Люберцы", "Электросталь", "Красногорск", "Железнодорожный", "Коломна", "Одинцово", "Серпухов", "Щелково", "Домодедово", "Орехово-Зуево", "Обнинск", "Раменское", "Жуковский", "Пушкино", "Сергиев Посад", "Долгопрудный", "Ногинск", "Реутов", "Воскресенск", "Клин", "Дубна", "Ивантеевка", "Лобня", "Егорьевск", "Чехов", "Дмитров", "Ступино", "Павловский Посад", "Видное", "Наро-Фоминск", "Фрязино", "Климовск", "Дзержинский", "Солнечногорск", "Кашира", "Нахабино", "Краснознаменск", "Троицк", "Истра", "Шатура", "Можайск", "Луховицы", "Ликино-Дулёво", "Дедовск", "Апрелевка", "Красноармейск", "Озёры", "Зарайск", "Электрогорск", "Бронницы", "Старая Купавна", "Электроугли", "Аэропорт Сочи"],
    rusLevel2: ["Екатеринбург", "Ростов-на-Дону", "Самара", "Казань", "Новосибирск", "Пермь", "Челябинск", "Крым", "Волоколамск", "Голицыно", "Звенигород", "Калининец", "Кратово", "Кубинка", "Куровское", "Ликино-Дулёво", "Протвино", "Сколково", "Лосино-Петровский", "Пущино", "Омск", "Волгоград", "Воронеж", "Красноярск", "Нижний Новгород", "Уфа"],
    rusLevel3: ["Людиново", "Сертолово", "Сорочинск", "Избербаш", "Балтийск", "Ильский", "Сузун", "Краснодар", "Ульяновск", "Тюмень", "Тольятти", "Томск", "Оренбург", "Пенза", "Липецк", "Барнаул", "Набережные Челны", "Астрахань", "Саратов", "Ижевск", "Кемерово", "Киров", "Махачкала", "Иркутск", "Ярославль", "Рязань", "Владивосток", "Хабаровск", "Новокузнецк"],
    rusLevel4: ["Черепаново", "Черногорск", "Тамбов", "Чебоксары", "Балаково", "Тула", "Калининград", "Курск", "Севастополь", "Ставрополь", "Улан-Удэ", "Тверь", "Магнитогорск", "Брянск", "Иваново", "Белгород", "Сургут", "Владимир", "Нижний Тагил", "Архангельск", "Чита", "Калуга", "Симферополь", "Волжский", "Курган", "Череповец", "Орел", "Саранск", "Вологда", "Якутск", "Владикавказ", "Мурманск", "Грозный", "Стерлитамак", "Петрозаводск", "Кострома", "Нижневартовск", "Йошкар-Ола", "Таганрог", "Комсомольск-на-Амуре", "Сыктывкар", "Нальчик", "Нижнекамск", "Шахты", "Дзержинск", "Братск", "Орск", "Ангарск", "Энгельс", "Старый Оскол", "Великий Новгород", "Псков", "Бийск", "Прокопьевск", "Южно-Сахалинск", "Армавир", "Рыбинск", "Северодвинск", "Абакан", "Петропавловск-Камчатский", "Норильск", "Сызрань", "Волгодонск", "Уссурийск", "Каменск-Уральский", "Новочеркасск", "Златоуст", "Альметьевск", "Салават", "Миасс", "Находка", "Керчь", "Копейск", "Пятигорск", "Рубцовск", "Березники", "Майкоп", "Хасавюрт", "Ковров", "Кисловодск", "Нефтекамск", "Нефтеюганск", "Новомосковск", "Батайск", "Первоуральск", "Дербент", "Черкесск", "Невинномысск", "Димитровград", "Назрань", "Кызыл", "Октябрьский", "Каспийск", "Новый Уренгой", "Камышин", "Муром", "Новошахтинск", "Северск", "Ессентуки", "Ноябрьск", "Артем", "Евпатория", "Ачинск", "Елец", "Арзамас", "Элиста", "Бердск", "Новокуйбышевск", "Железногорск", "Ханты-Мансийск", "Воткинск", "Сарапул", "Междуреченск", "Ухта", "Серов", "Ленинск-Кузнецкий", "Саров", "Гатчина", "Соликамск", "Мичуринск", "Глазов", "Магадан", "Канск", "Новотроицк", "Бузулук", "Бугульма", "Железногорск (Красноярский край)", "Ейск", "Чайковский", "Усть-Илимск", "Юрга", "Новоуральск", "Азов", "Кропоткин", "Озерск (Челябинская область)", "Ялта", "Выборг", "Усолье-Сибирское", "Минеральные воды", "Анапа", "Геленджик", "Биробиджан", "Елабуга", "Кирово-Чепецк", "Белово", "Анжеро-Судженск", "Всеволожск", "Георгиевск", "Сосновый Бор", "Белорецк", "Ишимбай", "Буйнакск", "Асбест", "Вольск", "Алексин", "Горно-Алтайск", "Россошь", "Туапсе", "Полевской", "Белебей", "Тихорецк", "Мелеуз", "Михайловка", "Сальск", "Павлово", "Тихвин", "Нягань", "Нерюнгри", "Берёзовский", "Искитим", "Гусь-Хрустальный", "Лиски", "Свободный", "Тимашевск", "Североморск", "Снежинск", "Бугуруслан", "Балахна", "Лесной", "Салехард", "Кизляр", "Мегион", "Ливны", "Грязи", "Бирск", "Рузаевка", "Богданович", "Кимры", "Канаш", "Ярцево", "Надым", "Каневская", "Куйбышев", "Кольчугино", "Осинники", "Тулун", "Стрежевой", "Камень-на-Оби", "Белая Калитва", "Новозыбков", "Чебаркуль", "Ртищево", "Конаково", "Мариинск", "Большой Камень", "Усинск", "Курчатов", "Джанкой", "Красный Сулин", "Алексеевка", "Мценск", "Урюпинск", "Баксан", "Ахтубинск", "Южноуральск", "Абинск", "Учалы", "Кыштым", "Сокол (Вологодская область)", "Малгобек", "Горячий Ключ", "Луга", "Гай", "Коркино", "Динская", "Сухой Лог", "Тайшет", "Слободской", "Острогожск", "Муравленко", "Трёхгорный", "Вятские Поляны", "Великий Устюг", "1-е Вереитиново", "Касимов", "Староминская", "Алушта", "Костомукша", "Дивногорск", "Еманжелинск", "Топки", "Малоярославец", "Губкинский", "Карасук", "Киржач", "Камышлов", "Октябрьск", "Новопавловск", "Балобаново", "Янаул", "Медногорск", "Киреевск", "Ипатово", "Тайга", "Кувандык", "Давлеканово", "Фокино (Приморский край)", "Гурьевск", "Благовещенск", "Буинск", "Сысерть", "Игра", "Пикалёво", "Нижняя Тура", "Рыбное", "Абдулино", "Шексна", "Юрьев-Польский", "Яровое", "Карачев", "Инза", "Суворов", "Нижняя Салда", "Туринск", "Покров", "Кинель-Черкассы", "Мамадыш", "Ясный", "Абаза", "Анадырь", "Бокситогорск", "Белокуриха", "Заполярный", "Венев", "Цивильск", "Купино", "Новосергиевка (Оренбургская область)", "Руза", "Жуков", "Климово", "Гвардейск", "Гороховец", "Никель (Мурманская область)", "Кораблино", "Черноморское", "Таруса", "Суоярви", "Белозерск", "Устюжна", "Новоселицкое", "Ядрин", "Балтаси", "Пестрецы", "Медынь", "Магас", "Новобурейский", "Тоцкое", "Приобье", "Еткуль", "Дивеево", "Юхнов", "Оршанка", "Короча", "Турки", "Курумкан", "Доброе (Липецкая область)", "Любань", "Саган-Нур", "Хомутовка", "Коктебель", "Агрыз", "Адлер", "Адыгейск", "Азнакаево", "Алагир", "Алапаевск", "Алатырь", "Александров", "Апшеронск", "Асино", "Аскиз", "Аткарск", "Аша", "Балабаново", "Балашов", "Белогорск", "Белореченск", "Белые Берега", "Благовещенск Республика Башкортостан", "Бологое", "Большая Соснова", "Борисоглебск", "Боровичи", "Брюховецкая", "Будённовск", "Бутурлиновка", "Валуйки", "Великие Луки", "Верещагино", "Верхнебаканский", "Верхнеяркеево", "Верхняя Салда", "Волгореченск", "Волжск", "Володарск", "Волосово", "Воркута", "Выкса", "Вязники", "Вязьма", "Гаврилов-Ям", "Гагарин", "Губаха", "Гудермес", "Гусев", "Дагестанские огни", "Данков", "Десногорск", "Добрянка", "Дюртюли", "Дятьково", "Ершов", "Ефремов", "Жигулевск", "Завитинск", "Заволжье", "Залукокоаже", "Заречный", "Заречный Пензенская область", "Зеленогорск", "Зеленодольск", "Зеленокумск", "Зубова поляна", "Ивдель", "Калач", "Калачинск", "Камбарка", "Каменка", "Каменск-Шахтинский", "Камызяк", "Кантышево", "Карабудахкент", "Качканар", "Кизел", "Кизилюрт", "Кингисепп", "Кинешма", "Кириши", "Клинцы", "Когалым", "Козельск", "Козьмодемьянск", "Кондрово", "Кореновск", "Кормиловка", "Корсаков", "Котельнич", "Котлас", "Котово", "Красноуфимск", "Красный кут", "Крестцы", "Крымск", "Кудымкар", "Куеда", "Кузнецк", "Кумертау", "Кунгур", "Курганинск", "Курсавка", "Кущевская", "Лабинск", "Лакинск", "Лангепас", "Ленинградская", "Лениногорск", "Лесосибирск", "Лысково", "Лысогорская", "Лысьва", "Льгов", "Любинский", "Лянтор", "Малая Вишера", "Матвеев Курган", "Можга", "Моздок", "Мончегорск", "Мосальск", "Навашино", "Назарово", "Нарткала", "Нарьян-Мар", "Невьянск", "Нестеров", "Нефтегорск", "Нефтекумск", "Нижнеудинск", "Нововоронеж", "Нурлат", "Няндома", "Обоянь", "Окуловка", "Оленегорск", "Оса", "Отрадный", "Оха", "Павловск Алтайский край", "Палласовка", "Партизанск", "Петергоф", "Петушки", "Печора", "Подпорожье", "Покровское", "Похвистнево", "Почел", "Приморско-Ахтарск", "Приютово", "Прохладный", "Пугачев", "Пыть-Ях", "Радужный", "Райчихинск", "Рассказово", "Ревда", "Реж", "Ржев", "Родники", "Рославль", "Ростов", "Саракташ", "Сасово", "Сатка", "Сафоново", "Светлоград", "Северская", "Сегежа", "Семибратово", "Семикаракорск", "Сердобск", "Серышево", "Сибай", "Славгород", "Славянск-на-Кубани", "Советский", "Солнечнодольск", "Соль-Илецк", "Спасск-Дальний", "Степное", "Суджа", "Суздаль", "Сурхахи", "Тара", "Тарко-Сале", "Тбилисская", "Тейково", "Темрюк", "Терек", "Тогучин", "Толбазы", "Томилино", "Торжок", "Тосно", "Троицк (Челябинская область)", "Трубчевск", "Туймазы", "Тутаев", "Тында", "Тырныауз", "Углич", "Ужур", "Урай", "Урус-Мартан", "Хороль", "Чамзинка", "Чегем", "Черемхово", "Черниговка", "Чернушка", "Черняховск", "Чечен-Аул", "Чистополь", "Чкаловск", "Чусовой", "Шадринск", "Шарыпово", "Шарья", "Шумерля", "Шуя", "Юго-Камский", "Югорск", "Юрюзань", "Ялуторовск", "Арск", "Елизово", "Бирюч", "Выселки", "Калач на Дону", "Ирбит", "Строитель", "Апатиты", "Белая Глина", "Гулькевичи", "Шали", "Старая Русса", "Барабинск", "Суворовская", "Покачи", "Константиновск", "Иглино", "Сельцо", "Маркс", "Агидель", "Афипский", "Донецк Ростовская область", "Нерехта", "Гуково", "Городец", "Нестеровская", "Нелидово", "Ишим", "Буй", "Чапаевск", "Заводоуковск", "Башмаково", "Вичуга", "Долгодеревенское", "Елань", "Минусинск", "Николаевск-на-Амуре", "Павловская", "Таштагол", "Товарково", "Холмск", "Новороссийск", "Смоленск", "Тобольск"],
    kaz: ["Актау", "Актобе", "Алматы", "Астана", "Атырау", "Караганда", "Кокшетау", "Костанай", "Кызылорда", "Павлодар", "Петропавловск", "Семей", "Темиртау", "Тараз", "Туркестан", "Уральск", "Усть-Каменогорск", "Экибастуз", "Жезказган", "Талдыкорган", "Шымкент"],
    kgz: ["Бишкек", "Ош"],
    geo: ["Кутаиси", "Рустави", "Тбилиси", "Батуми"],
    arm: ["Араратская область", "Ванадзор", "Горис", "Гюмри", "Ереван", "Капан", "Котайкская область", "Армавирская область"],
    ukr: ["Днепр", "Запорожье", "Киев", "Кривой Рог", "Львов", "Николаев", "Одесса", "Харьков"],
    lat: ["Рига"],
    mda: ["Кишинёв"],
    blrAllcity: ["Минск", "Гомель", "Гродно", "Жодино", "Речица", "Борисов", "Могилев", "Витебск", "Бобруйск", "Брест", "Барановичи", "Орша", "Пинск ", "Вилейка", "Молодечно", "Полоцк", "Волковыск", "Мозырь", "Лида"],
    blrLevel3: ["Пинск ", "Вилейка", "Молодечно", "Полоцк", "Волковыск", "Мозырь"],
    az: ["Баку"],
    uzb: ["Ташкент", "Фергана", "Наманган"],
    ltu: ["Вильнюс"],
    est: ["Таллин", "Тарту"],
    srb: ["Белград", "Нови-Сад"],
    fin: ["Хельсинки"],
    rou: ["Бухарест"],
    smallRus: ["Сарапул", "Калач", "Горячий Ключ", "Ильский", "Зеленодольск", "Балтийск", "Новотроицк", "Бугульма", "Лениногорск", "Ершов", "Ирбит", "Рославль", "Сафоново", "Кинешма", "Шуя", "Темрюк", "Кудымкар", "Дюртюли", "Буйнакск", "Рассказово", "Вышний Волочек", "Суровикино", "Борисоглебск", "Лукоянов", "Володарск", "Балашов", "Глазов", "Долгодеревенское", "Канаш", "Ейск", "Лысьва", "Рузаевка", "Выкса", "Белая Калитва", "Сасово", "Солнечный", "Вязники", "Павловская", "Богородск", "Чернушка", "Туймазы", "Мирный Якутская область", "Губкинский", "Углич", "Михайловка", "Черняховск", "Соль-Илецк", "Верещагино", "Красный Кут", "Кольчугино", "Верхнебаканский", "Куйбышев", "Кузнецк", "Алапаевск", "Алексин", "Новозыбков", "Нарткала", "Курганинск", "Старая Русса", "Мценск", "Дагестанские Огни", "Агрыз", "Холмск", "Нововоронеж", "Пионерский", "Исилькуль", "Медногорск", "Покровское", "Зеленокумск", "Нефтекумск", "Ефремов", "Можга", "Нягань", "Новоалтайск", "Алейск", "Алексеевка", "Кирово-Чепецк", "Абинск", "Афипский", "Заполярный", "Заволжье", "Беслан", "Троицк_Члб", "Междуреченск", "Ухта", "Заинск", "Серов", "Ахтубинск", "Юрьев-Польский", "Апатиты", "Горнозаводск", "Арсеньев", "Отрадный", "Лесной", "Ярцево", "Десногорск", "Аша", "Слободской", "Лабинск", "Апшеронск", "Новосокольники", "Свободный", "Гусь-Хрустальный", "Усть-Илимск", "Ленинск-Кузнецкий", "Осинники", "Староминская", "Татарск", "Печора", "Похвистнево", "Хвалынск", "Полевской", "Стрежевой", "Сатка", "Коркино", "Бутурлиновка", "Шелехов", "Ленинградская", "Мостовской", "Октябрьская", "Городец", "Рыбное", "Октябрьск", "Красноармейск Саратовская область", "Корсаков", "Когалым", "Шумерля", "Камень-на-Оби", "Белогорск", "Дятьково", "Сельцо", "Александров", "Тейково", "Новопокровская", "Шадринск", "Мончегорск", "Кандалакша", "Никель Мурманская область", "Саров", "Карасук", "Сальск", "Карпинск", "Торжок", "Селижарово", "Аргун", "Цивильск", "Суворовская", "Заринск", "Яровое", "Камызяк", "Шебекино", "Белые Берега", "Покров", "Павловск", "Хомутово", "Советск", "Учкекен", "Архыз", "Джубга", "Дивногорск", "Навашино", "Болотное", "Фокино (Приморский край)", "Раевский", "Кизляр", "Волжск", "Зубова Поляна", "Тацинская", "Новомихайловский", "Долинск", "Заречный", "Нижняя Салда", "Ипатово", "Конаково", "Мегион", "Пыть-Ях", "Северобайкальск", "Чебаркуль", "Южноуральск", "Шали", "Гудермес", "Переславль-Залесский", "Гаврилов-Ям", "Благовещенск Республика Башкортостан", "Лысогорская", "Донецк", "Ряжск", "Курсавка", "Славгород", "Иннополис", "Тальменка", "Чекалин", "Павловск Алтайский край", "Верхоянск", "Курильск", "Змеиногорск", "Артемовск", "Плес", "Тында", "Островной", "Шимановск", "Райчихинск", "Завитинск", "Горбатов", "Кедровый", "Серышево", "Сковородино", "Сольвычегодск", "Приморск", "Калино", "Измайлово", "Тарбагатай", "Многовершинный", "Белая Гора", "Синегорье", "Котлас", "Сеймчан", "Коряжма", "Вельск", "Няндома", "Алексеевск", "Чокурдах", "Благоево", "Кировский", "Гари", "Уптар", "Синдор", "Орша", "Рабочий поселок имени В.И.Ленина", "Агириш", "Углеродовский", "Олымский", "Центральный", "Лёвинцы", "Провидения", "Зеленоборск", "Пушкино", "Первое Мая", "Чупа", "Знаменск", "Харабали", "Васильевский Мох", "Петровский", "Новописцово", "Зеленый Город", "Волго-Каспийский", "Бурмакино", "Раздолинск", "Золотаревка", "Всеволодо-Вильва", "Валуйки", "Амазар", "Новый Оскол", "Холбон", "Борисовка", "Хохлово", "Ровеньки", "им. Степана Разина", "Малошуйка", "Пригорск", "Куженкино", "Угловка", "Горный", "Бирюч", "Кулотино", "Кожва", "Уральский", "Колобово", "Вейделевка", "Нижний Баскунчак", "Любытино", "Богородское", "Куйбышевский Затон", "Шумский", "Карачев", "Смолино", "Почеп", "Северо-Курильск", "Трубчевск", "Малиновский", "Верхний Дженгутай", "Хелюля", "Палкино", "Усть-Мая", "Умет", "Черский", "Вышков", "Комсомольский", "Усвяты", "Перелешинский", "Иванино", "Плюсса", "Белушья Губа", "Лесная Поляна", "Чучково", "Бира", "Ксеньевка", "Железнодорожный", "Квиток", "Светлополянск", "Собинка", "Лух", "Лакинск", "Кысыл-Сыр", "Сосновый Бор", "Петушки", "Гусевский", "Куминский", "Пятовский", "Кунья", "Яковлево", "Силикатный", "Балашейка", "Юганец", "Зырянка", "Каменский", "Поселок Курорт-Дарасун", "Войвож", "Красный Гуляй", "Суслонгер", "Котово", "Большая Речка", "Сазоново", "Новоорловск", "Теплая Гора", "Муезерский", "Баляга", "Елань", "Ильинское-Хованское", "Лальск", "Наушки", "Мама", "Рогнедино", "Юрино", "Высокогорный", "Ишня", "Орджоникидзевский", "Кондинское", "Зеленый Бор", "Усть-Омчуг", "Тим", "Палана", "Шаблыкино", "Старая Полтавка", "Сокол", "Великий Устюг", "Шексна", "Кологрив", "Дровяная", "Аксеново-Зиловское", "Депутатский", "Вяртсиля", "Малиновое Озеро", "Осинки", "Сандово", "Сапожок", "Приводино", "Сулея", "Лососина", "Арбаж", "Жарковский", "Октябрьское", "Елатьма", "Староуткинск", "Поворино", "Рудногорск", "Лебяжье", "ВершинаТёи", "Богучар", "Кантемировка", "Сусанино", "Серебряный Бор", "Новый Уоян", "Махнево", "Кошурниково", "Итатский", "Пелым", "Атиг", "Ближне-Песочное", "Новосиль", "Холм-Жирковский", "Красный Октябрь", "Обозерский", "Эгвекинот", "Краснознаменск", "Белый", "Широковский", "Советское", "Новоржев", "Павловский", "Стрижи", "Борзя", "Малоархангельск", "Ягодное", "Варнавино", "Мезень", "Черемисиново", "Светлый", "Печенга", "Пестяки", "Нижний Кисляй", "Новый Карачай", "Голынки", "Локня", "Охотск", "Правокубанский", "Уруша", "Ольховатка", "Касторное", "Нема", "Приамурский", "Могзон", "Чермоз", "Старотимошкино", "Радица-Крыловка", "Холм", "Шипицыно", "Бежаницы", "Горноуральский", "Новогуровский", "Большегривское", "Гдов", "Эрпели", "Конышевка", "Новоильинский", "Теткино", "Горбатовка", "Вичуга", "Кадый", "Афанасьево", "Родники", "Пинеровка", "Мортка", "Среднеколымск", "Хомутовка", "Талинка", "Пряжа", "Беркакит", "Пашия", "Елань-Коленовский", "Монастырщина", "Языково", "Волово", "Мухен", "Батагай", "Пено", "Краногородск", "Палатка", "Новопавловка", "Усолье-Сибирское", "Черемхово", "Тулун", "Усть-Кут", "Теплоозерск", "Нижнеудинск", "Тайшет", "Козлово", "Дружинино", "Рудничный", "Вихоревка", "Шимск", "Чунский", "Александро-Невский", "Ермишь", "Сонково", "Новый Сулак", "Пижанка", "Сява", "Цильна", "Подосиновец", "Сангар", "Култук", "Кесова Гора", "Омсукчан", "Угольные Копи", "Шумячи", "Опарино", "Дорогино", "Томари", "Хиславичи", "Солнцево", "Хотынец", "Новочернореченский", "Мартюш", "Новая Чара", "Подтесово", "Балаганск", "Мещовск", "Калевала", "Лоухи", "Ладушкин", "Лукино", "Тыреть1-я", "Килемары", "Майский", "Терек", "Долгое", "Стрелица", "Песковка", "Залукокоаже", "Пижма", "Мстёра", "Пустошка", "Свеча", "Радищево", "Дальнее Константиново", "Кашхатау", "Славск", "Гвардейск", "Витим", "Духовщина", "Певек", "Верхошижемье", "Санчурск", "Нестеров", "Каз", "Рамешки", "Уни", "Нижний Бестях", "Большая Ирба", "Вишневогорск", "Товарково", "Шиморское", "Красный", "Тужа", "Правдинск", "Пятницкое", "Краснокаменск", "Чернышевский", "Милославское", "Кадошкино", "Юхнов", "Чистые Боры", "Ферзиково", "Урдома", "Бурея", "Умёт", "Смидович", "Мосальск", "Ржакса", "Верхняя Максаковка", "Усть-Джегута", "Карачаевск", "Зеленчукская", "Эркен-Шахар", "Теберда", "Талакан", "Глушково", "Посевная", "Спас-Деменск", "Нижнеангарск", "Белово", "Березовский", "Мыски", "Мариинск", "Медвенка", "Пиндуши", "Тайга", "Таштагол", "Гурьевск", "Демянск", "Новобирюсинский", "Краснооктябрьский", "Мундыбаш", "Нагорск", "Краснобродский", "Жирекен", "Кропачево", "Ухолово", "Ровное", "Поназырево", "Кикнур", "Уркарах", "Камское Устье", "Старь", "Игарка", "Бытошь", "Идрица", "Бабушкин", "Вятские Поляны", "Котельнич", "Пронск", "Калашниково", "Ерофей Павлович", "Умба", "Кадников"]
    }

const cityNotVisiblePhotos = ['Москва', 'Санкт-Петербург', ...city.kaz, ...city.kgz, ...city.geo, ...city.arm, ...city.ukr, ...city.lat, ...city.mda, ...city.blrAllcity, ...city.uzb, ...city.az, ...city.ltu, ...city.est, ...city.srb, ...city.fin, ...city.rou]

const config = {
    "1 уровень": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.rusLevel1],
    "2 уровень": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.rusLevel2],
    "3 уровень": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.rusLevel3],
    "4 уровень": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.rusLevel4],
    "Малые города бренд ПУСКАЕМ": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.smallRus],
    "Казахстан": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.kaz],
    "Киргизия": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.kgz],
    "Грузия": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.geo],
    "Армения": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.arm],
    "Украина": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.ukr],
    "Латвия": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.lat],
    "Молдавия": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.mda],
    "Беларусь": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.blrAllcity],
    "Азербайджан": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.az],
    "Узбекистан": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.uzb],
    "Литва": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.ltu],
    "Эстония": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.est],
    "Сербия": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.srb],
    "Финляндия": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.fin],
    "Румыния": [{ rgb: 'black', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.rou],
}

const configSpecial = {
  //спец метки
  "смотрим наличие ШАШЕК": [{ rgb: '#6aaa4e', permissions: [...dkk, ...dkkPriority, 'history'] }, "Москва"],
  "СМОТРИМ бренд": [{
    rgb: 'red',
    permissions: ['DkkCommonBlock', 'DkkCommonInvite', 'DkkPriorityBlock', 'DkkPriorityInvite', 'history']
  }, ...city.blrLevel3],//РБ 3 уровень
  "НЕ реагируем на бренд": [{
    rgb: 'red',
    permissions: ['DkkCommonBlock', 'DkkCommonInvite', 'DkkPriorityBlock', 'DkkPriorityInvite', 'history']
  }, "Лида"],//лида
  "БЛОК ITaxi,Teleport и Uklon": [{
    rgb: 'red',
    permissions: ['DkkCommonBlock', 'DkkCommonInvite', 'DkkPriorityBlock', 'DkkPriorityInvite', 'history']
  }, ...city.mda], //4 уровень? кишинев
  "Maxim, Bolt/Taxify - замечание": [{
    rgb: 'red',
    permissions: ['DkkCommonBlock', 'DkkCommonInvite', 'DkkPriorityBlock', 'DkkPriorityInvite', 'history']
  }, ...city.geo], //4 уроень
  "Нет БЛОКА и ЧС": [{ rgb: 'red', permissions: [...dkk, ...dkkPriority, 'history'] }, ...city.ukr], //украина
  // "ШЫМКЕНТ Г/Н Иностранный БЛОК": [{ rgb: 'red', permissions: ['DkkCommonBlock', 'DkkCommonInvite', 'DkkPriorityBlock', 'DkkPriorityInvite', 'history'] }, "Шымкент"], //шымкент
  "x-car.taxi - сторонний бренд": [{
    rgb: 'red',
    permissions: ['DkkCommonBlock', 'DkkCommonInvite', 'DkkPriorityBlock', 'DkkPriorityInvite', 'history']
  }, "Усть-Лабинск"], //Усть-Лабинск
  "Смотрим ремни и замки!": [{
    rgb: 'red',
    permissions: [...dkk, ...dkkPriority, 'history']
  }, ...city.rusLevel1, ...city.rusLevel2, ...city.rusLevel3, ...city.rusLevel4, ...city.smallRus], //весь рф
  "Нет блока за ГРЯЗЬ, ПОВРЕЖДЕНИЯ!": [{
    rgb: '#f1c32e',
    permissions: [...dkk.filter(i => i !== 'DkkTariffsBlock' && i !== 'DkkTariffsCommon'), ...dkkPriority.filter(i => i !== 'DkkPriorityTariffsBlock' && i !== 'DkkPriorityTariffsCommon'), 'history']
  }, "Екатеринбург", "Ростов-на-Дону", "Самара", "Казань", "Новосибирск", "Пермь", "Челябинск", "Уфа", "Омск", "Волгоград", "Воронеж", "Красноярск", "Нижний Новгород", "Краснодар", "Ульяновск", "Тольятти"], //2 урвоень

  //Повышенные
  "смотрим наличие ШАШЕК": [{ rgb: '#6aaa4e', permissions: [...dkk, ...dkkPriority, 'history'] }, "Москва"], //МСК
  "Наклон спинки - замечание": [{
    rgb: '#ff8e36',
    permissions: ['DkkTariffsBlock', 'DkkTariffsCommon', 'DkkPriorityTariffsBlock', 'DkkPriorityTariffsCommon', 'history']
  }, ...city.kaz], //казахстан
  "ремни/замки-отрыв тарифа": [{
    rgb: '#ff8e36',
    permissions: ['DkkTariffsBlock', 'DkkTariffsCommon', 'DkkPriorityTariffsBlock', 'DkkPriorityTariffsCommon', 'history']
  }, ...city.kaz], //казахстан
  "Грязные сидения блок": [{
    rgb: 'red',
    permissions: ['DkkTariffsBlock', 'DkkTariffsCommon', 'DkkPriorityTariffsBlock', 'DkkPriorityTariffsCommon', 'history']
  }, "Москва", "Санкт-Петербург", "Сочи", "Екатеринбург"], //мск, спб сочи екб
}

const brandsCargo = ["BAW FENIX", "BAW TONIK", "CHANGAN 1027DBA4", "CHANGAN SC1027DAC5", "CHANGAN SC1030FW9", "CHEVROLET EXPRESS", "CHEVROLET LABO", "CHEVROLET LANOS", "CITROEN BERLINGO CARGO", "CITROEN BERLINGO", "CITROEN C4 PICASSO", "CITROEN JUMPER", "CITROEN JUMPY", "DAEWOO DAMAS", "DAEWOO LABO", "DODGE SPRINTER", "FAW 10XX", "FAW 3802", "FAW BESTURN B50", "FIAT DOBLO CARGO", "FIAT DOBLO", "FIAT DUCATO", "FORD GALAXY", "FORD TOURNEO CONNECT", "FORD TOURNEO", "FORD TRANSIT", "FORD TRANSIT CONNECT", "FORD TRANSIT CUSTOM", "FOTON AUMAN", "FOTON AUMARK", "FOTON BJ5026XXYD1", "FOTON FORLAND BJ", "FOTON FORLAND", "FOTON OLLIN", "FOTON OTHER CARGO", "FOTON TUNLAND", "GAC GONOW", "HINO 300", "HINO 500", "HINO 700", "HYUNDAI GRAND STAREX", "HYUNDAI H", "HYUNDAI H-1", "HYUNDAI H100", "HYUNDAI H35", "HYUNDAI HD 120", "HYUNDAI HD 35", "HYUNDAI HD 65", "HYUNDAI HD 72", "HYUNDAI HD 78", "HYUNDAI HD", "HYUNDAI PORTER", "HYUNDAI STAREX", "ISUZU FORWARD", "ISUZU D-MAX", "ISUZU ELF", "ISUZU FORWARD", "ISUZU NQR", "IVECO DAILY", "IVECO EUROCARGO", "IVECO OTHER CARGO", "JMC A0107", "JMC BAODIAN", "KIA BONGO", "LADA (ВАЗ) 2329", "LADA (ВАЗ) 4X4 ФУРГОН", "LADA (ВАЗ) GRANTA ФУРГОН", "LADA (ВАЗ) LARGUS", "LADA (ВАЗ) LARGUS ФУРГОН", "LADA (ВАЗ) LARGUS ФУРГОН*", "LDV MAXUS", "MAN TGA", "MAN TGL", "MAN TGM", "MAZDA 818", "MAZDA BONGO", "MAZDA TITAN", "MERCEDES-BENZ ACTROS", "MERCEDES-BENZ ATEGO", "MERCEDES-BENZ CITAN CARGO", "MERCEDES-BENZ SPRINTER", "MERCEDES-BENZ SPRINTER CLASSIC", "MERCEDES-BENZ VITO", "MITSUBISHI FUSO CANTER", "MITSUBISHI FUSO", "NISSAN ATLAS", "NISSAN CABSTAR", "NISSAN DIESEL", "NISSAN INTERSTAR", "NISSAN VANETTE", "OPEL COMBO", "OPEL COMBO CARGO", "OPEL COMBO", "OPEL VIVARO", "PEUGEOT BIPPER", "PEUGEOT BOXER", "PEUGEOT EXPERT", "PEUGEOT PARTNER", "PEUGEOT PARTNER CARGO", "PEUGEOT PARTNER", "RENAULT DOKKER", "RENAULT DOKKER VAN", "RENAULT KANGOO EXPRESS", "RENAULT KANGOO", "RENAULT MASTER", "RENAULT MIDLUM", "RENAULT TRAFIC", "TATA 613", "TOYOTA DYNA", "TOYOTA HIACE", "TOYOTA PROACE CITY CARGO", "TOYOTA TOYOACE", "VOLKSWAGEN CADDY KASTEN", "VOLKSWAGEN CADDY", "VOLKSWAGEN CARAVELLE", "VOLKSWAGEN CRAFTER", "VOLKSWAGEN MULTIVAN", "VOLKSWAGEN TRANSPORTER", "ВИС 2347", "ГАЗ 2705", "ГАЗ 2752", "ГАЗ 2834", "ГАЗ 3302", "ГАЗ 3302 ФЕРМЕР", "ГАЗ 3302", "ГАЗ ВАЛДАЙ", "ГАЗ ГАЗЕЛЬ", "ГАЗ ГАЗЕЛЬ NEXT", "ГАЗ ГАЗЕЛЬ", "ГАЗ ГАЗОН NEXT", "ГАЗ ГАЗОН", "ЗИЛ MM34502", "ТАГАЗ LC100", "УАЗ PATRIOT", "УАЗ ПРОФИ"]

const cargo = document.querySelector('input[value="cargo_brand"]')

cargo === null ? console.log('lol') : cargo.closest('a.js-tag').addEventListener('click', () => $('#photo-Trunk').css({ display: cargo?.checked ? 'block' : 'none' }))

function findLabelsFromCity(config, city) {
    const result = []
    for (let label in config) {
        if (config[label].includes(city)) {
            result.push({ label, ...config[label][0] })
        };
    };
    return result
}

function createNotification(label, style) {
    const span = document.createElement('span');
    span.classList.add('level_notation')
    span.style = `display: block; opacity: 1; width: fit-content; width: -moz-fit-content; padding: 2px 4px; margin-left: -4px; background: ${style.rgb}; border: 1px solid rgb(128,128,128);`
    span.textContent = label
    return span
}

function levelMark(labels, query = '') {
    const parentElement = document.querySelector('.check-thumb-number')
    labels.filter(el => el.permissions.includes(query)).map(({ label, rgb }) => createNotification(label, { rgb })).forEach(el => parentElement.prepend(el))
};

function defineLevel(e, params) {
    $('.level_notation').remove();
    let city = params.city;

    if (!document.getElementById('category')) {
        return levelMark(findLabelsFromCity({ ...configSpecial, ...config }, city), 'history')
    }

    const tree = document.getElementById('category').selectedOptions[0].value

    const btnOK = document.getElementById('btn-ok')
    const brand = params.car.match(/^(.+?)\s\[/)

    $('#photo-Trunk').css({
        display: cargo?.checked ? 'block' : 'none'
    })

    if (cityNotVisiblePhotos.includes(city)) {
        $('#photo-Trunk').css({ display: 'block' })
    }
    if (tree === 'DkkTariffsBlock' ||
        tree === 'DkkTariffsCommon' ||
        tree === 'DkkPriorityTariffsBlock' ||
        tree === 'DkkPriorityTariffsCommon') {
        $('#photo-Trunk').css({ display: 'block' })
    }

    if (brandsCargo.includes(brand[1].toUpperCase())) {
        $('#photo-Trunk').css({ display: 'block' })
    }

    //защита
    setTimeout(() => {
        btnOK.disabled = true
    }, 0)
    setTimeout(() => {
        btnOK.disabled = false
    }, 2500)

    return levelMark(findLabelsFromCity({ ...configSpecial, ...config }, city), tree)
};

$(document).bind('item_info', defineLevel);