// ==UserScript==
// @name         AIIT双周报批阅小助手
// @namespace    http://tampermonkey.net/
// @version      1.1
// @description  AIIT双周报批阅小助手!
// @author       Chipmuck
// @match       *://ims.aiit.edu.cn/process-control/weekly/audit-look.do?*
// @icon         data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAYAAABzenr0AAAAAXNSR0IArs4c6QAAB4xJREFUWEfFl3tQVNcdx7/n7oOFhV0e8loWRB4KqMCuYFmsARuIQ03sWBvHEq2manXiaKLgo60ZJSEdVBJMOzHamhJrO2o7TJqOZuzoFF9AGgSxKCqCu8hz5b3sg33d09kru4K7q2Q6mZ6/7j3n+/udz/md3zn3dwn+z414m7/zCG8lj9pbZDtw97tk9AjQ8RFzVxSisLHmAZlN31llZdkP4orR8W1ANBVQMoRZAyJcwRcGyVm7iVKr/pXoHbbLk/24ATz6GPNEktQmoWQ2zyGkrKXF+LhW4hcZ92pgzOJcMMxqMDSLCgjgQwAWAEtB7ADMtMNqGDjXV/8nIpTOyfAJiOMRnu+CCT/dxse1vVFbBzKfD1DBnAxZsDrb2m9JcApFQUE1PlJJPA1geiDh+VEekjxFg1B0QceKiZEGmfr6Ry1jeqlTxw8WNxs1DYO2kdtvTd5W9whUMKORq3aqLZohq7VPlyGWRVbzfXyW0CDev6g/+cF0t4GMssCo3aLTdAj5Yf4NwqhA02hNrdnU3/CXmJ32SqcfN4DOCl5txMq3BSCMP1/L6sAwCykPQ1TGD57u5C6dBW3MkD3BKrDe5YWIkvvPnbtiGWn5W8wO9hOvAB0VzLHIZdsyBUZhPFjKhZCKSBMN5aV/awAAhOIh0drj2HBea/+XVaMWg/rdmHds//QK0PdZ5N5wReEegAQ6Rf8LgMMHoVRNtOys4duX1dDVK4I3Y9QrgOXammMCccRm12olwTcwM5WAL0gEtWsB1sAOXndFgwmYexnC0GQQEg5qbYJJY2KNXSq3aFnpLdI9LmcyP57h9RTQOweEdFz3gBAm5rXiS90h0WlR6enpsFqtaGt7wB4/vpYBTHp2oNrf6YQD8AnLdbyrVHsN8+dniFNSUrhhtfqhJdBfp92/IzKai0S/3ULG2Xyi/PCqxwjQxuINAE7kvPMNjhw5olEoFLEO4bFjx5rLysrmJyXF3rxw4VcKdqDatQgnQH7+YZw8ebJPJpNFOAZ7e3u/WbFiRaxer8fclBjd6aNpCbDSVqbPPkaU5RleAIrUAIldfbATZ86c4TRtbW01eXl5i2aEhra9vqow4at/nOqu/mJplIuA8Me2728xrlmzy5qVlSV39peUlNRVVlaq8l8p4G6+15fqA/Ny5OnMYzvI3MOu0+d6oI27XwbYSw5x9tYa1NbWcr4cK1GpVAudjt/fm3njjZ8kuFbg6D/06cOumPgfsYWFhTFO3aZNm5ouXrzoypXr55f3ycLFEcRAH5FhupEoDl3ktsWV6Q1FPwYhVY73A3+4qbEFZ8WWlpZywxqNpi43N1dVkBdz+ZOyRdx+P9sWvFxl2vJWke/mzU/y12w2t23cuDHh2rVrlk1rk77+5duKl7gBik6my/YlUZZvmwpws2gdKPnc6fiueqT7p+/VR8XGxkKr1dJ1q8Lrf7E2eSF4oi7iE95BeP5WajfyqemREtTu57A7+LtbI6e/6AqUy+WglMJu6Wnesz2dLlkkS50MzHTaQJTl3OInbcGubZg3ez0EfOUkcS/stg6w4+PURiKJIFQLfuB8AEFPNXSMWkdvwjrMgAjMRCSNAxmb9WScbYbZMMiahsOI3TyTEp4BPMEg81CX7AGgaB+SEpbBV5TlHmDxHU1t91zTmLHJMcbwGL85ecrZnrbiSZ+1BRgIAmikm8ZmvoHmtgxPEShBwsw8BIizpxoRk6Z2yPePK0tc3XGLc7D+r1u9z8+NjF4BDDluIvN4J1raoz0A7ElD1IwrCJvh+oROGPfZxkOk7836mSODfB19WRvevP/D0oI5LyAA0KMFED5Fpxu7j/aOJqL8cPWUHOAStL2EIs51kibZSb8+u+n343fO1XEnYFfT8b6A8CDuwnl+e9wA2LiCxNU6e4GBoWyiLK9zB2jaTZGWrAMgeWohvgoEpAGM9Gj+7ut+wRL7+rP73EM7YfCg+ta9xCVpEwXL8GXA9PTYsqwWt1vDSdpB94uIi8DNXR8hOuLnCAme2AafKwfn7pZur/vtLF+JWDqk1nYdzSs27Gs/5RZ+w6Bu5NQbv2ndcqHMdWkBzwA8HhxDr3Y/ST9c4VygW0FCm/dSpCT2gGFkAHn478+atOf3VaqWlb5Z970NBaoTy9+9Ko0IZlNXLo6eszQj3uHo7zs+rWs8W61cd/rXrfE5aY5jOtGeAbjXDpJcOmVOj1UxVb9PEeu81gNq/1PVJLx06Gy4cVCnD02UDwxr+iQmnUFOWRrimGnRltduLyleNUso9hFPzYlJAI96gKGR7xPF4ZrJGs8A9UX5kIedQERYDEDuAZEei9AXpSDQ80QyPNoOddefyYLyA8/aeP0xoY3FnyMi9CVEhIlAArsBvykfoBdPzq0+G0MjvejoFhJlucyTjVcALikbilPhI7iF+AQNRHKuNph2M/c+wCN1IgzGZURx+Ctvds8F4CCqD/Ah1Z+Ar3gpZs5Tw1fiXm5N8U6H0N8pRPd9CthSieKI5nnQLwRwGtPGncsBZguEvgUQirz71A87PnGvEkX5+elEa9oAk53RxqIU2EmYW0Jllk/57/vOAKbjeLqa/wJZawROtv9lkAAAAABJRU5ErkJggg==
// @require  https://cdn.bootcdn.net/ajax/libs/jquery/1.8.3/jquery.js
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/432073/AIIT%E5%8F%8C%E5%91%A8%E6%8A%A5%E6%89%B9%E9%98%85%E5%B0%8F%E5%8A%A9%E6%89%8B.user.js
// @updateURL https://update.greasyfork.org/scripts/432073/AIIT%E5%8F%8C%E5%91%A8%E6%8A%A5%E6%89%B9%E9%98%85%E5%B0%8F%E5%8A%A9%E6%89%8B.meta.js
// ==/UserScript==

(function () {
    'use strict';

    let panel = `<div id="assistant" style="display: flex;flex-direction: column;width: 120px;margin:20px 0px 0px 20px;">
			<div class="logo" style="display: flex; justify-content: center;">
				<svg style="width: 50px;height: 50px;" t="1630999445654" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1686" width="200" height="200"><path d="M165.44 79.573333c52.586667-57.813333 133.973333 5.546667 171.093333 51.733334-3.84 1.92-11.413333 5.653333-15.253333 7.573333-35.84-25.92-74.133333-72.533333-123.093333-58.346667-54.506667 45.76-35.413333 125.973333-36.266667 188.373334-2.346667 4.053333-6.933333 12.266667-9.28 16.426666-26.453333-63.36-19.733333-144.853333 12.8-205.76zM660.053333 123.306667c65.173333-25.706667 139.733333-93.653333 210.24-44.48 46.08 61.013333 50.346667 156.906667 15.146667 223.786666l-10.24-19.626666c7.786667-68.266667 29.653333-166.293333-45.866667-205.013334-52.906667 4.8-96.853333 39.146667-146.24 55.573334l-23.04-10.24z" fill="#E28F02" opacity=".98" p-id="1687"></path><path d="M198.186667 80.533333c48.96-14.186667 87.253333 32.426667 123.093333 58.346667-35.84 23.04-69.44 49.173333-103.253333 74.986667-12.053333-24.853333-25.173333-50.133333-47.466667-67.52-5.44 34.346667-2.026667 69.013333 2.133333 103.253333-2.773333 4.8-8.106667 14.506667-10.773333 19.306667 0.853333-62.4-18.24-142.613333 36.266667-188.373334zM683.093333 133.546667c49.386667-16.426667 93.333333-50.773333 146.24-55.573334 75.52 38.72 53.653333 136.746667 45.866667 205.013334-2.133333-3.52-6.4-10.666667-8.533333-14.186667-1.493333-41.92 4.586667-88.746667-22.72-124.266667-21.12 16.533333-19.84 48.426667-28.266667 72.213334-39.786667-34.133333-84.48-62.4-132.586667-83.2z" fill="#F0AD54" p-id="1688"></path><path d="M336.533333 131.306667c100.586667-42.24 222.08-53.226667 323.52-8l23.04 10.24c48.106667 20.8 92.8 49.066667 132.586667 83.2 16.64 17.706667 33.706667 34.88 50.986667 52.053333 2.133333 3.52 6.4 10.666667 8.533333 14.186667l10.24 19.626666c38.08 66.88 63.786667 141.973333 62.72 219.626667 8.853333 162.56-87.36 322.24-230.293333 397.653333-161.6 88.106667-379.413333 59.413333-508.8-73.066666-151.253333-141.546667-176-392.533333-56.426667-561.493334 2.346667-4.16 6.933333-12.373333 9.28-16.426666 2.666667-4.8 8-14.506667 10.773333-19.306667 14.826667-12.16 30.293333-23.68 45.333334-35.733333 33.813333-25.813333 67.413333-51.946667 103.253333-74.986667 3.84-1.92 11.413333-5.653333 15.253333-7.573333m57.493334 4.906666c-63.466667 17.28-96.746667 91.626667-85.12 152.853334-17.706667 3.306667-31.04 16.32-44.053334 27.733333-48.32 5.333333-99.2 37.44-106.453333 88.853333-2.133333 45.76 38.4 77.653333 77.12 92.8-3.306667 2.88-10.026667 8.746667-13.333333 11.733334-38.933333-2.026667-77.973333-4.053333-116.8 0.426666-5.44 40.96-4.053333 82.773333 3.306666 123.413334 0.106667 0.746667 0.426667 2.346667 0.64 3.093333 10.773333 49.92 37.546667 94.186667 64.213334 136.96 0.426667 0.533333 1.173333 1.706667 1.6 2.24 35.84 45.226667 75.733333 96.533333 134.293333 111.36 55.253333 47.146667 131.52 60.053333 202.56 51.2 70.506667 7.146667 162.026667-4.373333 209.493333-51.733333 60.266667-18.666667 98.346667-75.84 138.133334-121.386667l1.6-2.346667c24.426667-35.093333 41.706667-74.666667 52.8-115.946666 0.213333-0.746667 0.64-2.24 0.746666-2.986667 4.053333-18.56 7.04-37.546667 6.08-56.64l9.706667 0.106667c7.36-138.24-42.56-285.12-152.426667-374.08-103.36-87.573333-254.933333-128.32-384.106666-77.653334z" fill="#FFCE74" p-id="1689"></path><path d="M394.026667 136.213333c129.173333-50.666667 280.746667-9.92 384.106666 77.653334 109.866667 88.96 159.786667 235.84 152.426667 374.08l-9.706667-0.106667c-2.026667-16.533333-3.84-33.066667-7.253333-49.28-35.626667 0.64-72.213333 10.026667-106.986667-2.026667-49.386667-13.866667-103.573333-41.066667-153.813333-14.933333-56.106667 38.4-112.64-4.586667-165.546667-24.96-51.946667-19.093333-94.08 25.066667-141.866666 36.266667-39.466667-14.933333-81.28-20.693333-123.2-22.72 3.306667-2.986667 10.026667-8.853333 13.333333-11.733334 73.173333 17.813333 160.533333-17.386667 168.533333-100.053333 11.946667-32.64 13.973333-68.586667 3.52-101.866667-32.32-7.573333-65.706667-6.72-98.666666-7.466666-11.626667-61.226667 21.653333-135.573333 85.12-152.853334m134.08 167.466667c-12.16 44.053333 2.666667 88.96 34.346666 120.64 43.2 101.653333 205.653333 107.946667 267.52 21.653333 21.12-29.973333 4.373333-70.826667-21.76-91.733333-33.813333-31.04-81.6-37.44-125.653333-36.16-44.266667-28.373333-109.12-54.933333-154.453333-14.4zM170.56 146.346667c22.293333 17.386667 35.413333 42.666667 47.466667 67.52-15.04 12.053333-30.506667 23.573333-45.333334 35.733333-4.16-34.24-7.573333-68.906667-2.133333-103.253333zM815.68 216.746667c8.426667-23.786667 7.146667-55.68 28.266667-72.213334 27.306667 35.52 21.226667 82.346667 22.72 124.266667a2131.306667 2131.306667 0 0 1-50.986667-52.053333z" fill="#FDEB78" p-id="1690"></path><path d="M528.106667 303.68c45.333333-40.533333 110.186667-13.973333 154.453333 14.4-56.426667 8.533333-117.12 42.666667-120.106667 106.24-31.68-31.68-46.506667-76.586667-34.346666-120.64zM264.853333 316.8c13.013333-11.413333 26.346667-24.426667 44.053334-27.733333 32.96 0.746667 66.346667-0.106667 98.666666 7.466666 10.453333 33.28 8.426667 69.226667-3.52 101.866667-26.133333-53.333333-79.68-85.333333-139.2-81.6z" fill="#FFFFB9" p-id="1691"></path><path d="M158.4 405.653333c7.253333-51.413333 58.133333-83.52 106.453333-88.853333 59.52-3.733333 113.066667 28.266667 139.2 81.6-8 82.666667-95.36 117.866667-168.533333 100.053333-38.72-15.146667-79.253333-47.04-77.12-92.8m101.44-70.826666c-35.093333 7.253333-82.88 26.453333-78.72 70.186666-8.64 75.2 93.973333 96.426667 149.013333 74.026667-22.4-20.16-59.626667-36.906667-54.4-73.066667 2.666667-35.2 38.933333-48.533333 65.493334-62.933333-26.56-5.973333-54.08-14.826667-81.386667-8.213333m97.6 43.733333c-29.973333 6.933333 0.426667 51.733333 16.853333 27.626667 20.48-8.746667-2.666667-40-16.853333-27.626667zM562.453333 424.32c2.986667-63.573333 63.68-97.706667 120.106667-106.24 44.053333-1.28 91.84 5.12 125.653333 36.16 26.133333 20.906667 42.88 61.76 21.76 91.733333-61.866667 86.293333-224.32 80-267.52-21.653333m113.386667-88.64c-41.493333 8.213333-94.613333 31.466667-97.173333 79.573333 17.6 73.813333 117.226667 87.36 178.453333 64.213334-22.72-19.093333-55.146667-38.933333-45.013333-74.133334-0.32-33.813333 32.853333-46.186667 56.32-62.186666-30.186667-6.613333-61.653333-15.146667-92.586667-7.466667m119.253333 43.306667c-18.56 4.906667-19.52 36.906667 1.386667 38.506666 29.013333 20.48 30.933333-57.813333-1.386667-38.506666z" fill="#1F1F1F" p-id="1692"></path><path d="M259.84 334.826667c27.306667-6.613333 54.826667 2.24 81.386667 8.213333-26.56 14.4-62.826667 27.733333-65.493334 62.933333-5.226667 36.16 32 52.906667 54.4 73.066667-55.04 22.4-157.653333 1.173333-149.013333-74.026667-4.16-43.733333 43.626667-62.933333 78.72-70.186666zM675.84 335.68c30.933333-7.68 62.4 0.853333 92.586667 7.466667-23.466667 16-56.64 28.373333-56.32 62.186666-10.133333 35.2 22.293333 55.04 45.013333 74.133334-61.226667 23.146667-160.853333 9.6-178.453333-64.213334 2.56-48.106667 55.68-71.36 97.173333-79.573333z" fill="#FFFFFF" p-id="1693"></path><path d="M357.44 378.56c14.186667-12.373333 37.333333 18.88 16.853333 27.626667-16.426667 24.106667-46.826667-20.693333-16.853333-27.626667zM795.093333 378.986667c32.32-19.306667 30.4 58.986667 1.386667 38.506666-20.906667-1.6-19.946667-33.6-1.386667-38.506666z" fill="#888A8E" p-id="1694"></path><path d="M345.386667 532.906667c47.786667-11.2 89.92-55.36 141.866666-36.266667 52.906667 20.373333 109.44 63.36 165.546667 24.96 77.12 41.493333 111.146667 141.333333 101.973333 225.6 1.493333 50.133333-48.32 88.853333-33.28 139.946667-47.466667 47.36-138.986667 58.88-209.493333 51.733333-71.04 8.853333-147.306667-4.053333-202.56-51.2-15.146667-57.6-46.293333-108.693333-68.693333-163.2 3.413333-34.24 40.853333-40.746667 66.453333-52.586667-8.213333-21.333333-24.32-40.426667-25.92-63.786666 5.546667-34.666667 33.386667-60.906667 64.106667-75.2m-9.92 38.08c-44.266667 7.466667-25.813333 66.24 0.106666 85.12 36.906667 22.613333 50.24 64.746667 67.733334 101.76-54.4 28.16-105.173333-10.986667-135.786667-53.546667-22.186667 21.653333 13.333333 50.666667 29.866667 65.386667 51.093333 42.346667 115.413333-4.266667 171.946666 15.786666 66.133333 12.693333 158.72-12.586667 181.653334-81.92-32.32 5.76-51.093333 37.226667-81.173334 48.533334-53.866667 24.853333-135.466667 23.04-164.373333-37.76-38.08-53.013333 68.266667-77.226667 45.12-130.133334-29.44-28.16-78.08-14.186667-115.093333-13.226666z" fill="#FFFFB9" p-id="1695"></path><path d="M105.386667 510.613333c38.826667-4.48 77.866667-2.453333 116.8-0.426666 41.92 2.026667 83.733333 7.786667 123.2 22.72-30.72 14.293333-58.56 40.533333-64.106667 75.2 1.6 23.36 17.706667 42.453333 25.92 63.786666-25.6 11.84-63.04 18.346667-66.453333 52.586667 22.4 54.506667 53.546667 105.6 68.693333 163.2-58.56-14.826667-98.453333-66.133333-134.293333-111.36-0.426667-0.533333-1.173333-1.706667-1.6-2.24-26.666667-42.773333-53.44-87.04-64.213334-136.96-0.213333-0.746667-0.533333-2.346667-0.64-3.093333-7.36-40.64-8.746667-82.453333-3.306666-123.413334zM652.8 521.6c50.24-26.133333 104.426667 1.066667 153.813333 14.933333 34.773333 12.053333 71.36 2.666667 106.986667 2.026667 3.413333 16.213333 5.226667 32.746667 7.253333 49.28 0.96 19.093333-2.026667 38.08-6.08 56.64-0.106667 0.746667-0.533333 2.24-0.746666 2.986667-11.093333 41.28-28.373333 80.853333-52.8 115.946666l-1.6 2.346667c-39.786667 45.546667-77.866667 102.72-138.133334 121.386667-15.04-51.093333 34.773333-89.813333 33.28-139.946667 9.173333-84.266667-24.853333-184.106667-101.973333-225.6z" fill="#FFFF9F" p-id="1696"></path><path d="M335.466667 570.986667c37.013333-0.96 85.653333-14.933333 115.093333 13.226666 23.146667 52.906667-83.2 77.12-45.12 130.133334 28.906667 60.8 110.506667 62.613333 164.373333 37.76 30.08-11.306667 48.853333-42.773333 81.173334-48.533334-22.933333 69.333333-115.52 94.613333-181.653334 81.92-56.533333-20.053333-120.853333 26.56-171.946666-15.786666-16.533333-14.72-52.053333-43.733333-29.866667-65.386667 30.613333 42.56 81.386667 81.706667 135.786667 53.546667-17.493333-37.013333-30.826667-79.146667-67.733334-101.76-25.92-18.88-44.373333-77.653333-0.106666-85.12m82.026666 28.693333c-4.586667 17.6 1.6 23.04 18.453334 16.213333 4.693333-17.92-1.493333-23.36-18.453334-16.213333z" fill="#7D180F" p-id="1697"></path><path d="M417.493333 599.68c16.96-7.146667 23.146667-1.706667 18.453334 16.213333-16.853333 6.826667-23.04 1.386667-18.453334-16.213333z" fill="#FFFFFF" p-id="1698"></path><path d="M108.693333 634.026667zM914.026667 647.466667c0.213333-0.746667 0.64-2.24 0.746666-2.986667-0.106667 0.746667-0.533333 2.24-0.746666 2.986667zM859.626667 765.76l1.6-2.346667-1.6 2.346667zM173.546667 774.08c0.426667 0.533333 1.173333 1.706667 1.6 2.24-0.426667-0.533333-1.173333-1.706667-1.6-2.24z" fill="#FFFFB9" p-id="1699"></path></svg>
			</div>
			<div class="operation" style="display: flex;align-items: center;justify-content: space-around;flex-wrap: wrap;">
				<div id="num_check" style="width: 45px;height: 45px;text-align: center;background-color: #b7d28d;cursor: pointer;color: #fff;font-weight: bold;border-radius: 5px;padding: 0px 5px;margin-bottom: 10px;">字数检测</div>
				<div id="random_score" style="width: 45px;height: 45px;text-align: center;background-color: #b8f1ed;cursor: pointer;color: #fff;font-weight: bold;border-radius: 5px;padding: 0px 5px;margin-bottom: 10px;">随机评分</div>
			</div>
			<div class="operation" style="display: flex;align-items: center;justify-content: space-around;flex-wrap: wrap;">
				<div id="comments" style="width: 45px;height: 45px;text-align: center;background-color: #fecf45;cursor: pointer;color: #fff;font-weight: bold;border-radius: 5px;padding: 0px 5px;">评阅意见</div>
				<div id="reject" style="width: 45px;height: 45px;text-align: center;background-color: #f1b8e4;cursor: pointer;color: #fff;font-weight: bold;border-radius: 5px;padding: 0px 5px;">驳回原因</div>
			</div>
		</div>`;

    // 添加面板
    $(".leftnav div").append(panel)

    let work_content = $("textarea").eq(0);
    let experience = $("textarea").eq(1);
    let mark_comments = $("textarea").eq(2);
    let reject_reason = $("textarea").eq(3);
    let score = $(".state-default input");

    const COMMENTS_ARRAY = [
        "在工作中要多观察，多思考。将学校学到的知识融汇贯通，在举一反三，自我学习。",
        "工作辛苦了，努力一定会有回报，努力学习，做更好的自己",
        "能真实的记录自己在实习过程种的所想，所体会，非常好",
        "从心得中可以看出，你已经很好的适应了工作环境，加油",
        "记录真实，态度认证，可以看出每周都在进步，更加的成熟，再接再厉",
        "希望你在认识的自身差距的同时，能够努力学习，缩短差距，加油，你一定可以！",
        "利用好在学校学习的基础，努力扩展知识的深度和广度，加油！",
        "希望企业实习给你带来的不仅是工作能力上的进步，而是还有心态的转变，能够有更加认真、努力的态度面对以后的工作、生活，加油！",
        "很多时候我们学到的知识，需要大量的练习与思考，才能融会贯通，为已所用。希望你能秉持多看、多写、多思考的态度，保持进步，加油！",
        "初入公司肯定会遇到不少的困难，多学习，多思考。遇到不熟悉不会的内容，优先去查阅资料独立解决，实在是毫无头绪就应该立即请教同事，你一定会进步的，加油！",
        "学校的生活只能决定你在企业的前三年，而在企业的前三年，可以决定你未来的十年。所以，请努力付出，保持进步，共勉，加油！",
        "你的周报显示你在实习中对待工作兢兢业业，这是一个很好的态度，继续保持吧！",
        "在工作中，不断积累经验和技能是非常重要的，你的周报表明你正在积极地做这件事，继续加油！",
        "你在心得中提到了团队协作，这是一个非常关键的技能，继续与同事紧密合作，互相学习和支持吧！",
        "实习是一个很好的机会，让你将理论知识转化为实际操作，你已经在这方面取得了不小的进展，继续保持学习的动力！",
        "在工作中遇到问题时，及时请教同事是一个聪明的举措，你在周报中提到了这一点，这是一个很好的做法，继续如此！",
        "你的周报展示了你对自身发展的积极态度，继续追求个人和专业的成长，你将会在实习中受益匪浅！",
        "你在心得中分享了一些挑战和解决方案，这对你的同学也是一个很好的学习机会，谢谢你的分享！",
        "实习是一个不断学习的过程，你的周报反映了你对新知识的渴望，这种学习精神非常值得鼓励，继续前进吧！",
        "工作中的自我反思是提高的关键，你的周报表明你在这方面有很好的表现，保持这一习惯，你会取得更多进步的！",
        "实习不仅是为了积累经验，还是为了建立人际关系，继续主动与同事互动，建立有价值的职业网络吧！",
        "你的周报展现了你对工作的责任感，这是一个很重要的品质，继续为自己设定高标准，并努力达到它们！",
        "继续保持积极的态度，对待工作和挑战，你将会在实习中获得更多的成就和经验！",
        "实习是一个了解行业和职业生涯的宝贵时机，你已经开始积累这方面的知识，继续探索各种可能性吧！",
        "你在周报中展示了自我管理，这是一个非常重要的技能，继续发展它，将对你未来的职业生涯有所帮助！",
        "实习是一个成长的旅程，不断反思和改进是不可或缺的一部分，你已经在这方面做得很好，继续前进！",
        "你的周报表明你对公司文化和价值观有一定的了解，继续融入其中，你将更好地融入团队！",
        "在实习中，每一次机会都是一个学习的机会，你已经开始积极地抓住这些机会，继续如此！",
        "你的周报体现了你对工作的热情和承诺，这是通向成功的关键，继续燃烧这份激情！",
        "继续保持自己的学习计划，追求职业发展的目标，你将会在实习中走得更远！",
        "感谢你分享你的实习心得，这对你的同学和未来的实习生都有帮助，继续分享和学习！",
        "你在周报中提到了挑战，记住，挑战是成长的机会，勇敢地面对它们，你会变得更强大！",
        "在实习中，发展自己的解决问题的技能是非常重要的，你已经在这方面取得了进展，继续锻炼自己的解决问题的能力吧！",
        "你的周报反映了你对工作的责任感和自我驱动力，这将是你职业生涯中的宝贵资产，继续坚持下去！",
        "实习是一个了解不同职能部门的机会，继续探索各种工作领域，这将有助于你更好地规划未来职业发展！",
        "你提到了自我学习，这是一个非常重要的品质，继续主动学习新知识和技能，你会受益无穷！",
        "在实习中，积极沟通和表达观点是关键，你已经开始在这方面表现出色，继续锻炼自己的沟通技巧吧！",
        "实习是建立自信的机会，你的周报表明你正在增强自信，继续相信自己，你会做得很出色！",
        "你的周报显示了你对细节的关注，这是一个很重要的能力，继续保持注重细节的习惯吧！",
        "继续保持对行业动态的关注，了解市场趋势将帮助你更好地适应变化和做出明智的决策！",
        "实习是建立职业关系的机会，你已经在这方面取得了进展，继续扩大你的职业网络吧！",
        "你提到了适应工作环境，这是一个很重要的技能，继续适应并融入团队，你将会更好地发挥作用！",
        "在实习中，学会设定目标并追求它们是非常重要的，你已经在这方面取得了一些进展，继续为自己设定挑战吧！",
        "你在周报中强调了团队合作，这是成功的关键，继续积极参与团队项目，你将成为不可或缺的一部分！",
        "实习是一个反思和成长的过程，你已经在这方面取得了进展，继续反思并寻找提高的机会吧！",
        "你提到了工作的多样性，这是实习的一大优势，继续接触不同的项目和任务，你将会更全面发展！",
        "继续保持对公司价值观的认同，你的价值观与公司的一致将有助于你在企业中获得成功！",
        "你在周报中展示了时间管理，这是一个非常关键的技能，继续提高你的时间管理能力吧！",
        "在实习中，学会接受反馈并不断改进是非常重要的，你已经在这方面表现出色，继续坚持下去！",
        "继续对行业和市场趋势保持敏感，这将帮助你在未来做出明智的决策！",
        "你在心得中提到了目标设定，这是一个很好的实践，继续制定明确的目标，你将更有动力追求成功！",
    ];
    const REJECT_ARRAY = [
        "内容过于精简，请详细记录，每项最少150字以上，这样对自己实习也是一份美好的记忆",
        "内容过于精简，请详细记录，每项最少150字以上"
    ];

    // 字数检测
    $(".leftnav div").on('click', "#num_check", function (e) {
        e.stopPropagation();
        // 工作内容字数检测
        let word_content_num = work_content.val().length;
        if (word_content_num >= 150) {
            work_content.css("border", "2px solid green");
        } else {
            work_content.css("border", "2px solid red");
        }
        let numDomWorkContent = `<b id="contentB">${word_content_num}字</b>`
        if (!document.getElementById("contentB")) {
            work_content.after(numDomWorkContent);
        } else {
            document.getElementById("contentB").innerText = `${word_content_num}字`;
        }

        // 完成情况及心得体会检测
        let experience_num = experience.val().length;
        if (experience_num >= 150) {
            experience.css("border", "2px solid green");
        } else {
            experience.css("border", "2px solid red");
        }
        let numDomExperience = `<b id="contentE">${experience_num}字</b>`

        if (!document.getElementById("contentE")) {
            experience.after(numDomExperience);
        } else {
            document.getElementById("contentE").innerText = `${experience_num}字`;
        }
    })

    // 随机分数
    $(".leftnav div").on("click", "#random_score", function (e) {
        e.stopPropagation();
        $(".state-default input").attr("value", Math.floor(Math.random() * 10) + 88);
    })

    // 评阅意见
    $(".leftnav div").on("click", "#comments", function (e) {
        e.stopPropagation();
        $('.radio').eq(0).trigger('click');
        reject_reason.val("");
        let comments = Math.floor((Math.random() * COMMENTS_ARRAY.length))
        mark_comments.val(COMMENTS_ARRAY[comments]);
    })

    // 驳回原因
    $(".leftnav div").on("click", "#reject", function (e) {
        e.stopPropagation();
        // 触发驳回input的选中
        $('.radio').eq(1).trigger('click');
        mark_comments.val("");
        // 填写内容
        let reason = Math.floor((Math.random() * REJECT_ARRAY.length))
        reject_reason.val(REJECT_ARRAY[reason]);
    })
})();