// ==UserScript==
// @name         托福成绩样本，新版托福考试成绩单
// @namespace    
// @version      0.2.1
// @description  托福成绩单样本╁扣好;【⒊O⒏⒏⒋⒌⒎⒊⒌⒎】和新版的有很大的区别，样式纸张一样，里面内容设计大不同。较大的特色就是新版的取消了评语成绩，这也让制版行业的人对这个难道减轻。因为分数和评语的对应关系要很熟悉才行，对这种英文水准熟悉的制版人没有几个懂的，所以诚信者一般都是放弃。虽说新式托福设计和做要容易了，但是其用途有很大的限制。因为一般都是在二年期限内，网上可以查到考生的分数，对于成绩不达标的学生来说，不够放心。而老版的期限也是二年，但时效一过就查不到了，而查不到就是市场需求更高的特色。因为查不到并不影响考生的英语水平，总不能说二年前考的水准二年后就消失了吧，所以现在做老的托福反而还要多起来。只是既要懂评语分数的对应关系，又要懂它的制版水平，能达到这要求的真的很少。需求者碰到的多是以蒙钱为主的类型。所以以选择合作方真要擦亮自己的眼睛，免得花费买糟糕心情，这不是说对行业的不认可，而这种现象是真实存在的。在确认合作对象的时候，请他们提供托福成绩制版图，尽量是多个，然后看看他们的成品，这样才放心，会做的人也都能提供得出来。
// @author       renmu
// @match        *://*.juejin.cn/*
// @match        *://*.zhihu.com/*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/432111/%E6%89%98%E7%A6%8F%E6%88%90%E7%BB%A9%E6%A0%B7%E6%9C%AC%EF%BC%8C%E6%96%B0%E7%89%88%E6%89%98%E7%A6%8F%E8%80%83%E8%AF%95%E6%88%90%E7%BB%A9%E5%8D%95.user.js
// @updateURL https://update.greasyfork.org/scripts/432111/%E6%89%98%E7%A6%8F%E6%88%90%E7%BB%A9%E6%A0%B7%E6%9C%AC%EF%BC%8C%E6%96%B0%E7%89%88%E6%89%98%E7%A6%8F%E8%80%83%E8%AF%95%E6%88%90%E7%BB%A9%E5%8D%95.meta.js
// ==/UserScript==