// ==UserScript==
// @name            斗鱼78622专用歌曲弹幕
// @icon		    http://www.douyutv.com/favicon.ico
// @namespace       http://tampermonkey.net/
// @version         1.2
// @description     78622专属歌曲弹幕/设置弹幕发送时间间隔/设置弹幕发送总时长/手动停止发送/根据歌名搜索弹幕/发送指定弹幕/弹幕根据粉丝徽章等级自动变色
// @author          叶子宇 QQ346989693
// @require			https://cdn.bootcss.com/jquery/3.3.1/jquery.min.js
// @grant           none
// @match			*://*.douyu.com/78622
// @match			*://*.douyu.com/*?rid=78622
// @downloadURL https://update.greasyfork.org/scripts/432605/%E6%96%97%E9%B1%BC78622%E4%B8%93%E7%94%A8%E6%AD%8C%E6%9B%B2%E5%BC%B9%E5%B9%95.user.js
// @updateURL https://update.greasyfork.org/scripts/432605/%E6%96%97%E9%B1%BC78622%E4%B8%93%E7%94%A8%E6%AD%8C%E6%9B%B2%E5%BC%B9%E5%B9%95.meta.js
// ==/UserScript==
(function () {
    'use strict';
    window.$yeziyu = jQuery.noConflict();
    var yeziyu_data = [{
        "yeziyu_name": "光",
        "yeziyu_data": "💫光落在你脸上💫可爱一如往常💫"
    },
    {
        "yeziyu_name": "路",
        "yeziyu_data": "💕让你知道执着是我💕 唯一的骄傲💕"
    },
    {
        "yeziyu_name": "鱼",
        "yeziyu_data": "🐠🐠🐠🐠🐠🐠🐠"
    },
    {
        "yeziyu_name": "闷",
        "yeziyu_data": "❤我不怕沉沦❤"
    },
    {
        "yeziyu_name": "问",
        "yeziyu_data": "❤我可以奉献一生， 为我所爱的珂❤"
    },
    {
        "yeziyu_name": "痒",
        "yeziyu_data": "来呀， 快活啊~"
    },
    {
        "yeziyu_name": "勇",
        "yeziyu_data": "❤爱你无人可挡我路❤"
    },
    {
        "yeziyu_name": "圆",
        "yeziyu_data": "⭕️⭕️⭕️⭕️"
    },
    {
        "yeziyu_name": "紫",
        "yeziyu_data": "❤心心之间， 念念之远❤"
    },
    {
        "yeziyu_name": "蛊",
        "yeziyu_data": "❤️哎呀我的心， 被你下了蛊❤️"
    },
    {
        "yeziyu_name": "爱",
        "yeziyu_data": "因为我真的爱你❤"
    },
    {
        "yeziyu_name": "放心",
        "yeziyu_data": "❤用最好的我赴你的约❤"
    },
    {
        "yeziyu_name": "岁月",
        "yeziyu_data": "🌙🌙🌙🌙🌙🌙🌙"
    },
    {
        "yeziyu_name": "水手",
        "yeziyu_data": "🌊🌊🌊🌊🌊🌊🌊"
    },
    {
        "yeziyu_name": "单车",
        "yeziyu_data": "🚲🚲🚲🚲🚲🚲🚲"
    },
    {
        "yeziyu_name": "浮夸",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "梦伴",
        "yeziyu_data": "✨🌙✨🌙✨🌙"
    },
    {
        "yeziyu_name": "后来",
        "yeziyu_data": "💕有一个男孩爱着这个女孩💕"
    },
    {
        "yeziyu_name": "当你",
        "yeziyu_data": "❤️当你的眼睛眯着笑❤️ 我的世界都为你倾倒❤️"
    },
    {
        "yeziyu_name": "暗涌",
        "yeziyu_data": "🌤有你的天空没有密云🌤"
    },
    {
        "yeziyu_name": "素颜",
        "yeziyu_data": "💄 素颜的你依旧很美💄"
    },
    {
        "yeziyu_name": "遇见",
        "yeziyu_data": "💕遇见你💕 最美丽的意外💕"
    },
    {
        "yeziyu_name": "大鱼",
        "yeziyu_data": "🐬🐬🐬🐬🐬🐬🐬"
    },
    {
        "yeziyu_name": "走马",
        "yeziyu_data": "你还是我的我的我的❤️"
    },
    {
        "yeziyu_name": "丫头",
        "yeziyu_data": "💕你是我的掌中宝💕"
    },
    {
        "yeziyu_name": "成全",
        "yeziyu_data": "🌙你的一句晚安🌙 成全了我的失眠🌙"
    },
    {
        "yeziyu_name": "体面",
        "yeziyu_data": "❤️我爱你永不后悔❤️"
    },
    {
        "yeziyu_name": "同类",
        "yeziyu_data": "💕不怕孤单， 我们都是同类💕"
    },
    {
        "yeziyu_name": "喜欢",
        "yeziyu_data": "❤️我喜欢你❤️"
    },
    {
        "yeziyu_name": "淘汰",
        "yeziyu_data": "❤️我说的我爱你❤️ 请你一定要相信❤️"
    },
    {
        "yeziyu_name": "十年",
        "yeziyu_data": "💕相伴每一个十年💕"
    },
    {
        "yeziyu_name": "碌卡",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "日常",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "邮差",
        "yeziyu_data": "💌你是一封信 我是邮差💌"
    },
    {
        "yeziyu_name": "暧昧",
        "yeziyu_data": "💕止于唇齿💕 掩于岁月💕"
    },
    {
        "yeziyu_name": "棋子",
        "yeziyu_data": "♚ 我就是你最坚强的防备♚"
    },
    {
        "yeziyu_name": "矜持",
        "yeziyu_data": "❤️我是爱你的❤️ 我爱你到底❤️"
    },
    {
        "yeziyu_name": "雪人",
        "yeziyu_data": "⛄⛄⛄⛄⛄⛄⛄"
    },
    {
        "yeziyu_name": "可乐",
        "yeziyu_data": "❤️你是我最渴望的爱情❤️"
    },
    {
        "yeziyu_name": "枫红",
        "yeziyu_data": "🍁🍁🍁🍁🍁🍁🍁"
    },
    {
        "yeziyu_name": "棉被",
        "yeziyu_data": "❤不管多么的狼狈❤ 我们一起面对❤"
    },
    {
        "yeziyu_name": "稻香",
        "yeziyu_data": "❤回家吧 78622 是最初的美好❤"
    },
    {
        "yeziyu_name": "白羊",
        "yeziyu_data": "🐏🐏🐏🐏🐏🐏🐏"
    },
    {
        "yeziyu_name": "轨迹",
        "yeziyu_data": "❤️想对你说的❤️ 我愿意再说一遍❤️"
    },
    {
        "yeziyu_name": "人间",
        "yeziyu_data": "💕愿你的眼睛只看得到笑容💕"
    },
    {
        "yeziyu_name": "茶汤",
        "yeziyu_data": "🎶这一次多放一点脑浆🎶"
    },
    {
        "yeziyu_name": "晴天",
        "yeziyu_data": "☀有你的每一天都是晴天☀️"
    },
    {
        "yeziyu_name": "退后",
        "yeziyu_data": "❤️我们永不退后❤️"
    },
    {
        "yeziyu_name": "怎样",
        "yeziyu_data": "❤️我们在一起会怎样❤️"
    },
    {
        "yeziyu_name": "偿还",
        "yeziyu_data": "❤️爱的心路历程❤️ 只够你我两个人💑"
    },
    {
        "yeziyu_name": "凉城",
        "yeziyu_data": "我在那头等你很久❤️"
    },
    {
        "yeziyu_name": "风月",
        "yeziyu_data": "🌙不说再见🌙"
    },
    {
        "yeziyu_name": "房间",
        "yeziyu_data": "❤在78622这温暖的房间❤️"
    },
    {
        "yeziyu_name": "花海",
        "yeziyu_data": "💐🌷🌹🥀🌺🌸🌼"
    },
    {
        "yeziyu_name": "病变",
        "yeziyu_data": "💕我不能停止对你的爱恋💕"
    },
    {
        "yeziyu_name": "美错",
        "yeziyu_data": "💕你我就从78622开始💕"
    },
    {
        "yeziyu_name": "夜车",
        "yeziyu_data": "✨🚗✨🚗✨🚗✨🚗"
    },
    {
        "yeziyu_name": "拥抱",
        "yeziyu_data": "我们爱你💕 将你的手握紧（ 原♚ 假面骑士团觐见公主殿下♚"
    },
    {
        "yeziyu_name": "不枉",
        "yeziyu_data": "❤️我爱你三个字❤️ 命中注定一辈子❤️"
    },
    {
        "yeziyu_name": "红豆",
        "yeziyu_data": "❤我会陪你看细水长流❤"
    },
    {
        "yeziyu_name": "传奇",
        "yeziyu_data": "❤️我一直在你身边从未走远❤️"
    },
    {
        "yeziyu_name": "催眠",
        "yeziyu_data": "💤💤💤💤💤💤💤"
    },
    {
        "yeziyu_name": "小小",
        "yeziyu_data": "❤我的心里从此住进一个你❤"
    },
    {
        "yeziyu_name": "爱情",
        "yeziyu_data": "那是因为爱着你❤️ 所以深夜没睡意❤️"
    },
    {
        "yeziyu_name": "流年",
        "yeziyu_data": "✨💫✨💫✨💫"
    },
    {
        "yeziyu_name": "彩虹",
        "yeziyu_data": "🌈 看不见你的笑我怎么睡得着🌈"
    },
    {
        "yeziyu_name": "匆匆（ 王菲）",
        "yeziyu_data": "匆匆匆匆匆匆匆"
    },
    {
        "yeziyu_name": "匆匆（ 二珂）",
        "yeziyu_data": "❤时光匆匆❤ 我还有你❤"
    },
    {
        "yeziyu_name": "答案",
        "yeziyu_data": "❤爱就像蓝天白云晴空万里❤"
    },
    {
        "yeziyu_name": "戒烟",
        "yeziyu_data": "❤戒了你我不习惯❤"
    },
    {
        "yeziyu_name": "车站",
        "yeziyu_data": "🚉🚉🚉🚉🚉🚉🚉"
    },
    {
        "yeziyu_name": "私奔",
        "yeziyu_data": "我们一起私奔❤"
    },
    {
        "yeziyu_name": "藏着",
        "yeziyu_data": "78622 里藏着一个温柔的你❤"
    },
    {
        "yeziyu_name": "儿时",
        "yeziyu_data": "我们就一天天长大❤"
    },
    {
        "yeziyu_name": "偏爱",
        "yeziyu_data": "❤爱上你我不撤退❤"
    },
    {
        "yeziyu_name": "征服",
        "yeziyu_data": "❤就这样被你征服❤"
    },
    {
        "yeziyu_name": "借我",
        "yeziyu_data": "❤借我笑颜灿烂如春天❤"
    },
    {
        "yeziyu_name": "暗号",
        "yeziyu_data": "❤拥有你我的世界才能完美❤"
    },
    {
        "yeziyu_name": "宝贝",
        "yeziyu_data": "🎀 啦啦啦啦， 让你知道你最美🎀"
    },
    {
        "yeziyu_name": "笔记",
        "yeziyu_data": "🎈 我只想飞， 在你的天空飞🎈"
    },
    {
        "yeziyu_name": "承认",
        "yeziyu_data": "💕我承认了， 我需要你💕"
    },
    {
        "yeziyu_name": "乘客",
        "yeziyu_data": "💕坐你开的车， 听你唱的歌💕"
    },
    {
        "yeziyu_name": "单飞",
        "yeziyu_data": "💕珂珂勇敢飞， 我们永相随💕"
    },
    {
        "yeziyu_name": "短发",
        "yeziyu_data": "❤发丝易断， 你我难分❤"
    },
    {
        "yeziyu_name": "对嘴",
        "yeziyu_data": "💕你如同烈酒， 难免会宿醉💕"
    },
    {
        "yeziyu_name": "儿歌",
        "yeziyu_data": "❤️生活 生活 明天我们好好的过❤️"
    },
    {
        "yeziyu_name": "非酋",
        "yeziyu_data": "这次我一定中！"
    },
    {
        "yeziyu_name": "搁浅",
        "yeziyu_data": "呜呜呜呜呜呜"
    },
    {
        "yeziyu_name": "画沙",
        "yeziyu_data": "❤因为我爱你呀❤"
    },
    {
        "yeziyu_name": "记得",
        "yeziyu_data": "💕我会和你手牵手， 一起走到最后💕"
    },
    {
        "yeziyu_name": "尽头",
        "yeziyu_data": "💕爱你永无尽头💕"
    },
    {
        "yeziyu_name": "境外",
        "yeziyu_data": "💕在赤道山脉，在北极冰河，不珂分割💕"
    },
    {
        "yeziyu_name": "九儿",
        "yeziyu_data": "💕珂儿送你去心上💕"
    },
    {
        "yeziyu_name": "看看",
        "yeziyu_data": "❤️把我的心让你看看 都是爱你的形状❤️"
    },
    {
        "yeziyu_name": "哭砂",
        "yeziyu_data": "呜呜呜呜呜呜"
    },
    {
        "yeziyu_name": "离开",
        "yeziyu_data": "❤️地老天荒， 永不分离❤"
    },
    {
        "yeziyu_name": "凉凉",
        "yeziyu_data": "❤凉凉夜色❤ 为思念成河❤"
    },
    {
        "yeziyu_name": "烈女",
        "yeziyu_data": "💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "路口",
        "yeziyu_data": "❤于人生路口， 遇见最美好的你❤"
    },
    {
        "yeziyu_name": "迷宫",
        "yeziyu_data": "I don 't care~where we go~"
    },
    {
        "yeziyu_name": "渺小",
        "yeziyu_data": "✨宇宙洪荒再沉默， 总有珂珂在闪烁✨"
    },
    {
        "yeziyu_name": "男孩",
        "yeziyu_data": "呜呜呜呜"
    },
    {
        "yeziyu_name": "暖暖",
        "yeziyu_data": "❤打从心里暖暖的你比自己更重要❤"
    },
    {
        "yeziyu_name": "泡沫",
        "yeziyu_data": "○。○。○。○。○。○。"
    },
    {
        "yeziyu_name": "飘摇",
        "yeziyu_data": "❤我飘啊飘❤ 你摇啊摇❤"
    },
    {
        "yeziyu_name": "扑火",
        "yeziyu_data": "💕只迫切想拥有你的微笑💕"
    },
    {
        "yeziyu_name": "千古",
        "yeziyu_data": "💕爱得执迷又糊涂， 也不悔做你的信徒💕"
    },
    {
        "yeziyu_name": "芊芊",
        "yeziyu_data": "💕山穷水绝处回眸一遍你💕"
    },
    {
        "yeziyu_name": "青鸟",
        "yeziyu_data": ""
    },
    {
        "yeziyu_name": "情歌",
        "yeziyu_data": "💕一整个宇宙💕 换一个猴猴💕"
    },
    {
        "yeziyu_name": "情人",
        "yeziyu_data": "❤多少春秋风雨改❤ 多少崎岖不变爱❤"
    },
    {
        "yeziyu_name": "囚鸟",
        "yeziyu_data": "💕我是被你囚禁的鸟💕"
    },
    {
        "yeziyu_name": "神奇",
        "yeziyu_data": "🕺💃🕺💃🕺💃🕺💃🕺💃🕺💃"
    },
    {
        "yeziyu_name": "失踪",
        "yeziyu_data": ""
    },
    {
        "yeziyu_name": "她说",
        "yeziyu_data": "🌛 你是我在夜里翻来覆去的寄托🌛"
    },
    {
        "yeziyu_name": "唐人",
        "yeziyu_data": "💕我点一丝烛火 一时泛滥了对你的思念💕"
    },
    {
        "yeziyu_name": "替身",
        "yeziyu_data": "❤️无可代替， 非你不珂❤️"
    },
    {
        "yeziyu_name": "温柔",
        "yeziyu_data": "❤️把我的最好的爱都给你❤️"
    },
    {
        "yeziyu_name": "无赖",
        "yeziyu_data": "❤️做一个只喜欢你的无赖❤️"
    },
    {
        "yeziyu_name": "相思",
        "yeziyu_data": "❤️双木非林， 田下有心， 最是相思❤️"
    },
    {
        "yeziyu_name": "消愁",
        "yeziyu_data": "🍻🍻🍻🍻🍻🍻🍻🍻"
    },
    {
        "yeziyu_name": "小宇",
        "yeziyu_data": "❤我真心对你❤"
    },
    {
        "yeziyu_name": "心动",
        "yeziyu_data": "你就住在我心底❤ 伴着我呼吸❤"
    },
    {
        "yeziyu_name": "心墙",
        "yeziyu_data": "❤是你让我所有悲伤融化❤"
    },
    {
        "yeziyu_name": "心雨",
        "yeziyu_data": "💕思念你没有时差💕"
    },
    {
        "yeziyu_name": "星晴",
        "yeziyu_data": "🎈 手牵手一步两步三步四步守护你🎈"
    },
    {
        "yeziyu_name": "旋木",
        "yeziyu_data": "🎠🎠🎠🎠🎠🎠"
    },
    {
        "yeziyu_name": "学会",
        "yeziyu_data": "🎀 你是无可取代的美🎀"
    },
    {
        "yeziyu_name": "阴天",
        "yeziyu_data": "💕傻傻的猴酱， 笑的多甜💕"
    },
    {
        "yeziyu_name": "勇气",
        "yeziyu_data": "🎈 我愿意天涯海角都随你去🎈"
    },
    {
        "yeziyu_name": "羽毛",
        "yeziyu_data": "❤你是给人幸福的青鸟❤"
    },
    {
        "yeziyu_name": "雨蝶",
        "yeziyu_data": "只要你无怨❤ 我也无悔❤"
    },
    {
        "yeziyu_name": "遇到",
        "yeziyu_data": "❤️我比谁都更明白遇到你的重要❤️"
    },
    {
        "yeziyu_name": "寓言",
        "yeziyu_data": "💕我想追寻有你的完美世界💕"
    },
    {
        "yeziyu_name": "约定",
        "yeziyu_data": "两鬓斑白❤ 都可认得你❤"
    },
    {
        "yeziyu_name": "天梯",
        "yeziyu_data": "能供你沿途来爬天梯不用忌讳中伤流言全捍卫❤"
    },
    {
        "yeziyu_name": "表白",
        "yeziyu_data": "💌 好想跟你表白💌"
    },
    {
        "yeziyu_name": "舞娘",
        "yeziyu_data": "💃🏻 旋转💃🏻 跳跃💃🏻 我闭着眼💃🏻"
    },
    {
        "yeziyu_name": "再见（ 张震岳）",
        "yeziyu_data": "我会牢牢记住你的脸❤ 我会珍惜你给的思念❤"
    },
    {
        "yeziyu_name": "再见（ 邓紫棋）",
        "yeziyu_data": "不说再见💕"
    },
    {
        "yeziyu_name": "成都",
        "yeziyu_data": "❤️和我在成都的街头走一走❤️"
    },
    {
        "yeziyu_name": "野花",
        "yeziyu_data": "🌹🌹🌹🌹🌹🌹🌹🌹🌹"
    },
    {
        "yeziyu_name": "过火",
        "yeziyu_data": "我给你的爱不过火， 刚刚好💕"
    },
    {
        "yeziyu_name": "说谎",
        "yeziyu_data": "我没有说谎， 我真的爱你❤"
    },
    {
        "yeziyu_name": "浪费",
        "yeziyu_data": "爱你这件事整整六年❤"
    },
    {
        "yeziyu_name": "气球",
        "yeziyu_data": "🎈🎈🎈🎈🎈🎈🎈🎈"
    },
    {
        "yeziyu_name": "疯子",
        "yeziyu_data": "呜呜呜呜呜"
    },
    {
        "yeziyu_name": "小半",
        "yeziyu_data": "对你的偏爱太过于明目张胆❤"
    },
    {
        "yeziyu_name": "绿光",
        "yeziyu_data": "❤你就是绿光 如此的唯一❤"
    },
    {
        "yeziyu_name": "红日",
        "yeziyu_data": "我愿能一生永远陪伴你❤"
    },
    {
        "yeziyu_name": "阿刁",
        "yeziyu_data": "❤️阿刁， 你是自由的鸟❤️"
    },
    {
        "yeziyu_name": "杀手",
        "yeziyu_data": "我是一个木得感情的杀手🔪"
    },
    {
        "yeziyu_name": "普通Disco",
        "yeziyu_data": "💃💃💃💃💃"
    },
    {
        "yeziyu_name": "安静",
        "yeziyu_data": "💕我会学着等你💕 是因为我太爱你💕"
    },
    {
        "yeziyu_name": "离人愁",
        "yeziyu_data": "梦里殇此情高几楼🎶"
    },
    {
        "yeziyu_name": "红昭愿",
        "yeziyu_data": "❤️你还在我的心上❤️"
    },
    {
        "yeziyu_name": "空白格",
        "yeziyu_data": "💕也许你不是我的💕 爱你却又难割舍💕"
    },
    {
        "yeziyu_name": "我要你",
        "yeziyu_data": "💕我要默默把你想💕"
    },
    {
        "yeziyu_name": "我的梦",
        "yeziyu_data": "❤️因为你是我的梦❤️"
    },
    {
        "yeziyu_name": "柠檬树",
        "yeziyu_data": "❤️我一天一天更爱你❤️"
    },
    {
        "yeziyu_name": "三角题",
        "yeziyu_data": "🔺🔺🔺🔺🔺🔺🔺"
    },
    {
        "yeziyu_name": "热气球",
        "yeziyu_data": "🎈🎈🎈🎈🎈🎈🎈"
    },
    {
        "yeziyu_name": "我不配",
        "yeziyu_data": "❤️仔仔细细描述我如何爱你❤️"
    },
    {
        "yeziyu_name": "小跳蛙",
        "yeziyu_data": "🐸🐸🐸🐸🐸🐸🐸"
    },
    {
        "yeziyu_name": "讲真的",
        "yeziyu_data": "💕讲真的我喜欢你💕"
    },
    {
        "yeziyu_name": "学猫叫",
        "yeziyu_data": "喵🐾 喵🐾 喵🐾 喵🐾"
    },
    {
        "yeziyu_name": "女儿情",
        "yeziyu_data": "💕美美美💕💕 美美美💕💕 美美美💕"
    },
    {
        "yeziyu_name": "过云雨",
        "yeziyu_data": "🌧☁️🌧☁️🌧☁️"
    },
    {
        "yeziyu_name": "小永远",
        "yeziyu_data": "每一刻都是小永远❤️"
    },
    {
        "yeziyu_name": "水星记",
        "yeziyu_data": "❤️沉迷于你眼睛❤️"
    },
    {
        "yeziyu_name": "喜欢你",
        "yeziyu_data": "🍍🍍🍍🍍🍍🍍🍍"
    },
    {
        "yeziyu_name": "烟熏妆",
        "yeziyu_data": "💄 卸了妆你依旧美丽💄"
    },
    {
        "yeziyu_name": "克卜勒",
        "yeziyu_data": "⭐️⭐️⭐️⭐️⭐️⭐️⭐️"
    },
    {
        "yeziyu_name": "后继者",
        "yeziyu_data": "我们一直都在💐"
    },
    {
        "yeziyu_name": "红玫瑰",
        "yeziyu_data": "🌹🌹🌹🌹🌹🌹🌹"
    },
    {
        "yeziyu_name": "园游会",
        "yeziyu_data": "❤️你的脸上没有化妆我却疯狂爱上❤️"
    },
    {
        "yeziyu_name": "偶阵雨",
        "yeziyu_data": "☔️☔️☔️☔️☔️☔️☔️"
    },
    {
        "yeziyu_name": "清平调",
        "yeziyu_data": "❤️云想衣裳花想容❤️"
    },
    {
        "yeziyu_name": "青花瓷",
        "yeziyu_data": "❤️天青色等烟雨❤️ 而我在等你❤️"
    },
    {
        "yeziyu_name": "发如雪",
        "yeziyu_data": "❄️❄️❄️❄️❄️❄️❄️"
    },
    {
        "yeziyu_name": "红颜旧",
        "yeziyu_data": "唯不变此情悠悠~"
    },
    {
        "yeziyu_name": "说爱你",
        "yeziyu_data": "爱你❤️ 爱你❤"
    },
    {
        "yeziyu_name": "起风了",
        "yeziyu_data": "❤再次看到你❤ 微凉晨光里❤ 笑得很甜蜜❤"
    },
    {
        "yeziyu_name": "东风破",
        "yeziyu_data": "谁在用琵琶弹奏一曲东风破❤"
    },
    {
        "yeziyu_name": "七月上",
        "yeziyu_data": "❤就让我走向你❤"
    },
    {
        "yeziyu_name": "七里香",
        "yeziyu_data": "你出现在我诗的每一页❤"
    },
    {
        "yeziyu_name": "无底洞",
        "yeziyu_data": "❤你的感受我们会懂❤"
    },
    {
        "yeziyu_name": "追光者",
        "yeziyu_data": "我可以跟在你身后❤ 像影子追着光梦游~❤"
    },
    {
        "yeziyu_name": "秋意浓",
        "yeziyu_data": "❤不怕相思苦❤ 只怕你伤痛❤"
    },
    {
        "yeziyu_name": "野孩子",
        "yeziyu_data": "你是我最牵挂的一个女子❤"
    },
    {
        "yeziyu_name": "达尔文",
        "yeziyu_data": "我们都要进化成更好的人"
    },
    {
        "yeziyu_name": "猪之歌",
        "yeziyu_data": "🐷🐷🐷🐷🐷🐷🐷"
    },
    {
        "yeziyu_name": "采花贼",
        "yeziyu_data": "喂喂喂喂~"
    },
    {
        "yeziyu_name": "关键词",
        "yeziyu_data": "你是我的关键词❤️ 你是我的关键词❤️"
    },
    {
        "yeziyu_name": "丁香花",
        "yeziyu_data": "💐💐💐💐💐💐💐"
    },
    {
        "yeziyu_name": "牵丝戏",
        "yeziyu_data": "💕我和你， 最天生一对💕"
    },
    {
        "yeziyu_name": "笑忘书",
        "yeziyu_data": "💌 给珂的情书💌"
    },
    {
        "yeziyu_name": "想着你",
        "yeziyu_data": "❤就这样想着你❤"
    },
    {
        "yeziyu_name": "下一秒",
        "yeziyu_data": "❤喜欢这样看你傻傻的笑❤️"
    },
    {
        "yeziyu_name": "我愿意",
        "yeziyu_data": "❤什么都愿意❤ 为你❤"
    },
    {
        "yeziyu_name": "日不落",
        "yeziyu_data": "💕我要送你日不落的爱恋💕"
    },
    {
        "yeziyu_name": "小情歌",
        "yeziyu_data": "❤就算整个城市被大雨颠倒❤ 我会给你怀抱❤"
    },
    {
        "yeziyu_name": "黄昏晓",
        "yeziyu_data": "❤我用一辈子去追逐你❤"
    },
    {
        "yeziyu_name": "爱疯了",
        "yeziyu_data": "☀ 选择了你就是对的人☀"
    },
    {
        "yeziyu_name": "爱啦啦",
        "yeziyu_data": "💕整个世界都是你给的甜蜜空气💕"
    },
    {
        "yeziyu_name": "爱要逃",
        "yeziyu_data": "一辈子真爱一次💕 为何偏让你遇到💕"
    },
    {
        "yeziyu_name": "爱一点",
        "yeziyu_data": "我会爱你多一点点💕 一直就在你的眼前💕"
    },
    {
        "yeziyu_name": "爱与诚",
        "yeziyu_data": "🎀 一生都将会记得今晚🎀"
    },
    {
        "yeziyu_name": "安静了",
        "yeziyu_data": "🎀 撒娇的可爱的粘人的都是我喜欢的你🎀"
    },
    {
        "yeziyu_name": "白山茶",
        "yeziyu_data": "💕我知道余生必定再戒不掉你💕"
    },
    {
        "yeziyu_name": "处处吻",
        "yeziyu_data": "啵啵啵啵啵啵啵啵啵啵啵啵"
    },
    {
        "yeziyu_name": "打错了",
        "yeziyu_data": "❤遇见你是注定不是巧合❤"
    },
    {
        "yeziyu_name": "躲猫猫",
        "yeziyu_data": "✨你就是我的星空✨"
    },
    {
        "yeziyu_name": "防空洞",
        "yeziyu_data": "我要住进你心里的防空洞💕"
    },
    {
        "yeziyu_name": "疯起来",
        "yeziyu_data": "💃🏻 今晚就疯起来💃"
    },
    {
        "yeziyu_name": "刚刚好",
        "yeziyu_data": "呜呜呜呜呜呜呜呜呜"
    },
    {
        "yeziyu_name": "给你们",
        "yeziyu_data": "一定是特别的缘分成就78622一家人🎶"
    },
    {
        "yeziyu_name": "好汉歌",
        "yeziyu_data": "🍻 生死之交一碗酒哇🍻"
    },
    {
        "yeziyu_name": "红颜旧",
        "yeziyu_data": "💕唯不变此情悠悠💕"
    },
    {
        "yeziyu_name": "后继者",
        "yeziyu_data": "这时我们都在❤ 流逝的时光里等待❤"
    },
    {
        "yeziyu_name": "简单爱",
        "yeziyu_data": "我想大声宣布🎀 对你依依不舍🎀"
    },
    {
        "yeziyu_name": "健康歌",
        "yeziyu_data": "💃 左三圈右三圈脖子扭扭屁股扭扭💃"
    },
    {
        "yeziyu_name": "九张机",
        "yeziyu_data": "💝篆刻心头是你的名字💝"
    },
    {
        "yeziyu_name": "旧行李",
        "yeziyu_data": "💝I 'd still be loving you💝"
    },
    {
        "yeziyu_name": "可爱颂",
        "yeziyu_data": "💕keyomi💕 口香糖♻ 交个朋友吧♻"
    },
    {
        "yeziyu_name": "蓝旗袍",
        "yeziyu_data": "🎈 在你面前理智统统取消🎈"
    },
    {
        "yeziyu_name": "落大雨",
        "yeziyu_data": "虽然窗外又落大雨❤ 你心中的温暖由我提供❤"
    },
    {
        "yeziyu_name": "眉间雪",
        "yeziyu_data": "相伴相护❤ 初心不负❤"
    },
    {
        "yeziyu_name": "美人鸣",
        "yeziyu_data": "💕红红的美人脸相思在心头💕"
    },
    {
        "yeziyu_name": "美人鱼",
        "yeziyu_data": "💘 你就是我的美人鱼💘"
    },
    {
        "yeziyu_name": "梦醒了",
        "yeziyu_data": "❤️你傻笑的表情那么真实❤️"
    },
    {
        "yeziyu_name": "陌生人",
        "yeziyu_data": "💝真心希望你能幸福💝"
    },
    {
        "yeziyu_name": "牡丹江",
        "yeziyu_data": "到不了的都叫做远方❤️ 回不去的名字叫家乡❤"
    },
    {
        "yeziyu_name": "那个人",
        "yeziyu_data": "💘 没有你的剧本 不完整的人生💘"
    },
    {
        "yeziyu_name": "女人花",
        "yeziyu_data": "🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹"
    },
    {
        "yeziyu_name": "欧若拉",
        "yeziyu_data": "✨珂是一道光如此美妙✨"
    },
    {
        "yeziyu_name": "杀破狼",
        "yeziyu_data": "💘 我穿越几个世界只为你💘"
    },
    {
        "yeziyu_name": "珊瑚海",
        "yeziyu_data": "❤我们一直都在， 不会离开❤"
    },
    {
        "yeziyu_name": "十二楼",
        "yeziyu_data": "呜~爱你让我心情舒畅❤"
    },
    {
        "yeziyu_name": "水中央",
        "yeziyu_data": "爱飘像水中央~恣意的游荡"
    },
    {
        "yeziyu_name": "思美人",
        "yeziyu_data": "💖 思美人兮心若香💖"
    },
    {
        "yeziyu_name": "苏州河",
        "yeziyu_data": "💟 爱只是爱伟大的爱情到头来也只是爱💟"
    },
    {
        "yeziyu_name": "桃花诺",
        "yeziyu_data": "🌺🌺🌺🌺🌺🌺🌺🌺"
    },
    {
        "yeziyu_name": "天黑黑",
        "yeziyu_data": "天黑了～ 我以为你就是我追求的世界"
    },
    {
        "yeziyu_name": "甜甜的",
        "yeziyu_data": "💕甜甜甜💕 甜甜甜💕"
    },
    {
        "yeziyu_name": "听你说",
        "yeziyu_data": "❤真的喜欢你安静的自由❤"
    },
    {
        "yeziyu_name": "童话镇",
        "yeziyu_data": "啊啊啊啊啊啊啊啊啊～"
    },
    {
        "yeziyu_name": "往前飞",
        "yeziyu_data": "放开那些事与愿违🎶 往前飞❤️"
    },
    {
        "yeziyu_name": "我本人",
        "yeziyu_data": "❤难忘你的歌声好听宛若惊鸿有韵味❤"
    },
    {
        "yeziyu_name": "我喜欢",
        "yeziyu_data": "💞 我喜欢💞 像这样💞 爱的好自然💞"
    },
    {
        "yeziyu_name": "莫哥窟: 💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "喜帖街",
        "yeziyu_data": "💕你和我的喜帖贴满了整个街💕"
    },
    {
        "yeziyu_name": "下一秒",
        "yeziyu_data": "喜欢这样看着你傻傻的笑～"
    },
    {
        "yeziyu_name": "想自由",
        "yeziyu_data": "或许只有我懂你所以我没逃脱～"
    },
    {
        "yeziyu_name": "新的家",
        "yeziyu_data": "🏠 78622 是猴猴们新的家🏠"
    },
    {
        "yeziyu_name": "星象仪",
        "yeziyu_data": "❤想到你左右， 想在你身边停留❤"
    },
    {
        "yeziyu_name": "眼鼻嘴",
        "yeziyu_data": "👀👃👄👀👃👄👀👃👄"
    },
    {
        "yeziyu_name": "野蔷薇",
        "yeziyu_data": "🌹🌹🌹🌹🌹🌹🌹"
    },
    {
        "yeziyu_name": "有没有",
        "yeziyu_data": "❤你有没有爱过我❤ 有没有想过我❤"
    },
    {
        "yeziyu_name": "雨樱花",
        "yeziyu_data": "☔🌸☔🌸☔🌸☔"
    },
    {
        "yeziyu_name": "在梅边",
        "yeziyu_data": "爱是什么？ 爱就是你～"
    },
    {
        "yeziyu_name": "致青春",
        "yeziyu_data": "❤我最美的青春献给了你❤"
    },
    {
        "yeziyu_name": "中国话",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "钟无艳",
        "yeziyu_data": "没有你的允许～ 我都会爱下去～"
    },
    {
        "yeziyu_name": "转转转",
        "yeziyu_data": "💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "最好的",
        "yeziyu_data": "💝在这遇见最好的你💝"
    },
    {
        "yeziyu_name": "第一天",
        "yeziyu_data": "💃🏻 每一天都那么灿烂💃🏻"
    },
    {
        "yeziyu_name": "特务J",
        "yeziyu_data": "零零珂🔫🔫"
    },
    {
        "yeziyu_name": "错的人",
        "yeziyu_data": "❤你是那个对的人❤"
    },
    {
        "yeziyu_name": "纸飞机",
        "yeziyu_data": "纸飞机快飞吧~快乐是永不忘的呀~"
    },
    {
        "yeziyu_name": "好运来",
        "yeziyu_data": "💰 恭喜发财💰"
    },
    {
        "yeziyu_name": "龙卷风",
        "yeziyu_data": "🌪🌪🌪🌪🌪🌪🌪"
    },
    {
        "yeziyu_name": "捉泥鳅",
        "yeziyu_data": "捉猴子~捉猴子~"
    },
    {
        "yeziyu_name": "白桦林",
        "yeziyu_data": "呜呜呜呜呜呜"
    },
    {
        "yeziyu_name": "可能否",
        "yeziyu_data": "❤可能我永远忘不掉你吧❤"
    },
    {
        "yeziyu_name": "他不懂",
        "yeziyu_data": "我懂你的心❤ 我懂你的心❤"
    },
    {
        "yeziyu_name": "海草舞",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "卡路里",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "小叮当（ 范晓萱）",
        "yeziyu_data": "AngAngAng~"
    },
    {
        "yeziyu_name": "樱花草",
        "yeziyu_data": "🌸 你是我心中的樱花草🌸"
    },
    {
        "yeziyu_name": "多遥远",
        "yeziyu_data": "无论多遥远❤ 78622 都心连心❤"
    },
    {
        "yeziyu_name": "叹云兮",
        "yeziyu_data": "陪你看日升月潜❤ 陪你看沧海变迁❤"
    },
    {
        "yeziyu_name": "胆小鬼",
        "yeziyu_data": "❤️有你不害怕❤️"
    },
    {
        "yeziyu_name": "美人吟",
        "yeziyu_data": "❤️自古美女爱英雄❤️"
    },
    {
        "yeziyu_name": "小酒窝",
        "yeziyu_data": "💕我每天睡不着💕 想念你的微笑💕"
    },
    {
        "yeziyu_name": "小幸运",
        "yeziyu_data": "❤原来你是我最想留住的幸运❤"
    },
    {
        "yeziyu_name": "心在跳",
        "yeziyu_data": "❤答案得走过天涯海角❤ 最后才知道❤"
    },
    {
        "yeziyu_name": "卷珠帘",
        "yeziyu_data": "❤犹眷恋梨花泪❤ 静画红妆等谁归❤"
    },
    {
        "yeziyu_name": "抛物线",
        "yeziyu_data": "❤我们用真心就不会有差错❤"
    },
    {
        "yeziyu_name": "百年孤寂",
        "yeziyu_data": "我的❤ 属于你~"
    },
    {
        "yeziyu_name": "豆浆油条",
        "yeziyu_data": "😄 我知道我和你就像是豆浆和油条😄"
    },
    {
        "yeziyu_name": "理想三旬",
        "yeziyu_data": "🎶 理想三旬🎶"
    },
    {
        "yeziyu_name": "未闻花名",
        "yeziyu_data": "💐💐💐💐💐💐💐"
    },
    {
        "yeziyu_name": "友情岁月",
        "yeziyu_data": "❤友情岁月❤"
    },
    {
        "yeziyu_name": "难念的经",
        "yeziyu_data": "啊~哈！ 啊~哈！ 啊~哈！ 啊~哈！"
    },
    {
        "yeziyu_name": "你的甜蜜",
        "yeziyu_data": "🍭 甜甜甜🍭"
    },
    {
        "yeziyu_name": "等你下课",
        "yeziyu_data": "❤周二猴下课别跑❤ 周二猴下课别跑❤"
    },
    {
        "yeziyu_name": "咖喱咖喱",
        "yeziyu_data": "咖喱咖喱~咖喱咖喱~咖喱咖喱~"
    },
    {
        "yeziyu_name": "云烟成雨",
        "yeziyu_data": "☁️🌧☁️🌧☁️🌧"
    },
    {
        "yeziyu_name": "阳光宅男",
        "yeziyu_data": "我决定插手你的人生"
    },
    {
        "yeziyu_name": "香格里拉",
        "yeziyu_data": "💕78622 是我的家💕"
    },
    {
        "yeziyu_name": "寻人启事",
        "yeziyu_data": "❤️我多想找到你 轻捧你的脸❤️"
    },
    {
        "yeziyu_name": "空空如也",
        "yeziyu_data": "🈳 你让我的心不再空空如也🈳"
    },
    {
        "yeziyu_name": "回到过去",
        "yeziyu_data": "回不去了~回不去了~回不去了~"
    },
    {
        "yeziyu_name": "开不了口",
        "yeziyu_data": "💕没有你在我有多难熬💕"
    },
    {
        "yeziyu_name": "开到荼靡",
        "yeziyu_data": "❤对你死心塌地❤"
    },
    {
        "yeziyu_name": "烟花易冷",
        "yeziyu_data": "❤️缘分落地生根是我们❤️"
    },
    {
        "yeziyu_name": "告白气球",
        "yeziyu_data": "🎈🎈🎈🎈🎈🎈🎈🎈🎈🎈"
    },
    {
        "yeziyu_name": "后会无期",
        "yeziyu_data": "我们约定每一天❤️"
    },
    {
        "yeziyu_name": "星月神话",
        "yeziyu_data": "⭐️🌙⭐️🌙⭐️🌙⭐️🌙"
    },
    {
        "yeziyu_name": "世界末日",
        "yeziyu_data": "❤️有你在就不会世界末日❤️"
    },
    {
        "yeziyu_name": "寻水的鱼",
        "yeziyu_data": "🐠🐠🐠🐠🐠🐠🐠"
    },
    {
        "yeziyu_name": "有何不可",
        "yeziyu_data": "❤️喜欢你有何不可❤️"
    },
    {
        "yeziyu_name": "明天你好",
        "yeziyu_data": "❤️明天你好❤️ 请勇敢的向前奔跑❤️"
    },
    {
        "yeziyu_name": "半岛铁盒",
        "yeziyu_data": "💕陪着你的我们不会走💕"
    },
    {
        "yeziyu_name": "词不达意",
        "yeziyu_data": "❤我想能与你搭起桥梁❤"
    },
    {
        "yeziyu_name": "历历万乡",
        "yeziyu_data": "🌾 当你站在朝阳上， 就会脱去昨日的惆怅🌾"
    },
    {
        "yeziyu_name": "好久不见",
        "yeziyu_data": "我多么想见你一面❤️"
    },
    {
        "yeziyu_name": "电台情歌",
        "yeziyu_data": "✨欢迎收听Fm78622✨ 你的月亮我的珂✨"
    },
    {
        "yeziyu_name": "你的甜蜜",
        "yeziyu_data": "❤️你的甜蜜🌹 打动了我的心❤"
    },
    {
        "yeziyu_name": "匆匆那年❤ 如果再见不能红着眼 是否还能红着脸❤"
    },
    {
        "yeziyu_name": "因为爱情",
        "yeziyu_data": "❤因为爱情❤ 所以我们还是年轻的模样❤"
    },
    {
        "yeziyu_name": "分手快乐",
        "yeziyu_data": "❤️我们不分手❤️"
    },
    {
        "yeziyu_name": "爱情错觉",
        "yeziyu_data": "❤因为你的出现❤ 打破所有一切❤"
    },
    {
        "yeziyu_name": "爱似水仙",
        "yeziyu_data": "❤要为你改变❤ 盛开在夏天❤"
    },
    {
        "yeziyu_name": "时间快转",
        "yeziyu_data": "🎠🎠🎠🎠🎠🎠🎠"
    },
    {
        "yeziyu_name": "可爱女人",
        "yeziyu_data": "🎀 可爱女孩🎀🎀 可爱女孩🎀"
    },
    {
        "yeziyu_name": "灵魂伴侣",
        "yeziyu_data": "❤️你就是我的灵魂伴侣❤️"
    },
    {
        "yeziyu_name": "美若黎明",
        "yeziyu_data": "❤美若黎明的你❤️"
    },
    {
        "yeziyu_name": "夏天的风",
        "yeziyu_data": "❤️你和我的夏天❤️ 风轻轻说着❤️"
    },
    {
        "yeziyu_name": "花花世界",
        "yeziyu_data": "🎶 心花若怒放， 开到茶靡又何妨🎶"
    },
    {
        "yeziyu_name": "你的甜蜜",
        "yeziyu_data": "❤️你的甜蜜❤️ 打动了我的心❤️"
    },
    {
        "yeziyu_name": "亲密爱人",
        "yeziyu_data": "❤️你是我最亲密爱人❤️"
    },
    {
        "yeziyu_name": "富士山下",
        "yeziyu_data": "🗻🗻🗻🗻🗻🗻🗻"
    },
    {
        "yeziyu_name": "相约九八",
        "yeziyu_data": "❤️相约78622❤️"
    },
    {
        "yeziyu_name": "六月的雨",
        "yeziyu_data": "🌧🌧🌧🌧🌧🌧🌧"
    },
    {
        "yeziyu_name": "非你不爱",
        "yeziyu_data": "❤️非珂不爱❤️"
    },
    {
        "yeziyu_name": "棠梨煎雪",
        "yeziyu_data": "❤️一生心事只得你一人来解❤"
    },
    {
        "yeziyu_name": "止战之殇",
        "yeziyu_data": "🕊🕊🕊🕊🕊🕊🕊"
    },
    {
        "yeziyu_name": "以父之名",
        "yeziyu_data": "💕我们每个人都有罪， 犯着爱你的罪💕"
    },
    {
        "yeziyu_name": "红尘客栈",
        "yeziyu_data": "我只求与你共华发💑"
    },
    {
        "yeziyu_name": "香水有毒",
        "yeziyu_data": "❤️你身上的香水味❤️ 使我鼻子犯了罪❤️"
    },
    {
        "yeziyu_name": "春夏秋冬",
        "yeziyu_data": "春🌸 夏🍉 秋🌼 冬🌹 爱你不变"
    },
    {
        "yeziyu_name": "春风十里",
        "yeziyu_data": "🌸 春风十里不如你🌸"
    },
    {
        "yeziyu_name": "最冷一天",
        "yeziyu_data": "❤️有你在最冷一天不再寒冷❤️"
    },
    {
        "yeziyu_name": "爱的魔法",
        "yeziyu_data": "❤💫✨❤️💫✨"
    },
    {
        "yeziyu_name": "我不难过",
        "yeziyu_data": "❤我不难过❤"
    },
    {
        "yeziyu_name": "虎口脱险",
        "yeziyu_data": "❤️很难度过想你的夜❤️"
    },
    {
        "yeziyu_name": "他不爱我",
        "yeziyu_data": "我爱你❤️"
    },
    {
        "yeziyu_name": "明天过后",
        "yeziyu_data": "❤️山明和水秀不比你有看头❤️"
    },
    {
        "yeziyu_name": "终生美丽",
        "yeziyu_data": "💕珂珂终生美丽💕"
    },
    {
        "yeziyu_name": "终生美丽 - 最后的时候刷",
        "yeziyu_data": "❤任他们多漂亮❤ 未及你矜贵❤）"
    },
    {
        "yeziyu_name": "一生所爱",
        "yeziyu_data": "💕你是我一生所爱💕"
    },
    {
        "yeziyu_name": "千千阙歌",
        "yeziyu_data": "❤你令我思忆漫长❤"
    },
    {
        "yeziyu_name": "当你老了",
        "yeziyu_data": "💕二珂永远十八岁💕"
    },
    {
        "yeziyu_name": "世上只有",
        "yeziyu_data": "💕I Love You💕"
    },
    {
        "yeziyu_name": "骑士精神",
        "yeziyu_data": "❤我就是你的骑士❤"
    },
    {
        "yeziyu_name": "半途而废",
        "yeziyu_data": "💕爱珂决不半途而废💕"
    },
    {
        "yeziyu_name": "浪人琵琶",
        "yeziyu_data": "❤我情不自禁会为你牵挂❤"
    },
    {
        "yeziyu_name": "孤独她呀",
        "yeziyu_data": "孤独不怕， 我陪你呀❤"
    },
    {
        "yeziyu_name": "爱的供养",
        "yeziyu_data": "❤我用尽一生一世来将你供养❤"
    },
    {
        "yeziyu_name": "爱情抗体",
        "yeziyu_data": "爱情有时像恶作剧～ 但我依旧爱你"
    },
    {
        "yeziyu_name": "爱情秘语",
        "yeziyu_data": "💕想要全心全意爱着你💕"
    },
    {
        "yeziyu_name": "爱如空气",
        "yeziyu_data": "💘 我们之间的爱轻的像空气💘"
    },
    {
        "yeziyu_name": "爱我别走",
        "yeziyu_data": "💕爱你不走💕 爱你不走"
    },
    {
        "yeziyu_name": "爸爸妈妈",
        "yeziyu_data": "👫👫👫👫👫👫👫"
    },
    {
        "yeziyu_name": "百万个吻",
        "yeziyu_data": "mua~mua~mua~"
    },
    {
        "yeziyu_name": "贝壳风铃",
        "yeziyu_data": "🎐 剪影的你轮廓太好看🎐"
    },
    {
        "yeziyu_name": "不可思议",
        "yeziyu_data": "❤想说我爱你❤ 想说在乎你❤"
    },
    {
        "yeziyu_name": "不醉不会",
        "yeziyu_data": "我的宇宙轻飘飘～ 你美的摇摇欲坠"
    },
    {
        "yeziyu_name": "彩云之南",
        "yeziyu_data": "🌈🌈🌈🌈🌈🌈🌈🌈"
    },
    {
        "yeziyu_name": "淡水河边",
        "yeziyu_data": "❤为你快乐因为你值得❤"
    },
    {
        "yeziyu_name": "第三人称",
        "yeziyu_data": "💞 我以第三人称默默守护着你💞"
    },
    {
        "yeziyu_name": "对爱渴望",
        "yeziyu_data": "❤❤❤❤❤❤❤❤❤❤"
    },
    {
        "yeziyu_name": "飞女正传",
        "yeziyu_data": "❤️我敢说我爱到动魄惊心❤️"
    },
    {
        "yeziyu_name": "光年之外",
        "yeziyu_data": "❤缘分让我们相遇78622❤"
    },
    {
        "yeziyu_name": "好不容易",
        "yeziyu_data": "❤因为爱的只有你 我己换了自己❤"
    },
    {
        "yeziyu_name": "好心分手",
        "yeziyu_data": "💔💔💔💔💔💔💔💔💔"
    },
    {
        "yeziyu_name": "忽然之间",
        "yeziyu_data": "🎀 不想一路走来珍惜的回忆没有你🎀"
    },
    {
        "yeziyu_name": "护花使者",
        "yeziyu_data": "💓 我们都是你的护花使者💓"
    },
    {
        "yeziyu_name": "欢喜就好",
        "yeziyu_data": "💫 二珂你欢喜就好💫"
    },
    {
        "yeziyu_name": "风吹麦浪",
        "yeziyu_data": "❤️78622 是你和我爱过的地方❤️"
    },
    {
        "yeziyu_name": "荷塘月色",
        "yeziyu_data": "我像只鱼儿在你的荷塘~"
    },
    {
        "yeziyu_name": "吉祥三宝",
        "yeziyu_data": "❤️你就是我的太阳❤️"
    },
    {
        "yeziyu_name": "开始懂了",
        "yeziyu_data": "❤️有昨天还是好的 但明天是自己的❤"
    },
    {
        "yeziyu_name": "老人与海",
        "yeziyu_data": "❤️爱你的心 怎能搁浅❤️"
    },
    {
        "yeziyu_name": "离不开他",
        "yeziyu_data": "❤️我离不开你❤️"
    },
    {
        "yeziyu_name": "美丽心情",
        "yeziyu_data": "❤️爱你我每天都是美丽心情❤️"
    },
    {
        "yeziyu_name": "那么骄傲",
        "yeziyu_data": "❤️爱你我找不到解药❤️"
    },
    {
        "yeziyu_name": "那些花儿",
        "yeziyu_data": "❤️我会永远守在你身旁❤️"
    },
    {
        "yeziyu_name": "你瞒我瞒",
        "yeziyu_data": "❤️我心里只有你一人❤"
    },
    {
        "yeziyu_name": "你太猖狂",
        "yeziyu_data": "❤️思念你太猖狂❤️"
    },
    {
        "yeziyu_name": "你怎么说",
        "yeziyu_data": "❤️三百六十五个想你的日子不好过❤️"
    },
    {
        "yeziyu_name": "牛仔很忙",
        "yeziyu_data": "❤️你就像个牛仔， 一枪击中我的心❤️"
    },
    {
        "yeziyu_name": "朋友的酒",
        "yeziyu_data": "❤️你的人生我们来陪❤️"
    },
    {
        "yeziyu_name": "青藏高原",
        "yeziyu_data": "呀拉索， 那就是青藏高原~"
    },
    {
        "yeziyu_name": "如初之光",
        "yeziyu_data": "❤️你的每次微笑给我无穷的力量❤️"
    },
    {
        "yeziyu_name": "三寸天堂",
        "yeziyu_data": "❤️78622 是我永远爱你的地方❤️"
    },
    {
        "yeziyu_name": "生日快乐",
        "yeziyu_data": "祝你生日快乐~"
    },
    {
        "yeziyu_name": "时光正好",
        "yeziyu_data": "❤️那是正好的时光， 爱上可爱的你呀❤️"
    },
    {
        "yeziyu_name": "双栖动物",
        "yeziyu_data": "❤️我只能活在有你的幸福❤️"
    },
    {
        "yeziyu_name": "岁月神偷",
        "yeziyu_data": "❤️我愿和你一起， 看云淡风轻❤️"
    },
    {
        "yeziyu_name": "岁月无期",
        "yeziyu_data": "❤️岁月无期， 永远爱你❤️"
    },
    {
        "yeziyu_name": "棠梨煎雪",
        "yeziyu_data": "❤️一生心事只得你来解❤️"
    },
    {
        "yeziyu_name": "天龙八部",
        "yeziyu_data": "❤️我心所向爱你一生一世❤️"
    },
    {
        "yeziyu_name": "天文特征",
        "yeziyu_data": "💫💫💫💫💫💫💫"
    },
    {
        "yeziyu_name": "同一首歌",
        "yeziyu_data": "👫👫👫👫👫👫👫"
    },
    {
        "yeziyu_name": "头号粉丝",
        "yeziyu_data": "💕我是你的头号粉丝💕"
    },
    {
        "yeziyu_name": "我不难过",
        "yeziyu_data": "❤️我知道你不会让我难过❤️"
    },
    {
        "yeziyu_name": "我好想你",
        "yeziyu_data": "💕我好想你， 我好想你💕"
    },
    {
        "yeziyu_name": "我怀念的",
        "yeziyu_data": "💕你就是我的快乐💕"
    },
    {
        "yeziyu_name": "仙剑问情",
        "yeziyu_data": "❤️如有你相伴， 不羡鸳鸯不羡仙❤️"
    },
    {
        "yeziyu_name": "小城大事",
        "yeziyu_data": "❤️青春仿佛我爱你开始❤️"
    },
    {
        "yeziyu_name": "小小恋歌",
        "yeziyu_data": "❤️やさしい歌は世界を変える❤️"
    },
    {
        "yeziyu_name": "心有独钟",
        "yeziyu_data": "❤️我对你情有独钟❤️"
    },
    {
        "yeziyu_name": "辛德瑞拉",
        "yeziyu_data": "❤️你就是我的Cinderella❤️"
    },
    {
        "yeziyu_name": "幸运大门",
        "yeziyu_data": "❤️你的笑声触动了我敏感神经❤️"
    },
    {
        "yeziyu_name": "需要人陪",
        "yeziyu_data": "❤️我来点亮天的黑， 我会陪你直到天明❤️"
    },
    {
        "yeziyu_name": "一半一半",
        "yeziyu_data": "💕爱你我情愿平淡💕"
    },
    {
        "yeziyu_name": "一人一花",
        "yeziyu_data": "💕我会陪着你绽放， 我会伴着你成长💕"
    },
    {
        "yeziyu_name": "一生守候",
        "yeziyu_data": "💕我只为你守候💕"
    },
    {
        "yeziyu_name": "一事无成",
        "yeziyu_data": "💕爱上你我不会逃避💕"
    },
    {
        "yeziyu_name": "一丝不挂",
        "yeziyu_data": "❤️爱你我不甘心割舍❤️"
    },
    {
        "yeziyu_name": "一吻之间",
        "yeziyu_data": "❤️我会一直深爱你❤️"
    },
    {
        "yeziyu_name": "依然爱你",
        "yeziyu_data": "❤我爱你每个呼吸每个动作每个表情❤"
    },
    {
        "yeziyu_name": "远走高飞",
        "yeziyu_data": "🚗🚗🚗🚗🚗🚗🚗"
    },
    {
        "yeziyu_name": "执迷不悟",
        "yeziyu_data": "❤我对你执迷不悟❤"
    },
    {
        "yeziyu_name": "中国姑娘",
        "yeziyu_data": "❤我多想看你模样是那么漂亮❤"
    },
    {
        "yeziyu_name": "自由飞翔",
        "yeziyu_data": "💕有你的远方就是天堂💕"
    },
    {
        "yeziyu_name": "自作多情",
        "yeziyu_data": "❤只会对你献殷勤❤"
    },
    {
        "yeziyu_name": "昨日情书",
        "yeziyu_data": "❤你清澈的笑让我想念❤"
    },
    {
        "yeziyu_name": "执迷不悔",
        "yeziyu_data": "对你执迷不悔❤"
    },
    {
        "yeziyu_name": "花房姑娘",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "七上八下",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "难忘今宵",
        "yeziyu_data": "🎉 78622 过年好🎉"
    },
    {
        "yeziyu_name": "终身美丽",
        "yeziyu_data": "🌸 任他们多漂亮未及你矜贵🌸"
    },
    {
        "yeziyu_name": "隔壁泰山",
        "yeziyu_data": "嗷嗷嗷嗷~嗷嗷嗷嗷~"
    },
    {
        "yeziyu_name": "落叶归根",
        "yeziyu_data": "我的爱像落叶归根❤ 家唯独在你身边"
    },
    {
        "yeziyu_name": "香水百合",
        "yeziyu_data": "等爱出现❤ 让我捧在你手心上"
    },
    {
        "yeziyu_name": "往后余生",
        "yeziyu_data": "❤️往后余生只爱你❤️"
    },
    {
        "yeziyu_name": "残酷月光",
        "yeziyu_data": "❤你就是夜里最温柔的月光❤"
    },
    {
        "yeziyu_name": "身骑白马",
        "yeziyu_data": "🦄🦄🦄🦄🦄"
    },
    {
        "yeziyu_name": "大城小爱",
        "yeziyu_data": "脑袋都是你， 心里都是你❤"
    },
    {
        "yeziyu_name": "改变自己",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "小城故事",
        "yeziyu_data": "78622 故事多， 欢迎来做客☕"
    },
    {
        "yeziyu_name": "睫毛弯弯",
        "yeziyu_data": "气氛好浪漫🎀 需要你陪伴🎀 气氛好浪漫🎀 需要你陪伴🎀"
    },
    {
        "yeziyu_name": "单身情歌",
        "yeziyu_data": "爱珂越挫越勇👫 爱珂肯定执着"
    },
    {
        "yeziyu_name": "情非得已",
        "yeziyu_data": "爱上你是我情非得已❤"
    },
    {
        "yeziyu_name": "你的背包",
        "yeziyu_data": "🎒🎒🎒🎒🎒🎒🎒"
    },
    {
        "yeziyu_name": "你的微笑",
        "yeziyu_data": "因为你❤ 世界不再单调❤"
    },
    {
        "yeziyu_name": "如果爱下去",
        "yeziyu_data": "❤爱下去会地久天长❤"
    },
    {
        "yeziyu_name": "心愿便利贴",
        "yeziyu_data": "💕收集感动给以后怀念💕"
    },
    {
        "yeziyu_name": "当爱在靠近",
        "yeziyu_data": "❤️只想和你在一起❤️ 不管明天在哪里❤️"
    },
    {
        "yeziyu_name": "小手拉大手",
        "yeziyu_data": "👫👫👫👫👫"
    },
    {
        "yeziyu_name": "我的歌声里",
        "yeziyu_data": "❤️你存在我深深的脑海里❤️"
    },
    {
        "yeziyu_name": "我们的回忆",
        "yeziyu_data": "💕我们的回忆是最美好的💕"
    },
    {
        "yeziyu_name": "我们的故事",
        "yeziyu_data": "💕我们的故事从78622开始💕"
    },
    {
        "yeziyu_name": "终于等到你",
        "yeziyu_data": "❤️终于等到你❤️ 还好我没放弃❤️"
    },
    {
        "yeziyu_name": "最美的期待",
        "yeziyu_data": "❤️你是我最美的期待❤️"
    },
    {
        "yeziyu_name": "爱X无限大",
        "yeziyu_data": "💕爱珂无限大💕"
    },
    {
        "yeziyu_name": "我的滑板鞋",
        "yeziyu_data": "摩擦摩擦~摩擦摩擦~"
    },
    {
        "yeziyu_name": "爱的就是你",
        "yeziyu_data": "全世界只爱珂一个❤️"
    },
    {
        "yeziyu_name": "易燃易爆炸",
        "yeziyu_data": "💥💥💥💥💥💥💥"
    },
    {
        "yeziyu_name": "如果有来生",
        "yeziyu_data": "❤️如果有来生❤️ 我还爱你❤️"
    },
    {
        "yeziyu_name": "只爱陌生人",
        "yeziyu_data": "❤️我只爱周二珂❤️"
    },
    {
        "yeziyu_name": "再见二丁目",
        "yeziyu_data": "🌙 岁月长🌙 衣衫薄🌙"
    },
    {
        "yeziyu_name": "寂寞在唱歌",
        "yeziyu_data": "❤️我们一直都在❤️"
    },
    {
        "yeziyu_name": "算什么男人",
        "yeziyu_data": "❤️你三十没男人❤️"
    },
    {
        "yeziyu_name": "慢慢喜欢你",
        "yeziyu_data": "💕慢慢喜欢你💕"
    },
    {
        "yeziyu_name": "走在冷风中",
        "yeziyu_data": "❤爱是等待是细水长流❤"
    },
    {
        "yeziyu_name": "让一切随风",
        "yeziyu_data": "🌪 就让一切随风🌪"
    },
    {
        "yeziyu_name": "旅行的意义",
        "yeziyu_data": "我看过所有的美景❤ 都不如你❤"
    },
    {
        "yeziyu_name": "陆垚知马俐",
        "yeziyu_data": "❤️会好的， 都会好的❤️"
    },
    {
        "yeziyu_name": "第二次表白",
        "yeziyu_data": "❤️爱珂以嗨❤️ 爱珂以嗨❤️"
    },
    {
        "yeziyu_name": "全世界失眠",
        "yeziyu_data": "🌙 想你想到全世界失眠🌙"
    },
    {
        "yeziyu_name": "漫步人生路",
        "yeziyu_data": "💕人生漫漫💕 有珂陪伴💕"
    },
    {
        "yeziyu_name": "贝加尔湖畔",
        "yeziyu_data": "🎶 你清澈又神秘🎶 像贝加尔湖畔🎶"
    },
    {
        "yeziyu_name": "下一站天后",
        "yeziyu_data": "❤途中你畏高， 背后我撑腰❤️"
    },
    {
        "yeziyu_name": "红色高跟鞋",
        "yeziyu_data": "👠👠👠👠👠👠👠"
    },
    {
        "yeziyu_name": "悲伤的秋千",
        "yeziyu_data": "❤️给你我的肩膀❤️"
    },
    {
        "yeziyu_name": "尚好的青春",
        "yeziyu_data": "❤尚好青春都是你❤ 没有片刻不想你❤"
    },
    {
        "yeziyu_name": "最美的期待",
        "yeziyu_data": "💕你是我最美的期待💕"
    },
    {
        "yeziyu_name": "盛夏的果实",
        "yeziyu_data": "❤️当看尽潮起潮落 我们都记得你❤️"
    },
    {
        "yeziyu_name": "潇洒走一回",
        "yeziyu_data": "💕潇洒的爱你💕 永远不离开💕"
    },
    {
        "yeziyu_name": "隐形的翅膀",
        "yeziyu_data": "👼🏻 我们是你隐形的翅膀👼🏻"
    },
    {
        "yeziyu_name": "突然的自我",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "如果没有你",
        "yeziyu_data": "❤我真的好想你❤"
    },
    {
        "yeziyu_name": "乌苏里船歌",
        "yeziyu_data": "🚣🏻🚣🏻🚣🏻🚣🏻🚣🏻🚣🏻🚣🏻"
    },
    {
        "yeziyu_name": "爱在西元前",
        "yeziyu_data": "❤我给你的爱写在西元前❤"
    },
    {
        "yeziyu_name": "把耳朵叫醒",
        "yeziyu_data": "你的歌声把我的耳朵叫醒💕"
    },
    {
        "yeziyu_name": "被驯服的象",
        "yeziyu_data": "🐘🐘🐘🐘🐘🐘🐘"
    },
    {
        "yeziyu_name": "别找我麻烦",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "不完美小孩",
        "yeziyu_data": "💕你是我的宝贝💕"
    },
    {
        "yeziyu_name": "大叔不要跑",
        "yeziyu_data": "二珂不要跑~"
    },
    {
        "yeziyu_name": "带你去旅行",
        "yeziyu_data": "💕我想带你去旅行💕"
    },
    {
        "yeziyu_name": "东京不太热",
        "yeziyu_data": "❤人太多大 部分是漫无目的地走听着歌想念一个人心痛也不说❤"
    },
    {
        "yeziyu_name": "刚好遇见你",
        "yeziyu_data": "💕因为我刚好遇见你💕 留下足迹才美丽💕"
    },
    {
        "yeziyu_name": "街角的祝福",
        "yeziyu_data": "💕我把祝福留在78622💕"
    },
    {
        "yeziyu_name": "靠近一点点",
        "yeziyu_data": "喜欢看你不经意的笑容💕"
    },
    {
        "yeziyu_name": "可惜不是你",
        "yeziyu_data": "💕感谢遇见你💕 可惜没如果💕"
    },
    {
        "yeziyu_name": "老鼠爱大米",
        "yeziyu_data": "💕我爱你爱着你💕 就像老鼠爱大米💕"
    },
    {
        "yeziyu_name": "淋雨一起走",
        "yeziyu_data": "❤️有梦就别怕痛❤️"
    },
    {
        "yeziyu_name": "旅行中忘记",
        "yeziyu_data": "Don’ t forget me❤️"
    },
    {
        "yeziyu_name": "美丽笨女人",
        "yeziyu_data": "💃 这一个美丽的美丽的笨女人💃"
    },
    {
        "yeziyu_name": "梦带我旅行",
        "yeziyu_data": "一遍遍的说着我爱你❤️"
    },
    {
        "yeziyu_name": "明天会更好",
        "yeziyu_data": "明天会更好💕"
    },
    {
        "yeziyu_name": "那就这样吧",
        "yeziyu_data": "不要哭了妈该哭的人是我爸"
    },
    {
        "yeziyu_name": "你给我听好",
        "yeziyu_data": "🎉 你给我听好每天都要笑🎉"
    },
    {
        "yeziyu_name": "陪我看日出",
        "yeziyu_data": "💕在心中你陪我看每一个日出💕"
    },
    {
        "yeziyu_name": "其实都没有",
        "yeziyu_data": "其实什么都没有"
    },
    {
        "yeziyu_name": "奇妙能力歌",
        "yeziyu_data": "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤"
    },
    {
        "yeziyu_name": "千年等一回",
        "yeziyu_data": "爱你永不变 { 啊啊啊啊 }"
    },
    {
        "yeziyu_name": "少女的祈祷",
        "yeziyu_data": "🌳 祈求沿途未变心 请给我护荫🌳"
    },
    {
        "yeziyu_name": "少一点天分",
        "yeziyu_data": "💕我们在这不离不弃陪伴着💕"
    },
    {
        "yeziyu_name": "是不是爱情",
        "yeziyu_data": "❤️旅程多美丽❤️ 因为你在这里❤️"
    },
    {
        "yeziyu_name": "听妈妈的话",
        "yeziyu_data": "❤️听妈妈的话别让她受伤❤️"
    },
    {
        "yeziyu_name": "外面的世界",
        "yeziyu_data": "❤️我在78622盼望你❤️"
    },
    {
        "yeziyu_name": "未来俱乐部",
        "yeziyu_data": "欢笑吧 释放吧 你是我的甜心吖"
    },
    {
        "yeziyu_name": "握不住的他",
        "yeziyu_data": "❤来这听歌呀， 让心好好休息一下❤"
    },
    {
        "yeziyu_name": "喜欢两个人",
        "yeziyu_data": "❤就我们两个人， 在浮动不安世界里找到安稳❤"
    },
    {
        "yeziyu_name": "下一个天亮",
        "yeziyu_data": "❤️你的肩膀是我豁达的天堂❤️"
    },
    {
        "yeziyu_name": "新贵妃醉酒",
        "yeziyu_data": "🍻🍻🍻🍻🍻"
    },
    {
        "yeziyu_name": "一辈子孤单",
        "yeziyu_data": "❤️我们不会让你孤单❤️"
    },
    {
        "yeziyu_name": "一千年以后",
        "yeziyu_data": "❤️一千年太短爱你到永远❤️"
    },
    {
        "yeziyu_name": "一生中最爱",
        "yeziyu_data": "❤️你是我一生中最爱❤️"
    },
    {
        "yeziyu_name": "一直很安静",
        "yeziyu_data": "❤️给你的爱一直很安静❤️"
    },
    {
        "yeziyu_name": "以后的以后",
        "yeziyu_data": "💕陪你到以后的以后💕"
    },
    {
        "yeziyu_name": "有你的快乐",
        "yeziyu_data": "💕心中充满想你的甜蜜💕"
    },
    {
        "yeziyu_name": "越来越不懂",
        "yeziyu_data": "❤️对你爱得绝对爱得坦白❤️"
    },
    {
        "yeziyu_name": "在树上唱歌",
        "yeziyu_data": "想要光着脚丫~在树上唱歌~"
    },
    {
        "yeziyu_name": "最初的梦想",
        "yeziyu_data": "❤️最初的梦想绝对会到达❤"
    },
    {
        "yeziyu_name": "最浪漫的事",
        "yeziyu_data": "💕我们想到最浪漫的事就是💕 和你一起慢慢变老💕"
    },
    {
        "yeziyu_name": "最炫民族风",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "最长的电影",
        "yeziyu_data": "好听❤️ 好听❤️ 好听❤️ 好听❤️ 好听❤️ 好听❤️ 好听❤️ 好听"
    },
    {
        "yeziyu_name": "另一个天堂",
        "yeziyu_data": "❤你是我的另一个天堂❤"
    },
    {
        "yeziyu_name": "左眼皮跳跳",
        "yeziyu_data": "🎉 珂珂笑一笑好事要来到🎉"
    },
    {
        "yeziyu_name": "布拉格广场",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "爱的主打歌",
        "yeziyu_data": "原来你是我的猪大哥~"
    },
    {
        "yeziyu_name": "突然想起你",
        "yeziyu_data": "一个人的夜我的心放在你的那里❤"
    },
    {
        "yeziyu_name": "B小调雨后",
        "yeziyu_data": "☁🌧☁🌧☁🌧☁🌧"
    },
    {
        "yeziyu_name": "欢乐的跳吧",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "对你爱不完",
        "yeziyu_data": "对你爱爱爱不完❤"
    },
    {
        "yeziyu_name": "但愿人长久",
        "yeziyu_data": "但愿人长久🌙 千里共婵娟🌙"
    },
    {
        "yeziyu_name": "临走前吻我",
        "yeziyu_data": "爱你这么深一早就清楚❤️"
    },
    {
        "yeziyu_name": "像中枪一样",
        "yeziyu_data": "呜呜呜呜"
    },
    {
        "yeziyu_name": "爱的华尔兹",
        "yeziyu_data": "没有谁能比你更合我的拍❤️"
    },
    {
        "yeziyu_name": "月半小夜曲",
        "yeziyu_data": "这晚夜没有吻别❤"
    },
    {
        "yeziyu_name": "都是夜归人",
        "yeziyu_data": "❤️孤单的路上， 有我们陪伴❤️"
    },
    {
        "yeziyu_name": "踮起脚尖爱",
        "yeziyu_data": "踮起脚尖找寻爱❤️ 78622 存在"
    },
    {
        "yeziyu_name": "烟火里的尘埃",
        "yeziyu_data": "❤️我会和你一起， 等待着花开❤️"
    },
    {
        "yeziyu_name": "失恋阵线联盟",
        "yeziyu_data": "💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻💃🏻"
    },
    {
        "yeziyu_name": "梦带我去旅行",
        "yeziyu_data": "💕梦带我遇见最好的你💕"
    },
    {
        "yeziyu_name": "永不失联的爱",
        "yeziyu_data": "❤️你给我这辈子都不想失联的爱❤️"
    },
    {
        "yeziyu_name": "第一次爱的人",
        "yeziyu_data": "第一次爱的人是你❤"
    },
    {
        "yeziyu_name": "写不完的温暖",
        "yeziyu_data": "💕余下的温暖由我们来为你填写💕"
    },
    {
        "yeziyu_name": "爱上未来的你",
        "yeziyu_data": "❤️爱上现在和未来的你❤️"
    },
    {
        "yeziyu_name": "广东爱情故事",
        "yeziyu_data": "🎶 漂泊累了就来78622听歌吧🎶"
    },
    {
        "yeziyu_name": "给自己的情书",
        "yeziyu_data": "💌💌💌💌💌💌💌"
    },
    {
        "yeziyu_name": "无名指的等待",
        "yeziyu_data": "❤️我的等待以在爱的海洋❤️"
    },
    {
        "yeziyu_name": "粉红色的回忆",
        "yeziyu_data": "🎀 给你一个粉红的回忆🎀"
    },
    {
        "yeziyu_name": "魔鬼中的天使",
        "yeziyu_data": "😈😇😈😇😈😇"
    },
    {
        "yeziyu_name": "寂寞的恋人啊",
        "yeziyu_data": "💕有你在不寂寞💕"
    },
    {
        "yeziyu_name": "十万毫升泪水",
        "yeziyu_data": "我会给你个答案❤ 你别伤感❤"
    },
    {
        "yeziyu_name": "推开世界的门",
        "yeziyu_data": "❤️推开爱你的门❤️"
    },
    {
        "yeziyu_name": "我真的受伤了",
        "yeziyu_data": "💕我的伤唯你能治愈💕"
    },
    {
        "yeziyu_name": "流着泪说分手",
        "yeziyu_data": "💘 我们永远不分手💘"
    },
    {
        "yeziyu_name": "分分钟需要你",
        "yeziyu_data": "💕每分钟都在想你💕"
    },
    {
        "yeziyu_name": "有可能的夜晚",
        "yeziyu_data": "✨让我成为你的有可能🌙"
    },
    {
        "yeziyu_name": "化身孤岛的鲸",
        "yeziyu_data": "🐳🐳🐳🐳🐳"
    },
    {
        "yeziyu_name": "会有那么一天",
        "yeziyu_data": "❤️听我说声我爱你❤️"
    },
    {
        "yeziyu_name": "火红的萨日朗",
        "yeziyu_data": "💞 珂珂在身边随处是天堂💞"
    },
    {
        "yeziyu_name": "马德里不思议",
        "yeziyu_data": "❤️突然那么想念你❤️"
    },
    {
        "yeziyu_name": "你是我的唯一",
        "yeziyu_data": "💕你是我的唯一💕"
    },
    {
        "yeziyu_name": "你在终点等我",
        "yeziyu_data": "❤️我会陪你走到终点❤️"
    },
    {
        "yeziyu_name": "如果你也听说",
        "yeziyu_data": "❤懂我的人就你一个❤"
    },
    {
        "yeziyu_name": "数到五答应我",
        "yeziyu_data": "❤️我是真的爱你❤️"
    },
    {
        "yeziyu_name": "说好的幸福呢",
        "yeziyu_data": "❤️说好的幸福在你这❤️"
    },
    {
        "yeziyu_name": "我可以抱你吗",
        "yeziyu_data": "可以可以可以可以"
    },
    {
        "yeziyu_name": "写不完的温柔",
        "yeziyu_data": "你一直是最温柔"
    },
    {
        "yeziyu_name": "阳光下的星星",
        "yeziyu_data": "✨你的笑容星星一样明亮✨"
    },
    {
        "yeziyu_name": "一个人的行李",
        "yeziyu_data": "❤️天若真的塌下来， 我陪你扛❤️"
    },
    {
        "yeziyu_name": "印第安老斑鸠",
        "yeziyu_data": "💃💃💃💃💃（🦅🦅🦅🦅）"
    },
    {
        "yeziyu_name": "离开地球表面",
        "yeziyu_data": "💃💃💃💃💃"
    },
    {
        "yeziyu_name": "一百万个可能",
        "yeziyu_data": "❤️一瞬间， 看着你走近， 暖了我冬心❤️"
    },
    {
        "yeziyu_name": "不潮不用花钱",
        "yeziyu_data": "周二抠~周二抠~"
    },
    {
        "yeziyu_name": "爱了很久的朋友",
        "yeziyu_data": "❤️爱你我不放手❤️"
    },
    {
        "yeziyu_name": "如果你也想起我",
        "yeziyu_data": "✨✨✨✨✨✨✨"
    },
    {
        "yeziyu_name": "爱着爱着就永远",
        "yeziyu_data": "💕我们永远永远爱着你💕"
    },
    {
        "yeziyu_name": "可惜我是水瓶座",
        "yeziyu_data": "❤我就是你最结实的堡垒❤"
    },
    {
        "yeziyu_name": "马来西亚的查某",
        "yeziyu_data": "🎶🎶🎶🎶🎶🎶🎶🎶🎶🎶"
    },
    {
        "yeziyu_name": "你就不要想起我",
        "yeziyu_data": "❤我已不会懦弱， 我们不会错过❤"
    },
    {
        "yeziyu_name": "漂洋过海来看你",
        "yeziyu_data": "直到山穷水尽❤ 一生和你相依❤"
    },
    {
        "yeziyu_name": "听袁惟仁弹吉他",
        "yeziyu_data": "听小仙女唱歌🎤"
    },
    {
        "yeziyu_name": "下个星期去英国",
        "yeziyu_data": "喔喔喔喔喔喔喔"
    },
    {
        "yeziyu_name": "一人有一个梦想",
        "yeziyu_data": "是哦～ 是哦～ 是哦～"
    },
    {
        "yeziyu_name": "樱花樱花想见你",
        "yeziyu_data": "🌸🌸🌸🌸🌸🌸🌸🌸🌸"
    },
    {
        "yeziyu_name": "樱花粉的浪漫",
        "yeziyu_data": "🌸🌸🌸🌸🌸🌸🌸🌸"
    },
    {
        "yeziyu_name": "致珊珊来迟的你",
        "yeziyu_data": "❤我发现了在78622美丽的你❤"
    },
    {
        "yeziyu_name": "创造101女孩",
        "yeziyu_data": "周二珂~周二珂（ 破音"
    },
    {
        "yeziyu_name": "光着我的脚丫子",
        "yeziyu_data": "👣👣👣👣👣👣👣"
    },
    {
        "yeziyu_name": "我们都是好孩子",
        "yeziyu_data": "我们都是好猴子🐒 我们都是好猴子🐒"
    },
    {
        "yeziyu_name": "原来你也在这里🎶",
        "yeziyu_data": "你存在我的梦境里🎶 只想有你🎶"
    },
    {
        "yeziyu_name": "为你我受冷风吹",
        "yeziyu_data": "💘 我会给你安慰💘 我害怕你伤悲💘"
    },
    {
        "yeziyu_name": "明天我要嫁给你",
        "yeziyu_data": "明天就要嫁给你啦~"
    },
    {
        "yeziyu_name": "容易受伤的女人",
        "yeziyu_data": "🌹 我们不会让你受伤🌹"
    },
    {
        "yeziyu_name": "带着音乐去旅行",
        "yeziyu_data": "🎵🎵🎵🎵🎵🎵🎵"
    },
    {
        "yeziyu_name": "但是我们分手了",
        "yeziyu_data": "❤️我们永远不分手❤"
    },
    {
        "yeziyu_name": "我要我们在一起",
        "yeziyu_data": "💘 我们永远在一起💘"
    },
    {
        "yeziyu_name": "假如让我说下去",
        "yeziyu_data": "❤暴雨天我至少想讲挂念你❤"
    },
    {
        "yeziyu_name": "人生何处不相逢",
        "yeziyu_data": "🌸 在最好的时刻与你相遇🌸"
    },
    {
        "yeziyu_name": "北京东路的日子",
        "yeziyu_data": "当某天你若听见78622是否会想起我们～"
    },
    {
        "yeziyu_name": "不为谁而作的歌",
        "yeziyu_data": "💝当我抬起头才发觉， 你是如此的美丽💖"
    },
    {
        "yeziyu_name": "我在那天的窗外",
        "yeziyu_data": "💕你不会一个人💕"
    },
    {
        "yeziyu_name": "向天再借五百年",
        "yeziyu_data": "💕我真的还想再听五百年💕"
    },
    {
        "yeziyu_name": "燃烧我的卡路里",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "你快乐所以我快乐",
        "yeziyu_data": "🎉 你快乐所以我快乐🎉"
    },
    {
        "yeziyu_name": "有多少爱可以重来",
        "yeziyu_data": "❤有多少爱可以重来， 有多少人值得等待❤"
    },
    {
        "yeziyu_name": "好像掉进爱情海里",
        "yeziyu_data": "❤️我想要住进你心里❤️"
    },
    {
        "yeziyu_name": "我和春天有个约会",
        "yeziyu_data": "❤我生而为爱痴迷❤"
    },
    {
        "yeziyu_name": "世界上的另一个我",
        "yeziyu_data": "🎀 秃头姐妹花UPUP🎀"
    },
    {
        "yeziyu_name": "她来听我的演唱会",
        "yeziyu_data": "💕我来听你的演唱会💕"
    },
    {
        "yeziyu_name": "给我一首歌的时间",
        "yeziyu_data": "💞 你唱这首歌的时间刚好爱上你💞"
    },
    {
        "yeziyu_name": "活着是最好的死亡",
        "yeziyu_data": "💔 把绝望活成爱你的渴望💔"
    },
    {
        "yeziyu_name": "未给姐姐寄出的信",
        "yeziyu_data": "一切都会好的～ 会好的～"
    },
    {
        "yeziyu_name": "我的一个道姑朋友",
        "yeziyu_data": "❤你眼中有柔情千种，如脉脉春风冰雪也消融❤"
    },
 
    {
        "yeziyu_name": "我喜欢你你会知道",
        "yeziyu_data": "❤我喜欢你全世界都知道❤"
    },
    {
        "yeziyu_name": "如果爱能早些说出来",
        "yeziyu_data": "❤如果爱能早些说出来～你会不会和我恋爱～"
    },
    {
        "yeziyu_name": "我多喜欢你，你会知道",
        "yeziyu_data": "❤喜欢你已变成习惯难以戒掉❤️"
    },
    {
        "yeziyu_name": "羞答答的玫瑰静悄悄地开",
        "yeziyu_data": "🌹🌹🌹🌹🌹🌹🌹"
    },
    {
        "yeziyu_name": "我喜欢上你时的内心活动",
        "yeziyu_data": "🎵 我喜欢上你时的内心活动🎵"
    },
    {
        "yeziyu_name": "亲爱的你怎么不在我身边",
        "yeziyu_data": "💍 可是我们一直守护着你💍"
    },
    {
        "yeziyu_name": "是什么让我遇见这样的你",
        "yeziyu_data": "💞 是什么让我遇见最好最美的你💞"
    },
    {
        "yeziyu_name": "我是全英雄联盟最骚的骚猪",
        "yeziyu_data": "🎉🎉🎉🎉🎉🎉🎉"
    },
    {
        "yeziyu_name": "浮生未歇",
        "yeziyu_data": "❤再相见❤ 方知浮生未歇❤"
    },
    {
        "yeziyu_name": "我的秘密",
        "yeziyu_data": "❤我心里的秘密是我好像喜欢了你❤"
    },
    {
        "yeziyu_name": "不能说的秘密",
        "yeziyu_data": "❤️最美的不是下雨天， 是曾与你躲过雨的屋檐❤️"
    },
    {
        "yeziyu_name": "修炼爱情",
        "yeziyu_data": "❤忘不了你我投降❤"
    },
    {
        "yeziyu_name": "搁浅",
        "yeziyu_data": "❤我对你的爱永不搁浅❤"
    },
    {
        "yeziyu_name": "年少有为",
        "yeziyu_data": "❤祝你年少有为❤"
    },
    {
        "yeziyu_name": "这里有埋伏",
        "yeziyu_data": "1234~这里有埋伏~"
    },
    {
        "yeziyu_name": "逝去的爱",
        "yeziyu_data": "❤你是我永不逝去的爱❤"
    },
    {
        "yeziyu_name": "停格",
        "yeziyu_data": "爱停格在78622❤"
    },
    {
        "yeziyu_name": "珍重",
        "yeziyu_data": "❤️不肯不可不忍不舍失去你❤️"
    },
    {
        "yeziyu_name": "悟空",
        "yeziyu_data": ""
    },
    {
        "yeziyu_name": "雪落下的声音",
        "yeziyu_data": "❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️❄️"
    },
    {
        "yeziyu_name": "你比从前快乐",
        "yeziyu_data": "❤你天天都要快乐❤"
    },
    {
        "yeziyu_name": "迷迭香",
        "yeziyu_data": "❤️你的嘴角 微微上翘 可爱的无可救药❤️"
    },
    {
        "yeziyu_name": "新房客",
        "yeziyu_data": "❤️沉迷于你的微笑❤️"
    },
    {
        "yeziyu_name": "开到荼蘼",
        "yeziyu_data": "❤对你死心塌地❤"
    },
    {
        "yeziyu_name": "斑马斑马",
        "yeziyu_data": "斑马🦓 斑马🦓 斑马🦓 斑马🦓"
    },
    {
        "yeziyu_name": "虚拟",
        "yeziyu_data": "❤️你是我未曾拥有无法捕捉的亲昵❤️"
    },
    {
        "yeziyu_name": "我对自己开了一枪",
        "yeziyu_data": "❤️只有你能治愈我的伤❤️"
    },
    {
        "yeziyu_name": "我是真的爱上你",
        "yeziyu_data": "❤️你有一双会说话的眼睛❤️ 你的微笑总是让我为你着迷❤️"
    },
    {
        "yeziyu_name": "Letting go",
        "yeziyu_data": "❤️你是我存在的原因❤️"
    },
    {
        "yeziyu_name": "天空",
        "yeziyu_data": "❤️有你的天空挂满笑脸❤️"
    },
    {
        "yeziyu_name": "手写的从前",
        "yeziyu_data": "❤我将你深埋在心里面❤"
    },
    {
        "yeziyu_name": "甘心替代你",
        "yeziyu_data": "❤️经得起忧伤与悲， 只因心中有着你❤️❤ 人美歌甜周二珂, 你的月亮我的珂❤"
    },
    {
        "yeziyu_name": "黄昏",
        "yeziyu_data": "❤有你的黄昏没有黑夜❤"
    },
    {
        "yeziyu_name": "半糖主义",
        "yeziyu_data": "💃💃💃💃💃💃💃💃💃💃💃💃"
    },
    {
        "yeziyu_name": "我只在乎你",
        "yeziyu_data": "❤我只在乎你❤️"
    },
    {
        "yeziyu_name": "东西",
        "yeziyu_data": "❤我愿意陪着你去东和西❤"
    },
    {
        "yeziyu_name": "玻璃之情",
        "yeziyu_data": "❤️你每天都要快乐❤️"
    },
    {
        "yeziyu_name": "江南",
        "yeziyu_data": "❤只因你而留恋这人世间❤"
    },
    {
        "yeziyu_name": "Always online",
        "yeziyu_data": "❤是你删除了我的孤单❤"
    },
    {
        "yeziyu_name": "Beautiful love",
        "yeziyu_data": "❤️我们勇敢的爱着❤️"
    },
    {
        "yeziyu_name": "给我一个理由忘记",
        "yeziyu_data": "❤️给我一个理由忘记 那么爱我的你❤️"
    },
    {
        "yeziyu_name": "走着走着就散了",
        "yeziyu_data": "❤️我们永远不会走散❤️"
    },
    {
        "yeziyu_name": "正方形的圆",
        "yeziyu_data": "❤️我会与你共度笑与伤❤️"
    },
    {
        "yeziyu_name": "慕容雪",
        "yeziyu_data": "❤️谁人能像你感动我❤️"
    },
    {
        "yeziyu_name": "Better me",
        "yeziyu_data": "❤️请一定加倍爱护自己❤️"
    },
    {
        "yeziyu_name": "我相信",
        "yeziyu_data": "❤️我比谁都确定你的心❤️"
    },
    {
        "yeziyu_name": "光阴的故事",
        "yeziyu_data": "❤珂珂永远18岁❤"
    },
    {
        "yeziyu_name": "一路向北",
        "yeziyu_data": "❤你转身向背❤ 侧脸还是很美❤"
    },
    {
        "yeziyu_name": "霍元甲",
        "yeziyu_data": "嚯嚯嚯嚯嚯嚯嚯嚯~"
    },
    {
        "yeziyu_name": "失落沙洲",
        "yeziyu_data": "❤除了你之外的空白❤ 还有谁能来教我爱❤"
    },
    {
        "yeziyu_name": "世界上的另一个我",
        "yeziyu_data": "❤秃头姐妹花upup❤"
    },
    {
        "yeziyu_name": "好感觉",
        "yeziyu_data": "❤️你牵引了我的视线❤️"
    },
    {
        "yeziyu_name": "浪漫手机",
        "yeziyu_data": "❤我就是卸不下对你的喜欢❤"
    },
    {
        "yeziyu_name": "人质",
        "yeziyu_data": "❤我会乖乖的守护着你❤"
    },
    {
        "yeziyu_name": "I love us",
        "yeziyu_data": "❤看 你的笑 你的倦 看不厌❤"
    },
    {
        "yeziyu_name": "我只是睡前想了一下你",
        "yeziyu_data": "❤️我只是睡前想了一下你❤️ 我们的故事未完待续❤️"
    },
    {
        "yeziyu_name": "麦芽糖",
        "yeziyu_data": "❤️我牵着你的手经过❤️ 种麦芽糖的山坡❤️"
    },
    {
        "yeziyu_name": "gotta have you",
        "yeziyu_data": "❤I 've gotta have you❤"
    },
    {
        "yeziyu_name": "你一定要幸福啊",
        "yeziyu_data": "❤珂珂你一定要幸福❤"
    },
    {
        "yeziyu_name": "月牙湾",
        "yeziyu_data": "❤爱你的心不孤单❤"
    },
    {
        "yeziyu_name": "我只是在睡前想了一下你",
        "yeziyu_data": "❤️我只是在睡前想了一下你❤️"
    },
    {
        "yeziyu_name": "知否",
        "yeziyu_data": "❤我喜欢你你知否❤"
    },
    {
        "yeziyu_name": "演员",
        "yeziyu_data": "❤️为了你一切都值得❤️"
    },
    {
        "yeziyu_name": "Perfect",
        "yeziyu_data": "❤you look perfect tonight❤"
    },
    {
        "yeziyu_name": "The scientist",
        "yeziyu_data": "❤you don 't know how lovely you are❤"
    },
    {
        "yeziyu_name": "叶子",
        "yeziyu_data": "🍃🍃🍃🍃🍃🍃"
    },
    {
        "yeziyu_name": "in control",
        "yeziyu_data": "❤️i 'm really in love with you❤"
    },
    {
        "yeziyu_name": "lemon",
        "yeziyu_data": "❤今でもあなたはわたしの光❤"
    },
    {
        "yeziyu_name": "未闻花名",
        "yeziyu_data": "❤だから こうして 梦の中で ずっと永远に最高の思い出を❤"
    },
    {
        "yeziyu_name": "世界上的另一个我",
        "yeziyu_data": "❤秃头姐妹花upup❤"
    },
    {
        "yeziyu_name": "天真有邪",
        "yeziyu_data": "❤我会一直守护天真无邪的你❤"
    },
    {
        "yeziyu_name": "我很好",
        "yeziyu_data": "❤我们永远在一起❤"
    },
    {
        "yeziyu_name": "像我这样的人",
        "yeziyu_data": "❤️像你这样的人❤️ 让我奋不顾身❤️"
    },
    {
        "yeziyu_name": "家后",
        "yeziyu_data": "❤我会牵你的手　 因为我是你的家后❤"
    },
    {
        "yeziyu_name": "卷睫盼",
        "yeziyu_data": "❤️爱是因为你， 美丽被还原❤️"
    },
    {
        "yeziyu_name": "I could be the one",
        "yeziyu_data": "I could be your sea of sand❤️"
    },
    {
        "yeziyu_name": "下雨天",
        "yeziyu_data": "❤️下雨天了怎么办 我好想你❤️"
    },
    {
        "yeziyu_name": "圣诞节",
        "yeziyu_data": "🎄🎄🎄🎄🎄🎄🎄🎄🎄🎄🎄🎄"
    },
    {
        "yeziyu_name": "怎么了",
        "yeziyu_data": "❤️祝福我最爱的 能永远飞翔着❤️"
    },
    {
        "yeziyu_name": "无与伦比的美丽",
        "yeziyu_data": "❤你是这个世界上无与伦比的美丽❤"
    },
    {
        "yeziyu_name": "知足",
        "yeziyu_data": "❤我爱上了你的笑容❤"
    },
    {
        "yeziyu_name": "夏天",
        "yeziyu_data": "❤你的微笑， 就像弯弯的彩虹❤"
    },
    {
        "yeziyu_name": "保留",
        "yeziyu_data": "❤爱你毫无保留❤"
    },
    {
        "yeziyu_name": "中意他",
        "yeziyu_data": "❤️我只中意周二猴❤️❤️ 我只中意周二猴❤️"
    },
    {
        "yeziyu_name": "有一种悲伤",
        "yeziyu_data": "❤你是太阳 照亮我的过往❤"
    },
    {
        "yeziyu_name": "让她降落",
        "yeziyu_data": "❤爱你的心永远不会落寞❤"
    },
    {
        "yeziyu_name": "伤痕",
        "yeziyu_data": "❤爱你是一种沉沦❤"
    },
    {
        "yeziyu_name": "吴哥窟",
        "yeziyu_data": "❤越要退出越向你生命移动❤"
    },
    {
        "yeziyu_name": "Yellow",
        "yeziyu_data": "The stars shine for you"
    },
    {
        "yeziyu_name": "鸭子",
        "yeziyu_data": "❤习惯性只去你的心里❤❤ 习惯性只去你的心里❤"
    },
    {
        "yeziyu_name": "爱笑的眼睛",
        "yeziyu_data": "❤️你的笑别人无法代替❤️❤️ 你的笑别人无法代替❤️"
    },
    {
        "yeziyu_name": "说散就散",
        "yeziyu_data": "❤️我忽略自己就因为遇见你❤️"
    },
    {
        "yeziyu_name": "胡广生",
        "yeziyu_data": "❤走走停停， 我们定在78622❤"
    },
    {
        "yeziyu_name": "绿色",
        "yeziyu_data": "❤你出现时我心里的彩虹 就变成彩色❤"
    },
    {
        "yeziyu_name": "倒数",
        "yeziyu_data": "❤每天身边有你❤ 一点一滴每一天珍惜❤"
    },
    {
        "yeziyu_name": "真的爱你",
        "yeziyu_data": "❤️我是真的爱你❤️"
    },
    {
        "yeziyu_name": "处处吻",
        "yeziyu_data": "❤️你是我路上最美的邂逅❤️"
    },
    {
        "yeziyu_name": "触电",
        "yeziyu_data": "💃🏻 爱的魔力转圈圈"
    },
    {
        "yeziyu_name": "情歌王",
        "yeziyu_data": "❤forever love❤ forever love❤"
    },
    {
        "yeziyu_name": "糖不甩",
        "yeziyu_data": "❤️誰是幸福的愛人❤️ 雲在天❤️ 甜在心❤️"
    },
    {
        "yeziyu_name": "男孩",
        "yeziyu_data": "❤️忘不了 你的爱❤️❤️ 忘不了 你的爱❤️"
    },
    {
        "yeziyu_name": "活着就是最好的死亡",
        "yeziyu_data": "❤️把绝望 活成趁早爱你的渴望❤️ 把绝望 活成趁早爱你的渴望"
    },
    {
        "yeziyu_name": "至少还有你",
        "yeziyu_data": "❤️如果全世界我也可以放弃， 至少还有你值得我去珍惜❤️"
    },
    {
        "yeziyu_name": "原来你什么都不要",
        "yeziyu_data": "💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔"
    },
    {
        "yeziyu_name": "棉花糖",
        "yeziyu_data": "❤️你就是我心中的棉花糖甜蜜的梦想❤️"
    },
    {
        "yeziyu_name": "致姗姗来迟的你",
        "yeziyu_data": "❤️我正在与你相遇的路上马不停蹄❤️"
    },
    {
        "yeziyu_name": "Be with you",
        "yeziyu_data": "❤️想拉着你的手❤️ 感受你的温柔❤️"
    },
    {
        "yeziyu_name": "梦中人",
        "yeziyu_data": "❤你是我的梦中人❤❤ 你是我的梦中人❤❤ 你是我的梦中人❤"
    },
    {
        "yeziyu_name": "你不知道的事",
        "yeziyu_data": "❤️我不会离开你❤️❤️ 我不会离开你❤️❤️ 我不会离开你❤️"
    },
    {
        "yeziyu_name": "去年夏天",
        "yeziyu_data": "❤你一定会活得很精彩❤❤ 你一定会活得很精彩❤"
    },
    {
        "yeziyu_name": "单向箭头",
        "yeziyu_data": "❤你的眼睛 足够温柔❤❤ 你的眼睛 足够温柔❤"
    },
    {
        "yeziyu_name": "听见下雨的声音",
        "yeziyu_data": "❤我听见下雨的声音 想起你用唇语 说爱情❤"
    },
    {
        "yeziyu_name": "侧脸",
        "yeziyu_data": "❤关于你的一切我都想要了解❤"
    },
    {
        "yeziyu_name": "大碗宽面",
        "yeziyu_data": "🍜🍜🍜🍜🍜🍜🍜🍜🍜🍜🍜🍜🍜🍜🍜"
    },
    {
        "yeziyu_name": "像鱼",
        "yeziyu_data": "❤我要记住你的样子❤❤ 我要记住你的样子❤❤ 我要记住你的样子❤"
    },
    {
        "yeziyu_name": "只要平凡",
        "yeziyu_data": "❤不要神的光环 只要你的平凡❤"
    },
    {
        "yeziyu_name": "倒带",
        "yeziyu_data": "❤我会陪你一起看海❤❤ 我会陪你一起看海❤❤ 我会陪你一起看海❤"
    },
    {
        "yeziyu_name": "我们说好的",
        "yeziyu_data": "❤️我们说好绝不放开相互牵的手❤️ 我们说好绝不放开相互牵的手"
    },
    {
        "yeziyu_name": "姗姗",
        "yeziyu_data": "❤️你想哭就哭吧 明天总要微笑啊❤️"
    },
    {
        "yeziyu_name": "不要说话",
        "yeziyu_data": "❤️愿意在角落唱沙哑的歌 再大声也都是给你❤️"
    },
    {
        "yeziyu_name": "寂寞寂寞就好",
        "yeziyu_data": "❤️有你我再不寂寞❤️❤️ 有你我再不寂寞❤️❤️ 有你我再不寂寞❤️"
    },
    {
        "yeziyu_name": "爱要坦荡荡",
        "yeziyu_data": "❤要你很善良 就算对我说谎也温暖❤"
    },
    {
        "yeziyu_name": "雨爱",
        "yeziyu_data": "❤你的呼吸像雨滴渗入我的爱里❤"
    },
    {
        "yeziyu_name": "Forever young",
        "yeziyu_data": "❤️我深爱着这样的你❤️"
    },
    {
        "yeziyu_name": "Mojito",
        "yeziyu_data": "❤️这世界已经因为你甜得过头❤️"
    },
    {
        "yeziyu_name": "走过咖啡屋",
        "yeziyu_data": "你我初次相识在这里❤️ 揭开了相悦的序幕"
    },
    {
        "yeziyu_name": "空心",
        "yeziyu_data": "热爱你是我唯一的信仰❤️"
    },
    {
        "yeziyu_name": "枫叶",
        "yeziyu_data": "🍁 我要的只是你在我身边🍁"
    },
    {
        "yeziyu_name": "多情种",
        "yeziyu_data": "🍁❤️ 78622 是我们短暂的相逢❤️"
    },
    {
        "yeziyu_name": "我（ 蔡依林）",
        "yeziyu_data": "假如我看见你， 还是会爱你❤️"
    },
    {
        "yeziyu_name": "小小（ 戴佩妮）",
        "yeziyu_data": "你在我心里面❤️"
    },
    {
        "yeziyu_name": "嘉宾",
        "yeziyu_data": "今天你妆扮得格外美丽❤️"
    },
    {
        "yeziyu_name": "爱你",
        "yeziyu_data": "因为你　 让我心甘情愿❤️"
    },
    {
        "yeziyu_name": "淋雨一直走",
        "yeziyu_data": "❤️你这颗宝石就该闪烁❤️"
    },
    {
        "yeziyu_name": "这世界那么多人",
        "yeziyu_data": "❤️这世界有那么多人, 多幸运 我有个我们❤️"
    },
    {
        "yeziyu_name": "阿拉斯加海湾",
        "yeziyu_data": "❤️愿世间温情化作一缕风， 代替我拥抱你❤️"
    },
    {
        "yeziyu_name": "想你的夜",
        "yeziyu_data": "❤️想你的夜， 多希望你能在我身边❤️"
    },
    {
        "yeziyu_name": "刻在我心底的名字",
        "yeziyu_data": "❤️你是我刻在心底的名字❤️"
    },
    {
        "yeziyu_name": "飞鸟和蝉",
        "yeziyu_data": "你骄傲地飞远 我栖息的叶片❤️"
    },
    {
        "yeziyu_name": "给电影人的情书",
        "yeziyu_data": "❤️人间不过是你寄身之处 银河才是你灵魂的徜徉之地❤️"
    },
    {
        "yeziyu_name": "兰亭序",
        "yeziyu_data": "❤️无关风月 我题序等你回❤️"
    },
    {
        "yeziyu_name": "伯虎说",
        "yeziyu_data": "❤️公子王孙何必问 和光也同尘❤️"
    },
    {
        "yeziyu_name": "不舍",
        "yeziyu_data": "❤️你是我不愿遗忘的时光 也是我奋不顾身的疯狂❤️"
    },
    {
        "yeziyu_name": "My cookie can",
        "yeziyu_data": "❤️手里心里都要怀着你❤️"
    },
    {
        "yeziyu_name": "当爱已成往事",
        "yeziyu_data": "❤️忘了痛或许可以， 忘了你却太不容易❤️"
    },
    {
        "yeziyu_name": "没有意外",
        "yeziyu_data": "❤️自对自独白睡前发会呆 梦里总有个女孩❤️"
    },
    {
        "yeziyu_name": "星空剪影",
        "yeziyu_data": "❤️听见你的声音轻轻说我爱你 我就愿意放下所有朝你奔去❤️"
    },
    {
        "yeziyu_name": "特别",
        "yeziyu_data": "❤️我深爱过你的特别 所以不后悔❤️"
    },
    {
        "yeziyu_name": "路过人间",
        "yeziyu_data": "❤️路过人间 有幸与你❤️"
    },
    {
        "yeziyu_name": "大眠",
        "yeziyu_data": "❤️我心疼你我当然明白❤️"
    },
    {
        "yeziyu_name": "十字路口",
        "yeziyu_data": "❤️我和你的故事 又有了新的开头❤️"
    },
    {
        "yeziyu_name": "人间惊鸿客",
        "yeziyu_data": "❤️我愿浪迹于青山外， 不问今昔何年❤️"
    },
    {
        "yeziyu_name": "客官不可以",
        "yeziyu_data": "❤️都怪我生的美丽 气质又那么多情❤️"
    },
    {
        "yeziyu_name": "爱你",
        "yeziyu_data": "❤️在我的心里　 你真的就是唯一❤️"
    },
    {
        "yeziyu_name": "有点甜",
        "yeziyu_data": "❤️是你让我的世界从那刻变成粉红色❤️"
    },
    {
        "yeziyu_name": "破茧",
        "yeziyu_data": "❤️守护 你一腔孤勇 哪怕 未来如洪流❤️"
    },
    {
        "yeziyu_name": "心引力",
        "yeziyu_data": "❤️我在等你的出现❤️"
    },
    {
        "yeziyu_name": "热爱105° 的你",
        "yeziyu_data": "❤️Super Idol的笑容都没你的甜 八月正午的阳光都没你耀眼❤️"
    },
    {
        "yeziyu_name": "你不要担心",
        "yeziyu_data": "❤️후회 없이 사랑했노라 말해요❤️"
    },
    {
        "yeziyu_name": "明明就",
        "yeziyu_data": "❤️远方传来风笛 我只在意有你的消息❤️"
    },
    {
        "yeziyu_name": "For ya",
        "yeziyu_data": "❤️所有美好全部come for ya 我的爱也全部come for ya❤️"
    },
    {
        "yeziyu_name": "有些情绪可能和夜晚有关",
        "yeziyu_data": "❤️那些难过的句型 都变成你❤️"
    },
    {
        "yeziyu_name": "错位时空",
        "yeziyu_data": "我愿意在不同的时空守护你❤️"
    },
    {
        "yeziyu_name": "套马杆",
        "yeziyu_data": "❤️你的心海和大地一样宽广❤️"
    },
    {
        "yeziyu_name": "星辰大海",
        "yeziyu_data": "❤️我向你奔赴而来， 你就是星辰大海❤️"
    },
    {
        "yeziyu_name": "四季与你",
        "yeziyu_data": "❤️只想在你身旁把这情歌慢慢唱❤️"
    },
    {
        "yeziyu_name": "女爵",
        "yeziyu_data": "❤️为你封了国境 为你赦了罪❤️"
    },
    {
        "yeziyu_name": "非常替身",
        "yeziyu_data": "❤️让我来替你疯 替你笨 替你欢笑与苦闷❤️"
    },
    {
        "yeziyu_name": "蛊",
        "yeziyu_data": "❤️哎呀我的心， 被你下了蛊❤️"
    },
    {
        "yeziyu_name": "Have a nice day",
        "yeziyu_data": "❤️二珂好甜！！！！ 可爱❤️"
    },
    {
        "yeziyu_name": "呼吸决定",
        "yeziyu_data": "❤️听我说我是真的喜欢你❤️"
    },
    {
        "yeziyu_name": "给朱利安",
        "yeziyu_data": "❤️但是 我已经把我自己放在你那里❤️"
    },
    {
        "yeziyu_name": "言不由衷",
        "yeziyu_data": "❤️愿你永远安康 愿你永远懂得飞翔❤️"
    },
    {
        "yeziyu_name": "无人之岛",
        "yeziyu_data": "❤️如果云层是天空的一封信， 能不能再听一听 听你的声音❤️"
    },
    {
        "yeziyu_name": "梦醒时分",
        "yeziyu_data": "❤️有些事情你现在不必问， 有些人你永远不必等❤️"
    },
    {
        "yeziyu_name": "当冬夜渐暖",
        "yeziyu_data": "❤️一百次相爱， 只要有一次的绚烂❤️"
    },
    {
        "yeziyu_name": "专属天使",
        "yeziyu_data": "❤️没有谁能取代你在我心上❤️"
    },
    {
        "yeziyu_name": "平凡的一天",
        "yeziyu_data": "❤️这是最平凡的一天啊❤️"
    },
    {
        "yeziyu_name": "清风徐来",
        "yeziyu_data": "❤️清风徐来， 水波不兴❤️"
    },
    {
        "yeziyu_name": "隐形人",
        "yeziyu_data": "❤️给你我的体温 好帮你驱走寒冷 看不见也能感受心疼❤️"
    },
    {
        "yeziyu_name": "我是女生",
        "yeziyu_data": "❤️你是女生 漂亮的女生❤️"
    },
    {
        "yeziyu_name": "当",
        "yeziyu_data": "❤️你的温柔是我今生最大的守候❤️"
    },
    {
        "yeziyu_name": "怎么唱情歌",
        "yeziyu_data": "❤️至少我记得 那些美好的❤️"
    },
    {
        "yeziyu_name": "借口",
        "yeziyu_data": "陪你一直走到最后❤️"
    },
    {
        "yeziyu_name": "会呼吸的痛",
        "yeziyu_data": "❤️没看你脸上 张扬过哀伤 那是种多么 寂寞的倔强❤️"
    },
    {
        "yeziyu_name": "恋爱循环",
        "yeziyu_data": "❤️あなたが笑っている それだけで笑颜になる❤️"
    },
    {
        "yeziyu_name": "告诉我",
        "yeziyu_data": "❤️告诉我 你不是真的离开我❤️"
    },
    {
        "yeziyu_name": "相信和你遇见",
        "yeziyu_data": "❤️相信有一天你微笑出现 会给我最美的遇见❤️"
    },
    {
        "yeziyu_name": "连名带姓",
        "yeziyu_data": "❤️我且爱且走 其实在等你❤️"
    },
    {
        "yeziyu_name": "慢冷",
        "yeziyu_data": "❤️浪漫让你温柔 也让你最惹人 泪流❤️"
    },
    {
        "yeziyu_name": "飞云之下",
        "yeziyu_data": "❤️我也承认我还是会想你❤️"
    },
    {
        "yeziyu_name": "星座",
        "yeziyu_data": "❤️我为了了解爱的神秘下定决心❤️"
    },
    {
        "yeziyu_name": "花田错",
        "yeziyu_data": "❤️醉 怎么会喝醉 美 因为你的美❤️"
    },
    {
        "yeziyu_name": "Last dance",
        "yeziyu_data": "❤️所以暂时将你眼睛闭了起来 可以慢慢滑进我的心怀❤️"
    },
    {
        "yeziyu_name": "霓虹甜心",
        "yeziyu_data": "❤️你是注定派给我的天使❤️"
    },
    {
        "yeziyu_name": "你要跳舞吗",
        "yeziyu_data": "❤️每当浪潮来临的时候 你会不会也伤心❤️"
    },
    {
        "yeziyu_name": "葡萄成熟时",
        "yeziyu_data": "❤️日后 尽量别教今天的泪白流❤️"
    },
    {
        "yeziyu_name": "The show",
        "yeziyu_data": "❤️Life is a maze, and love is a riddle❤️"
    },
    {
        "yeziyu_name": "所念皆星河",
        "yeziyu_data": "❤️无垠的宇宙 浩瀚的选择 你是最亮那颗❤️"
    },
    {
        "yeziyu_name": "倾城",
        "yeziyu_data": "❤️传说中痴心的眼泪会倾城❤️"
    },
    {
        "yeziyu_name": "Baby",
        "yeziyu_data": "❤️we would never, ever, ever be apart❤️"
    },
    {
        "yeziyu_name": "我的新衣",
        "yeziyu_data": "Chua~Chua~我的新衣"
    },
    {
        "yeziyu_name": "Ringringring",
        "yeziyu_data": "❤️拉长耳朵提高警觉 神经细胞全面戒备❤️"
    },
    {
        "yeziyu_name": "夜夜夜夜",
        "yeziyu_data": "❤️我不愿再放纵 也不愿每天每夜每秒飘流❤️"
    },
    {
        "yeziyu_name": "最爱",
        "yeziyu_data": "❤️没法隐藏这份爱 是我深情深似海❤️"
    },
    {
        "yeziyu_name": "越难越爱",
        "yeziyu_data": "❤️无惧世事变改 还是越难越爱❤️"
    },
    {
        "yeziyu_name": "团子大家族",
        "yeziyu_data": "❤️あかちゃんだんごは いつもしあわせのなかで❤️"
    },
    {
        "yeziyu_name": "私奔到月球",
        "yeziyu_data": "❤️一二三牵着手四五六抬起头 七八九我们私奔到月球❤️"
    },
    {
        "yeziyu_name": "Free loop",
        "yeziyu_data": "❤️It's hard for me to lose in my life I've found❤️"
    },
    {
        "yeziyu_name": "Try",
        "yeziyu_data": "❤️You don't have to change a single thing❤️"
    },
    {
        "yeziyu_name": "Can't take my eyes off you ",
        "yeziyu_data": "❤️ Can't take my eyes off you❤️"
    },
    {
        "yeziyu_name": "Thank you",
        "yeziyu_data": "❤️all I see is you❤️"
    },
    {
        "yeziyu_name": "萱草花",
        "yeziyu_data": "❤️把它别在你的发梢捧在我心上❤️"
    },
    {
        "yeziyu_name": "你被写在我的歌里",
        "yeziyu_data": "❤️忧伤有时候竟被你调味得像颗糖❤️"
    },
    {
        "yeziyu_name": "浣溪沙",
        "yeziyu_data": "❤️无可奈何花落去，似曾相识燕归来❤️（二珂新歌 浣溪沙 QQ音乐多多收听评论"
    },
    {
        "yeziyu_name": "相信和你遇见",
        "yeziyu_data": "❤️相信有一天你微笑出现 会给我最美的遇见❤️（二珂新歌 相信和你遇见 网易云多多收听评论"
    },
    {
        "yeziyu_name": "画",
        "yeziyu_data": "❤️我把你画成花 未开的一朵花 再把思念一点一滴画成雨落下❤️"
    },
    {
        "yeziyu_name": "原来你什么都不想要",
        "yeziyu_data": "❤️在你身后是我一辈子的骄傲❤️"
    },
    {
        "yeziyu_name": "善变",
        "yeziyu_data": "❤️只怪有你的从前 美的太过惊艳❤️"
    },
    {
        "yeziyu_name": "无人知晓",
        "yeziyu_data": "❤️你的心酸隐忍我都知晓❤️"
    },
    {
        "yeziyu_name": "海底",
        "yeziyu_data": "❤️灵魂没入寂静 无人将你吵醒❤️"
    },
    {
        "yeziyu_name": "Day by day",
        "yeziyu_data": ""
    },
    {
        "yeziyu_name": "勾指起誓",
        "yeziyu_data": "❤️你是三千美丽世界里 我的一瓢水❤️"
    },
    {
        "yeziyu_name": "爱你不是两三天",
        "yeziyu_data": "❤️爱你不是两三天 每天却想你很多遍❤️"
    },
    {
        "yeziyu_name": "醉乡记",
        "yeziyu_data": "❤️惟愿你笑容明亮，也算不负时光❤️（《醉乡记》二珂 QQ音乐欢迎收听评论"
    },
    {
        "yeziyu_name": "不留",
        "yeziyu_data": "❤️我把心给了你，再也没有什么牵挂❤️"
    },
    {
        "yeziyu_name": "菊花台",
        "yeziyu_data": "❤️你的影子剪不断 徒留我孤单在湖面成双❤️"
    },
    {
        "yeziyu_name": "Melody",
        "yeziyu_data": "❤️我永远不能忘记 你是多么的美丽❤️"
    },
    {
        "yeziyu_name": "New boy",
        "yeziyu_data": "❤️18岁是天堂 你甜得像糖❤️"
    },
    {
        "yeziyu_name": "平凡之路",
        "yeziyu_data": "❤️我曾经跨过山和大海 也穿过人山人海❤️"
    },
    {
        "yeziyu_name": "美人鱼（周杰伦）❤️思念成了仅存的那一切 缺氧的感觉❤️"
    },
    {
        "yeziyu_name": "我是一只鱼",
        "yeziyu_data": "🐬需要你，我是一只鱼🐬"
    },
    {
        "yeziyu_name": "雅俗共赏",
        "yeziyu_data": "❤️你就是我一直在找的姑娘❤️"
    },
    {
        "yeziyu_name": "彩虹的微笑",
        "yeziyu_data": "❤️彩虹是微笑的脸 难过就抬起头大声唱❤️"
    },
    {
        "yeziyu_name": "真爱你的云",
        "yeziyu_data": "❤️因为风轻轻吹着所以我想念你了❤️"
    },
    {
        "yeziyu_name": "未闻花名",
        "yeziyu_data": "❤️また出会えるのを信じて❤️"
    },
    {
        "yeziyu_name": "寓言",
        "yeziyu_data": "❤️你就是我的寓言❤️"
    },
    {
        "yeziyu_name": "爱我的资格",
        "yeziyu_data": "❤️我只看着你 想着你 只有你❤️"
    },
    {
        "yeziyu_name": "你要的爱",
        "yeziyu_data": "❤️你是我的那个唯一❤️"
    },
    {
        "yeziyu_name": "年轮说",
        "yeziyu_data": "❤️了解这个你 沉迷这个你 时间暂停 再继续❤️"
    },
    {
        "yeziyu_name": "我（张国荣）",
        "yeziyu_data": "❤️我就是我 是颜色不一样的烟火❤️"
    },
    {
        "yeziyu_name": "亲爱的旅人啊",
        "yeziyu_data": "❤️开往未来的路上 没有人会再回返❤️"
    },
    {
        "yeziyu_name": "白色风车",
        "yeziyu_data": "❤️爱你并不孤独 不会再让你哭❤️"
    },
    {
        "yeziyu_name": "蒲公英的约定",
        "yeziyu_data": "❤️说好要一起旅行 是你如今 唯一坚持的任性❤️"
    },
    {
        "yeziyu_name": "雨",
        "yeziyu_data": "❤️转身朝着你的方向，没有任何墙能阻挡这太阳❤️"
    },
    {
        "yeziyu_name": "世间美好与你环环相扣",
        "yeziyu_data": "❤️穿越人海 只为与你相拥❤️"
    },
    {
        "yeziyu_name": "真的吗",
        "yeziyu_data": "❤️爱情没有太多理由 可以不用要求❤️"
    }
    ],
        yeziyu_datat = [],  //过滤后的新数组
        yeziyu_intervalTime = localStorage.getItem('yeziyu_intervalTime'), //发送间隔
        yeziyu_totalTime = localStorage.getItem('yeziyu_totalTime'), //总时长
        yeziyu_name = '',   //查询条件
        yezi_item = '',     //计时器
        yeziyu_colorLength=0,   //获取的弹幕颜色个数
        yeziyu_colorOffset=0;   //发送时点击改变弹幕颜色的数
    function yeziyu_init() {
        if (!yeziyu_urlBool()) return false
        yeziyu_addUi()
        yeizyu_btnNameFn()
        $yeziyu('#yeziyu_btn_suspend').on('click', function () {
            yeizyu_buttonFn()
        })
        $yeziyu('#yeizyu_input').on('input', function () {
            yeizyu_InputFn()
        })
        $yeziyu('#yeziyu_btn_suspendS').on('click', function () {
            yeizyu_InputDanFn()
        })
        $yeziyu('.yeziyu_numIpt').on('input', function (event) {
            yeziyu_inputNumFn(event)
        })
        $yeziyu('#yeziyu_intervalTime').on('input', function () {
            yeziyu_intervalTimeFn()
        })
        $yeziyu('#yeziyu_totalTime').on('input', function () {
            yeziyu_totalTimeFn()
        })
        $yeziyu('.yeziyu_i').on('click', function () {
            yeziyu_iFn(this)
        })
        $yeziyu('#yeziyu_checkbox').on('change', function () {
            yeziyu_checkboxFn()
        })
    }
    function yeziyu_checkboxFn(){
        $yeziyu('#yeziyu_checkbox').attr('checked',$yeziyu('#yeziyu_checkbox').attr('checked')?false:true)
    }
    function yeziyu_color(){
        if($yeziyu('.FansBarrageSwitcher').length){
            $yeziyu('.FansBarrageSwitcher').click()
            let FansBarrageColor_item=$yeziyu('.FansBarrageColor-item')
            for (let i = 0; i < FansBarrageColor_item.length; i++) {
                let itemClassName = FansBarrageColor_item.eq(i).attr('class');
                if (itemClassName.indexOf("is-lock") == -1) {
                    yeziyu_colorLength++;
                }
            }
        }
    }
    function yeziyu_addUi() {
        if (!yeziyu_urlBool()) return false
        let style = document.createElement('style');
        style.appendChild(document.createTextNode(`
        tbody {
            display: block;
            height: 139px;
            overflow-y: overlay;
            overflow-x: clip;
        }
        table thead, tbody tr {
            display: table;
            width: 100%;
            table-layout: fixed;
        }
        div.yeziyu_div {
            width: 350px;
            height: 354px;
            overflow: auto;
            background-color: #fdfdfd;
            border: 2px solid #ccc;
            border-radius: 19px;
            position: fixed;
            bottom: 0;
            left: 0;
            z-index: 9999999999999999999;
        }
 
        div.yeziyu_div.yeziyu_div_no {
            width: 27px;
            height: 27px;
        }
 
        div.yeziyu_div>.yeziyu_div_div {
            margin: 20px 20px 0px;
        }
 
        div.yeziyu_div>.yeziyu_div_no {
            display: none;
        }
 
        div.yeziyu_div>.yeziyu_i {
            position: absolute;
            right: 0px;
            top: 0px;
            border-radius: 50%;
            width: 25px;
            height: 25px;
            line-height: 21px;
            text-align: center;
            border: 1px solid;
        }
 
        div.yeziyu_divInput {
            margin: 9px 0;
        }
 
        table {
            border-collapse: collapse;
            border-spacing: 0;
        }
 
        td,
        th {
            padding: 0;
            text-align: center;
            vertical-align: middle;
        }
 
        .yeziyu_table {
            border-collapse: collapse;
            border-spacing: 0;
            empty-cells: show;
            border: 1px solid #cbcbcb;
        }
        .yeziyu_table caption {
            color: #000;
            font: italic 85%/1 arial, sans-serif;
            padding: 1em 0;
            text-align: center;
        }
 
        .yeziyu_table td{
            border-left: 1px solid #aaa;
        }
        .yeziyu_table td,
        .yeziyu_table th {
            border-width: 0 0 0 1px;
            font-size: inherit;
            margin: 0;
            overflow: visible;
            padding: .5em 1em;
        }
 
        .yeziyu_table thead {
            background-color: #ccc;
            color: #000;
            text-align: center;
            vertical-align: bottom;
        }
 
        .yeziyu_table tbody tr:nth-child(2n) {
            background-color: #f2f2f2;
        }
 
        .yeziyu_table tbody tr:nth-child(2n+1) {
            background-color: #fff;
        }
 
        .yeziyu_table tbody tr:nth-child(2n+1):hover {
            background-color: #f9f9f9;
        }
 
        .yeizyu_button {
            max-width: 120px;
            background-color: #fedd0a;
            border-color: #fedd0a;
            color: #333;
            position: relative;
            display: inline-block;
            font-size: 12px !important;
            padding: 6px 16px;
            border: 0;
            border-radius: 4px;
            white-space: nowrap;
            text-align: center;
            vertical-align: middle;
            cursor: pointer;
            margin-bottom: 5px;
            box-shadow: inset 0 1px 0 0 rgb(200 200 200 / 40%), 0 1px 1px 0 rgb(0 0 0 / 30%);
            overflow: hidden;
            text-overflow: ellipsis;
            white-space: nowrap;
        }
 
        .yeizyu_button:hover {
            background-color: transparent;
            color: #000;
        }
 
        .yeizyu_input {
            height: 34px;
            padding: 6px 12px;
            font-size: 14px;
            width: 185px;
            margin-right: 14px;
            color: #555;
            background-image: none;
            border: none;
            border-radius: 4px !important;
            transition: border-color ease-in-out 0.15s, box-shadow ease-in-out 0.15s;
            box-sizing: border-box;
            background-color: #fdfdfd;
            box-shadow: inset 0 1px 0 0 rgb(200 200 200 / 40%), 0 1px 1px 0 rgb(0 0 0 / 30%);
        }
 
        .yeizyu_input:focus {
            outline: 0;
            box-shadow: inset 0 1px 1px rgb(200 200 200 / 8%), 0 0 8px rgb(0 0 0 / 30%);
        }
        .yeziyu_numIpt{
            width:120px
        }
        `))
        let yeziyu_div = document.createElement('div');
        yeziyu_div.innerHTML = `
            <div class="yeziyu_div yeziyu_div_no">
                <i class="yeziyu_i yeziyu_div_no" id="yeziyu_i_false" yeziyu_i_bool="yeziyu_false">x</i>
                <i class="yeziyu_i " id="yeziyu_i_true" yeziyu_i_bool="yeziyu_true">✓</i>
                <div class="yeziyu_div_div yeziyu_div_no">
                    <div class="yeziyu_divInput">
                        <input type="number" class="yeizyu_input yeziyu_numIpt" id="yeziyu_intervalTime" placeholder="间隔时长" min='1'>秒
                        <input type="number" class="yeizyu_input yeziyu_numIpt" id="yeziyu_totalTime" placeholder="发送总时长" min='1'>分
                    </div>
                    <div class="yeziyu_divInput">
                        <input type="text" class="yeizyu_input" id="yeizyu_input" placeholder="请输入歌名进行查询"> <button class="yeizyu_button" id="yeziyu_btn_suspend">停止发送</button>
                    </div>
                    <div class="yeziyu_divInput">
                        <input type="text" class="yeizyu_input" id="yeizyu_inputDan" placeholder="请输入弹幕进行发送"> <button class="yeizyu_button" id="yeziyu_btn_suspendS">点击发送</button>
                    </div>
                    <table class="yeziyu_table">
                        <thead>
                            <tr>
                                <th>歌名</th>
                                <th>点击发送弹幕</th>
                            </tr>
                        </thead>
                        <tbody id="yeziyu_tbody">
                            <tr>
                                <td colspan="2">无匹配数据</td>
                            </tr>
                        </tbody>
                    </table>
                    <form >
                        <label for="yeziyu_checkbox"><input type="checkbox" name="sex" id="yeziyu_checkbox" checked value/>自动变色</label>
                  </form>
                </div>
            </div>`;
        document.head.appendChild(style);
        $yeziyu('body')[0].appendChild(yeziyu_div);
        if (yeziyu_intervalTime) {
            $yeziyu("#yeziyu_intervalTime").val(yeziyu_intervalTime)
        }
        if (yeziyu_totalTime) {
            $yeziyu("#yeziyu_totalTime").val(yeziyu_totalTime)
        }
    }
 
    function yeziyu_tdBtnFn(yeziyu_str) {
        yeizyu_buttonFn()
        if (!yeziyu_intervalTime) {
            alert('选择间隔时间，未清除数据的情况下一次就好')
        } else if (!yeziyu_totalTime) {
            alert('选择发送总时长，未清除数据的情况下一次就好')
        } else if (!yeziyu_str.length) {
            alert('数据错误')
        } else {
            if($yeziyu('#yeziyu_checkbox').attr('checked')){
                if(!yeziyu_colorLength){
                    yeziyu_color()
                }
                yeziyu_colorOffset=0
            }
            douyuFn(yeziyu_str)
            yezi_item = setInterval(() => {
                douyuFn(yeziyu_str)
            }, yeziyu_intervalTime * 1000);
            setTimeout(() => {
                yeizyu_buttonFn()
            }, yeziyu_totalTime * 60 * 1000)
        }
    }
 
    function douyuFn(yeziyu_str) {
        if (!yeziyu_urlBool()) return false
        if($yeziyu('#yeziyu_checkbox').attr('checked')){
            if(yeziyu_colorLength!=0){
                if(yeziyu_colorOffset>(yeziyu_colorLength-1)){
                    yeziyu_colorOffset=0
                }
                $yeziyu('.FansBarrageSwitcher').click()
                let FansBarrageColor_item=$yeziyu('.FansBarrageColor-item')
                if(FansBarrageColor_item!=undefined){
                    FansBarrageColor_item.eq(yeziyu_colorOffset).click()
                    yeziyu_colorOffset++
                }
            }
        }
        $yeziyu('.ChatSend-txt').val(yeziyu_str);
        $yeziyu('.ChatSend-button').click()
    }
    //停止发送
    function yeizyu_buttonFn() {
        if (yezi_item) {
            clearInterval(yezi_item)
            yezi_item = ''
        }
    }
    //每次发送时间间隔改变
    function yeziyu_intervalTimeFn() {
        yeziyu_intervalTime = $yeziyu('#yeziyu_intervalTime').val()
        localStorage.setItem('yeziyu_intervalTime', yeziyu_intervalTime)
    }
    //每次发送总时长改变
    function yeziyu_totalTimeFn() {
        yeziyu_totalTime = $yeziyu('#yeziyu_totalTime').val()
        localStorage.setItem('yeziyu_totalTime', yeziyu_totalTime)
    }
    function yeizyu_InputDanFn() {
        yeziyu_tdBtnFn($yeziyu("#yeizyu_inputDan").val())
    }
    //搜索框input事件
    function yeizyu_InputFn() {
        if (!yeziyu_urlBool()) return false
        yeziyu_name = $yeziyu("#yeizyu_input").val()
        let inHtml = ''
        yeziyu_datat = yeziyu_data.filter((item) => {
            return item.yeziyu_name.indexOf(yeziyu_name) >= 0
        })
        if (yeziyu_datat.length > 0) {
            for (let i = 0; i < yeziyu_datat.length; i++) {
                inHtml += `<tr><td>${yeziyu_datat[i].yeziyu_name}</td><td>
            <button class="yeizyu_button yeizyu_button_d" title=${yeziyu_datat[i].yeziyu_data} yeziyu_dataItem ="${yeziyu_datat[i].yeziyu_data}">
            ${yeziyu_datat[i].yeziyu_data}
            </button>
            </td></tr>`
            }
        } else {
            inHtml += `<tr><td colspan="2">无匹配数据</td></tr>`
        }
        $yeziyu('#yeziyu_tbody').html(inHtml)
        yeizyu_btnNameFn()
    }
    //过滤渲染
    function yeizyu_btnNameFn() {
        if (!yeziyu_urlBool()) return false;
        $yeziyu('.yeizyu_button_d').on('click', function () {
            yeziyu_tdBtnFn(this.getAttribute('yeziyu_dataItem'))
        })
    }
    // 收缩
    function yeziyu_iFn(thit) {
        let bool = thit.getAttribute("yeziyu_i_bool")
        if (bool == "yeziyu_true") {
            $yeziyu("#yeziyu_i_false").attr('class', 'yeziyu_i ')
            $yeziyu("#yeziyu_i_true").attr('class', 'yeziyu_i yeziyu_div_no')
            $yeziyu(".yeziyu_div_div").attr('class', 'yeziyu_div_div')
            $yeziyu(".yeziyu_div").attr('class', 'yeziyu_div')
 
        } else {
            $yeziyu("#yeziyu_i_false").attr('class', 'yeziyu_i yeziyu_div_no')
            $yeziyu("#yeziyu_i_true").attr('class', 'yeziyu_i')
            $yeziyu(".yeziyu_div_div").attr('class', 'yeziyu_div_div yeziyu_div_no')
            $yeziyu(".yeziyu_div").attr('class', 'yeziyu_div yeziyu_div_no')
        }
    }
    function yeziyu_inputNumFn(event) {
        event.target.value = event.target.value.replace(/\-/g, "");
    }
    function yeziyu_urlBool() {
        let yeziyu_url = window.parent.location.href;
        // let yeziyu_url = "https://www.douyu.com/78622"
        if (yeziyu_url.indexOf('78622') == -1) {
            return false
        } else {
            return true
        }
    }
    yeziyu_init()
})();