// ==UserScript==
// @name         江苏网上报名辅助系统
// @namespace    
// @version      1.0
// @description  江苏网上报名审核端辅助检测系统
// @author       Mr.Sang
// @match        http://sangfor.40e187e63e7add63e4b9134699c9f5fa.com:8002/*
// @icon         
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/435031/%E6%B1%9F%E8%8B%8F%E7%BD%91%E4%B8%8A%E6%8A%A5%E5%90%8D%E8%BE%85%E5%8A%A9%E7%B3%BB%E7%BB%9F.user.js
// @updateURL https://update.greasyfork.org/scripts/435031/%E6%B1%9F%E8%8B%8F%E7%BD%91%E4%B8%8A%E6%8A%A5%E5%90%8D%E8%BE%85%E5%8A%A9%E7%B3%BB%E7%BB%9F.meta.js
// ==/UserScript==

(function () {

    console.log('----- Start');

    if (document.querySelector("#ui_titlebar_cap").innerHTML == "审核考生信息"){

        var arr = [];
        //1
        arr["中文文秘类"] = ["文艺学","语言学及应用语言学","汉语言文字学","中国古典文献学","中国古代文学","中国现当代文学","中国少数民族语言文学（分语族）","比较文学与世界文学","新闻学","传播学","新闻与传播","史学理论及史学史","考古学及博物馆学","历史地理学","历史文献学（含敦煌学、古文字学）","哲学","专门史","中国古代史","中国近现代史","世界史","出版","学科教学（历史）","学科教学（语文）","中国文学与文化","中国语言文学","汉语国际教育","中国史","考古学","新闻传播学","文物与博物馆","科学技术史","美学","思想政治教育","马克思主义理论","中共党史","汉语言文学","汉语言","对外汉语","中国少数民族语言文学（可注明藏、蒙、维、朝、哈等语言文学）","古典文献","中国语言文化","应用语言学","古典文献学","新闻学","广播电视新闻","广播电视编导","广播电视新闻学","广告学","编辑出版学","传播学","媒体创意","广播电视学","网络与新媒体","数字出版","秘书学","历史学","哲学","世界史","世界历史","考古学","博物馆学","文物与博物馆学","文物保护技术","汉语国际教育","文物鉴赏与修复","高级文秘","汉语言文学教育","文秘教育","思想政治教育","新媒体与信息网络","戏剧影视文学","播音与主持艺术","马克思主义理论","汉语","文物鉴定与修复","文化事业管理","文化市场经营与管理","中国少数民族语言文化","影视广告","新闻采编与制作","电视节目制作","新闻与传播","网络新闻与传播","信息传播与策划","传媒策划与管理","文秘","医学文秘","文秘速录","文化创意与策划","涉外文秘","文秘与办公自动化"];
        //3
        arr["法律类"] = ["法学理论","法律史","宪法学与行政法学","刑法学","民商法学（含：劳动法学、社会保障法学）","诉讼法","诉讼法学","经济法学","环境与资源保护法学","国际法学（含：国际公法、国际私法、国际经济法）","军事法学","法学","法律","法律硕士","法律（法学）","法律（非法学）","法律硕士（法学）","法律硕士（非法学）","知识产权法学","国际法","经济法","比较法学","法学","知识产权","监狱学","律师","知识产权法","民商法","法律","法学（法务会计）","海商法学","司法助理","法律文秘","司法警务","法律事务","书记官","刑事执行","民事执行","行政执行","刑事侦查技术","司法鉴定技术","安全防范技术","司法信息技术","司法信息安全","经济法律事务","海关国际法律条约与公约","检查事务","法律服务管理"];
        //4
        arr["社会政治类"] = ["马克思主义哲学","中国哲学","外国哲学","逻辑学","伦理学","美学","宗教学","科学技术哲学","宗教哲学","哲学","政治学理论","政治学","中外政治制度","科学社会主义与国际共产主义运动","中共党史（含：党的学说与党的建设）","国际政治","国际关系","外交学","社会学","人口学","人才学","人类学","民俗学（含：中国民间文学）","社会保障","民族学","中国少数民族经济","中国少数民族史","中国少数民族艺术","马克思主义基本原理","马克思主义民族理论与政策","马克思主义发展史","马克思主义中国化研究","国外马克思主义研究","思想政治教育","中国近现代史基本问题研究","马克思主义理论","史学理论及史学史","考古学及博物馆学","文物与博物馆","历史地理学","历史文献学","专门史","中国古代史","中国近现代史","世界史","图书馆学","情报学","档案学","图书情报","图书情报与档案管理","社会工作","中国史","考古学","公共管理","行政管理","哲学","逻辑学","宗教学","伦理学","政治学与行政学","国际政治","外交学","思想政治教育","国际文化交流","国际政治经济学","国际事务","国际事务与国际关系","政治学、经济学与哲学","社会学","社会工作","家政学","人类学","女性学","民族学","科学社会主义与国际共产主义运动","中国革命史与中国共产党党史","科学社会主义","中国共产党党史","中国共产党历史","历史学","世界历史","考古学","博物馆学","文物保护技术","图书馆学","档案学","信息资源管理","劳动与社会保障","劳动和社会保障","档案管理","社会工作与管理","马克思主义理论","外国语言与外国历史","公共事业管理","行政管理","广播电视学","新闻学","社会工作","社区管理与服务","青少年工作与管理","社会福利事业管理","家政服务","老年服务与管理","社区康复","听力语言康复技术","音乐康复技术","心理咨询","科技成果中介服务","职业中介服务","现代殡仪技术与管理","戒毒康复","涉外事务管理","公共关系","人民武装","妇女工作与管理","体育场馆管理","商检技术","图书档案管理","家政管理","运动康复","社区矫正","档案管理"];
        //5
        arr["经济类"] = ["政治经济学", "经济思想史", "经济史", "西方经济学", "世界经济", "人口、资源与环境经济学", "国民经济学", "区域经济学", "财政学（含税收学）", "税务", "金融学（含保险学）", "产业经济学", "国际贸易学", "劳动经济学", "统计学", "数量经济学", "国防经济", "技术经济及管理", "农业经济管理", "林业经济管理", "农林经济管理", "渔业经济管理", "教育经济与管理", "应用统计", "金融", "保险", "资产评估", "国际贸易", "农村与区域发展", "中国少数民族经济", "国际商务", "理论经济学", "应用经济学", "企业管理", "工商管理", "工商管理硕士", "审计", "物流管理", "工程管理", "会计", "会计学", "金融学", "会计与金融", "经济学", "国际经济与贸易", "财政学", "金融学", "国民经济管理", "贸易经济", "保险", "金融工程", "税务", "信用管理", "网络经济学", "体育经济", "投资学", "环境资源与发展经济学", "资源与环境经济学", "海洋经济学", "国际文化贸易", "会展经济与管理", "经济与行政管理", "经济与工商管理", "工商管理", "经济统计学", "商务经济学", "能源经济", "保险学", "金融数学", "经济与金融", "农业经济管理", "林业经济管理", "农林经济管理", "农村区域发展", "渔业经济管理", "资产评估", "现代农业管理", "金融管理", "国际市场营销", "金融保险", "国际贸易", "市场营销", "金融", "统计学", "税收学", "国际商务", "电子商务", "工程造价", "工程管理", "财务管理", "应用统计学", "体育经济与管理", "物流管理", "会计", "会计学", "互联网金融", "经济与金融", "财政", "财务管理", "税务", "金融管理与实务", "国际金融", "金融与证券", "金融保险", "金融与保险", "保险实务", "医疗保险实务", "资产评估", "资产评估与管理", "证券投资与管理", "投资与理财", "证券与期货", "经济管理", "经济信息管理", "国际经济与贸易", "国际贸易实务", "国际商务", "商务经纪与代理", "产权交易与实务", "信用管理", "农村合作金融", "机动车保险实务", "农业经济管理", "林业经济管理", "渔业经济管理", "农林经济管理", "林业经济信息管理", "农村经济管理", "国际航运保险与公估", "经济与行政管理", "国际贸易", "经济贸易", "物流管理"];
        //6
        arr["公共管理类"] = ["管理科学与工程","行政管理","社会医学与卫生事业管理","教育经济与管理","社会保障","社会工作","社会学","土地资源管理","图书馆学","情报学","档案学","农业经济管理","林业经济管理","渔业经济管理","公共管理","图书情报与档案管理","图书情报","人力资源管理","工程管理","项目管理","教育领导与管理","农村与区域发展","教育管理","公共管理硕士","工商管理","旅游管理","工商管理硕士","政治学理论","企业管理","农村发展","政治学","农业管理","物流工程与管理","工业工程与管理","国民经济管理","信用管理","海关管理","海事管理","海洋管理","边防管理","公安管理学","管理科学","信息管理与信息系统","管理科学工程","人力资源管理","行政管理","政治学与行政学","公共事业管理","工商管理","市场营销","旅游管理","社会保障","劳动与社会保障","劳动和社会保障","土地资源管理","公共关系学","公共政策学","城市管理","公共管理","文化产业管理","文化艺术事业管理","会展经济与管理","国防教育与管理","航运管理","劳动关系","公共安全管理","体育管理","体育产业管理","食品经济管理","农业经济管理","现代农业管理","林业经济管理","渔业经济管理","农林经济管理","农村区域发展","信息资源管理","资源环境与城乡规划管理","农村行政管理","乡镇企业管理","城市管理与监察","工商行政管理","管理科学与工程","交通管理","图书馆学","档案学","保密管理","管理工程","档案管理","卫生事业管理","经济与行政管理","工程管理","社会工作","社会学","行政管理学","财政学","酒店管理","体育经济与管理","物流管理","房地产开发与管理","物业管理","城乡规划","土地资源管理","邮政管理","国防动员与国防教育","健康服务与管理","社会工作","社区管理与服务","青少年工作与管理","社会福利事业管理","公共关系","商检技术","人民武装","涉外事务管理","公共事务管理","民政管理","行政管理","行政管理学","人力资源管理","劳动与社会保障","国土资源管理","海关管理","环境规划与管理","文化事业管理","文化市场经营与管理","图书档案管理","体育服务与管理","治安管理","交通管理","警察管理","公共安全管理","防火管理","边境管理","老年服务与管理","现代殡仪技术与管理","农业经济管理","林业经济管理","渔业经济管理","农林经济管理","农村行政管理","农村经济管理","林业经济信息管理","渔业资源与渔政管理","农业技术与管理","林业信息工程与管理","都市林业资源与林政管理","农村行政与经济管理","社会救助","国际质量管理体系认证","卫生监督","卫生信息管理","公共卫生管理","电子政务","经济管理","经济信息管理","灾害救援与管理","客运站务管理","知识产权管理","文化艺术管理","工商行政管理","教育管理","档案管理","经济与行政管理","旅游管理"];
        //7
        arr["工商管理类"] = ["管理科学与工程", "会计学", "会计", "会计硕士", "企业管理（含：财务管理；市场营销；旅游管理；技术经济及管理；人力资源管理）", "工程管理", "项目管理", "工商管理, 工商管理硕士", "工业工程", "物流工程", "国际商务", "物流工程与管理", "工业工程与管理", "工业工程", "工程管理", "工程造价", "工程造价管理", "房地产经营管理", "产品质量工程", "项目管理", "工商管理", "市场营销", "财务管理", "人力资源管理", "文化产业管理", "旅游管理", "商品学", "审计学", "电子商务", "物流", "电子商务物流", "物流管理", "物流工程", "国际物流", "物流与供应链管理", "国际商务", "特许经营管理", "连锁经营管理", "资产评估", "商务策划管理", "酒店管理", "物业管理", "物业设施管理", "会计学", "管理科学", "管理科学与工程", "劳动关系", "采购管理", "标准化工程", "质量管理工程", "房地产开发与管理", "保密管理", "会展经济与管理", "体育经济与管理", "金融管理", "国际市场营销", "管理工程", "金融保险", "经济与行政管理", "市场营销教育", "财务会计教育", "销售管理", "商务管理", "电子商务及法律", "国际经济与贸易", "商务英语", "市场营销", "网络营销", "市场开发与营销", "营销与策划", "医药营销", "电子商务", "工商企业管理", "工商行政管理", "商务管理", "连锁经营管理", "物流", "电子商务物流", "物流管理", "物业管理", "旅游管理", "涉外旅游", "导游", "旅行社经营管理", "景区开发与管理", "酒店管理", "餐饮管理", "餐饮管理与服务", "烹饪工艺与营养", "企业资源计划管理", "招商管理", "采购供应管理", "项目管理", "乡镇企业管理", "广告经营与管理", "会展策划与管理", "历史文化旅游", "旅游服务与管理", "休闲服务与管理", "西餐工艺", "经济管理", "经济信息管理", "数字媒体设备管理", "信用管理", "物流园区金融管理", "村镇银行经营管理", "商务信息管理", "合作社经营管理", "客户服务管理", "国际工程物流管理", "拍卖与典当管理", "旅游传媒", "英语导游", "中西面点工艺", "餐饮食品安全", "婚庆服务与管理", "国际质量管理体系认证", "知识产权管理", "古玩艺术品投资管理", "高尔夫球场服务与管理", "运动休闲服务与管理", "心理健康教育", "高尔夫服务与管理", "高尔夫运动技术与管理", "建筑工程管理", "资产评估", "经济与行政管理", "销售管理", "国际商务"];
        //9
        arr["财务财会类"] = ["会计学","财政学（含税收学）","税务","会计","会计硕士","金融","金融硕士","金融学","审计","工商管理","资产评估","应用经济学","财政学","金融学","会计学","财务管理","会计信息技术","财务会计与审计","国际会计","财务会计教育","法学（法务会计）","审计学","审计学（ACCA方向）","会计","金融工程","保险学","经济学","税收学","国际经济与贸易","经济与金融","工商管理","资产评估","国际经济与贸易","贸易经济","互联网金融","保险","财政","财务管理","财务信息管理","会计","会计学","会计电算化","财务电算化","会计与统计核算","会计与审计","审计实务","统计实务","会计信息技术","涉外会计","财会","国际会计","保险","税务","会计信息管理"];
        //11
        arr["统计类"] = ["统计学","系统理论","应用统计","应用统计硕士","概率论与数理统计","数学","流行病与卫生统计学","系统科学","统计学","系统理论","系统科学与工程","应用统计学","经济统计学","经济学","数学与应用数学","金融数学","数据计算及应用","数理基础科学","信息与计算科学","会计与统计核算","统计实务","卫生统计","卫生统计学","卫生财会统计","财务会计统计","财务会计与统计"];
        //12
        arr["审计类"] = ["审计","审计学","审计学","财务会计与审计","审计学（ACCA方向）","会计与审计","审计实务"];
        //17
        arr["计算机类"] = ["计算机系统结构","计算机应用技术","系统工程","计算机技术","计算机科学与技术","计算机科学与技术","电子与计算机工程","空间信息与数字技术","计算机通信工程","电子商务","计算机及应用","通信工程","信息管理与信息系统","数据科学与大数据技术","信息工程","大数据管理与应用","计算机应用技术","计算机多媒体技术","计算机系统维护","计算机硬件与外设","计算机信息管理","图形图像制作","动漫设计与制作","航空计算机技术与应用","广告媒体开发","三维动画设计","计算机音乐制作","嵌入式技术与应用","智能监控技术","数据库开发与管理","计算机速录","文秘与办公自动化","计算机科学教育","计算机应用与维护","计算机应用","计算机软件与理论","软件工程","计算机科学与技术","模式识别与智能系统","计算机应用技术","计算机系统结构","计算机软件","软件工程","计算机应用软件","信息与计算科学","信息管理与信息系统","数字媒体技术","信息技术应用与管理","计算机科学与技术","软件技术","软件测试技术","软件开发与项目管理","游戏软件","网络软件开发技术","软件外包服务","网络空间安全","网络工程","物联网工程","信息安全","计算机科学与技术","信息管理与信息系统","网络空间安全","计算机技术及其应用","计算机网络技术","网络系统管理","计算机网络与安全管理","网站规划与开发技术","数据通信与网络系统","网络数字媒体","物联网应用技术","信息工程与网络技术","计算机网络管理","物理电子学","电路与系统","微电子学与固体电子学","电磁场与微波技术","通信与信息系统","信号与信息处理","电子科学与技术","电子与通信工程","信息与通信工程","计算机科学与技术","控制科学与工程","现代教育技术","集成电路工程","光学工程","农业信息化","控制理论与控制工程","控制工程","模式识别与智能系统","测试计量技术及仪器","仪器科学与技术","水声工程","教育技术学","电子信息","光学","农业工程与信息技术","机械电子工程","计算机技术","电子信息工程","通信工程","计算机通信工程","计算机科学与技术","电子科学与技术","电子信息科学与技术","信息工程","信息显示与光电技术","电路与系统","集成电路设计与集成系统","光电信息工程","广播电视工程","电气信息工程","微电子制造工程","医学信息工程","信息物理工程","智能科学与技术","数字媒体技术","医学影像工程","真空电子技术","电磁场与无线技术","微电子","微电子学","光电信息科学与技术","科技防卫","信息安全","信息科学技术","光电子技术科学","光信息科学与技术","微电子科学与工程","水声工程","电子封装技术","电波传播与天线","数字媒体艺术","光电信息科学与工程","信息管理与信息系统","信息技术应用与管理","会计信息技术","电子工程","电子信息技术","电子信息","生物医学工程","自动化","应用电子技术教育","教育技术学","测控技术与仪器","信息对抗技术","机械电子工程","电信工程及管理","软件工程","电气工程及其自动化","信息对抗技术","信息与通信工程	电子信息工程技术","应用电子技术","电子技术应用","电子测量技术与仪器","电子仪器仪表与维修","电子设备与运行管理","电子声像技术","电子工艺与管理","信息安全技术","图文信息技术","微电子技术","无线电技术","广播电视网络技术","有线电视工程技术","通信技术","移动通信技术","计算机通信","计算机网络技术","程控交换技术","通信网络与设备","通信系统运行管理","光电子技术","智能产品开发","音响工程","电光源技术","电子产品质量检测","飞行器电子装配技术","信息技术应用","无损检测技术","电子信息技术及产品营销","电子表面组装技术","电子组装技术与设备","嵌入式系统工程","电子电路设计与工艺","液晶显示与光电技术","卫星数字技术","通信线路","光纤通信","邮政通信","通讯工程设计与管理","通信工程设计与管理","电信商务","数字媒体技术","物流信息技术","信息技术开发与服务","新能源电子技术","单片机与应用电子技术","通信工程设计与施工","呼叫中心服务与管理","移动通信运营与服务","电信服务与管理","手机检测与维护","通信工程监理","信息工程与网络技术","信息安全与管理","会计信息技术","信息技术","光电技术应用"];
        //18
        arr["计算机（软件）类"] = ["计算机软件与理论","软件工程","计算机科学与技术","模式识别与智能系统","计算机应用技术","计算机系统结构","计算机软件","软件工程","计算机应用软件","信息与计算科学","信息管理与信息系统","数字媒体技术","信息技术应用与管理","计算机科学与技术","软件技术","软件测试技术","软件开发与项目管理","游戏软件","网络软件开发技术","软件外包服务"];
        //19
        arr["计算机（网络管理）类"] = ["网络空间安全","网络工程","物联网工程","信息安全","计算机科学与技术","信息管理与信息系统","网络空间安全","计算机技术及其应用","计算机网络技术","网络系统管理","计算机网络与安全管理","网站规划与开发技术","数据通信与网络系统","网络数字媒体","物联网应用技术","信息工程与网络技术","计算机网络管理"];
        //21
        arr["机电控制类"] = ["电机与电器", "电力系统及其自动化", "高电压与绝缘技术", "电力电子与电力传动", "电工理论与新技术", "控制理论与控制工程", "检测技术与自动化装置", "系统工程", "模式识别与智能系统", "导航、制导与控制", "精密仪器及机械", "测试计量技术及仪器", "控制工程", "电气工程", "控制科学与工程", "农业电气化与自动化", "机械电子工程", "仪器科学与技术", "仪器仪表工程", "农业工程与信息技术", "电子信息", "电气工程及其自动化", "电气工程与自动化", "自动化", "工业电气自动化", "电力工程与管理", "农业电气化与自动化", "测控技术与仪器", "电子信息技术及仪器", "智能电网信息工程", "光源与照明", "微机电系统工程", "轨道交通信号与控制", "过程装备与控制工程", "材料成型及控制工程", "工业自动化", "电气自动化", "电气工程与智能控制", "机械电子工程", "自动化（数控技术）", "机械设计制造及其自动化", "新能源科学与工程", "机电技术教育", "交通运输", "建筑电气与智能化", "木材科学与工程", "机器人工程", "汽车服务工程", "机械工程", "电子科学与技术", "发电厂及电力系统", "电厂设备运行与维护", "电厂热能动力装置", "火电厂集控运行", "小型水电站及电力网", "供用电技术", "电网监控技术", "电力系统继电保护与自动化", "高压输配电线路施工运行与维护", "农村电气化技术", "电厂化学", "机电一体化技术", "电气自动化技术", "生产过程自动化技术", "电力系统自动化技术", "计算机控制技术", "工业网络技术", "检测技术及应用", "理化测试及质检技术", "液压与气动技术", "机电设备维修与管理", "数控设备应用与维护", "自动化生产设备应用", "医用电子仪器与维护", "医学影像设备管理与维护", "输变电工程技术", "冶金设备应用与维护", "电气设备应用与维护", "电力客户服务与管理", "电力电子技术", "核电站动力装置", "风电系统运行维护与检修技术", "电气测控技术", "电气工程技术"];
        //22
        arr["机械工程类"] = ["机械制造及其自动化", "机械电子工程", "机械设计及理论", "车辆工程", "工程热物理", "热能工程", "动力机械及工程", "流体机械及工程", "制冷及低温工程", "化工过程机械", "控制工程", "控制理论与控制工程", "工业设计工程", "控制科学与工程", "机械工程", "工业工程", "农业机械化工程", "精密仪器及机械", "动力工程及工程热物理", "载运工具运用工程", "农业工程与信息技术", "机械", "动力工程", "农业工程", "机械制造及其自动化", "机械电子工程", "机械设计及理论", "车辆工程", "工程热物理", "热能工程", "动力机械及工程", "流体机械及工程", "制冷及低温工程", "化工过程机械", "控制工程", "控制理论与控制工程", "工业设计工程", "控制科学与工程", "机械工程", "工业工程", "农业机械化工程", "精密仪器及机械", "动力工程及工程热物理", "载运工具运用工程", "农业工程与信息技术", "机械", "动力工程", "农业工程", "机械设计制造及其自动化", "机械制造及自动化", "材料成型及控制工程", "工业设计", "过程装备与控制工程", "自动化", "机械工程及自动化", "机械工程及其自动化", "车辆工程", "机械电子工程", "汽车服务工程", "制造自动化与测控技术", "测控技术与仪器", "微机电系统工程", "制造工程", "体育装备工程", "医疗器械工程", "农业机械化及其自动化", "机械工程", "机械工艺技术", "标准化工程", "质量管理工程", "自动化（数控技术）", "数控加工与模具设计", "工业工程", "机电技术教育", "木材科学与工程", "金属材料工程", "热能与动力工程", "飞行器动力工程", "能源与动力工程", "农业工程"];
        //27
        arr["城建规划类"] = ["城乡规划学","城市规划与设计（含：风景园林规划与设计）","设计学","市政工程","建筑历史与理论","建筑设计及其理论","建筑技术科学","城市规划","风景园林","风景园林学","城市与区域规划","建筑学","园林植物与观赏园艺","建筑与土木工程","土木水利","道路与铁道工程","水工结构工程","结构工程","建筑学","城市规划","景观学","风景园林","园艺","园林","城市地下空间工程","景观设计","景观建筑设计","人文地理与城乡规划","城乡规划","资源环境与城乡规划管理","现代园艺","环境设计","历史建筑保护工程","土木工程","给排水科学与工程","道路桥梁与渡河工程","房地产开发与管理","城市管理","水利水电工程","水利工程","交通工程","室内设计技术","环境艺术设计","园林工程技术","城镇规划","城市管理与监察","城镇建设","市政工程技术","建筑设计技术","景观设计","园林规划设计","建筑室内设计"];
        //28
        arr["土地管理类"] = ["地图制图学与地理信息工程","土壤学","地图学与地理信息系统","自然地理学","人文地理学","地理学","土地资源管理","测绘科学与技术","大地测量学与测量工程","摄影测量与遥感","大地测量","地理科学","地理信息系统","地理信息科学","土地资源管理","土地管理","土地资源管理（国土资源与房地产方向）","土地规划与管理","国土整治与规划","土地管理及房地产","土地管理及房地产开发","资源环境与城乡规划管理","地籍测量与土地管理","地籍测量与土地信息学","国土资源管理","国土资源开发与管理","国土规划与整治","土地规划与利用","自然地理与资源环境","人文地理与城乡规划","城市规划","城乡规划","测绘工程","房地产开发与管理","地籍测绘与土地管理信息技术","土地管理与地籍测量","地籍测绘与土地管理","地籍测量与土地管理","地籍测量与土地信息学","国土资源管理","国土资源开发与管理","土地规划与利用"];
        //33
        arr["安全生产类"] = ["安全技术及工程","安全科学与工程","安全工程","矿业工程","防灾减灾工程及防护工程","石油与天然气工程","化工过程机械","采矿工程","安全工程","安全防范工程","消防工程","火灾勘查","雷电防护科学与技术","应急管理","应急技术与管理","防灾减灾科学与工程","特种能源技术与工程","辐射防护与核安全","油气储运工程","化学工程与工艺","采矿工程","工业环保与安全技术","救援技术","安全技术管理","烟花爆竹安全与质量技术","矿井通风与安全","矿山通风与安全","矿井通风与安全技术","安全保卫","城市应急救援辅助决策技术","信息技术与地球物理","化工生产安全技术"];
        //34
        arr["能源动力类"] = ["核能科学与工程","核燃料循环与材料","工程热物理","热能工程","动力工程","制冷及低温工程","流体机械及工程","动力工程及工程热物理","能源动力","供热、供燃气、通风及空调工程","能源与动力工程","能源与环境系统工程","风能与动力工程","新能源科学与工程","热能与动力工程","能源工程及自动化","建筑环境与能源应用工程","建筑环境与设备工程","能源经济","核工程与核技术","热能动力设备与应用","城市热能应用技术","农村能源与环境技术","制冷与冷藏技术","热工检测与控制技术","制冷与空调技术","工业热工控制技术","反应堆与加速器","风能与动力技术","新能源应用技术","节能工程技术","反应堆及加速器技术","光伏发电技术及应用","太阳能应用技术","太阳能光热技术及应用","化学电源技术及应用","建筑新能源工程技术","风力发电设备及电网自动化","新能源发电技术","工业节能管理","太阳能光电应用技术","光伏应用技术"];
        //38
        arr["食品工程类"] = ["制糖工程", "发酵工程", "食品科学", "粮食、油脂及植物蛋白工程", "农产品加工及贮藏工程", "水产品加工及贮藏工程", "营养与食品卫生学", "食品加工与安全", "食品工程", "食品科学与工程", "食品科学与工程", "食品质量与安全", "酿酒工程", "葡萄与葡萄酒工程", "农产品质量与安全", "粮食工程", "乳品工程", "植物资源工程", "食品卫生与营养学", "食品营养与检验教育", "质量管理工程", "食品安全与品控", "营养学", "食品加工技术", "食品营养与检测", "食品贮运与营销", "食品机械与管理", "食品生物技术", "农畜特产品加工", "粮食工程", "食品药品监督管理", "食品卫生检验", "食品分析与检验", "食品加工及管理", "食品检测及管理", "酿酒技术", "粮油储藏与检测技术", "乳品工艺", "食品工艺与检测", "食品工艺技术", "发酵技术", "营养与食品卫生", "技术监督与商检", "营养与配餐", "马铃薯生产加工", "制糖生产技术与管理", "功能性食品生产技术", "食品质量与安全监管", "黄酒酿造", "食品质量与安全", "餐饮食品安全", "食品安全与检测"];
        //41
        arr["农业类"] = ["农业","农业机械化工程","农业水土工程","农业生物环境与能源工程","农业电气化与自动化","作物栽培学与耕作学","作物遗传育种","作物","果树学","蔬菜学","茶学","土壤学","植物营养学","植物病理学","农业昆虫与害虫防治","农药学","农业经济管理","林业经济管理","农林经济管理","渔业经济管理","渔业资源与渔政管理","渔业","水产养殖","植物资源工程","植物学","植物保护","农业推广","农业科技组织与服务","作物安全生产与质量管理","农业资源利用","资源利用与植物保护","农村与区域发展","农村发展","农业工程","园林植物与观赏园艺","园艺","园艺学","草学","作物学","农业工程与信息技术","农业机械化","农业管理","渔业发展","农艺与种业","渔业资源","水产","畜牧学","森林保护学","森林培育","森林经理学","林木遗传育种","农业机械化及其自动化","农业电气化与自动化","农业电气化","农业建筑环境与能源工程","农业水利工程","农业工程","生物系统工程","生物工程","农学","园艺","林学","植物保护","茶学","烟草","植物科学与技术","种子科学与工程","应用生物科学","设施农业科学与工程","草业科学","农业经济","农业经济管理","农林经济管理","林业经济管理","渔业经济管理","渔业资源与渔政管理","农业资源与环境","农村区域发展","现代农业管理","现代园艺","园林","农艺教育","森林保护","生物技术","生物科学","水产养殖学","动物医学","动物科学","作物生产技术","种子生产与经营","设施农业技术","观光农业","园艺技术","茶叶生产加工技术","中草药栽培技术","烟草栽培技术","植物保护","植物检疫","农产品质量检测","农业经济管理","农林经济管理","林业经济管理","渔业经济管理","渔业资源与渔政管理","茶艺","绿色食品生产与经营","绿色食品生产与检测","药用植物栽培加工","食药用菌","农村行政管理","农业技术与管理","农村行政与经济管理","乡镇企业管理","热带作物生产技术","生态农业技术","都市农业装备应用技术","生态与农业气象技术"];
        //44
        arr["医学类"] = ["人体解剖与组织胚胎学", "免疫学", "遗传学", "病原生物学", "病理学与病理生理学", "法医学", "放射医学", "航空、航天与航海医学", "军事预防医学", "内科学（含：心血管病、血液病、呼吸系病、消化系病、内分泌与代谢病、肾病、风湿病、传染病）", "儿科学", "老年医学", "神经病学", "精神病与精神卫生学", "皮肤病与性病学", "影像医学与核医学", "临床检验诊断学", "外科学（含：普外、骨外、泌尿外、胸心外、神外、整型、烧伤、野战外）", "妇产科学", "眼科学", "耳鼻咽喉科学", "肿瘤学", "康复医学与理疗学", "运动医学", "麻醉学", "急诊医学", "医学技术", "口腔基础医学", "口腔临床医学", "中医基础理论", "中医临床基础", "中医医史文献", "方剂学", "中医诊断学", "中医内科学", "中医外科学", "中医骨伤科学", "中医妇科学", "中医儿科学", "中医五官科学", "针灸推拿学", "民族医学", "中西医结合基础", "中西医结合临床", "护理学", "临床医学", "口腔医学", "护理", "特种医学", "基础医学", "法医学", "病理学", "卫生检验与检疫", "预防医学", "卫生检验", "妇幼保健医学", "营养学", "营养与食品卫生", "临床医学", "麻醉学", "医学影像", "医学影像学", "医学检验", "放射医学", "眼视光学", "影视光医学", "康复治疗学", "精神医学", "医学技术", "听力学", "医学实验学", "医学美容技术", "假肢矫形工程", "医学实验技术", "医学检验技术", "医学影像技术", "口腔医学", "口腔修复工艺学", "口腔医学技术", "中医学", "针灸推拿学", "蒙医学", "藏医学", "维医学", "壮医学", "哈医学", "中西医临床医学", "护理学", "全球健康学", "高级护理", "涉外护理", "医学营养", "临床医学", "医学检验技术", "医学生物技术", "医学影像技术", "眼视光技术", "康复治疗技术", "医疗美容技术", "呼吸治疗技术", "医疗仪器维修技术", "医学实验技术", "实验动物技术", "康复工程技术", "临床工程技术", "放射治疗技术", "卫生检验与检疫技术", "口腔医学", "口腔医学技术", "中医学", "蒙医学", "藏医学", "维医学", "傣医学", "针灸推拿", "中医骨伤", "中西医结合", "护理", "助产", "涉外护理", "预防医学"];
        //45
        arr["公共卫生类"] = ["流行病与卫生统计学", "劳动卫生与环境卫生学", "营养与食品卫生学", "少儿卫生与妇幼保健学", "卫生毒理学", "军事预防医学", "公共卫生", "公共卫生与预防医学", "社会医学与卫生事业管理", "卫生检验学", "预防医学", "基础医学", "卫生检验", "卫生检验与检疫", "食品卫生与营养学", "全球健康学", "卫生事业管理", "药事管理", "营养学", "护理学", "妇幼保健医学", "高级护理", "涉外护理", "健康服务与管理", "卫生监督", "卫生信息管理", "公共卫生管理", "卫生检验与检疫技术", "医学文秘", "预防医学", "健康管理"];
        //46
        arr["药学类"] = ["药物化学", "药剂学", "生药学", "药物分析学", "微生物与生化药学", "药理学", "中药学", "药学", "制药工程", "生物与医药", "动物药学", "药学", "中药学", "药物制剂", "中草药栽培与鉴定", "藏药学", "中药资源与开发", "应用药学", "临床药学", "海洋药学", "药事管理", "蒙药学", "药物化学", "药物分析", "中药制药", "生物制药", "制药工程", "药学", "中药", "中药鉴定与质量检测技术", "现代中药技术", "维药学"];

        var assCompanyCode = document.querySelector("#mm1 > tbody > tr:nth-child(1) > td:nth-child(2)").innerHTML;//单位代码
        var assCompany = document.querySelector("#mm1 > tbody > tr:nth-child(2) > td:nth-child(2)").innerHTML;//单位名称
        var assCode = document.querySelector("#mm1 > tbody > tr:nth-child(4) > td:nth-child(2)").innerHTML;//职位代码
        var assMajor = document.querySelector("#mm1 > tbody > tr:nth-child(11) > td:nth-child(2)").innerHTML;//专业
        var assEdu = document.querySelector("#mm1 > tbody > tr:nth-child(13) > td:nth-child(2)").innerHTML;//学历
        var assIsHigh = assEdu.indexOf("研究生");//是否需要研究生
        var assOther = document.querySelector("#mm1 > tbody > tr:nth-child(14) > td:nth-child(2)").innerHTML;//其他
        var assIsPart = assOther.indexOf("党员");//是否需要党员
        var assIsMale = assOther.indexOf("，男性");//是否需要男性
        var assIsNow = assOther.indexOf("应届毕业生");//是否需要应届毕业生

        var stuSex = document.querySelector("#mm2 > tbody > tr:nth-child(6) > td:nth-child(2)").innerHTML;//性别
        var stuBirth = document.querySelector("#mm2 > tbody > tr:nth-child(7) > td:nth-child(2)").innerHTML;//出生日期
        var stuMarry = document.querySelector("#mm2 > tbody > tr:nth-child(11) > td:nth-child(2)").innerHTML;//婚姻状况
        var stuProvince = document.querySelector("#mm2 > tbody > tr:nth-child(14) > td:nth-child(2) > font").innerHTML;//生源地
        var stuIsJS = stuProvince.indexOf("江苏");//是否江苏生源地
        var stuPolitics = document.querySelector("#mm2 > tbody > tr:nth-child(15) > td:nth-child(2)").innerHTML;//政治面貌
        var stuNow = document.querySelector("#mm2 > tbody > tr:nth-child(16) > td:nth-child(2)").innerHTML;//考生现在身份
        var stuIsPart = stuPolitics.indexOf("党员");//是否党员
        var stuOverseasWork = document.querySelector("#mm2 > tbody > tr:nth-child(20) > td:nth-child(2)").innerHTML;//是否有海外工作经历
        var stuOverseasStudy = document.querySelector("#mm2 > tbody > tr:nth-child(21) > td:nth-child(2)").innerHTML;//是否有海外留学经历
        var stuEdu = document.querySelector("#mm2 > tbody > tr:nth-child(24) > td:nth-child(2)").innerHTML;//学历
        var stuIsHigh = stuEdu.indexOf("研究生");//是否是研究生
        var stuDegree = document.querySelector("#mm2 > tbody > tr:nth-child(25) > td:nth-child(2)").innerHTML;//学位
        var stuMajor = document.querySelector("#mm2 > tbody > tr:nth-child(29) > td:nth-child(2)").innerHTML;//毕业专业名称
        var stuGov = document.querySelector("#mm2 > tbody > tr:nth-child(34) > td:nth-child(2) > font").innerHTML;//是否为2019年1月1日以后办理过公务员或参照管理机关（单位）工作人员录用审批（备案）手续的人员
        var stuRelation = document.querySelector("#mm2 > tbody > tr:nth-child(45) > td:nth-child(2) > pre").innerHTML;//社会关系
        var stuAvoid = document.querySelector("#mm2 > tbody > tr:nth-child(46) > td:nth-child(2) > pre").innerHTML;//回避关系

        console.log(' assCode:' + assCode);
        console.log(' assMajor:' + assMajor);
        console.log(' assEdu:' + assEdu);
        console.log(' assOther:' + assOther);

        console.log(' stuSex:' + stuSex);
        console.log(' stuProvince:' + stuProvince);
        console.log(' stuIsJS:' + stuIsJS);
        console.log(' stuPolitics:' + stuPolitics);
        console.log(' stuOverseasWork:' + stuOverseasWork);
        console.log(' stuOverseasStudy:' + stuOverseasStudy);
        console.log(' stuEdu:' + stuEdu);
        console.log(' stuDegree:' + stuDegree);
        console.log(' stuMajor:' + stuMajor);
        console.log(' stuGov:' + stuGov);
        console.log(' stuAvoid:' + stuAvoid);

        //60 61 62 岗位 生源地问题
        if (assCode == '60' || assCode == '61' || assCode == '62') {
            document.querySelector("#mm1 > tbody > tr:nth-child(4) > td.tdc").setAttribute('style', 'background-color:#fbda41');
            if (stuEdu != "硕士研究生" && stuEdu != "博士研究生") {
                if (stuIsJS == -1) {
                    document.querySelector("#mm2 > tbody > tr:nth-child(14) > td").setAttribute('style', 'background-color:#f1939c');
                    alert("该考生属于不是江苏生源的本科学历！请注意");
                }else{
                    document.querySelector("#mm2 > tbody > tr:nth-child(14) > td").setAttribute('style', 'background-color:#57c3c2');
                }
            }else{
                document.querySelector("#mm2 > tbody > tr:nth-child(24) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }
        }

        //判断专业是否符合
        if (assMajor != "不限") {

            //多大类
            if(assMajor.indexOf('，')!=-1){
                var arrTemp = assMajor.split("，");
                var boolTemp = false;
                arrTemp.forEach( function(item){
                    if (arr[item] && arr[item].includes(stuMajor)) {
                        boolTemp =true;
                    }
                } )
                if(boolTemp){
                    document.querySelector("#mm2 > tbody > tr:nth-child(29) > td").setAttribute('style', 'background-color:#57c3c2');
                }else{
                    document.querySelector("#mm2 > tbody > tr:nth-child(29) > td").setAttribute('style', 'background-color:#f1939c');
                    alert("该考生可能不符合专业限制,请注意!");
                }
            }

            //单一大类
            if (arr[assMajor]) {
                if (arr[assMajor].includes(stuMajor)) {
                    document.querySelector("#mm2 > tbody > tr:nth-child(29) > td").setAttribute('style', 'background-color:#57c3c2');
                } else {
                    document.querySelector("#mm2 > tbody > tr:nth-child(29) > td").setAttribute('style', 'background-color:#f1939c');
                    alert("该考生可能不符合专业限制,请注意!");
                }
            }

        }

        //判断学历
        if (assEdu == "本科及以上" ) {
            if(stuEdu == "本科" ||stuEdu == "硕士研究生" ||stuEdu == "博士研究生" ){
                document.querySelector("#mm2 > tbody > tr:nth-child(24) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }else{
                document.querySelector("#mm2 > tbody > tr:nth-child(24) > td.tdc").setAttribute('style', 'background-color:#f1939c');
            }
        }

        //判断是否需要党员
        if (assIsPart != -1 ) {
            if(stuIsPart==-1){
                document.querySelector("#mm2 > tbody > tr:nth-child(15) > td.tdc").setAttribute('style', 'background-color:#f1939c');
                alert("该岗位限制研究生，考生不是研究生，请注意！")
            }else{
                document.querySelector("#mm2 > tbody > tr:nth-child(15) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }
        }

        //判断是否需要男性
        if (assIsMale != -1 ) {
            if(stuSex=="女"){
                document.querySelector("#mm2 > tbody > tr:nth-child(6) > td.tdc").setAttribute('style', 'background-color:#f1939c');
                alert("该岗位限制男性，考生性别不符，请注意！")
            }else{
                document.querySelector("#mm2 > tbody > tr:nth-child(6) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }
        }

        //判断是否需要研究生
        if (assIsHigh != -1 ) {
            if(stuIsHigh == -1){
                document.querySelector("#mm2 > tbody > tr:nth-child(24) > td.tdc").setAttribute('style', 'background-color:#f1939c');
                alert("该岗位限制研究生，考生学历不符，请注意！")
            }else{
                document.querySelector("#mm2 > tbody > tr:nth-child(24) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }
        }

        //判断是否需要应届毕业生
        if ( assIsNow != -1 ) {
            if( stuNow == "应届毕业生" ){
                document.querySelector("#mm2 > tbody > tr:nth-child(16) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }else{

                document.querySelector("#mm2 > tbody > tr:nth-child(16) > td.tdc").setAttribute('style', 'background-color:#f1939c');
                alert("该岗位限制应届毕业生，考生可能不符，请注意！")
            }
        }

        if(!/1\d{10}/.test(stuRelation)){
            alert("该考生“家庭成员及主要社会关系一栏”无手机号，请注意！");
            document.querySelector("#mm2 > tbody > tr:nth-child(45) > td.tdc").setAttribute('style', 'background-color:#f1939c');

        }

        // ———————————————— 一般错误提示

        if (stuEdu == "本科" && (stuDegree == "硕士学位" || stuDegree == "博士学位")) {
            document.querySelector("#mm2 > tbody > tr:nth-child(24) > td").setAttribute('style', 'background-color:#f1939c');
            document.querySelector("#mm2 > tbody > tr:nth-child(25) > td").setAttribute('style', 'background-color:#f1939c');
            alert("该考生学历学位存疑！请注意");
        }
        if (stuEdu == "硕士研究生" && stuDegree != "硕士学位") {
            document.querySelector("#mm2 > tbody > tr:nth-child(24) > td").setAttribute('style', 'background-color:#f1939c');
            document.querySelector("#mm2 > tbody > tr:nth-child(25) > td").setAttribute('style', 'background-color:#f1939c');
            alert("该考生学历学位存疑！请注意");
        }
        if (stuEdu == "博士研究生" && stuDegree != "博士学位") {
            document.querySelector("#mm2 > tbody > tr:nth-child(24) > td").setAttribute('style', 'background-color:#f1939c');
            document.querySelector("#mm2 > tbody > tr:nth-child(25) > td").setAttribute('style', 'background-color:#f1939c');
            alert("该考生学历学位存疑，请注意！");
        }

        // ———————————————— 一般警告提示

        if (stuOverseasWork != "没有") {
            document.querySelector("#mm2 > tbody > tr:nth-child(20) > td.tdc").setAttribute('style', 'background-color:#f1939c');
            alert("该考生可能有海外工作经历，请注意！");
        }else{
            document.querySelector("#mm2 > tbody > tr:nth-child(20) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
        }
        if (stuOverseasStudy != "没有") {
            document.querySelector("#mm2 > tbody > tr:nth-child(21) > td.tdc").setAttribute('style', 'background-color:#f1939c');
            alert("该考生可能有海外求学经历，请注意！");
        }else{
            document.querySelector("#mm2 > tbody > tr:nth-child(21) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
        }

        //无学位
        if (stuDegree == "无" && assCode != '90') {
            document.querySelector("#mm2 > tbody > tr:nth-child(24) > td").setAttribute('style', 'background-color:#f1939c');
            document.querySelector("#mm2 > tbody > tr:nth-child(25) > td").setAttribute('style', 'background-color:#f1939c');
            alert("该考生无学位！请注意");
        }

        if (stuGov == "是") {
            document.querySelector("#mm2 > tbody > tr:nth-child(34) > td").setAttribute('style', 'background-color:#f1939c');
            alert("该考生办理过公务员登记，请注意！");
        }else{
            document.querySelector("#mm2 > tbody > tr:nth-child(34) > td").setAttribute('style', 'background-color:#57c3c2');
        }

        if (stuAvoid.trim() == "无") {
            document.querySelector("#mm2 > tbody > tr:nth-child(46) > td").setAttribute('style', 'background-color:#57c3c2');
        }else{
            document.querySelector("#mm2 > tbody > tr:nth-child(46) > td").setAttribute('style', 'background-color:#f1939c');
            alert("该考生回避关系不是“无”，请注意！");
        }

        if ( stuPolitics == "民主党派"){
            document.querySelector("#mm2 > tbody > tr:nth-child(15) > td:nth-child(2)").setAttribute('style', 'background-color:#f1939c');
            alert("该考生为民主党派，请注意！");
        }

        //公安年龄
        if ( assCompanyCode == "3092200007" ){

            var stuYear =  stuBirth.substring(0,4);
            var stuMonth =  stuBirth.substring(5,7);
            var stuDate = stuBirth.substring(8,10);

            if(stuYear == "1990"){
                if( stuMonth =="11" ){
                    if( stuBirth.substring(8,10)== "01" ){
                        document.querySelector("#mm2 > tbody > tr:nth-child(7) > td:nth-child(2)").setAttribute('style', 'background-color:#f1939c');
                        alert("该考生为1990年11月1日的考生，请注意年龄！");
                    }else{
                        document.querySelector("#mm2 > tbody > tr:nth-child(7) > td:nth-child(2)").setAttribute('style', 'background-color:#57c3c2');
                    }
                }else if( parseInt(stuMonth) < 11 ){
                    document.querySelector("#mm2 > tbody > tr:nth-child(7) > td:nth-child(2)").setAttribute('style', 'background-color:#f1939c');
                    alert("该考生为1990年11月之前的考生，请注意年龄！");
                }else{
                    document.querySelector("#mm2 > tbody > tr:nth-child(7) > td:nth-child(2)").setAttribute('style', 'background-color:#57c3c2');
                }

            }else if(parseInt(stuYear) < 1990){
                document.querySelector("#mm2 > tbody > tr:nth-child(7) > td:nth-child(2)").setAttribute('style', 'background-color:#f1939c');
                alert("该考生为1990年之前的考生，请注意年龄！");
            }else{
                document.querySelector("#mm2 > tbody > tr:nth-child(7) > td.tdc").setAttribute('style', 'background-color:#57c3c2');
            }
        }

        // ———————————————— 审阅提示
        //document.querySelector("#mm1 > tbody > tr:nth-child(4) > td.tdc").setAttribute('style', 'background-color:#fbda41');//职位代码
        //document.querySelector("#mm1 > tbody > tr:nth-child(11) > td.tdc").setAttribute('style', 'background-color:#fbda41');//专业
        //document.querySelector("#mm1 > tbody > tr:nth-child(2) > td.tdc").setAttribute('style', 'background-color:#fbda41');//单位名称
        document.querySelector("#mm2 > tbody > tr:nth-child(3) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//姓名

        if(stuMarry != "未婚"){
            document.querySelector("#mm2 > tbody > tr:nth-child(11) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//婚姻状况
        }
        document.querySelector("#mm2 > tbody > tr:nth-child(24) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//学历
        document.querySelector("#mm2 > tbody > tr:nth-child(25) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//学位
        document.querySelector("#mm2 > tbody > tr:nth-child(26) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//毕业院校
        document.querySelector("#mm2 > tbody > tr:nth-child(27) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//毕业时间
        document.querySelector("#mm2 > tbody > tr:nth-child(29) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;');//毕业专业名称
        document.querySelector("#mm2 > tbody > tr:nth-child(45) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;line-height:2em;');//家庭成员及主要社会关系
        document.querySelector("#mm2 > tbody > tr:nth-child(48) > td:nth-child(2)").setAttribute('style', 'background-color:#fbda41;font-size:14px;line-height:2em;');//考生简历

        //岗位信息
        var parentBox = document.querySelector("#form > table > tbody > tr");
        var tip = document.createElement('td');
        // innerText 只设置文本
        tip.innerText  = "①单位名称：" + assCompany + " ②职位代码："+ assCode + " ③学历：" + assEdu+" ④其他："+ assOther + " ⑤专业："+ assMajor  ;
        document.querySelector("#form > table > tbody > tr > td:nth-child(1) > div > div").setAttribute('style', 'width:100%!important');//职位信息
        tip.setAttribute('style', 'background-color:#fbda41');//职位信息
        parentBox.appendChild(tip);

        document.querySelector("#mm2 > tbody > tr:nth-child(1) > td").setAttribute('style', 'width:180px!important');

        console.log('----- End');
    }
})();