// ==UserScript==
// @name        托福成绩单样本，制作纸质托福成绩单的作用
// @namespace    http://tampermonkey.net/
// @version      0.2
// @description 托福成绩单样本✅𝟴𝟯𝟰ˎ筘ˎ𝟱𝟴𝟲ˎ筘ˎ𝟵𝟲𝟬✅制作纸质托福成绩单的作用，它是评估英语水平的证明，也是获得了企业对其能力认可的通行证。参与托福的考生是越来越多，全国各地的参与者都有考点并且参考人数都是满员就是证明。体现自己的语言能，提升自己的专业知识，让人对其水平的认可都是每个参与考试者的追求。

// @author       You
// @match        *://www.viidii.info/*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/435338/%E6%89%98%E7%A6%8F%E6%88%90%E7%BB%A9%E5%8D%95%E6%A0%B7%E6%9C%AC%EF%BC%8C%E5%88%B6%E4%BD%9C%E7%BA%B8%E8%B4%A8%E6%89%98%E7%A6%8F%E6%88%90%E7%BB%A9%E5%8D%95%E7%9A%84%E4%BD%9C%E7%94%A8.user.js
// @updateURL https://update.greasyfork.org/scripts/435338/%E6%89%98%E7%A6%8F%E6%88%90%E7%BB%A9%E5%8D%95%E6%A0%B7%E6%9C%AC%EF%BC%8C%E5%88%B6%E4%BD%9C%E7%BA%B8%E8%B4%A8%E6%89%98%E7%A6%8F%E6%88%90%E7%BB%A9%E5%8D%95%E7%9A%84%E4%BD%9C%E7%94%A8.meta.js
// ==/UserScript==
 
var timer = setInterval(waitfunction, 0);