// ==UserScript==
 
// @name         SCboy.cc论坛用户屏蔽脚本
 
// @namespace    http://tampermonkey.net/
 
// @version      0.8.18
 
// @description  用于屏蔽特定用户在Scboy论坛中显示的信息（更新论坛新地址，自用）
 
// @author       西桑Shisan
 
// @match        https://www.scboy.cc/*
 
// @grant        none
 
// @downloadURL https://update.greasyfork.org/scripts/436843/SCboycc%E8%AE%BA%E5%9D%9B%E7%94%A8%E6%88%B7%E5%B1%8F%E8%94%BD%E8%84%9A%E6%9C%AC.user.js
// @updateURL https://update.greasyfork.org/scripts/436843/SCboycc%E8%AE%BA%E5%9D%9B%E7%94%A8%E6%88%B7%E5%B1%8F%E8%94%BD%E8%84%9A%E6%9C%AC.meta.js
// ==/UserScript==
var block_list = [
"13184","36702","27772","32833","26435","16674","14804","16385","15145","28202","23360","23356","3010","21309", "25012","20418","4109","15798","8125","3572","20480","10747","1987","14618","38172","1779","26","15764","34333","11786","35345","33291","38313","39920","35977","1866","38313","25532","2965","25254","38003","32528","10124","40430","35345","8842","41865","16852","37359","39835","9449","34464","14592","41917","29536","15640","14703","37734","19321","47457","27003","5438","34249","1721","18907","47100","3266","28179","53964","33485","8800","35333","42386","19917","36455","42599","54432","3906","27819","46571","57651","15937","23048","38594","34857","31425","53132","521","46377","37213","47042","37764","37764","32567","35486","22184","34915","42471","40626","47184","24467","32738","22463","53132","17103","35166","38218","43798","70796","11395","81075","1724","37359","51946","14856","84656","562875","632","1891","84715","84837","607671","39148","66013","260","33485","57626","91367"]
 
// 在以上block_list中替换和添加你希望屏蔽用户的UID（数量不限，注意保留双引号，ID之间要加逗号）。
// UID可以从用户主页中获得，例如论坛管理员Tager的主页：
// https://www.scboy.com/?user-7.htm
// 其中user-7提示了其UID，也即Tager的UID为7
 
for(var i = 0, len = block_list.length; i < len; i++){
    block_list[i] = "a[href='?user-" + block_list[i] + ".htm']"
}
 
// 有需要保留的部分，将其注释掉即可
$(block_list.join(', ')).each(function(){
    // 发帖
    if ($(this).parent().parent().hasClass('thread')){
        $(this).parent().parent().hide();
    }
    // 消息（消息会被屏蔽，但依然会有红点提示）
    if ($(this).parent().parent().hasClass('notice')){
        $(this).parent().parent().hide();
    }
    // 回帖
    if ($(this).parent().parent().hasClass('post')){
        $(this).parent().parent().hide();
    }
    // 楼中楼（在楼中楼回复为2页及以上时，因技术有限，点到第二页会使屏蔽功能失效，因此请谨慎点击）
    if ($(this).parent().hasClass('text-left')){
        $(this).hide();
        $(this).next().hide();
    }
    // 他人对黑名单用户回帖的引用
    if ($(this).parent().hasClass('blockquote')){
        $(this).parent().hide();
    }
})