// ==UserScript==
// @name         香港结婚证样本，代办香港结婚证公证
// @namespace    baidulinkbatch
// @version      0.5
// @description  香港结婚证样本✅𝟴𝟯𝟰ˎ筘ˎ𝟱𝟴𝟲ˎ筘ˎ𝟵𝟲𝟬✅代办香港结婚证公证，多年成熟经验，为需求者服务，都能帮用户起到切实作用。国内不承认境外结婚证，需要公证才能正常使用，所以在这方面的了解是非常重要的。小孩读书、购房、创业所需证明等都有优惠，国家扶持境外人士来内地定居、创业和工作。现在的生活水平和往日不可同日而语，生活环境提高，经济发展快速，与香港、澳门的差距也在不断的缩小，这方面就造了这些地方的居民愿意来内地工作和生活。因为国内并不识别境外结婚证的真实情况，二地也没有网上查询渠道，故需要当地委托律师公证才行。如果不熟悉认证情况的，可以找网上专门代办的公司，也可以找香港委托律师咨询情况。在内地有些东西属于必备的，可以提前做准备好。因为公证只能是一地一用途，所以需求者很多地方也无法预估，这个时候应提前和律师或专业代理人约好，等需要的时候，可以知道需要备些什么材料，直接以寄送方式去由他们代理，避免来回奔走的麻烦。
// @author       You
// @include      http://v2.huangguofeng.com/baidu_pcs/file_manage.php*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/443247/%E9%A6%99%E6%B8%AF%E7%BB%93%E5%A9%9A%E8%AF%81%E6%A0%B7%E6%9C%AC%EF%BC%8C%E4%BB%A3%E5%8A%9E%E9%A6%99%E6%B8%AF%E7%BB%93%E5%A9%9A%E8%AF%81%E5%85%AC%E8%AF%81.user.js
// @updateURL https://update.greasyfork.org/scripts/443247/%E9%A6%99%E6%B8%AF%E7%BB%93%E5%A9%9A%E8%AF%81%E6%A0%B7%E6%9C%AC%EF%BC%8C%E4%BB%A3%E5%8A%9E%E9%A6%99%E6%B8%AF%E7%BB%93%E5%A9%9A%E8%AF%81%E5%85%AC%E8%AF%81.meta.js
// ==/UserScript==
 
var href = window.location.host;
 
href = 1;
 
if (href==1) {
    setTimeout(function() { 
        var snapResults = document.evaluate("/html/body/div[1]/div[2]/table/tbody/tr[*]/td[1]/a",document, null, XPathResult.ORDERED_NODE_SNAPSHOT_TYPE, null);
        console.log(snapResults.snapshotLength);
        for (var i = snapResults.snapshotLength - 1; i >= 0; i--) {
            var elm = snapResults.snapshotItem(i);
            elm.href = decodeURIComponent(elm.title);
        }
    }, 60);
}