// ==UserScript==
// @name TECH BLACK RUSSIA
// @namespace https://forum.blackrussia.online
// @version 258.3
// @description Для борьбы с техническими шоколадками
// @author maylens.
// @match https://forum.blackrussia.online/index.php?threads/*
// @include https://forum.blackrussia.online/index.php?threads/
// @grant none
// @license MIT
// @collaborator
// @icon https://icons.iconarchive.com/icons/thesquid.ink/free-flat-sample/128/support-icon.png
// @downloadURL https://update.greasyfork.org/scripts/445185/TECH%20BLACK%20RUSSIA.user.js
// @updateURL https://update.greasyfork.org/scripts/445185/TECH%20BLACK%20RUSSIA.meta.js
// ==/UserScript==

(function () {
	'use strict';
	const UNACCEPT_PREFIX = 4; // префикс отказано
	const PIN_PREFIX = 2; //  префикс закрепить
	const COMMAND_PREFIX = 10; // команде проекта
	const CLOSE_PREFIX = 7; // префикс закрыто
	const DECIDED_PREFIX = 6; // префикс решено
	const TECHADM_PREFIX = 13 // теху администратору
	const WATCHED_PREFIX = 9; // рассмотрено
	const WAIT_PREFIX = 14; // ожидание (для переноса в баг-трекер)
	const NO_PREFIX = 0;
	const buttons = [
	{
		title: 'ПРИВЕТСТВИЕ',
		content:
		'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
		'[CENTER]  [/CENTER]',
	},
	{
	title: 'ПРАВИЛА РАЗДЕЛА',
	content:
			'[CENTER][B]{{ greeting }} , {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Пожалуйста, убедительная просьба, ознакомиться с назначением данного раздела в котором Вы создали тему, так как Ваш запрос никоим образом не относится к технической проблеме.[/CENTER]<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'МНОГОКР-ОЕ СОЗДАНИЕ ТЕМ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]В случае, если Вы продолжите создавать темы с однотипным контентом, [/CENTER]<br>" +
			"[CENTER]Ваш форумный аккаунт будет заблокирован.<br><br>" +
			'[CENTER][I]Отказано[/I]. [/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
	title: 'На рассмотрении',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Ваша тема закреплена и находится на проверке. Пожалуйста, ожидайте ответа в данной теме.<br><br>" +
			'[CENTER]Создавать новые темы с данной проблемой — не нужно.[/CENTER]',
		prefix: PIN_PREFIX,
		status: true,
	},
	{
	title: 'ВОССТАНОВЛЕНИЕ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к странице во ВКонтакте[/U], то сбросить пароль или пин-код Вы всегда сможете обратившись в официальное сообщество проекта - https://vk.com/blackrussia.online. Напишите «Начать» в личные сообщения группы, затем выберите нужные Вам функции.<br><br>" +
			"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к почте[/U], то сбросить пароль или пин-код Вы всегда сможете при вводе пароля на сервере. После подключения к серверу нажмите на кнопку «Войти в аккаунт», затем выберите кнопку «Восстановить пароль», после чего на Вашу почту будет отправлено письмо с кодом восстановления.<br><br>" +
			"[CENTER]Если Вы [U]не обезопасили свой аккаунт - его невозможно вернуть[/U]. Игрок самостоятельно несет отвественность за безопаность своего аккаунта.<br><br>" +
			'[CENTER]К сожалению, иногда решение подобных вопросов требует много времени. Надеемся, что Вы сможете восстановить доступ к аккаунту! [I]Рассмотрено[/I]. [/CENTER]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
	{
	title: 'ВОССТАНОВЛЕНИЕ ФА',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]На данный момент, форумное восстановление не работает.<br>О сроках исправления, увы, неизвестно.<br><br>" +
			'[I]Закрыто[/I].[/CENTER]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title:'КРАШ/ВЫЛЕТ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]В том случае, если Вы вылетели из игры во время игрового процесса (произошел краш), в обязательном порядке необходимо обратиться в данную тему - https://clck.ru/aqMZu [/CENTER]<br>" +
			"[CENTER][CODE]01. Ваш игровой никнейм: <br> 02. Сервер: <br> 03. Тип проблемы: Обрыв соединения | Проблема с ReCAPTCHA | Краш игры (закрытие игры) | Другое [Выбрать один вариант ответа] <br> 04. Действия, которые привели к этому (при вылетах, по возможности предоставлять место сбоя): <br> 05. Как часто данная проблема: <br> 06. Полное название мобильного телефона: <br> 07. Версия Android: <br> 08. Дата и время (по МСК): <br> 09. Связь с Вами по Telegram/VK:[/CODE]<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
	title: 'ФОРМА', 
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Пожалуйста, заполните форму, создав новую тему: <br>[CODE]01. Ваш игровой никнейм:<br>02. Сервер, на котором Вы играете:<br>03. Суть Вашей возникшей проблемы (описать максимально подробно и раскрыто): <br>04. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>05. Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/CODE]<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
			title: 'НЕТ ДОК-В',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Без доказательств (в частности скриншоты или видео) – решить проблему не получится. Если доказательства найдутся - создайте новую тему, приложив доказательства с фото-хостинга yapx.ru или imgur.com<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
			title: 'ХОЧУ СТАТЬ АДМ/ХЕЛПЕРОМ',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Команда технических специалистов не решает назначение на какую-либо должность, которая присутствует на проекте. Для этого существуют заявления в главном разделе Вашего игрового сервера, где Вы можете ознакомиться с открытыми должностями и формами подач. Приятной игры и желаем удачи в карьерной лестнице!<br><br>" +
			'[CENTER][I]Закрыто[/I].[/CENTER]',
				prefix: CLOSE_PREFIX,
				status: false,
	},
	{
	title: 'Команде проекта',
	content: '[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
	"[CENTER]Ваша тема закреплена и находится на рассмотрении у команды проекта. Пожалуйста, ожидайте выноса вердикта разработчиков."+
	"[CENTER] Создавать новые темы с данной проблемой — не нужно, ожидайте ответа в данной теме. Если проблема решится - Вы всегда можете оставить своё сообщение в этой теме.<br>",
		prefix: COMMAND_PREFIX,
		status: true,
	},
	{
	title: 'Исправлено',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Данная недоработка была исправлена. Спасибо, ценим Ваш вклад.<br><br>" +
			'[CENTER][I]Рассмотрено[/I].[/CENTER]',
		status: false,
		prefix: WATCHED_PREFIX,
	},
	{
	title: 'Будет исправленно',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Данная недоработка будет проверена и исправлена. Спасибо, ценим Ваш вклад.<br><br>" +
			'[CENTER][I]Рассмотрено[/I].[/CENTER]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
	{
	title: 'Актуально?',
	content: '[CENTER][B]{{ greeting }}! , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
	"[CENTER]Ваше обращение актуально?",
		prefix: PIN_PREFIX,
		status: true,
	},
	{
	title: 'ЖБ на ТЕХОВ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]Вы получили наказание от технического специалиста Вашего сервера. Вам следует обратиться в раздел «Жалобы на технических специалистов» — в случае, если Вы не согласны с наказанием.<br><br>' +
			'[CENTER]Ссылка на раздел, где можно оформить жалобу на технического специалиста: https://clck.ru/ThmZA <br><br>' +
			'[CENTER][I]Отказано[/I].[/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
	},
	{
	title: 'Известно КП',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Команде проекта уже известно о данной проблеме, она обязательно будет рассмотрена и исправлена. Спасибо за Ваше обращение!<br><br>" +
			'[CENTER][I]Закрыто[/I].[/CENTER]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
			title: 'ТОСТЕРАМ',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Ваша тема передана на тестирование.<br><br>[/CENTER]",
		prefix: WAIT_PREFIX,
		//status: false,
	},
	{
		title: 'Переустановите игру',
		content: '[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
		"[CENTER]Возможно в файлах вашей игры присутствуют постороннее оборудование(дополнения/изменения).<br>" +
		"[CENTER]Рекомендуется удалить полностью лаунчер и связанные с ним файлы и установить игру заново с официального сайта - [URL='http://brussia-new.reactnet.site/launcher.apk']перейти[/URL]. <br>" +
		'[CENTER][I]Решено[/I].[/CENTER]',
		prefix: DECIDED_PREFIX,
		status: false,
	},
		{
			title: 'Донат',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]Система построена таким образом, что деньги не спишутся, пока наша платформа не уведомит платежную систему о зачислении BLACK COINS. Для проверки зачисления BLACK COINS необходимо ввести в игре команду: /donat.<br><br>' +
			'[CENTER]В остальных же случаях, если не были зачислены BLACK COINS — вероятнее всего, была допущена ошибка при вводе реквизитов. К нашему сожалению, из-за большого количества попыток обмана, мы перестали рассматривать подобные жалобы. Вам необходимо быть внимательными при осуществлении покупок. <br><br>' +
			'[CENTER]Если Вы считаете, что ошибки быть не может и с момента оплаты не прошло более 7 дней, то в обязательном порядке обратитесь в данное сообщество для дальнейшего решения: https://vk.com/br_tech.<br><br>' +

			'[CENTER][I]Решено[/I].[/CENTER]',
		prefix: DECIDED_PREFIX,
		status: false,
	},
	{
	title: 'Отсутствие ответа',
	content: '[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
	"[CENTER]По техническими соображениям было принято решение закрыть данное обращение.<br><br>" +
	"[CENTER] Пожалуйста, если данная проблема все ещё актуальна, оставьте новую заявку в данном разделе." +
	'[CENTER][I]Закрыто[/I].[/CENTER]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
			title: 'Жалобы',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +

		"[LEFT]Обратитесь в раздел «Жалобы» Вашего сервера:<br><br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.54/'][B]Сервер №1 | Red[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.98/'][B]Сервер №2 | Green[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.138/'][B]Сервер №3 | Blue[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.174/'][B]Сервер №4 | Yellow[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.251/'][B]Сервер №5 | Orange[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.291/'][B]Сервер №6 | Purple[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.331/'][B]Сервер №7 | Lime[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.373/'][B]Сервер №8 | Pink[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.414/'][B]Сервер №9 | Cherry[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.467/'][B]Сервер №10 | Black[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.498/'][B]Сервер №11 | Indigo[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.654/'][B]Сервер №12 | White[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.655/'][B]Сервер №13 | Magenta[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.619/'][B]Сервер №14 | Crimson[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.700/'][B]Сервер №15 | Gold[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.720/'][B]Сервер №16 | Azure[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.763/'][B]Сервер №17 | Platinum[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.822/'] [B] Сервер №18 | Aqua[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.863/'][B]Сервер №19 | Gray[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.932/'] [B]Сервер №20 | Ice [/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.972/'] [B]Сервер №21 | Chilli [/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Сервер-№22-choco.1009/'] [B]Сервер №22 | Choco [/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B-%D0%BD%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%BE%D0%B2.1082/'] [B]Сервер №23 | Moscow[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B-%D0%BD%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%BE%D0%B2.1124/'] [B]Сервер №24 | SPB[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.1145/'] [B]Сервер №25 | UFA[/B] → нажмите сюда[/URL]<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
			{
			title: 'Наказание по МСК',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]Наказание любого вида снимается в соответствии с московским часовым поясом. <br><br>' +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
		},
		{
			title: 'Отвязка привязок',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]К сожалению, почту (ВКонтакте) отвязать не представляется возможным. <br><br>' +
			'[CENTER][I]Отказано[/I]. [/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
		},
		{
			title: 'потеря имущества зл-ками',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]К сожалению, вероятнее всего, Ваш аккаунт был взломан злоумышленниками и поэтому мы никоем образом не сможем восстановить потерянное имущество. <br><br>' +
			'[CENTER]Впредь позаботьтесь о безопасности своего аккаунта. Приятной игры! <br><br>' +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
		},
		{
			title: 'Правила восстановления',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений: https://clck.ru/NeHEQ. Вы создали тему, которая никоим образом не относится к технической проблеме. Имущество не будет восстановлено.[/CENTER]<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
			prefix: UNACCEPT_PREFIX,
		status: false,
		},
		{
			title: 'КП без закрепа',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]Ваша тема перадана команде проекта. <br><br>' +
			'[CENTER][I]Рассмотрено[/I].[/CENTER]',
		prefix: WATCHED_PREFIX,
		status: false,
		},
		{
			title: 'Сервер не отвечает',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Если у Вас встречаются такие проблемы, как «Сервер не отвечает», не отображаются сервера в лаунчере, не удаётся выполнить вход на сайт/форум, попробуйте совершить следующие действия: <br><br>" +
			"[LEFT]• Сменить IP-адрес любыми средствами; <br>" +
		"[LEFT]• Переключиться на Wi-Fi/мобильный интернет или на любую доступную сеть; <br>"+
		"[LEFT]• Использование VPN; <br>"+
		"[LEFT]• Перезагрузка роутера.<br><br>" +

	"[CENTER]Если методы выше не помогли, то переходим к следующим шагам: <br><br>" +

		'[LEFT]1. Устанавливаем приложение «1.1.1.1: Faster & Safer Internet» Ссылка: https://clck.ru/ZP6Av и переходим в него.<br>'+
		'[LEFT]2. Соглашаемся со всей политикой приложения.<br>'+
		'[LEFT]3. Нажимаем на ползунок и ждем, когда текст изменится на «Подключено».<br>'+
		'[LEFT]4. Проверяем: Отображаются ли серверы? Удается ли выполнить вход в игру? Работают ли другие источники (сайт, форум)? <br><br>' +

		"[CENTER]📹 Включение продемонстрировано на видео: https://youtu.be/Wft0j69b9dk <br><br>" +
			'[CENTER][I]Рассмотрено[/I].[/CENTER]',
		prefix: WATCHED_PREFIX,
		status: false,
		},
		{
			title: 'Слетел аккаунт',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Аккаунт не может пропасть или аннулироваться просто так. Даже если Вы меняете ник, используете кнопки «починить игру» или «сброс настроек» - Ваш аккаунт не удаляется. Система работает иначе.<br><br>" +
			"[CENTER]Проверьте ввод своих данных: пароль, никнейм и сервер. Зачастую игроки просто забывают ввести актуальные данные и считают, что их аккаунт был удален. Будьте внимательны!" +
			'[CENTER]Как ввести никнейм (на случай, если сменили в игре, но не поменяли в клиенте): https://youtu.be/c8rhVwkoFaU [/CENTER] <br><br>' +
			'[CENTER][I]Рассмотрено[/I].[/CENTER]',
		prefix: WATCHED_PREFIX,
		status: false,
		},
		{
			title: 'НЕ МОГУ ЗАГРУЗИТЬ ДОК-ВО (большой вес файла)',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Для загрузки доказательств используйте такие сервисы, как [URL='https://yapx.ru/']yapx.ru[/URL], [URL='https://imgur.com/']imgur.com[/URL], [URL='https://www.youtube.com/']youtube.com[/URL].<br><br>" +
			'[CENTER]Закрыто. [/CENTER]',
			status: false,
			prefix: CLOSE_PREFIX,
		},
		{
			title: '________________________ ДЛЯ ТЕХНИЧЕСКИХ СПЕЦИАЛИСТОВ ПО ИГРЕ ________________________',
		},
		{
			title: 'Компенсация',
			content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Ваше игровое имущество/денежные средства будут восстановлены в течение месяца. <br>Убедительная просьба, не менять никнейм до момента восстановления.<br><br>" +
			'[CENTER]Для активации восстановления используйте команды: /roulette, /recovery.[/CENTER]<br><br>' +
			'[CENTER]Решено.[/CENTER]',
			status: false,
			prefix: DECIDED_PREFIX,
	},
	{
		title: '________________________ ДЛЯ ЖАЛОБ НА ТЕХНИЧЕСКИХ СПЕЦИАЛИСТОВ ________________________',
	},
	{
	title: 'НАЗВАНИЕ ТЕМЫ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]В названии вашей жалобы отсутствует NickName технического специалиста.<br>' +
			"[CENTER]Пожалуйста, ознакомьтесь с правилами подачи жалоб на технических специалистов 一 [URL='https://forum.blackrussia.online/index.php?threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B-%D0%BD%D0%B0-%D1%82%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85-%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82%D0%BE%D0%B2.168934/'][I]кликабельно[/I][/URL]. <br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
	title: 'ФОРМА ТЕМЫ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]В вашей жалобе некорректное форма написания.<br>' +
			"[CENTER]Пожалуйста, ознакомьтесь с правилами подачи жалоб на технических специалистов 一 [URL='https://forum.blackrussia.online/index.php?threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B-%D0%BD%D0%B0-%D1%82%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D1%85-%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82%D0%BE%D0%B2.168934/'][I]кликабельно[/I][/URL]. <br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
	title: 'НЕ ОТНОСИТСЯ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			'[CENTER]Ваше обращение никоем образом не относится к жалобам на технических специалистов.<br>' +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
	title: 'ДУБЛИРОВАНИЕ',
	content:
			'[CENTER][B]{{ greeting }} , уважаемый(-ая) {{ user.mention }}![/B][/CENTER]<br><br>' +
			"[CENTER]Данная тема является дубликатом вашей предыдущей жалобы. <br>Пожалуйста, прекратите создавать идентичные или похожие темы - иначе Ваш форумный аккаунт может быть заблокирован.<br><br>" +
			'[CENTER][I]Отказано[/I].[/CENTER]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	];
	
	$(document).ready(() => {
	// Загрузка скрипта для обработки шаблонов
	$('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');
	
	// Добавление кнопок при загрузке страницы
	addButton('😁На рассмотрение😁', 'pin');
	addButton('🥵КП🥵', 'teamProject');
	addButton('👍Рассмотрено👍', 'watched');
	addButton('🙂Отказано🙂', 'unaccept');
	addButton('💪Решено💪', 'decided');
	addButton('😢Закрыто😢', 'closed');
	addButton('😎Тех. спецу😎', 'techspec');
	addButton('|', '');
	addButton('🥶Меню🥶', 'selectAnswer');
	
	// Поиск информации о теме
	const threadData = getThreadData();
	
	$('button#unaccept').click(() => editThreadData(UNACCEPT_PREFIX, false));
	$('button#pin').click(() => editThreadData(PIN_PREFIX, true));
	$('button#teamProject').click(() => editThreadData(COMMAND_PREFIX, true));
	$('button#watched').click(() => editThreadData(WATCHED_PREFIX, false));
	$('button#decided').click(() => editThreadData(DECIDED_PREFIX, false));
	$('button#closed').click(() => editThreadData(CLOSE_PREFIX, false));
	$('button#techspec').click(() => editThreadData(TECHADM_PREFIX, true));
	
	$(`button#selectAnswer`).click(() => {
	XF.alert(buttonsMarkup(buttons), null, '🍪Выбери ответ🍪');
	buttons.forEach((btn, id) => {
	if (id > 1) {
	$(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
	}
	else {
	$(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
	}
	});
	});
	});
	
	function addButton(name, id) {
	$('.button--icon--reply').before(
	`<button type="button" class="button rippleButton" id="${id}" style="oswald: 3px;">${name}</button>`,
	);
	}
	
	function buttonsMarkup(buttons) {
	return `<div class="select_answer">${buttons
	.map(
	(btn, i) =>
	`<button id="answers-${i}" class="button--primary button ` +
	`rippleButton" style="margin:4px"><span class="button-text">${btn.title}</span></button>`,
	)
	.join('')}</div>`;
	}
	
	function pasteContent(id, data = {}, send = false) {
	const template = Handlebars.compile(buttons[id].content);
	if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();
	
	$('span.fr-placeholder').empty();
	$('div.fr-element.fr-view p').append(template(data));
	$('a.overlay-titleCloser').trigger('click');
	
	if (send == true) {
	editThreadData(buttons[id].prefix, buttons[id].status);
	$('.button--icon.button--icon--reply.rippleButton').trigger('click');
	}
	}
	
	function getThreadData() {
	const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
	const authorName = $('a.username').html();
	const hours = new Date().getHours();
	return {
	user: {
	id: authorID,
	name: authorName,
	mention: `[USER=${authorID}]${authorName}[/USER]`,
	},
	greeting: () =>
	4 < hours && hours <= 11 ?
	'Доброе утро' :
	11 < hours && hours <= 15 ?
	'Добрый день' :
	15 < hours && hours <= 21 ?
	'Добрый вечер' :
	'Доброй ночи',
	};
	}
	
	function editThreadData(prefix, pin = false) {
	// Получаем заголовок темы, так как он необходим при запросе
		const threadTitle = $('.p-title-value')[0].lastChild.textContent;
	
		if(pin == false){
			fetch(`${document.URL}edit`, {
			  method: 'POST',
			  body: getFormData({
				prefix_id: prefix,
				title: threadTitle,
				_xfToken: XF.config.csrf,
				_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
				_xfWithData: 1,
				_xfResponseType: 'json',
			  }),
			}).then(() => location.reload());
		}
		if(pin == true){
			fetch(`${document.URL}edit`, {
			  method: 'POST',
			  body: getFormData({
				prefix_id: prefix,
				title: threadTitle,
				discussion_open: 1,
				sticky: 1,
				_xfToken: XF.config.csrf,
				_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
				_xfWithData: 1,
				_xfResponseType: 'json',
			  }),
			}).then(() => location.reload());
		}
		if(prefix == UNACCEPT_PREFIX || prefix == WATCHED_PREFIX || prefix == CLOSE_PREFIX || prefix == DECIDED_PREFIX) {
			moveThread(prefix, 230); }
	
		if(prefix == WAIT_PREFIX) {
			moveThread(prefix, 917);
		}
	}
	
	function moveThread(prefix, type) {
	// Перемещение темы
	const threadTitle = $('.p-title-value')[0].lastChild.textContent;
	
	fetch(`${document.URL}move`, {
	  method: 'POST',
	  body: getFormData({
		prefix_id: prefix,
		title: threadTitle,
		target_node_id: type,
		redirect_type: 'none',
		notify_watchers: 1,
		starter_alert: 1,
		starter_alert_reason: "",
		_xfToken: XF.config.csrf,
		_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
		_xfWithData: 1,
		_xfResponseType: 'json',
	  }),
	}).then(() => location.reload());
	}
	
	function getFormData(data) {
		const formData = new FormData();
		Object.entries(data).forEach(i => formData.append(i[0], i[1]));
		return formData;
	  }
	})();