// ==UserScript==
// @name         overframe国服名称替换英文名称
// @namespace    https://
// @version      0.3
// @description  以文本替换方式实现游戏名词国服化，基于英文名称替换，搜索时请使用原名称。PS：本人代码文盲，此脚本为使用别人现有脚本改造而成，欢迎有能力的朋友做出更优秀脚本。原脚本地址：https://greasyfork.org/zh-CN/scripts/376441-soldout-2-%E6%96%87%E6%9C%AC%E6%9B%BF%E6%8D%A2
// @author       ye
// @match        https://overframe.gg/*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/460948/overframe%E5%9B%BD%E6%9C%8D%E5%90%8D%E7%A7%B0%E6%9B%BF%E6%8D%A2%E8%8B%B1%E6%96%87%E5%90%8D%E7%A7%B0.user.js
// @updateURL https://update.greasyfork.org/scripts/460948/overframe%E5%9B%BD%E6%9C%8D%E5%90%8D%E7%A7%B0%E6%9B%BF%E6%8D%A2%E8%8B%B1%E6%96%87%E5%90%8D%E7%A7%B0.meta.js
// ==/UserScript==


(function() {
    'use strict';

    const i18n = new Map([
//界面
    ['Top Builds', '最佳配卡'],
        ['Sort', '排序'],
            ['RATING', '评价'],
            ['LAST UPDATED', '最后更新日期'],
            ['FORMA COUNT', '福马消耗量'],
            [' 🢃', ' 高'],
            [' 🢁', ' 低'],
            ['NAME', '名称'],
        ['Updated since', '更新时间'],
            ['Any Time', '任何时间'],
        ['Build name', '配卡名称'],
        ['Warframe', '星际战甲'],
        ['WARFRAMES', '战甲'],
        ['Primary Weapon', '主武器'],
        ['PRIMARY WEAPONS', '主武器'],
        ['Secondary Weapon', '副武器'],
        ['SECONDARY WEAPONS', '副武器'],
        ['Melee Weapon', '近战'],
        ['MELEE WEAPONS', '近战'],
        ['Archwing', '空战'],
        ['ARCHWING', '空战'],
        ['Companion', '小伙伴'],
        ['COMPANIONS', '小伙伴'],
    ['Tier List', '排行榜'],
        ['HELMINTH ABILITIES', '赫明斯技能'],
        ['DISPLAY:', '显示：'],
        ['TIERS', '级别'],
        ['VOTES', '评分'],
        ['Tier', '级'],
    ['New Build', '新建配卡'],
//双词缀
        ['Dual Kamas Prime', '圣装迦摩天双镰'],//近战武器，双词缀
        ['Dual Keres Prime', '圣装灾厄双刃'],//近战武器，双词缀
        ['Kuva Twin Stubbas', '赤毒双子斯图巴冲锋手枪'],//副武器，双词缀
        ['Prisma Dual Cleavers', '棱晶近卫者'],//近战武器，双词缀
        ['Prisma Dual Decurions', '棱晶什长双枪'],//空战武器，双词缀
        ['Secura Dual Cestra', '瑟古拉双持逆转聚能炮'],//副武器，双词缀
//单词缀
        ['Afuris Prime', '圣装双持弗里斯手枪'],//副武器，单词缀
        ['Akbolto Prime', '圣装双持角犀'],//副武器，单词缀
        ['Akbronco Prime', '圣装双持布隆克烈驹'],//副武器，单词缀
        ['Akjagara Prime', '圣装觉醒双枪'],//副武器，单词缀
        ['Aklex Prime', '圣装双持秩序之握'],//副武器，单词缀
        ['Aksomati Prime', '圣装轻灵索玛双枪'],//副武器，单词缀
        ['Akstiletto Prime', '圣装双持西提列托'],//副武器，单词缀
        ['Akvasto Prime', '圣装双持瓦斯托'],//副武器，单词缀
        ['Ankyros Prime', '圣装安奇洛斯拳套'],//近战武器，单词缀
        ['Ash Prime', '圣装灰烬之刃'],//战甲，单词缀
        ['Astilla Prime', '圣装碎晶霰弹枪'],//主武器，单词缀
        ['Atlas Prime', '圣装撼天刑者'],//战甲，单词缀
        ['Ballistica Prime', '圣装惊惧手弩'],//副武器，单词缀
        ['Banshee Prime', '圣装恸哭女妖'],//战甲，单词缀
        ['Baruuk Prime', '圣装圣拳武僧'],//战甲，单词缀
        ['Baza Prime', '圣装苍鹰冲锋枪'],//主武器，单词缀
        ['Bo Prime', '圣装破禅武杖'],//近战武器，单词缀
        ['Boar Prime', '圣装雄猪霰弹枪'],//主武器，单词缀
        ['Boltor Prime', '圣装波尔托骨刺'],//主武器，单词缀
        ['Bonewidow Prime', '圣装骨骸寡妇'],//战甲，单词缀
        ['Braton Prime', '圣装制式步枪'],//主武器，单词缀
        ['Braton Vandal', '镇暴制式步枪'],//主武器，单词缀
        ['Broken War', '破碎的纷争'],//近战武器，单词缀
        ['Bronco Prime', '圣装布隆克烈驹'],//副武器，单词缀
        ['Burston Prime', '圣装伯斯顿步枪'],//主武器，单词缀
        ['Caliban Prime', '圣装卡利班'],//战甲，单词缀
        ['Carmine Penta', '绯红五芒星榴弹炮'],//主武器，单词缀
        ['Cernos Prime', '圣装瑟诺斯长弓'],//主武器，单词缀
        ['Ceti Lacera', '天仓绝情双剪'],//近战武器，单词缀
        ['Chroma Prime', '圣装怒炎龙骑'],//战甲，单词缀
        ['Citrine Prime', '圣装辉光晶灵'],//战甲，单词缀
        ['Cobra & Crane Prime', '圣装眼镜蛇与鹤'],//近战武器，单词缀
        ['Corinth Prime', '圣装科林斯泵动式霰弹枪'],//主武器，单词缀
        ['Corvas Prime', '圣装黑鸦'],//空战武器，单词缀
        ['Dakra Prime', '圣装达克拉'],//近战武器，单词缀
        ['Deconstructor Prime', '圣装爆能分解'],//宠物武器，单词缀
        ['Dera Vandal', '镇暴德拉'],//主武器，单词缀
        ['Destreza Prime', '圣装护手刺剑'],//近战武器，单词缀
        ['Deth Machine Rifle Prime', '圣装冷酷机枪'],//宠物武器，单词缀
        ['Dex Dakra', '灵敏达克拉'],//近战武器，单词缀
        ['Dex Furis', '灵敏弗里斯双枪'],//副武器，单词缀
        ['Dex Sybaris', '灵敏远古丧钟'],//主武器，单词缀
        ['Dragon Nikana', '龙之侍刃'],//近战武器，单词缀
        ['Dual Cestra', '双持逆转聚能炮'],//副武器，单词缀
        ['Dual Cleavers', '近卫者'],//近战武器，单词缀
        ['Dual Decurion', '什长双枪'],//空战武器，单词缀
        ['Dual Ether', '苍穹双剑'],//近战武器，单词缀
        ['Dual Heat Swords', '烈焰双剑'],//近战武器，单词缀
        ['Dual Ichor', '恶脓双斧'],//近战武器，单词缀
        ['Dual Kamas', '迦摩天双镰'],//近战武器，单词缀
        ['Dual Keres', '灾厄双刃'],//近战武器，单词缀
        ['Dual Raza', '锋月双斧'],//近战武器，单词缀
        ['Dual Skana', '空灵双刀'],//近战武器，单词缀
        ['Dual Toxocyst', '毒刺双枪'],//副武器，单词缀
        ['Dual Zoren', '索伦双斧'],//近战武器，单词缀
        ['Ekwana Jai II', '双扣环坠'],//天工部件，单词缀
        ['Ekwana Ruhang II', '环钩坠'],//天工部件，单词缀
        ['Ember Prime', '圣装永恒烈焰'],//战甲，单词缀
        ['Equinox Prime', '圣装阴阳双子'],//战甲，单词缀
        ['Euphona Prime', '圣装仙乐奏鸣'],//副武器，单词缀
        ['Excalibur Umbra', '暗影圣剑'],//战甲，单词缀
        ['Fang Prime', '圣装狼牙双刃'],//近战武器，单词缀
        ['Fragor Prime', '圣装悲悯'],//近战武器，单词缀
        ['Frost Prime', '圣装冰雪寒霜'],//战甲，单词缀
        ['Furax Wraith', '红莲寄居蟹手刺'],//近战武器，单词缀
        ['Galatine Prime', '圣装加拉丁暗影'],//近战武器，单词缀
        ['Gara Prime', '圣装琉璃仕女'],//战甲，单词缀
        ['Garuda Prime', '圣装迦楼罗'],//战甲，单词缀
        ['Gauss Prime', '圣装迅电驰影'],//战甲，单词缀
        ['Gazal Machete', '加扎尔精英阔刀'],//近战武器，单词缀
        ['Glaive Prime', '圣装回旋刃'],//近战武器，单词缀
        ['Glaxion Vandal', '镇暴急冻冰枪'],//主武器，单词缀
        ['Gorgon Wraith', '红莲蛇发女妖'],//主武器，单词缀
        ['Gram Prime', '圣装格拉姆'],//近战武器，单词缀
        ['Grendel Prime', '圣装暴食者'],//战甲，单词缀
        ['Guandao Prime', '圣装偃月刀'],//近战武器，单词缀
        ['Gyre Prime', '圣装电光舞者'],//战甲，单词缀
        ['Halikar Wraith', '红莲喷射飞锤'],//近战武器，单词缀
        ['Harrow Prime', '圣装驱魔使者'],//战甲，单词缀
        ['Helios Prime', '圣装太阳之神'],//宠物，单词缀
        ['Hikou Prime', '圣装星镖'],//副武器，单词缀
        ['Hildryn Prime', '圣装重装武神'],//战甲，单词缀
        ['Hydroid Prime', '圣装惊涛骇浪'],//战甲，单词缀
        ['Hystrix Prime', '圣装豪猪镖枪'],//副武器，单词缀
        ['Ignis Wraith', '红莲爆燃喷射器'],//主武器，单词缀
        ['Imperator Vandal', '镇暴皇蟒'],//空战武器，单词缀
        ['Inaros Prime', '圣装沙海怒涛'],//战甲，单词缀
        ['Ivara Prime', '圣装神弓游侠'],//战甲，单词缀
        ['Jai II', '双扣坠'],//天工部件，单词缀
        ['Karak Wraith', '红莲超体步枪'],//主武器，单词缀
        ['Karyst Prime', '圣装困惑之刃'],//近战武器，单词缀
        ['Khora Prime', '圣装荒野猎手'],//战甲，单词缀
        ['Knell Prime', '圣装噩兆'],//副武器，单词缀
        ['Kogake Prime', '圣装牢笼拳套'],//近战武器，单词缀
        ['Kronen Prime', '圣装弧月刀'],//近战武器，单词缀
        ['Kuva Ayanga', '赤毒怒雷'],//空战武器，单词缀
        ['Kuva Brakk', '赤毒布拉克'],//副武器，单词缀
        ['Kuva Bramma', '赤毒布拉玛'],//主武器，单词缀
        ['Kuva Chakkhurr', '赤毒邪眼'],//主武器，单词缀
        ['Kuva Drakgoon', '赤毒龙息匣炮'],//主武器，单词缀
        ['Kuva Grattler', '赤毒反重力空气枪'],//空战武器，单词缀
        ['Kuva Hek', '赤毒狂神'],//主武器，单词缀
        ['Kuva Hind', '赤毒雌鹿半自动步枪'],//主武器，单词缀
        ['Kuva Karak', '赤毒超体步枪'],//主武器，单词缀
        ['Kuva Kohm', '赤毒聚能瓦斯炮'],//主武器，单词缀
        ['Kuva Kraken', '赤毒北海巨妖'],//副武器，单词缀
        ['Kuva Nukor', '赤毒努克微波'],//副武器，单词缀
        ['Kuva Ogris', '赤毒奥基手持火箭炮'],//主武器，单词缀
        ['Kuva Quartakk', '赤毒夸塔克四管突击步枪'],//主武器，单词缀
        ['Kuva Seer', '赤毒希尔先知'],//副武器，单词缀
        ['Kuva Shildeg', '赤毒希尔德'],//近战武器，单词缀
        ['Kuva Tonkor', '赤毒征服榴炮'],//主武器，单词缀
        ['Kuva Zarr', '赤毒煞皇'],//主武器，单词缀
        ['Lato Prime', '圣装拉托'],//副武器，单词缀
        ['Lato Vandal', '镇暴拉托'],//副武器，单词缀
        ['Latron Prime', '圣装拉特龙半自动步枪'],//主武器，单词缀
        ['Latron Wraith', '红莲拉特龙半自动步枪'],//主武器，单词缀
        ['Lavos Prime', '圣装无限术士'],//战甲，单词缀
        ['Lex Prime', '圣装秩序之握'],//副武器，单词缀
        ['Limbo Prime', '圣装灵薄狱'],//战甲，单词缀
        ['Loki Prime', '圣装邪神洛基'],//战甲，单词缀
        ['Machete Wraith', '红莲精英阔刀'],//近战武器，单词缀
        ['Mag Prime', '圣装磁力'],//战甲，单词缀
        ['Magnus Prime', '圣装猛犸手枪'],//副武器，单词缀
        ['Mara Detron', '玛拉迪特隆'],//副武器，单词缀
        ['Mesa Prime', '圣装圣枪弥撒'],//战甲，单词缀
        ['Mirage Prime', '圣装魅影精灵'],//战甲，单词缀
        ['MK1-Bo', '试用型-破禅武杖'],//近战武器，单词缀
        ['MK1-Braton', '试用型-制式步枪'],//主武器，单词缀
        ['MK1-Furax', '试用型-寄居蟹手刺'],//近战武器，单词缀
        ['MK1-Furis', '试用型-弗里斯手枪'],//副武器，单词缀
        ['MK1-Kunai', '试用型-苦无'],//副武器，单词缀
        ['MK1-Paris', '试用型-帕里斯长弓'],//主武器，单词缀
        ['MK1-Strun', '试用型-斯特朗炮'],//主武器，单词缀
        ['Mutalist Cernos', '异融瑟诺斯长弓'],//主武器，单词缀
        ['Mutalist Quanta', '异融光能量子'],//主武器，单词缀
        ['Nagantaka Prime', '圣装噬蛇弩'],//主武器，单词缀
        ['Nami Skyla Prime', '圣装纳米斯凯拉'],//近战武器，单词缀
        ['Nekros Prime', '圣装御魂主宰'],//战甲，单词缀
        ['Nezha Prime', '圣装哪咤三太子'],//战甲，单词缀
        ['Nidus Prime', '圣装异变之巢'],//战甲，单词缀
        ['Nikana Prime', '圣装侍刃'],//近战武器，单词缀
        ['Ninkondi Prime', '圣装翠玉双截棍'],//近战武器，单词缀
        ['Nova Prime', '圣装超能新星'],//战甲，单词缀
        ['Nyx Prime', '圣装冥河夜神'],//战甲，单词缀
        ['Oberon Prime', '圣装龙王奥伯'],//战甲，单词缀
        ['Octavia Prime', '圣装吟游歌者'],//战甲，单词缀
        ['Opticor Vandal', '镇暴热熔镭射炮'],//主武器，单词缀
        ['Orthos Prime', '圣装双尾鲨'],//近战武器，单词缀
        ['Pandero Prime', '圣装潘德罗'],//副武器，单词缀
        ['Pangolin Prime', '圣装鲮鲤'],//近战武器，单词缀
        ['Panthera Prime', '圣装猎豹'],//主武器，单词缀
        ['Paris Prime', '圣装帕里斯长弓'],//主武器，单词缀
        ['Phantasma Prime', '圣装幻影离子冲击枪'],//主武器，单词缀
        ['Prime Laser Rifle', '圣装激光步枪'],//宠物武器，单词缀
        ['Prisma Angstrum', '棱晶将军手持短炮'],//副武器，单词缀
        ['Prisma Burst Laser', '棱晶爆发激光发射器'],//宠物武器，单词缀
        ['Prisma Gorgon', '棱晶蛇发女妖'],//主武器，单词缀
        ['Prisma Grakata', '棱晶格拉达火舌'],//主武器，单词缀
        ['Prisma Grinlok', '棱晶尖叫小丑'],//主武器，单词缀
        ['Prisma Machete', '棱晶精英阔刀'],//近战武器，单词缀
        ['Prisma Obex', '棱晶惩戒手刺'],//近战武器，单词缀
        ['Prisma Shade', '棱晶幽冥暗影'],//宠物，单词缀
        ['Prisma Skana', '棱晶空灵刃'],//近战武器，单词缀
        ['Prisma Tetra', '棱晶泰特拉'],//主武器，单词缀
        ['Prisma Twin Gremlins', '棱晶双子精灵'],//副武器，单词缀
        ['Prisma Veritux', '棱晶宇宙真理'],//空战武器，单词缀
        ['Proboscis Cernos', '刺吸瑟诺斯长弓'],//主武器，单词缀
        ['Protea Prime', '圣装泊时灵械'],//战甲，单词缀
        ['Prova Vandal', '镇暴高压电棒'],//近战武器，单词缀
        ['Pyrana Prime', '圣装派亚脊刺'],//副武器，单词缀
        ['Quanta Vandal', '镇暴光能量子'],//主武器，单词缀
        ['Rakta Ballistica', '拉克塔惊惧手弩'],//副武器，单词缀
        ['Rakta Cernos', '拉克塔瑟诺斯长弓'],//主武器，单词缀
        ['Rakta Dark Dagger', '拉克塔暗影匕首'],//近战武器，单词缀
        ['Reaper Prime', '圣装收割者'],//近战武器，单词缀
        ['Redeemer Prime', '圣装救赎者'],//近战武器，单词缀
        ['Revenant Prime', '圣装徘徊夜灵'],//战甲，单词缀
        ['Rhino Prime', '圣装狂野犀牛'],//战甲，单词缀
        ['Rubico Prime', '圣装绿陶狙击枪'],//主武器，单词缀
        ['Ruhang II', '双钩坠'],//天工部件，单词缀
        ['Sancti Castanas', '圣洁分体式处理信标'],//副武器，单词缀
        ['Sancti Magistar', '圣洁真理权杖'],//近战武器，单词缀
        ['Sancti Tigris', '圣洁泰格里斯'],//主武器，单词缀
        ['Saryn Prime', '圣装剧毒之触'],//战甲，单词缀
        ['Scindo Prime', '圣装神罚巨斧'],//近战武器，单词缀
        ['Scourge Prime', '圣装天罚'],//主武器，单词缀
        ['Secura Lecta', '瑟古拉僵直电鞭'],//近战武器，单词缀
        ['Secura Penta', '瑟古拉五芒星榴弹炮'],//主武器，单词缀
        ['Sevagoth Prime', '圣装虚冥鬼影'],//战甲，单词缀
        ['Sicarus Prime', '圣装塞卡洛斯'],//副武器，单词缀
        ['Silva & Aegis Prime', '圣装希瓦·艾奎斯剑盾'],//近战武器，单词缀
        ['Skana Prime', '圣装空灵刃'],//近战武器，单词缀
        ['Snipetron Vandal', '镇暴特洛恩阳极磁轨枪'],//主武器，单词缀
        ['Soma Prime', '圣装索玛'],//主武器，单词缀
        ['Spectra Vandal', '镇暴光谱手枪'],//副武器，单词缀
        ['Spira Prime', '圣装螺旋飞刃'],//副武器，单词缀
        ['Stradavar Prime', '圣装斯特拉迪瓦'],//主武器，单词缀
        ['Strun Prime', '圣装斯特朗炮'],//主武器，单词缀
        ['Strun Wraith', '红莲斯特朗炮'],//主武器，单词缀
        ['Styanax Prime', '圣装无畏斗士'],//战甲，单词缀
        ['Supra Vandal', '镇暴量子苏普拉'],//主武器，单词缀
        ['Sweeper Prime', '圣装清道夫'],//宠物武器，单词缀
        ['Sybaris Prime', '圣装远古丧钟'],//主武器，单词缀
        ['Synoid Gammacor', '辛诺德射线发生仪'],//副武器，单词缀
        ['Synoid Heliocor', '辛诺德太阳神锤'],//近战武器，单词缀
        ['Synoid Simulor', '辛诺德重力奇点拟成枪'],//主武器，单词缀
        ['Tatsu Prime', '圣装龙辰'],//近战武器，单词缀
        ['Tekko Prime', '圣装刺蛇'],//近战武器，单词缀
        ['Telos Akbolto', '终极双持角犀'],//副武器，单词缀
        ['Telos Boltace', '终极螺钉弧月刀'],//近战武器，单词缀
        ['Telos Boltor', '终极波尔托骨刺'],//主武器，单词缀
        ['Tenet Agendus', '信条议程'],//近战武器，单词缀
        ['Tenet Arca Plasmor', '信条弧光等离子冲击枪'],//主武器，单词缀
        ['Tenet Cycron', '信条循环式电浆手枪'],//副武器，单词缀
        ['Tenet Detron', '信条迪特隆'],//副武器，单词缀
        ['Tenet Diplos', '信条迪普洛斯'],//副武器，单词缀
        ['Tenet Envoy', '信条特使'],//主武器，单词缀
        ['Tenet Exec', '信条枢密'],//近战武器，单词缀
        ['Tenet Ferrox', '信条铁磁式激光矛枪'],//主武器，单词缀
        ['Tenet Flux Rifle', '信条热能步枪'],//主武器，单词缀
        ['Tenet Grigori', '信条格里高利'],//近战武器，单词缀
        ['Tenet Livia', '信条利维亚'],//近战武器，单词缀
        ['Tenet Plinx', '信条漫射者'],//副武器，单词缀
        ['Tenet Spirex', '信条螺旋'],//副武器，单词缀
        ['Tenet Tetra', '信条泰特拉'],//主武器，单词缀
        ['Tenora Prime', '圣装泰诺拉'],//主武器，单词缀
        ['Tiberon Prime', '圣装提贝隆枪刺'],//主武器，单词缀
        ['Tigris Prime', '圣装泰格里斯'],//主武器，单词缀
        ['Tipedo Prime', '圣装提佩多'],//近战武器，单词缀
        ['Titania Prime', '圣装幻蝶仙灵'],//战甲，单词缀
        ['Trinity Prime', '圣装三位一体'],//战甲，单词缀
        ['Twin Basolk', '双子巴萨克'],//近战武器，单词缀
        ['Twin Grakatas', '双持格拉达火舌'],//副武器，单词缀
        ['Twin Gremlins', '双子精灵'],//副武器，单词缀
        ['Twin Kohmak', '双子寇玛热能炮'],//副武器，单词缀
        ['Twin Krohkur', '双子钩刃剑'],//近战武器，单词缀
        ['Twin Rogga', '双子罗迦霰弹枪'],//副武器，单词缀
        ['Twin Vipers Wraith', '红莲双子蝰蛇'],//副武器，单词缀
        ['Twin Vipers', '双子蝰蛇'],//副武器，单词缀
        ['Valkyr Prime', '圣装瓦尔基里'],//战甲，单词缀
        ['Vargeet II Jai', '双拐扣坠'],//天工部件，单词缀
        ['Vargeet II Ruhang', '双拐钩坠'],//天工部件，单词缀
        ['Vargeet Jai II', '双扣拐坠'],//天工部件，单词缀
        ['Vargeet Ruhang II', '双钩拐坠'],//天工部件，单词缀
        ['Vasto Prime', '圣装瓦斯托'],//副武器，单词缀
        ['Vauban Prime', '圣装工程统帅'],//战甲，单词缀
        ['Vaykor Hek', '维寇狂神'],//主武器，单词缀
        ['Vaykor Marelok', '维寇马洛克'],//副武器，单词缀
        ['Vaykor Sydon', '维寇三叉戟'],//近战武器，单词缀
        ['Vectis Prime', '圣装守望者'],//主武器，单词缀
        ['Venka Prime', '圣装钨钢合金爪'],//近战武器，单词缀
        ['Viper Wraith', '红莲蝰蛇'],//副武器，单词缀
        ['Voidrig Prime', '圣装虚空锐将'],//战甲，单词缀
        ['Volnus Prime', '圣装裂伤战锤'],//近战武器，单词缀
        ['Volt Prime', '圣装伏特'],//战甲，单词缀
        ['Voruna Prime', '圣装赤影狼母'],//战甲，单词缀
        ['Vulkar Wraith', '红莲伏尔卡狙击枪'],//主武器，单词缀
        ['Wisp Prime', '圣装离火幻灵'],//战甲，单词缀
        ['Wukong Prime', '圣装齐天大圣'],//战甲，单词缀
        ['Xaku Prime', '圣装虚空残响'],//战甲，单词缀
        ['Yareli Prime', '圣装咏浪之灵'],//战甲，单词缀
        ['Zakti Prime', '圣装猛毒镖枪'],//副武器，单词缀
        ['Zephyr Prime', '圣装狂啸西风'],//战甲，单词缀
        ['Zhuge Prime', '圣装诸葛连弩'],//主武器，单词缀
//无词缀
        ["Xata's Whisper", "真理密语"],//大嘴技能
        ["Lycath's Hunt", "莱卡斯之猎"],//大嘴技能
        ['Zymos', '邪莫斯'],//副武器
        ['Zylok', '宰洛克'],//副武器
        ['Zipneedle', '飞针'],//组件枪部件
        ['Zipfire', '啸火'],//组件枪部件
        ['Zip', '呼啸'],//组件枪部件
        ['Zhuge', '诸葛连弩'],//主武器
        ['Zephyr', '狂啸西风'],//战甲
        ['Zenith', '天涯'],//主武器
        ['Zenistar', '天顶之星'],//近战武器
        ['Zarr', '煞皇'],//主武器
        ['Zakti', '猛毒镖枪'],//副武器
        ['Yareli', '咏浪之灵'],//战甲
        ['Xoris', '驱魔之刃'],//近战武器
        ['Xaku', '虚空残响'],//战甲
        ['Wyrm', '邪念妖龙'],//宠物
        ['Wukong', '齐天大圣'],//战甲
        ['Wolf Sledge', '恶狼战锤'],//近战武器
        ['Wisp', '离火幻灵'],//战甲
        ['Well of Life', '生命之井'],//大嘴技能
        ['Warcry', '咆哮如雷'],//大嘴技能
        ['Vulklok', '电弧步枪'],//宠物武器
        ['Vulkar', '伏尔卡狙击枪'],//主武器
        ['Vulcax', '火神步枪'],//宠物武器
        ['Voruna', '赤影狼母'],//战甲
        ['Volt', '伏特'],//战甲
        ['Volnus', '裂伤战锤'],//近战武器
        ['Voidrig', '虚空锐将'],//战甲
        ['Vizier Predasite', '宰相扑猎达赛'],//宠物
        ['Vitrica', '金璃剑'],//近战武器
        ['Viper', '蝰蛇'],//副武器
        ['Vial Rush', '药瓶冲撞'],//大嘴技能
        ['Vermisplicer', '虫置'],//组件枪部件
        ['Veritux', '宇宙真理'],//空战武器
        ['Vericres', '真月武扇'],//近战武器
        ['Verglas', '冰凇'],//宠物武器
        ['Verdilac', '蝰首骨妖'],//近战武器
        ['Venka', '钨钢合金爪'],//近战武器
        ['Venato', '脉纹'],//近战武器
        ['Venari', '维纳利'],//宠物
        ['Velox', '逐电'],//副武器
        ['Velocitus', '威洛斯图'],//空战武器
        ['Veldt', '荒野步枪'],//主武器
        ['Vectis', '守望者'],//主武器
        ['Vauban', '工程统帅'],//战甲
        ['Vasto', '瓦斯托'],//副武器
        ['Vastilok', '瓦斯提枪刃'],//近战武器
        ['Vasca Kavat', '噬血型狯犽'],//宠物
        ['Vargeet Ruhang', '拐钩坠'],//天工部件
        ['Vargeet Jai', '拐扣坠'],//天工部件
        ['Valkyr', '瓦尔基里'],//战甲
        ['Tysis', '泰希斯异形'],//副武器
        ['Trumna', '灭杀者'],//主武器
        ['Trinity', '三位一体'],//战甲
        ['Tremor', '发抖'],//组件枪部件
        ['Torid', '爆裂生化炮'],//主武器
        ['Tonkor', '征服榴炮'],//主武器
        ['Tonbo', '龙涎棍'],//近战武器
        ['Tombfinger', '墓指'],//组件枪部件
        ['Titania', '幻蝶仙灵'],//战甲
        ['Tipedo', '提佩多军铲'],//近战武器
        ['Tigris', '泰格里斯'],//主武器
        ['Tiberon', '提贝隆枪刺'],//主武器
        ['Thunderdrum', '雷鼓'],//组件枪部件
        ['Thermal Sunder', '热能抽离'],//大嘴技能
        ['Tharros Strike', '豪勇之击'],//大嘴技能
        ['Tetra', '泰特拉'],//主武器
        ['Tesla Nervos', '特斯拉手雷'],//大嘴技能
        ['Terrify', '恐惧惊骇'],//大嘴技能
        ['Tenora', '泰诺拉'],//主武器
        ['Tempest Barrage', '暴风弹幕'],//大嘴技能
        ['Tekko', '蛇刺'],//近战武器
        ['Tazicor', '电镖步枪'],//宠物武器
        ['Taxon', '复归信标'],//宠物
        ['Tatsu', '龙辰'],//近战武器
        ['Talons', '鹰爪飞镖'],//副武器
        ['Synapse', '焦灼之须'],//主武器
        ['Sydon', '恶龙三叉戟'],//近战武器
        ['Sybaris', '远古丧钟'],//主武器
        ['Swiftfire', '迅火'],//组件枪部件
        ['Sweeper', '清道夫'],//宠物武器
        ['Supra', '量子苏普拉'],//主武器
        ['Sunika Kubrow', '勇猛库狛'],//宠物
        ['Styanax', '无畏斗士'],//战甲
        ['Stug', '斯塔格'],//副武器
        ['Stubba', '斯图巴冲锋手枪'],//副武器
        ['Strun', '斯特朗炮'],//主武器
        ['Stropha', '诡计之刃'],//近战武器
        ['Stradavar', '斯特拉迪瓦'],//主武器
        ['Stitch', '缝针'],//组件枪部件
        ['Stinger', '史丁格毒刺'],//宠物武器
        ['Steflos', '石晶之花'],//主武器
        ['Steadyslam', '稳击'],//组件枪部件
        ['Staticor', '静电势能发射器'],//副武器
        ['Stahlta', '钢刃步枪'],//主武器
        ['Sporothrix', '孢丝感染枪'],//主武器
        ['Sporelacer', '孢射'],//组件枪部件
        ['Splat', '猛砸'],//组件枪部件
        ['Spira', '小李飞刀'],//副武器
        ['Spellbind', '仙尘幻咒'],//大嘴技能
        ['Spectrorage', '辐光幻镜'],//大嘴技能
        ['Spectra', '光谱手枪'],//副武器
        ['Spark', '花火'],//组件枪部件
        ['Sonicor', '超声冲击枪'],//副武器
        ['Soma', '索玛'],//主武器
        ['Sobek', '鳄牙'],//主武器
        ['Snipetron', '特洛恩阳极磁轨枪'],//主武器
        ['Smite', '新星惩击'],//大嘴技能
        ['Smeeta Kavat', '柴郡狯犽'],//宠物
        ['Sly Vulpaphyla', '狡黠狐帕菲拉'],//宠物
        ['Slaytra', '屠煞'],//近战武器
        ['Slapneedle', '撞针'],//组件枪部件
        ['Slap', '冲撞'],//组件枪部件
        ['Skiajati', '暗影侍刃'],//近战武器
        ['Skana', '空灵刃'],//近战武器
        ['Simulor', '重力奇点拟成枪'],//主武器
        ['Silva & Aegis', '希瓦·艾奎斯剑盾'],//近战武器
        ['Silence', '静默光环'],//大嘴技能
        ['Sigma & Octantis', '南极星'],//近战武器
        ['Sicarus', '塞卡洛斯'],//副武器
        ['Sibear', '冰原重锤'],//近战武器
        ['Shuriken', '反转袖箭'],//大嘴技能
        ['Shtung', '特重长握柄'],//天工部件
        ['Shrewd', '机灵'],//组件枪部件
        ['Shooting Gallery', '靶场'],//大嘴技能
        ['Shock', '连锁闪电'],//大嘴技能
        ['Sheev', '西弗'],//近战武器
        ['Shedu', '舍杜'],//主武器
        ['Shaku', '虎骨双节棍'],//近战武器
        ['Shade', '幽冥暗影'],//宠物
        ['Sevagoth', '虚冥鬼影'],//战甲
        ['Serro', '工程支持联接体'],//近战武器
        ['Sepulcrum', '追击者'],//副武器
        ['Sepfahn', '直刃'],//天工部件
        ['Sentient Wrath', '灵煞之怒'],//大嘴技能
        ['Seer', '希尔先知'],//副武器
        ['Seekalla', '轻长握柄'],//天工部件
        ['Scourge', '天罚'],//主武器
        ['Scoliac', '腐尾蛟'],//近战武器
        ['Scindo', '神罚巨斧'],//近战武器
        ['Saryn', '剧毒之触'],//战甲
        ['Sarpa', '蛇刃'],//近战武器
        ['Sarofang', '沙罗之牙'],//近战武器
        ['Sahasa Kubrow', '斥候库狛'],//宠物
        ['Rumblejack', '电匕怪杰'],//近战武器
        ['Ruhang', '钩坠'],//天工部件
        ['Rubico', '绿陶狙击枪'],//主武器
        ['Roar', '征战号角'],//大嘴技能
        ['Ripkas', '覆海蛟'],//近战武器
        ['Rhino', '狂野犀牛'],//战甲
        ['Revenant', '徘徊夜灵'],//战甲
        ['Rest & Rage', '暂息一怒气'],//大嘴技能
        ['Resonator', '低音共振'],//大嘴技能
        ['Redeemer', '救赎者'],//近战武器
        ['Reave', '生气收割'],//大嘴技能
        ['Rattleguts', '响腹'],//组件枪部件
        ['Rathbone', '洛萨之骨'],//空战武器
        ['Ramflare', '耀光'],//组件枪部件
        ['Ramble', '漫谈'],//组件枪部件
        ['Raksa Kubrow', '守护库狛'],//宠物
        ['Radial Blind', '折光致盲'],//大嘴技能
        ['Rabvee', '重锤刃'],//天工部件
        ['Quiver', '百变箭袋'],//大嘴技能
        ['Quellor', '压制者'],//主武器
        ['Quatz', '夸兹'],//副武器
        ['Quassus', '威震战扇'],//近战武器
        ['Quartakk', '夸塔克四管突击步枪'],//主武器
        ['Quanta', '光能量子'],//主武器
        ['Pyrana', '派亚脊刺'],//副武器
        ['Pupacyst', '蛹囊寄生者'],//近战武器
        ['Pulmonars', '感染连枷'],//近战武器
        ['Pull', '万象天引'],//大嘴技能
        ['Prova', '高压电棒'],//近战武器
        ['Protea', '泊时灵械'],//战甲
        ['Praedos', '双雄'],//近战武器
        ['Pox', '异变信标'],//副武器
        ['Plinx', '漫射者'],//副武器
        ['Plasma Sword', '等离子长剑'],//近战武器
        ['Plague Kripath', '异变轻刺刃'],//天工部件
        ['Plague Keewar', '异变重镰刃'],//天工部件
        ['Plague Bokwin', '异变重长握柄'],//天工部件
        ['Plague Akwin', '异变轻短握柄'],//天工部件
        ['Pillage', '野火燎原'],//大嘴技能
        ['Phenmor', '凤殁'],//主武器
        ['Pharaoh Predasite', '法老扑猎达赛'],//宠物
        ['Phantasma', '幻影离子冲击枪'],//主武器
        ['Phage', '菲姬噬菌体'],//主武器
        ['Phaedra', '月蚀'],//空战武器
        ['Peye', '轻短握柄'],//天工部件
        ['Petrify', '石化冰封'],//大嘴技能
        ['Perigale', '月面狂风'],//主武器
        ['Penta', '五芒星榴弹炮'],//主武器
        ['Pennant', '尖幡'],//近战武器
        ['Pathocyst', '病囊飞刃'],//近战武器
        ['Paris', '帕里斯长弓'],//主武器
        ['Paracyst', '附肢寄生者'],//主武器
        ['Paracesis', '贤者之刃'],//近战武器
        ['Para Moa', '副木节恐鸟'],//宠物
        ['Panzer Vulpaphyla', '铁甲狐帕菲拉'],//宠物
        ['Panthera', '猎豹'],//主武器
        ['Pangolin Sword', '鲮鲤剑'],//近战武器
        ['Pandero', '潘德罗'],//副武器
        ['Oxylus', '山林卫士'],//宠物
        ['Orvius', '神庭轮'],//近战武器
        ['Orthos', '双尾鲨'],//近战武器
        ['Opticor', '热熔镭射炮'],//主武器
        ['Ooltha', '长刃'],//天工部件
        ['Onorix', '新星诺里斯'],//空战武器
        ['Oloro Moa', '扇冠恐鸟'],//宠物
        ['Okina', '三叉刺'],//近战武器
        ['Ohma', '欧玛电击棍'],//近战武器
        ['Ogris', '奥基手持火箭炮'],//主武器
        ['Odonata', '远古陨蜓曲翼'],//空战翅膀
        ['Odonata Prime', '圣装远古陨蜓曲翼'],//空战翅膀
        ['Ocucor', '幽浮能量枪'],//副武器
        ['Octavia', '吟游歌者'],//战甲
        ['Obex', '惩戒手刺'],//近战武器
        ['Oberon', '龙王奥伯'],//战甲
        ['Nyx', '冥河夜神'],//战甲
        ['Nychus Moa', '尼丘斯恐鸟'],//宠物
        ['Null Star', '湮灭流星'],//大嘴技能
        ['Nukor', '努克微波'],//副武器
        ['Nova', '超能新星'],//战甲
        ['Nourish', '消化滋养'],//大嘴技能
        ['Ninkondi', '翠玉双截棍'],//近战武器
        ['Nikana', '虎之侍刃'],//近战武器
        ['Nidus', '异变之巢'],//战甲
        ['Nezha', '哪咤三太子'],//战甲
        ['Nepheri', '赤炎流星'],//近战武器
        ['Nekros', '御魂主宰'],//战甲
        ['Nautilus', '鹦鹉螺'],//宠物
        ['Nataruk', '太始弓'],//主武器
        ['Nami Solo', '纳米索隆'],//近战武器
        ['Nami Skyla', '纳米斯凯拉'],//近战武器
        ['Nagantaka', '噬蛇弩'],//主武器
        ['Multron', '速射步枪'],//宠物武器
        ['Morgha', '置灵者'],//空战武器
        ['Molt', '蛇形蜕皮'],//大嘴技能
        ['Miter', '米特锯刃发射器'],//主武器
        ['Mire', '米雷泥沼'],//近战武器
        ['Mirage', '魅影精灵'],//战甲
        ['Mios', '米奥斯鞭刃'],//近战武器
        ['Mind Control', '心灵控制'],//大嘴技能
        ['Mewan', '重长刃'],//天工部件
        ['Mesa', '圣枪弥撒'],//战甲
        ['Medjay Predasite', '守卫扑猎达赛'],//宠物
        ['Mausolon', '惩戒者'],//空战武器
        ['Masseter', '咀嚼金棒'],//近战武器
        ['Marelok', '马洛克'],//副武器
        ['Magnus', '猛犸手枪'],//副武器
        ['Magistar', '真理权杖'],//近战武器
        ['Mag', '磁力'],//战甲
        ['Machete', '精英阔刀'],//近战武器
        ['Lull', '镇静'],//大嘴技能
        ['Lovetap', '爱抚'],//组件枪部件
        ['Loki', '邪神洛基'],//战甲
        ['Limbo', '灵薄狱'],//战甲
        ['Lex', '秩序之握'],//副武器
        ['Lesion', '毒伤之颚'],//近战武器
        ['Lenz', '楞次复合弓'],//主武器
        ['Lecta', '僵直电鞭'],//近战武器
        ['Lavos', '无限术士'],//战甲
        ['Latron', '拉特龙半自动步枪'],//主武器
        ['Lato', '拉托'],//副武器
        ['Laser Rifle', '激光步枪'],//宠物武器
        ['Larva', '卷须触肢'],//大嘴技能
        ['Larkspur', '翠雀'],//空战武器
        ['Lanka', '兰卡原能加速枪'],//主武器
        ['Lambeo Moa', '兰伯恐鸟'],//宠物
        ['Laka', '短握柄'],//天工部件
        ['Laetum', '奏凯'],//副武器
        ['Lacerten', '莱斯腾'],//宠物武器
        ['Lacera', '绝情双剪'],//近战武器
        ['Kwath', '重短握柄'],//天工部件
        ['Kunai', '苦无'],//副武器
        ['Kulstar', '集束鱼雷发射器'],//副武器
        ['Kroostra', '重长握柄'],//天工部件
        ['Kronsh', '重弯刃'],//天工部件
        ['Kronen', '弧月刀'],//近战武器
        ['Krohkur', '钩刃剑'],//近战武器
        ['Kreska', '克莱斯卡'],//近战武器
        ['Kraken', '北海巨妖'],//副武器
        ['Korumm', '雷霆暴君'],//近战武器
        ['Korrudo', '库鲁多'],//近战武器
        ['Korb', '特重短握柄'],//天工部件
        ['Kompressa', '卡帕压力枪'],//副武器
        ['Komorex', '猛毒'],//主武器
        ['Kohmak', '寇玛热能炮'],//副武器
        ['Kohm', '聚能瓦斯炮'],//主武器
        ['Kogake', '牢笼拳套'],//近战武器
        ['Knux', '雷格之拳'],//空战武器
        ['Knell', '噩兆'],//副武器
        ['Killstream', '连袭'],//组件枪部件
        ['Khora', '荒野猎手'],//战甲
        ['Kestrel', '红隼'],//近战武器
        ['Kesheg', '禁卫长戟'],//近战武器
        ['Keratinos', '卡提努之爪'],//近战武器
        ['Kaszas', '武者战镰'],//空战武器
        ['Karyst', '困惑之刃'],//近战武器
        ['Karak', '超体步枪'],//主武器
        ['Kama', '迦摩天战镰'],//近战武器
        ['Jayap', '长握柄'],//天工部件
        ['Jaw Sword', '蛇颚刀'],//近战武器
        ['Javlok', '爆燃矛枪'],//主武器
        ['Jat Kusar', '爆燃锁镰'],//近战武器
        ['Jat Kittag', '氪金狼牙棒'],//近战武器
        ['Jai', '扣坠'],//天工部件
        ['Ivara', '神弓游侠'],//战甲
        ['Itzal', '刺峰'],//空战翅膀
        ['Ironbride', '铁嫁'],//空战武器
        ['Innodem', '清刚'],//近战武器
        ['Inaros', '沙海怒涛'],//战甲
        ['Imperator', '皇蟒'],//空战武器
        ['Ignis', '爆燃喷射器'],//主武器
        ['Ice Wave', '极寒冰浪'],//大嘴技能
        ['Hystrix', '豪猪镖枪'],//副武器
        ['Hydroid', '惊涛骇浪'],//战甲
        ['Huras Kubrow', '狩猎库狛'],//宠物
        ['Hirudo', '血蛭'],//近战武器
        ['Hind', '雌鹿半自动步枪'],//主武器
        ['Hildryn', '重装武神'],//战甲
        ['Hikou', '星镖'],//副武器
        ['Hespar', '暮斩'],//近战武器
        ['Hema', '希玛异变体'],//主武器
        ['Helstrum', '赫尔斯壮'],//宠物武器
        ['Helminth Charger', '赫明斯巢体寄生疾冲者'],//宠物
        ['Helios', '太阳之神'],//宠物
        ['Heliocor', '太阳神锤'],//近战武器
        ['Hek', '狂神'],//主武器
        ['Hec Hound', '骸克猎犬'],//宠物
        ['Heat Sword', '烈焰长剑'],//近战武器
        ['Heat Dagger', '烈焰短剑'],//近战武器
        ['Haymaker', '重击'],//组件枪部件
        ['Hate', '厌弃'],//近战武器
        ['Harrow', '驱魔使者'],//战甲
        ['Harpak', '猎魂捕鲸炮'],//主武器
        ['Halikar', '喷射飞锤'],//近战武器
        ['Gyre', '电光舞者'],//战甲
        ['Gunsen', '铁骨军扇'],//近战武器
        ['Guandao', '偃月刀'],//近战武器
        ['Grinlok', '尖叫小丑'],//主武器
        ['Grendel', '暴食者'],//战甲
        ['Grattler', '反重力空气枪'],//空战武器
        ['Gram', '格拉姆'],//近战武器
        ['Grakata', '格拉达火舌'],//主武器
        ['Gorgon', '蛇发女妖'],//主武器
        ['Gloom', '惨淡'],//大嘴技能
        ['Glaxion', '急冻冰枪'],//主武器
        ['Glaive', '回旋刃'],//近战武器
        ['Gibber', '急语'],//组件枪部件
        ['Ghoulsaw', '尸鬼电锯'],//近战武器
        ['Gaze', '凝视'],//组件枪部件
        ['Gauss', '迅电驰影'],//战甲
        ['Garuda', '迦楼罗'],//战甲
        ['Gara', '琉璃仕女'],//战甲
        ['Gammacor', '射线发生仪'],//副武器
        ['Galvacord', '电流刺索'],//近战武器
        ['Galatine', '加拉丁暗影'],//近战武器
        ['Fusilai', '琉璃飞刀'],//副武器
        ['Furis', '弗里斯手枪'],//副武器
        ['Furax', '寄居蟹手刺'],//近战武器
        ['Fulmin', '雷霆'],//主武器
        ['Frost', '冰雪寒霜'],//战甲
        ['Fragor', '悲悯'],//近战武器
        ['Flux Rifle', '热能步枪'],//主武器
        ['Flutterfire', '曳火'],//组件枪部件
        ['Fluctus', '巨浪'],//空战武器
        ['Fire Walker', '风火霹雳'],//大嘴技能
        ['Fire Blast', '火焰冲击'],//大嘴技能
        ['Ferrox', '铁磁式激光矛枪'],//主武器
        ['Felarx', '逐枭'],//主武器
        ['Fang', '狼牙双刃'],//近战武器
        ['Falcor', '猎鹰回旋刃'],//近战武器
        ['Exergis', '晶能放射器'],//主武器
        ['Excalibur', '圣剑'],//战甲
        ['Ether Sword', '苍穹之剑'],//近战武器
        ['Ether Reaper', '苍穹夜神'],//近战武器
        ['Ether Daggers', '苍穹匕首'],//近战武器
        ['Equinox', '阴阳双子'],//战甲
        ['Epitaph', '葬铭'],//副武器
        ['Ensnare', '活钢陷阱'],//大嘴技能
        ['Endura', '苦行刺剑'],//近战武器
        ['Embolist', '蛇颅'],//副武器
        ['Ember', '永恒烈焰'],//战甲
        ['Elytron', '断脊鳞'],//空战翅膀
        ['Elemental Ward', '元素之护'],//大嘴技能
        ['Ekwana Ruhang', '双钩环坠'],//天工部件
        ['Ekwana Jai', '环扣坠'],//天工部件
        ['Ekwana II Ruhang', '双环钩坠'],//天工部件
        ['Ekwana II Jai', '双环扣坠'],//天工部件
        ['Eclipse', '黯然失色'],//大嘴技能
        ['Dread', '惊恐'],//主武器
        ['Drakgoon', '龙息匣炮'],//主武器
        ['Dorma Hound', '铎玛猎犬'],//宠物
        ['Dokrahm', '轻镰刃'],//天工部件
        ['Djinn', '暗影邪灵'],//宠物
        ['Dispensary', '后勤支援'],//大嘴技能
        ['Diriga', '电弧气囊'],//宠物
        ['Detron', '迪特隆'],//副武器
        ['Dethcube', '寂灭魔方'],//宠物
        ['Deth Machine Rifle', '冷酷机枪'],//宠物武器
        ['Destreza', '护手刺剑'],//近战武器
        ['Despair', '无妄'],//副武器
        ['Desiccation', '灼沙卷浪'],//大嘴技能
        ['Dera', '德拉'],//主武器
        ['Dehtat', '轻刺刃'],//天工部件
        ['Defy', '腾云驾雾'],//大嘴技能
        ['Deepbreath', '深呼吸'],//组件枪部件
        ['Decoy', '欺诈诱饵'],//大嘴技能
        ['Deconstructor', '爆能分解'],//宠物武器
        ['Dark Sword', '暗影长剑'],//近战武器
        ['Dark Split-Sword', '暗影子母剑'],//近战武器
        ['Dark Dagger', '暗影匕首'],//近战武器
        ['Daikyu', '大久和弓'],//主武器
        ['Cyngas', '复合瓦斯炮'],//空战武器
        ['Cycron', '循环式电浆手枪'],//副武器
        ['Cyath', '弯刃'],//天工部件
        ['Cyanex', '氰毒'],//副武器
        ['Cryotra', '冷冻射线枪'],//宠物武器
        ['Cronus', '克洛诺斯'],//近战武器
        ['Crescent Vulpaphyla', '月刃狐帕菲拉'],//宠物
        ['Corvas', '黑鸦'],//空战武器
        ['Corufell', '闪劫'],//近战武器
        ['Cortege', '送葬者'],//空战武器
        ['Corinth', '科林斯泵动式霰弹枪'],//主武器
        ['Convectrix', '对流射线发生器'],//主武器
        ['Condemn', '定罪锁链'],//大嘴技能
        ['Coil Horizon', '旋爆视界'],//大嘴技能
        ['Cobra & Crane', '眼镜蛇与鹤'],//近战武器
        ['Citrine', '辉光晶灵'],//战甲
        ['Chroma', '怒炎龙骑'],//战甲
        ['Chesa Kubrow', '寻宝库狛'],//宠物
        ['Cestra', '逆转聚能炮'],//副武器
        ['Cernos', '瑟诺斯长弓'],//主武器
        ['Cerata', '蛟鳃刃'],//近战武器
        ['Ceramic Dagger', '精瓷匕首'],//近战武器
        ['Centaur', '半人马'],//空战武器
        ['Cedo', '塞多'],//主武器
        ['Caustacyst', '腐蚀寄生者'],//近战武器
        ['Catchmoon', '射月'],//组件枪部件
        ['Catabolyst', '异化者'],//副武器
        ['Castanas', '分体式处理信标'],//副武器
        ['Cassowar', '鹤鸵双头戟'],//近战武器
        ['Carrier', '搬运信使'],//宠物
        ['Caliban', '卡利班'],//战甲
        ['Cadus', '光棍'],//近战武器
        ['Buzlok', '反击黄鼬'],//主武器
        ['Burston', '伯斯顿步枪'],//主武器
        ['Burst Laser', '爆发激光发射器'],//宠物武器
        ['Bubonico', '横痃重炮'],//主武器
        ['Bronco', '布隆克烈驹'],//副武器
        ['Broken Scepter', '破碎的权杖'],//近战武器
        ['Breach Surge', '裂口涌流'],//大嘴技能
        ['Braton', '制式步枪'],//主武器
        ['Brash', '骤雨'],//组件枪部件
        ['Brakk', '布拉克'],//副武器
        ['Bonewidow', '骨骸寡妇'],//战甲
        ['Boltor', '波尔托骨刺'],//主武器
        ['Bolto', '角犀'],//副武器
        ['Boltace', '螺钉弧月刀'],//近战武器
        ['Boar', '雄猪霰弹枪'],//主武器
        ['Blood Altar', '鲜血祭坛'],//大嘴技能
        ['Bhaira Hound', '拜拉猎犬'],//宠物
        ['Bellows', '咆哮'],//组件枪部件
        ['Baza', '苍鹰冲锋枪'],//主武器
        ['Battacor', '纷争能量枪'],//主武器
        ['Batoten', '巴托腾'],//宠物武器
        ['Basmu', '巴什穆'],//主武器
        ['Bashrack', '痛殴'],//组件枪部件
        ['Baruuk', '圣拳武僧'],//战甲
        ['Banshee', '恸哭女妖'],//战甲
        ['Banish', '裂隙放逐'],//大嘴技能
        ['Ballistica', '惊惧手弩'],//副武器
        ['Balla', '轻短刃'],//天工部件
        ['Azima', '日冕'],//副武器
        ['Attica', '阿提卡重弩'],//主武器
        ['Atterax', '刑罚绞索'],//近战武器
        ['Atomos', '原子矿融炮'],//副武器
        ['Atlas', '撼天刑者'],//战甲
        ['Athodai', '阿索代'],//副武器
        ['Astilla', '碎晶霰弹枪'],//主武器
        ['Ash', '灰烬之刃'],//战甲
        ['Arum Spinosa', '疆南星刺'],//近战武器
        ['Artemis Bow', '月神弓'],//显赫武器
        ['Artax', '冰冻光束'],//宠物武器
        ['Argonak', '阿格那突击步枪'],//主武器
        ['Arca Titron', '弧光蓄电重锤'],//近战武器
        ['Arca Scisco', '弧光探导手枪'],//副武器
        ['Arca Plasmor', '弧光等离子冲击枪'],//主武器
        ['Aquablades', '水形之刃'],//大嘴技能
        ['Ankyros', '安奇洛斯拳套'],//近战武器
        ['Anku', '侍魂镰'],//近战武器
        ['Angstrum', '将军手持短炮'],//副武器
        ['Amprex', '安普斯雷电'],//主武器
        ['Amphis', '安菲斯'],//近战武器
        ['Amesha', '圣火之翼'],//空战翅膀
        ['Ambassador', '使节'],//主武器
        ['Alternox', '电幻步枪'],//主武器
        ['Akzani', '双持欢喜丸'],//副武器
        ['Akvasto', '双持瓦斯托'],//副武器
        ['Akstiletto', '双持西提列托'],//副武器
        ['Aksomati', '轻灵索玛双枪'],//副武器
        ['Akmagnus', '猛犸双枪'],//副武器
        ['Aklex', '双持秩序之握'],//副武器
        ['Aklato', '双持拉托'],//副武器
        ['Akjagara', '觉醒双枪'],//副武器
        ['Akbronco', '双持布隆克烈驹'],//副武器
        ['Akbolto', '双持角犀'],//副武器
        ['Akaten', '阿卡腾'],//宠物武器
        ['Akarius', '阿利乌'],//副武器
        ['Airburst', '俯冲轰炸'],//大嘴技能
        ['Agkuza', '钩刃巨剑'],//空战武器
        ['Afuris', '双持弗里斯手枪'],//副武器
        ['Afentis', '圣英'],//主武器
        ['Aeolak', '风鸣'],//主武器
        ['Aegrit', '骇敌榴弹'],//副武器
        ['Adarza Kavat', '灵镜狯犽'],//宠物
        ['Acrid', '刻薄毒镖'],//副武器
        ['Ack & Brunt', '龟背盾斧'],//近战武器
        ['Acceltra', '迅发电浆炮'],//主武器
//词根
        ['War', '纷争'],//近战武器
        ['Bo', '破禅武杖'],//近战武器


    ])

    replaceText(document.body)

    const bodyObserver = new MutationObserver(mutations => {
      mutations.forEach(mutation => {
        mutation.addedNodes.forEach(addedNode => replaceText(addedNode))
      })
    })
    bodyObserver.observe(document.body, { childList: true, subtree: true })

    function replaceText(node) {
      nodeForEach(node).forEach(htmlnode => {
        i18n.forEach((value, index) => {
          // includes可直接使用 === 以提高匹配精度
          const textReg = new RegExp(index, 'g')
          if (htmlnode instanceof Text && htmlnode.nodeValue.includes(index))
            htmlnode.nodeValue = htmlnode.nodeValue.replace(textReg, value)
          else if (htmlnode instanceof HTMLInputElement && htmlnode.value.includes(index))
            htmlnode.value = htmlnode.value.replace(textReg, value)
        })
      })
    }

    function nodeForEach(node) {
      const list = []
      if (node.childNodes.length === 0) list.push(node)
      else {
        node.childNodes.forEach(child => {
          if (child.childNodes.length === 0) list.push(child)
          else list.push(...nodeForEach(child))
        })
      }
      return list
    }
})();