// ==UserScript==
// @name         overframe国服名称替换国际服名称
// @namespace    https://
// @version      0.2
// @description  以文本替换方式实现游戏名词国服化，基于国际服简中名称替换，搜索时请使用原名称。PS：本人代码文盲，此脚本为使用别人现有脚本改造而成，欢迎有能力的朋友做出更优秀脚本。原脚本地址：https://greasyfork.org/zh-CN/scripts/376441-soldout-2-%E6%96%87%E6%9C%AC%E6%9B%BF%E6%8D%A2
// @author       ye
// @match        https://overframe.gg/*
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/461507/overframe%E5%9B%BD%E6%9C%8D%E5%90%8D%E7%A7%B0%E6%9B%BF%E6%8D%A2%E5%9B%BD%E9%99%85%E6%9C%8D%E5%90%8D%E7%A7%B0.user.js
// @updateURL https://update.greasyfork.org/scripts/461507/overframe%E5%9B%BD%E6%9C%8D%E5%90%8D%E7%A7%B0%E6%9B%BF%E6%8D%A2%E5%9B%BD%E9%99%85%E6%9C%8D%E5%90%8D%E7%A7%B0.meta.js
// ==/UserScript==


(function() {
    'use strict';

    const i18n = new Map([
//界面
    ['Top Builds', '最佳配卡'],
        ['分类', '排序'],
            ['RATING', '评价'],
            ['LAST UPDATED', '最后更新日期'],
            ['FORMA COUNT', '福马消耗量'],
            [' 🢃', ' 高'],
            [' 🢁', ' 低'],
            ['NAME', '名称'],
        ['Updated since', '更新时间'],
            ['Any Time', '任何时间'],
        ['Build name', '配卡名称'],
        ['WARFRAME', '战甲'],
        ['ARCHWING', '空战'],
    ['Tier List', '排行榜'],
        ['HELMINTH', '赫明斯'],
        ['DISPLAY:', '显示：'],
        ['TIERS', '级别'],
        ['VOTES', '评分'],
        ['Tier', '级'],
    ['New Build', '新建配卡'],
//特殊
        ['丧钟 Prime', '圣装噩兆'],//副武器
        ['丧钟', '噩兆'],//副武器，在 席芭莉丝 前
        ['风起云涌', '风暴降临'],//战甲MOD，在 终焉风暴 前
        ['强化刀锋', '剑刃注能'],//光环MOD，在 强化刀片 前
//战甲，单词缀
        ['Zephyr Prime', '圣装狂啸西风'],//战甲
        ['Yareli Prime', '圣装咏浪之灵'],//战甲
        ['Xaku Prime', '圣装虚空残响'],//战甲
        ['Wukong Prime', '圣装齐天大圣'],//战甲
        ['Wisp Prime', '圣装离火幻灵'],//战甲
        ['Voruna Prime', '圣装赤影狼母'],//战甲
        ['Volt Prime', '圣装伏特'],//战甲
        ['Voidrig Prime', '圣装虚空锐将'],//战甲
        ['Vauban Prime', '圣装工程统帅'],//战甲
        ['Valkyr Prime', '圣装瓦尔基里'],//战甲
        ['Trinity Prime', '圣装三位一体'],//战甲
        ['Titania Prime', '圣装幻蝶仙灵'],//战甲
        ['Styanax Prime', '圣装无畏斗士'],//战甲
        ['Sevagoth Prime', '圣装虚冥鬼影'],//战甲
        ['Saryn Prime', '圣装剧毒之触'],//战甲
        ['Rhino Prime', '圣装狂野犀牛'],//战甲
        ['Revenant Prime', '圣装徘徊夜灵'],//战甲
        ['Protea Prime', '圣装泊时灵械'],//战甲
        ['Octavia Prime', '圣装吟游歌者'],//战甲
        ['Oberon Prime', '圣装龙王奥伯'],//战甲
        ['Nyx Prime', '圣装冥河夜神'],//战甲
        ['Nova Prime', '圣装超能新星'],//战甲
        ['Nidus Prime', '圣装异变之巢'],//战甲
        ['Nezha Prime', '圣装哪咤三太子'],//战甲
        ['Nekros Prime', '圣装御魂主宰'],//战甲
        ['Mirage Prime', '圣装魅影精灵'],//战甲
        ['Mesa Prime', '圣装圣枪弥撒'],//战甲
        ['Mag Prime', '圣装磁力'],//战甲
        ['Loki Prime', '圣装邪神洛基'],//战甲
        ['Limbo Prime', '圣装灵薄狱'],//战甲
        ['Lavos Prime', '圣装无限术士'],//战甲
        ['Khora Prime', '圣装荒野猎手'],//战甲
        ['Ivara Prime', '圣装神弓游侠'],//战甲
        ['Inaros Prime', '圣装沙海怒涛'],//战甲
        ['Hydroid Prime', '圣装惊涛骇浪'],//战甲
        ['Hildryn Prime', '圣装重装武神'],//战甲
        ['Harrow Prime', '圣装驱魔使者'],//战甲
        ['Gyre Prime', '圣装电光舞者'],//战甲
        ['Grendel Prime', '圣装暴食者'],//战甲
        ['Gauss Prime', '圣装迅电驰影'],//战甲
        ['Garuda Prime', '圣装迦楼罗'],//战甲
        ['Gara Prime', '圣装琉璃仕女'],//战甲
        ['Frost Prime', '圣装冰雪寒霜'],//战甲
        ['Excalibur Umbra', '暗影圣剑'],//战甲
        ['Equinox Prime', '圣装阴阳双子'],//战甲
        ['Ember Prime', '圣装永恒烈焰'],//战甲
        ['Citrine Prime', '圣装辉光晶灵'],//战甲
        ['Chroma Prime', '圣装怒炎龙骑'],//战甲
        ['Caliban Prime', '圣装卡利班'],//战甲
        ['Bonewidow Prime', '圣装骨骸寡妇'],//战甲
        ['Baruuk Prime', '圣装圣拳武僧'],//战甲
        ['Banshee Prime', '圣装恸哭女妖'],//战甲
        ['Atlas Prime', '圣装撼天刑者'],//战甲
        ['Ash Prime', '圣装灰烬之刃'],//战甲
//战甲
        ['Zephyr', '狂啸西风'],//战甲
        ['Yareli', '咏浪之灵'],//战甲
        ['Xaku', '虚空残响'],//战甲
        ['Wukong', '齐天大圣'],//战甲
        ['Wisp', '离火幻灵'],//战甲
        ['Voruna', '赤影狼母'],//战甲
        ['Volt', '伏特'],//战甲
        ['Voidrig', '虚空锐将'],//战甲
        ['Vauban', '工程统帅'],//战甲
        ['Valkyr', '瓦尔基里'],//战甲
        ['Trinity', '三位一体'],//战甲
        ['Titania', '幻蝶仙灵'],//战甲
        ['Styanax', '无畏斗士'],//战甲
        ['Sevagoth', '虚冥鬼影'],//战甲
        ['Saryn', '剧毒之触'],//战甲
        ['Rhino', '狂野犀牛'],//战甲
        ['Revenant', '徘徊夜灵'],//战甲
        ['Protea', '泊时灵械'],//战甲
        ['Octavia', '吟游歌者'],//战甲
        ['Oberon', '龙王奥伯'],//战甲
        ['Nyx', '冥河夜神'],//战甲
        ['Nova', '超能新星'],//战甲
        ['Nidus', '异变之巢'],//战甲
        ['Nezha', '哪咤三太子'],//战甲
        ['Nekros', '御魂主宰'],//战甲
        ['Mirage', '魅影精灵'],//战甲
        ['Mesa', '圣枪弥撒'],//战甲
        ['Mag', '磁力'],//战甲
        ['Loki', '邪神洛基'],//战甲
        ['Limbo', '灵薄狱'],//战甲
        ['Lavos', '无限术士'],//战甲
        ['Khora', '荒野猎手'],//战甲
        ['Ivara', '神弓游侠'],//战甲
        ['Inaros', '沙海怒涛'],//战甲
        ['Hydroid', '惊涛骇浪'],//战甲
        ['Hildryn', '重装武神'],//战甲
        ['Harrow', '驱魔使者'],//战甲
        ['Gyre', '电光舞者'],//战甲
        ['Grendel', '暴食者'],//战甲
        ['Gauss', '迅电驰影'],//战甲
        ['Garuda', '迦楼罗'],//战甲
        ['Gara', '琉璃仕女'],//战甲
        ['Frost', '冰雪寒霜'],//战甲
        ['Excalibur', '圣剑'],//战甲
        ['Equinox', '阴阳双子'],//战甲
        ['Ember', '永恒烈焰'],//战甲
        ['Citrine', '辉光晶灵'],//战甲
        ['Chroma', '怒炎龙骑'],//战甲
        ['Caliban', '卡利班'],//战甲
        ['Bonewidow', '骨骸寡妇'],//战甲
        ['Baruuk', '圣拳武僧'],//战甲
        ['Banshee', '恸哭女妖'],//战甲
        ['Atlas', '撼天刑者'],//战甲
        ['Ash', '灰烬之刃'],//战甲
//大嘴技能
        ['战术箭袋', '百变箭袋'],//大嘴技能
        ['战吼', '征战号角'],//大嘴技能
        ['责难束缚', '定罪锁链'],//大嘴技能
        ['诱饵', '欺诈诱饵'],//大嘴技能
        ['幼体', '卷须触肢'],//大嘴技能
        ['湮灭流星群', '湮灭流星'],//大嘴技能
        ['吸引', '万象天引'],//大嘴技能
        ['蜕皮', '蛇形蜕皮'],//大嘴技能
        ['特斯拉电激', '特斯拉手雷'],//大嘴技能
        ['死命顽抗', '腾云驾雾'],//大嘴技能
        ['束缚陷阱', '活钢陷阱'],//大嘴技能
        ['手里剑', '反转袖箭'],//大嘴技能
        ['石化凝视', '石化冰封'],//大嘴技能
        ['咆哮', '咆哮如雷'],//大嘴技能，在 风箱 前
        ['迷尘', '仙尘幻咒'],//大嘴技能
        ['掠夺', '野火燎原'],//大嘴技能
        ['枯沙竭血', '灼沙卷浪'],//大嘴技能
        ['空爆', '俯冲轰炸'],//大嘴技能
        ['静音', '静默光环'],//大嘴技能
        ['精神控制', '心灵控制'],//大嘴技能
        ['精华掠夺', '生气收割'],//大嘴技能
        ['惊骇', '恐惧惊骇'],//大嘴技能
        ['广域致盲', '折光致盲'],//大嘴技能
        ['光谱盛怒', '辐光幻镜'],//大嘴技能
        ['共鸣渲染', '低音共振'],//大嘴技能
        ['风火飞轮', '风火霹雳'],//大嘴技能
        ['放逐', '裂隙放逐'],//大嘴技能
        ['电击', '连锁闪电'],//大嘴技能
        ['惩击', '新星惩击'],//大嘴技能
        ['冰浪', '极寒冰浪'],//大嘴技能
        ['暴风雨弹幕', '暴风弹幕'],//大嘴技能
        ['Sentient 之怒', '灵煞之怒'],//大嘴技能
//主武器，单词缀
        ['诸葛连弩 Prime', '圣装诸葛连弩'],//主武器
        ['终极·螺钉步枪', '终极波尔托骨刺'],//主武器
        ['月神 Prime', '圣装索玛'],//主武器
        ['勇气·海克', '维寇狂神'],//主武器
        ['伊格尼斯·亡魂', '红莲爆燃喷射器'],//主武器
        ['野猪 Prime', '圣装雄猪霰弹枪'],//主武器
        ['嫣红·潘塔', '绯红五芒星榴弹炮'],//主武器
        ['信条·通量步枪', '信条热能步枪'],//主武器
        ['信条·铁晶磁轨炮', '信条铁磁式激光矛枪'],//主武器
        ['信条·特拉', '信条泰特拉'],//主武器
        ['信条·弧电离子枪', '信条弧光等离子冲击枪'],//主武器
        ['信条·典客', '信条特使'],//主武器
        ['席芭莉丝 Prime', '圣装远古丧钟'],//主武器
        ['西诺斯 Prime', '圣装瑟诺斯长弓'],//主武器
        ['碎裂者 Prime', '圣装碎晶霰弹枪'],//主武器
        ['苏普拉·破坏者', '镇暴量子苏普拉'],//主武器
        ['斯特朗·亡魂', '红莲斯特朗炮'],//主武器
        ['斯特朗 Prime', '圣装斯特朗炮'],//主武器
        ['斯特拉迪瓦 Prime', '圣装斯特拉迪瓦'],//主武器
        ['双簧管 Prime', '圣装泰诺拉'],//主武器
        ['枢议·重力奇点拟成枪', '辛诺德重力奇点拟成枪'],//主武器
        ['守望者 Prime', '圣装守望者'],//主武器
        ['噬蛇弩 Prime', '圣装噬蛇弩'],//主武器
        ['圣洁·猛虎', '圣洁泰格里斯'],//主武器
        ['蛇发女妖·亡魂', '红莲蛇发女妖'],//主武器
        ['帕里斯 Prime', '圣装帕里斯长弓'],//主武器
        ['猛虎 Prime', '圣装泰格里斯'],//主武器
        ['螺钉步枪 Prime', '圣装波尔托骨刺'],//主武器
        ['猎豹 Prime', '圣装猎豹'],//主武器
        ['量子切割器·破坏者', '镇暴光能量子'],//主武器
        ['冷冻光束步枪·破坏者', '镇暴急冻冰枪'],//主武器
        ['棱晶·特拉', '棱晶泰特拉'],//主武器
        ['棱晶·蛇发女妖', '棱晶蛇发女妖'],//主武器
        ['棱晶·葛拉卡达', '棱晶格拉达火舌'],//主武器
        ['棱晶·葛恩火枪', '棱晶尖叫小丑'],//主武器
        ['拉特昂·亡魂', '红莲拉特龙半自动步枪'],//主武器
        ['拉特昂 Prime', '圣装拉特龙半自动步枪'],//主武器
        ['狂鲨 Prime', '圣装提贝隆枪刺'],//主武器
        ['科林斯 Prime', '圣装科林斯泵动式霰弹枪'],//主武器
        ['卡拉克·亡魂', '红莲超体步枪'],//主武器
        ['绝路 Prime', '圣装绿陶狙击枪'],//主武器
        ['狙击特昂·破坏者', '镇暴特洛恩阳极磁轨枪'],//主武器
        ['金工火神·亡魂', '红莲伏尔卡狙击枪'],//主武器
        ['祸根 Prime', '圣装天罚'],//主武器
        ['幻离子 Prime', '圣装幻影离子冲击枪'],//主武器
        ['绯红·西诺斯', '拉克塔瑟诺斯长弓'],//主武器
        ['德拉·破坏者', '镇暴德拉'],//主武器
        ['赤毒·征服榴炮', '赤毒征服榴炮'],//主武器
        ['赤毒·邪眼', '赤毒邪眼'],//主武器
        ['赤毒·食人女魔', '赤毒奥基手持火箭炮'],//主武器
        ['赤毒·沙皇', '赤毒煞皇'],//主武器
        ['赤毒·龙骑兵', '赤毒龙息匣炮'],//主武器
        ['赤毒·夸塔克', '赤毒夸塔克四管突击步枪'],//主武器
        ['赤毒·寇恩热能枪', '赤毒聚能瓦斯炮'],//主武器
        ['赤毒·卡拉克', '赤毒超体步枪'],//主武器
        ['赤毒·海克', '赤毒狂神'],//主武器
        ['赤毒·雌鹿', '赤毒雌鹿半自动步枪'],//主武器
        ['赤毒·布拉玛', '赤毒布拉玛'],//主武器
        ['苍鹰 Prime', '圣装苍鹰冲锋枪'],//主武器
        ['布莱顿·破坏者', '镇暴制式步枪'],//主武器
        ['布莱顿 Prime', '圣装制式步枪'],//主武器
        ['伯斯顿 Prime', '圣装伯斯顿步枪'],//主武器
        ['保障·潘塔', '瑟古拉五芒星榴弹炮'],//主武器
        ['奥堤克光子枪·破坏者', '镇暴热熔镭射炮'],//主武器
        ['MK1-斯特朗', '试用型-斯特朗炮'],//主武器
        ['MK1-帕里斯', '试用型-帕里斯长弓'],//主武器
        ['MK1-布莱顿', '试用型-制式步枪'],//主武器
        ['Dex 席芭莉丝', '灵敏远古丧钟'],//主武器
//主武器
        ['异融西诺斯', '异融瑟诺斯长弓'],//主武器
        ['异融量子枪', '异融光能量子'],//主武器
        ['伊格尼斯', '爆燃喷射器'],//主武器
        ['野猪', '雄猪霰弹枪'],//主武器
        ['氩格纳克', '阿格那突击步枪'],//主武器
        ['血肢', '希玛异变体'],//主武器
        ['席芭莉丝', '远古丧钟'],//主武器
        ['西诺斯', '瑟诺斯长弓'],//主武器
        ['武使之力', '纷争能量枪'],//主武器
        ['托里德', '爆裂生化炮'],//主武器
        ['突触生化枪', '焦灼之须'],//主武器
        ['通量步枪', '热能步枪'],//主武器
        ['铁晶磁轨炮', '铁磁式激光矛枪'],//主武器
        ['天穹之顶', '天涯'],//主武器
        ['特拉', '泰特拉'],//主武器
        ['碎裂者', '碎晶霰弹枪'],//主武器
        ['苏普拉', '量子苏普拉'],//主武器
        ['斯特朗', '斯特朗炮'],//主武器
        ['双簧管', '泰诺拉'],//主武器
        ['噬菌者', '菲姬噬菌体'],//主武器
        ['食人女魔', '奥基手持火箭炮'],//主武器
        ['沙皇', '煞皇'],//主武器
        ['燃焰标枪', '爆燃矛枪'],//主武器
        ['潘塔', '五芒星榴弹炮'],//主武器
        ['帕里斯', '帕里斯长弓'],//主武器
        ['米特尔', '米特锯刃发射器'],//主武器
        ['猛虎', '泰格里斯'],//主武器
        ['螺钉步枪', '波尔托骨刺'],//主武器
        ['龙骑兵', '龙息匣炮'],//主武器
        ['量子切割器', '光能量子'],//主武器
        ['冷冻光束步枪', '急冻冰枪'],//主武器
        ['楞次弓', '楞次复合弓'],//主武器
        ['兰卡', '兰卡原能加速枪'],//主武器
        ['拉特昂', '拉特龙半自动步枪'],//主武器
        ['狂鲨', '提贝隆枪刺'],//主武器
        ['夸塔克', '夸塔克四管突击步枪'],//主武器
        ['寇恩热能枪', '聚能瓦斯炮'],//主武器
        ['恐惧', '惊恐'],//主武器
        ['科林斯', '科林斯泵动式霰弹枪'],//主武器
        ['卡拉克', '超体步枪'],//主武器
        ['绝路', '绿陶狙击枪'],//主武器
        ['狙击特昂', '特洛恩阳极磁轨枪'],//主武器
        ['金工火神', '伏尔卡狙击枪'],//主武器
        ['祸根', '天罚'],//主武器
        ['幻离子', '幻影离子冲击枪'],//主武器
        ['弧电离子枪', '弧光等离子冲击枪'],//主武器
        ['海克', '狂神'],//主武器
        ['哈帕克', '猎魂捕鲸炮'],//主武器
        ['葛拉卡达', '格拉达火舌'],//主武器
        ['葛恩火枪', '尖叫小丑'],//主武器
        ['鳄神', '鳄牙'],//主武器
        ['导热聚焦枪', '对流射线发生器'],//主武器
        ['刺吸西诺斯', '刺吸瑟诺斯长弓'],//主武器
        ['雌鹿', '雌鹿半自动步枪'],//主武器
        ['草原猎手', '荒野步枪'],//主武器
        ['苍鹰', '苍鹰冲锋枪'],//主武器
        ['布莱顿', '制式步枪'],//主武器
        ['伯斯顿', '伯斯顿步枪'],//主武器
        ['巴兹火枪', '反击黄鼬'],//主武器
        ['奥堤克光子枪', '热熔镭射炮'],//主武器
        ['安培克斯', '安普斯雷电'],//主武器
        ['阿提卡', '阿提卡重弩'],//主武器
//副武器，单词缀
        ['终极·螺钉双枪', '终极双持角犀'],//副武器
        ['悦音 Prime', '圣装仙乐奏鸣'],//副武器
        ['勇气·玛瑞火枪', '维寇马洛克'],//副武器
        ['野马双枪 Prime', '圣装双持布隆克烈驹'],//副武器
        ['野马 Prime', '圣装布隆克烈驹'],//副武器
        ['旋刃飞刀 Prime', '圣装螺旋飞刃'],//副武器
        ['信条·纵横双枪', '信条迪普洛斯'],//副武器
        ['信条·循环离子枪', '信条循环式电浆手枪'],//副武器
        ['信条·斯派克斯', '信条螺旋'],//副武器
        ['信条·漫射者', '信条漫射者'],//副武器
        ['信条·德特昂', '信条迪特隆'],//副武器
        ['瓦斯托双枪 Prime', '圣装双持瓦斯托'],//副武器
        ['瓦斯托 Prime', '圣装瓦斯托'],//副武器
        ['双子蝰蛇·亡魂', '红莲双子蝰蛇'],//副武器
        ['枢议·咖玛腕甲枪', '辛诺德射线发生仪'],//副武器
        ['手鼓 Prime', '圣装潘德罗'],//副武器
        ['史提托双枪 Prime', '圣装双持西提列托'],//副武器
        ['食人鱼 Prime', '圣装派亚脊刺'],//副武器
        ['圣洁·雷爆信镖', '圣洁分体式处理信标'],//副武器
        ['轻灵月神双枪 Prime', '圣装轻灵索玛双枪'],//副武器
        ['麦格努斯 Prime', '圣装猛犸手枪'],//副武器
        ['螺钉双枪 Prime', '圣装双持角犀'],//副武器
        ['棱晶·双子小精灵', '棱晶双子精灵'],//副武器
        ['棱晶·安格斯壮', '棱晶将军手持短炮'],//副武器
        ['雷克斯双枪 Prime', '圣装双持秩序之握'],//副武器
        ['雷克斯 Prime', '圣装秩序之握'],//副武器
        ['拉托·破坏者', '镇暴拉托'],//副武器
        ['拉托 Prime', '圣装拉托'],//副武器
        ['蝰蛇·亡魂', '红莲蝰蛇'],//副武器
        ['苦痛·德特昂', '玛拉迪特隆'],//副武器
        ['觉醒双枪 Prime', '圣装觉醒双枪'],//副武器
        ['豪猪 Prime', '圣装豪猪镖枪'],//副武器
        ['光谱切割器·破坏者', '镇暴光谱手枪'],//副武器
        ['绯红·布里斯提卡', '拉克塔惊惧手弩'],//副武器
        ['飞扬 Prime', '圣装星镖'],//副武器
        ['毒芽 Prime', '圣装猛毒镖枪'],//副武器
        ['盗贼双枪 Prime', '圣装双持弗里斯手枪'],//副武器
        ['赤毒·预言者', '赤毒希尔先知'],//副武器
        ['赤毒·双子史度巴', '赤毒双子斯图巴冲锋手枪'],//副武器
        ['赤毒·努寇微波枪', '赤毒努克微波'],//副武器
        ['赤毒·布拉克', '赤毒布拉克'],//副武器
        ['赤毒·北海巨妖', '赤毒北海巨妖'],//副武器
        ['布里斯提卡 Prime', '圣装惊惧手弩'],//副武器
        ['保障·锡斯特双枪', '瑟古拉双持逆转聚能炮'],//副武器
        ['暗杀者 Prime', '圣装塞卡洛斯'],//副武器
        ['MK1-苦无', '试用型-苦无'],//副武器
        ['MK1-盗贼', '试用型-弗里斯手枪'],//副武器
        ['Dex 盗贼双枪', '灵敏弗里斯双枪'],//副武器
//副武器
        ['预言者', '希尔先知'],//副武器
        ['鹰爪', '鹰爪飞镖'],//副武器
        ['野马双枪', '双持布隆克烈驹'],//副武器
        ['野马', '布隆克烈驹'],//副武器
        ['循环离子枪', '循环式电浆手枪'],//副武器
        ['旋刃飞刀', '小李飞刀'],//副武器
        ['席尔火枪', '宰洛克'],//副武器
        ['锡斯特双枪', '双持逆转聚能炮'],//副武器
        ['锡斯特', '逆转聚能炮'],//副武器
        ['瓦斯托双枪', '双持瓦斯托'],//副武器
        ['双子小精灵', '双子精灵'],//副武器
        ['双子罗格', '双子罗迦霰弹枪'],//副武器
        ['双子寇恩霰机枪', '双子寇玛热能炮'],//副武器
        ['双子葛拉卡达', '双持格拉达火舌'],//副武器
        ['手鼓', '潘德罗'],//副武器
        ['视使之触', '幽浮能量枪'],//副武器
        ['史提托双枪', '双持西提列托'],//副武器
        ['史特克', '斯塔格'],//副武器
        ['史度巴', '斯图巴冲锋手枪'],//副武器
        ['食人鱼', '派亚脊刺'],//副武器
        ['杀星', '集束鱼雷发射器'],//副武器
        ['轻灵月神双枪', '轻灵索玛双枪'],//副武器
        ['齐射玻刃', '琉璃飞刀'],//副武器
        ['努寇微波枪', '努克微波'],//副武器
        ['脓痘', '异变信标'],//副武器
        ['麦格努斯双枪', '猛犸双枪'],//副武器
        ['麦格努斯', '猛犸手枪'],//副武器
        ['玛瑞火枪', '马洛克'],//副武器
        ['螺钉双枪', '双持角犀'],//副武器
        ['螺钉手枪', '角犀'],//副武器
        ['雷克斯双枪', '双持秩序之握'],//副武器
        ['雷克斯', '秩序之握'],//副武器
        ['雷爆信镖', '分体式处理信标'],//副武器
        ['拉托双枪', '双持拉托'],//副武器
        ['寇恩霰机枪', '寇玛热能炮'],//副武器
        ['咖玛腕甲枪', '射线发生仪'],//副武器
        ['绝望', '无妄'],//副武器
        ['静电能量导引枪', '静电势能发射器'],//副武器
        ['荒谬双枪', '双持欢喜丸'],//副武器
        ['弧电探知者', '弧光探导手枪'],//副武器
        ['豪猪', '豪猪镖枪'],//副武器
        ['光谱切割器', '光谱手枪'],//副武器
        ['飞扬', '星镖'],//副武器
        ['方位角', '日冕'],//副武器
        ['毒芽', '猛毒镖枪'],//副武器
        ['毒囊双枪', '毒刺双枪'],//副武器
        ['德特昂', '迪特隆'],//副武器
        ['盗贼双枪', '双持弗里斯手枪'],//副武器
        ['盗贼', '弗里斯手枪'],//副武器
        ['啐沫者', '泰希斯异形'],//副武器
        ['超音波冲击枪', '超声冲击枪'],//副武器
        ['布里斯提卡', '惊惧手弩'],//副武器
        ['暗杀者', '塞卡洛斯'],//副武器
        ['安格斯壮', '将军手持短炮'],//副武器
        ['安柏勒斯', '蛇颅'],//副武器
        ['阿利乌双枪', '阿利乌'],//副武器
        ['阿克里德', '刻薄毒镖'],//副武器
//近战，单词缀
        ['重击巨锤 Prime', '圣装悲悯'],//近战
        ['终极·螺钉拐刃', '终极螺钉弧月刀'],//近战
        ['战刃 Prime', '圣装回旋刃'],//近战
        ['勇气·恶龙', '维寇三叉戟'],//近战
        ['眼镜蛇＆鹤 Prime', '圣装眼镜蛇与鹤'],//近战
        ['信条·枢密', '信条枢密'],//近战
        ['信条·莉薇娅', '信条利维亚'],//近战
        ['信条·集议', '信条议程'],//近战
        ['信条·格里高利', '信条格里高利'],//近战
        ['席瓦 & 神盾 Prime', '圣装希瓦·艾奎斯剑盾'],//近战
        ['铁钩手甲 Prime', '圣装刺蛇'],//近战
        ['提佩多 Prime', '圣装提佩多'],//近战
        ['双短柄战镰 Prime', '圣装迦摩天双镰'],//近战
        ['枢议·赫利俄光锤', '辛诺德太阳神锤'],//近战
        ['收割者 Prime', '圣装收割者'],//近战
        ['侍刃 Prime', '圣装侍刃'],//近战
        ['圣洁·执法者', '圣洁真理权杖'],//近战
        ['普罗沃·破坏者', '镇暴高压电棒'],//近战
        ['欧特鲁斯 Prime', '圣装双尾鲨'],//近战
        ['马谢特砍刀·亡魂', '红莲精英阔刀'],//近战
        ['龙辰 Prime', '圣装龙辰'],//近战
        ['鲮鲤剑 Prime', '圣装鲮鲤'],//近战
        ['棱晶·斩肉双刀', '棱晶近卫者'],//近战
        ['棱晶·马谢特砍刀', '棱晶精英阔刀'],//近战
        ['棱晶·空刃', '棱晶空灵刃'],//近战
        ['棱晶·奥比克斯', '棱晶惩戒手刺'],//近战
        ['狼牙 Prime', '圣装狼牙双刃'],//近战
        ['空刃 Prime', '圣装空灵刃'],//近战
        ['科加基 Prime', '圣装牢笼拳套'],//近战
        ['凯旋之爪 Prime', '圣装钨钢合金爪'],//近战
        ['凯瑞斯双刀 Prime', '圣装灾厄双刃'],//近战
        ['凯洛斯特 Prime', '圣装困惑之刃'],//近战
        ['救赎者 Prime', '圣装救赎者'],//近战
        ['降灵追猎者 Prime', '圣装翠玉双截棍'],//近战
        ['甲龙双拳 Prime', '圣装安奇洛斯拳套'],//近战
        ['迦伦提恩 Prime', '圣装加拉丁暗影'],//近战
        ['技巧之剑 Prime', '圣装护手刺剑'],//近战
        ['皇家拐刃 Prime', '圣装弧月刀'],//近战
        ['海波斯库拉对剑 Prime', '圣装纳米斯凯拉'],//近战
        ['哈利卡·亡魂', '红莲喷射飞锤'],//近战
        ['关刀 Prime', '圣装偃月刀'],//近战
        ['格拉姆 Prime', '圣装格拉姆'],//近战
        ['弗拉克斯·亡魂', '红莲寄居蟹手刺'],//近战
        ['分裂斩斧 Prime', '圣装神罚巨斧'],//近战
        ['绯红·暗黑匕首', '拉克塔暗影匕首'],//近战
        ['达克拉 Prime', '圣装达克拉'],//近战
        ['创伤 Prime', '圣装裂伤战锤'],//近战
        ['赤毒·希尔德', '赤毒希尔德'],//近战
        ['玻之武杖 Prime', '圣装破禅武杖'],//近战
        ['保障·勒克塔', '瑟古拉僵直电鞭'],//近战
        ['MK1-弗拉克斯', '试用型-寄居蟹手刺'],//近战
        ['MK1-玻之武杖', '试用型-破禅武杖'],//近战
        ['Dex 达克拉双剑', '灵敏达克拉'],//近战
//近战
        ['佐伦双斧', '索伦双斧'],//近战
        ['灼蚀变体镰', '腐蚀寄生者'],//近战
        ['重击巨锤', '悲悯'],//近战
        ['直镐', '克莱斯卡'],//近战
        ['执法者', '真理权杖'],//近战
        ['战争之剑', '纷争'],//近战
        ['战刃', '回旋刃'],//近战
        ['斩肉双刀', '近卫者'],//近战
        ['憎恨', '厌弃'],//近战
        ['影生', '暗影侍刃'],//近战
        ['眼镜蛇＆鹤', '眼镜蛇与鹤'],//近战
        ['心智之殁', '贤者之刃'],//近战
        ['席瓦 & 神盾', '希瓦·艾奎斯剑盾'],//近战
        ['希芙', '西弗'],//近战
        ['西格玛 & 南极座', '南极星'],//近战
        ['西伯利亚冰锤', '冰原重锤'],//近战
        ['翁', '三叉刺'],//近战
        ['威震武扇', '威震战扇'],//近战
        ['铁钩手甲', '蛇刺'],//近战
        ['天仓·悲痛之刃', '天仓绝情双剪'],//近战
        ['提佩多', '提佩多军铲'],//近战
        ['陶瓷匕首', '精瓷匕首'],//近战
        ['双子克鲁古尔', '双子钩刃剑'],//近战
        ['双头蛇', '安菲斯'],//近战
        ['双节尺棍', '虎骨双节棍'],//近战
        ['双短柄战镰', '迦摩天双镰'],//近战
        ['侍刃', '虎之侍刃'],//近战
        ['三叶坚韧', '苦行刺剑'],//近战
        ['锐卡斯', '覆海蛟'],//近战
        ['认知＆冲击', '龟背盾斧'],//近战
        ['蜻蛉薙', '龙涎棍'],//近战
        ['怯薛', '禁卫长戟'],//近战
        ['普罗沃', '高压电棒'],//近战
        ['破损珽杖', '破碎的权杖'],//近战
        ['破碎的战争之剑', '破碎的纷争'],//近战
        ['喷射战锤', '氪金狼牙棒'],//近战
        ['喷射锁镰', '爆燃锁镰'],//近战
        ['欧特鲁斯', '双尾鲨'],//近战
        ['欧玛', '欧玛电击棍'],//近战
        ['牡狮神', '米奥斯鞭刃'],//近战
        ['米尔', '米雷泥沼'],//近战
        ['蚂蟥', '血蛭'],//近战
        ['马谢特砍刀', '精英阔刀'],//近战
        ['裸鳃刃', '蛟鳃刃'],//近战
        ['螺钉拐刃', '螺钉弧月刀'],//近战
        ['灵枢', '神庭轮'],//近战
        ['猎鹰轮', '猎鹰回旋刃'],//近战
        ['烈焰匕首', '烈焰短剑'],//近战
        ['勒克塔', '僵直电鞭'],//近战
        ['狼牙', '狼牙双刃'],//近战
        ['空刃双刀', '空灵双刀'],//近战
        ['空刃', '空灵刃'],//近战
        ['克鲁古尔', '钩刃剑'],//近战
        ['科加基', '牢笼拳套'],//近战
        ['凯旋之爪', '钨钢合金爪'],//近战
        ['凯瑞斯双刀', '灾厄双刃'],//近战
        ['凯洛斯特', '困惑之刃'],//近战
        ['卡德斯', '光棍'],//近战
        ['军扇', '铁骨军扇'],//近战
        ['降灵追猎者', '翠玉双截棍'],//近战
        ['甲龙双拳', '安奇洛斯拳套'],//近战
        ['迦伦提恩', '加拉丁暗影'],//近战
        ['加扎勒反曲刀', '加扎尔精英阔刀'],//近战
        ['技巧之剑', '护手刺剑'],//近战
        ['脊椎节鞭', '腐尾蛟'],//近战
        ['皇家拐刃', '弧月刀'],//近战
        ['弧电振子锤', '弧光蓄电重锤'],//近战
        ['鹤鸵长戟', '鹤鸵双头戟'],//近战
        ['赫利俄光锤', '太阳神锤'],//近战
        ['海波斯库拉对剑', '纳米斯凯拉'],//近战
        ['海波单剑', '纳米索隆'],//近战
        ['哈利卡', '喷射飞锤'],//近战
        ['关刀', '偃月刀'],//近战
        ['弗拉克斯', '寄居蟹手刺'],//近战
        ['分裂斩斧', '神罚巨斧'],//近战
        ['恶龙', '恶龙三叉戟'],//近战
        ['夺魂死神', '侍魂镰'],//近战
        ['短柄战镰', '迦摩天战镰'],//近战
        ['毒囊骨茧', '蛹囊寄生者'],//近战
        ['电能斩锯', '工程支持联接体'],//近战
        ['创伤', '裂伤战锤'],//近战
        ['苍穹死神', '苍穹夜神'],//近战
        ['玻之武杖', '破禅武杖'],//近战
        ['病变', '毒伤之颚'],//近战
        ['悲痛之刃', '绝情双剪'],//近战
        ['奥比克斯', '惩戒手刺'],//近战
        ['暗黑长剑', '暗影长剑'],//近战
        ['暗黑分合剑', '暗影子母剑'],//近战
        ['暗黑匕首', '暗影匕首'],//近战
        ['阿特拉克斯', '刑罚绞索'],//近战
//空战，单词缀
        ['Odonata Prime', '圣装远古陨蜓曲翼'],//空战
        ['棱晶·真理巨剑', '棱晶宇宙真理'],//空战
        ['棱晶·什长双枪', '棱晶什长双枪'],//空战
        ['凯旋将军·破坏者', '镇暴皇蟒'],//空战
        ['黑鸦 Prime', '圣装黑鸦'],//空战
        ['赤毒·怒雷', '赤毒怒雷'],//空战
        ['赤毒·葛拉特勒', '赤毒反重力空气枪'],//空战
//空战
        ['真理巨剑', '宇宙真理'],//空战
        ['驯象钩刃', '钩刃巨剑'],//空战
        ['死亡使徒', '武者战镰'],//空战
        ['拉斯波恩', '洛萨之骨'],//空战
        ['克纳克斯', '雷格之拳'],//空战
        ['凯旋将军', '皇蟒'],//空战
        ['极速电磁步枪', '威洛斯图'],//空战
        ['合成燃气炮', '复合瓦斯炮'],//空战
        ['葛拉特勒', '反重力空气枪'],//空战
        ['菲德菈', '月蚀'],//空战
        ['奥努里克斯', '新星诺里斯'],//空战
        ['Odonata', '远古陨蜓曲翼'],//空战
        ['Itzal', '刺峰'],//空战
        ['Elytron', '断脊鳞'],//空战
        ['Amesha', '圣火之翼'],//空战
//宠物，单词缀
        ['死亡机枪 Prime', '圣装冷酷机枪'],//宠物
        ['扫除者 Prime', '圣装清道夫'],//宠物
        ['棱晶 激光点发', '棱晶爆发激光发射器'],//宠物
        ['激光步枪 Prime', '圣装激光步枪'],//宠物
        ['分离 Prime', '圣装爆能分解'],//宠物
        ['赫利俄斯 Prime', '圣装太阳之神'],//宠物
        ['蛟龙 Prime', '圣装邪念妖龙'],//宠物
//宠物
        ['引灵', '暗影邪灵'],//宠物
        ['阴影', '幽冥暗影'],//宠物
        ['寻猎型库狛', '寻宝库狛'],//宠物
        ['笑面型库娃', '柴郡狯犽'],//宠物
        ['薇娜丽', '维纳利'],//宠物
        ['突击型库狛', '斥候库狛'],//宠物
        ['泰瑟步枪', '电镖步枪'],//宠物
        ['塔克桑', '复归信标'],//宠物
        ['死亡魔方', '寂灭魔方'],//宠物
        ['死亡机枪', '冷酷机枪'],//宠物
        ['噬血型库娃', '噬血型狯犽'],//宠物
        ['扫除者', '清道夫'],//宠物
        ['帕拉恐鸟', '副木节恐鸟'],//宠物
        ['欧罗若恐鸟', '扇冠恐鸟'],//宠物
        ['匿踪型库狛', '狩猎库狛'],//宠物
        ['猎杀型库狛', '勇猛库狛'],//宠物
        ['拉姆比欧恐鸟', '兰伯恐鸟'],//宠物
        ['镜像型库娃', '灵镜狯犽'],//宠物
        ['金工火舌', '火神步枪'],//宠物
        ['金工火枪', '电弧步枪'],//宠物
        ['蛟龙', '邪念妖龙'],//宠物
        ['急冻喷枪', '冷冻射线枪'],//宠物
        ['激光点发', '爆发激光发射器'],//宠物
        ['赫利俄斯', '太阳之神'],//宠物
        ['分离', '爆能分解'],//宠物
        ['防护型库狛', '守护库狛'],//宠物
        ['多连穿甲枪', '速射步枪'],//宠物
        ['毒刺', '史丁格毒刺'],//宠物
        ['电气浮囊', '电弧气囊'],//宠物
        ['搬运者', '搬运信使'],//宠物
        ['奥克绪罗斯', '山林卫士'],//宠物
        ['阿塔克斯', '冰冻光束'],//宠物
        ['Helminth 疾冲者', '赫明斯巢体寄生疾冲者'],//宠物
//天工部件，双词缀
        ['伊克瓦纳 翟 II', '双扣环坠'],//天工部件
        ['伊克瓦纳 如杭 II', '双钩环坠'],//天工部件
        ['瓦吉特 翟 II', '双扣拐坠'],//天工部件
        ['瓦吉特 如杭 II', '双钩拐坠'],//天工部件
//天工部件，单词缀
        ['翟 II', '双扣坠'],//天工部件
        ['如杭 II', '双钩坠'],//天工部件
        ['伊克瓦纳 翟', '环扣坠'],//天工部件
        ['伊克瓦纳 如杭', '环钩坠'],//天工部件
        ['伊克瓦纳 II 翟', '双环扣坠'],//天工部件
        ['伊克瓦纳 II 如杭', '双环钩坠'],//天工部件
        ['瓦吉特 II 翟', '双拐扣坠'],//天工部件
        ['瓦吉特 II 如杭', '双拐钩坠'],//天工部件
        ['瓦吉特 翟', '拐扣坠'],//天工部件
        ['瓦吉特 如杭', '拐钩坠'],//天工部件
//天工部件
        ['翟', '扣坠'],//天工部件
        ['西亚什', '弯刃'],//天工部件
        ['乌尔萨', '长刃'],//天工部件
        ['瘟疫 奇沃', '异变重镰刃'],//天工部件
        ['瘟疫 克里帕丝', '异变轻刺刃'],//天工部件
        ['瘟疫 柏克文', '异变重长握柄'],//天工部件
        ['瘟疫 艾克文', '异变轻短握柄'],//天工部件
        ['斯卡拉', '轻长握柄'],//天工部件
        ['石当', '特重长握柄'],//天工部件
        ['瑟普梵', '直刃'],//天工部件
        ['如杭', '钩坠'],//天工部件
        ['佩耶', '轻短握柄'],//天工部件
        ['密丸', '重长刃'],//天工部件
        ['拉卡', '短握柄'],//天工部件
        ['拉比威', '重锤刃'],//天工部件
        ['库阿斯', '重短握柄'],//天工部件
        ['客隆什', '重弯刃'],//天工部件
        ['克鲁斯查', '重长握柄'],//天工部件
        ['科布', '特重短握柄'],//天工部件
        ['多克拉姆', '轻镰刃'],//天工部件
        ['德塔特', '轻刺刃'],//天工部件
        ['查亚普', '长握柄'],//天工部件
        ['宝拉', '轻短刃'],//天工部件
//组件枪部件
        ['重拳', '重击'],//组件枪部件
        ['震颤', '发抖'],//组件枪部件
        ['掌击', '冲撞'],//组件枪部件
        ['响胆', '响腹'],//组件枪部件
        ['碎语', '急语'],//组件枪部件
        ['速针', '飞针'],//组件枪部件
        ['速力', '呼啸'],//组件枪部件
        ['速火', '啸火'],//组件枪部件
        ['深息', '深呼吸'],//组件枪部件
        ['拍针', '撞针'],//组件枪部件
        ['凝目', '凝视'],//组件枪部件
        ['猛光', '耀光'],//组件枪部件
        ['漫游', '漫谈'],//组件枪部件
        ['连杀', '连袭'],//组件枪部件
        ['狂虐', '痛殴'],//组件枪部件
        ['精明', '机灵'],//组件枪部件
        ['溅击', '猛砸'],//组件枪部件
        ['急躁', '骤雨'],//组件枪部件
        ['激火', '曳火'],//组件枪部件
        ['火花', '花火'],//组件枪部件
        ['风箱', '咆哮'],//组件枪部件
        ['穿纫', '缝针'],//组件枪部件
        ['颤火', '迅火'],//组件枪部件
        ['捕月', '射月'],//组件枪部件
        ['爱击', '爱抚'],//组件枪部件
//MOD，单词缀
        ['重生 Prime', '高阶重生'],//高阶MOD
        ['重创 Prime', '高阶重创'],//高阶MOD
        ['压迫点 Prime', '高阶血压点'],//高阶MOD
        ['霰弹枪弹药转换 Prime', '高阶霰弹枪弹药转换'],//高阶MOD
        ['霰弹扩充 Prime', '高阶霰弹扩充'],//高阶MOD
        ['撕裂 Prime', '高阶撕裂'],//高阶MOD
        ['手枪精通 Prime', '高阶手枪精通'],//高阶MOD
        ['手枪弹药转换 Prime', '高阶手枪弹药转换'],//高阶MOD
        ['弱点专精 Prime', '高阶弱点专精'],//高阶MOD
        ['热病打击 Prime', '高阶狂热打击'],//高阶MOD
        ['驱逐堕落者 Prime', '高阶驱逐堕落者'],//高阶MOD
        ['驱逐 Infested Prime', '高阶驱逐异变体'],//高阶MOD
        ['驱逐 Grineer Prime', '高阶驱逐克隆尼'],//高阶MOD
        ['驱逐 Corpus Prime', '高阶驱逐科普斯'],//高阶MOD
        ['破灭 Prime', '高阶摧枯拉朽'],//高阶MOD
        ['灭亡堕落者 Prime', '高阶堕落者克星'],//高阶MOD
        ['灭亡 Infested Prime', '高阶异变体克星'],//高阶MOD
        ['灭亡 Grineer Prime', '高阶克隆尼克星'],//高阶MOD
        ['灭亡 Corpus Prime', '高阶科普斯克星'],//高阶MOD
        ['领袖 Prime', '高阶领袖'],//高阶MOD
        ['烈焰风暴 Prime', '高阶烈焰风暴'],//高阶MOD
        ['狂暴 Prime', '高阶狂暴'],//高阶MOD
        ['净化堕落者 Prime', '高阶净化堕落者'],//高阶MOD
        ['净化 Infested Prime', '高阶净化异变体'],//高阶MOD
        ['净化 Grineer Prime', '高阶净化克隆尼'],//高阶MOD
        ['净化 Corpus Prime', '高阶科普斯克星'],//高阶MOD
        ['剑风 Prime', '高阶剑风'],//高阶MOD
        ['火焰装填 Prime', '高阶火焰装填'],//高阶MOD
        ['活力 Prime', '高阶活力'],//高阶MOD
        ['毁灭堕落者 Prime', '高阶惩击堕落者'],//高阶MOD
        ['毁灭 Infested Prime', '高阶惩击异变体'],//高阶MOD
        ['毁灭 Grineer Prime', '高阶惩击克隆尼'],//高阶MOD
        ['毁灭 Corpus Prime', '高阶惩击科普斯'],//高阶MOD
        ['红晶枪管 Prime', '高阶赤晶枪管'],//高阶MOD
        ['非晶变压器 Prime', '高阶无态晶变压器'],//高阶MOD
        ['动物本能 Prime', '高阶动物本能'],//高阶MOD
        ['顶天立地 Prime', '高阶顶天立地'],//高阶MOD
        ['抵近射击 Prime', '高阶抵近射击'],//高阶MOD
        ['低温弹头 Prime', '高阶低温弹头'],//高阶MOD
        ['串联弹匣 Prime', '高阶串联弹夹'],//高阶MOD
        ['川流不息 Prime', '高阶川流不息'],//高阶MOD
        ['充电弹头 Prime', '高阶充电弹头'],//高阶MOD
        ['持续火力 Prime', '高阶快速装弹'],//高阶MOD
        ['持久力 Prime', '高阶持久力'],//高阶MOD
        ['步枪弹药转换 Prime', '高阶步枪弹药转换'],//高阶MOD
        ['爆发装填 Prime', '高阶灵巧快手'],//高阶MOD
//MOD
        ['灼痕焦点', '怒焚'],//副武器MOD
        ['准确射手', '精准射手'],//副武器MOD
        ['转轮弹匣', '高速弹夹'],//主武器MOD
        ['朱红暴风', '赭红风暴'],//近战MOD
        ['重定向', '复位定向'],//宠物MOD
        ['重点防御', '专注防御'],//近战MOD
        ['终焉风暴', '风起云涌'],//近战MOD
        ['终结闪光', '折光终结'],//战甲MOD
        ['中空子弹', '空尖弹'],//空战MOD
        ['滞痕冰浪', '酷冷阻抗'],//战甲MOD
        ['致命效率', '惊人高效'],//空战MOD
        ['致命动量', '致死冲力'],//副武器MOD
        ['致命传送', '瞬移冷酷'],//战甲MOD
        ['致盲掠夺', '致盲生气收割'],//战甲MOD
        ['致残突击', '重伤打击'],//近战MOD
        ['治愈归复', '治疗回馈'],//近战MOD
        ['治愈玻片', '碎刃补天'],//战甲MOD
        ['质子猛扑', '质子迸裂'],//组合MOD
        ['制导弹药', '制导武器'],//主武器MOD
        ['至尊浪人', '王权放逐'],//近战MOD
        ['指挥家', '共振指挥'],//战甲MOD
        ['正午', '如日中天'],//近战MOD
        ['震地共鸣', '共鸣冲击'],//战甲MOD
        ['震荡弹头', '震荡弹'],//副武器MOD
        ['招福', '好运'],//宠物MOD
        ['长吻', '触钩'],//宠物MOD
        ['长时瘫痪', '持久瘫痪'],//战甲MOD
        ['长时苦难', '持久痛苦'],//近战MOD
        ['战士', '勇士'],//宠物MOD
        ['增压弹匣', '弹夹增压'],//副武器MOD
        ['晕眩弹药', '晕眩弹头'],//副武器MOD
        ['跃动设局', '跃动设置'],//组合MOD
        ['月刃刺冲', '月刃冲锋'],//宠物MOD
        ['月落乌啼', '排山倒海'],//近战MOD
        ['原始暴怒', '怒发冲冠'],//战甲MOD
        ['预言协约', '预言者的调和'],//组合MOD
        ['预言通灵', '预言者的远见'],//组合MOD
        ['预言探求', '预言者的探求'],//组合MOD
        ['预言神密', '预言者的秘密'],//组合MOD
        ['预言契约', '预言者的誓约'],//组合MOD
        ['预言启示', '预言者的启示'],//组合MOD
        ['幼体爆发', '卷须爆裂'],//战甲MOD
        ['幽影之护', '幻影之盾'],//战甲MOD
        ['幽灵', '魅影'],//宠物MOD
        ['永恒战意', '永恒之战'],//战甲MOD
        ['异况超量', '状态超载'],//近战MOD
        ['氩晶瞄具', '氩素准镜'],//主武器MOD
        ['牙齿毒液', '毒液牙齿'],//宠物MOD
        ['削甲手里剑', '重拾袖箭'],//战甲MOD
        ['旋压刺针', '旋针绞刺'],//近战MOD
        ['蓄能重划', '弹道偏转'],//战甲MOD
        ['蓄力装填', '充能弹膛'],//主武器MOD
        ['蓄积长鞭', '蓄势鞭袭'],//战甲MOD
        ['嗅索取物', '寻回'],//宠物MOD
        ['星云钻孔', '星云镗孔'],//空战MOD
        ['星体切砍', '星穹切割'],//空战MOD
        ['星界剖解', '星际解剖'],//空战MOD
        ['心志偏狭', '心智偏狭'],//战甲MOD
        ['协力窜升', '协作奔流'],//延展MOD
        ['霰弹枪弹药搜集者', '霰弹枪清道夫'],//光环MOD
        ['献出力量', '能量奉献'],//战甲MOD
        ['系统重划', '系统重置'],//空战MOD
        ['系绳榴弹', '束缚榴弹'],//主武器MOD
        ['戏法增幅', '弹夹扩容'],//副武器MOD
        ['奚落守护', '高傲卫士'],//近战MOD
        ['吸取', '真空吸物'],//宠物MOD
        ['无明制裁', '盲目正义'],//近战MOD
        ['污染弹匣', '污染弹夹'],//主武器MOD
        ['稳定枪手', '稳定之手'],//副武器MOD
        ['瘟疫手枪', '异变手枪'],//副武器MOD
        ['未完之刺', '持续苦痛'],//近战MOD
        ['薇娜丽的护卫', '维纳利的护卫'],//战甲MOD
        ['危机感知', '危险感知'],//宠物MOD
        ['顽皮', '恶作剧'],//宠物MOD
        ['同化', '伤害同化'],//战甲MOD
        ['通晓霰弹枪', '霰弹精通'],//主武器MOD
        ['通量射线步枪超载', '热能过载'],//主武器MOD
        ['贪婪吸引', '贪婪天引'],//战甲MOD
        ['贪夺穹顶', '神偷天罗地网'],//战甲MOD
        ['贪夺触角', '触角神偷'],//战甲MOD
        ['锁定目标', '目标锁定'],//主武器MOD
        ['隼目', '鹰眼'],//主武器MOD
        ['速度窜升', '速度奔流'],//延展MOD
        ['私法追踪', '警备官的追击'],//组合MOD
        ['私法热诚', '警备官的热切'],//组合MOD
        ['私法侵犯', '警备官的攻势'],//组合MOD
        ['私法军备', '警备官的武装'],//组合MOD
        ['私法活力', '警备营的活力'],//组合MOD
        ['私法补给', '警备官的储备'],//组合MOD
        ['守护光罩', '圣域'],//宠物MOD
        ['手枪弹药搜集者', '手枪清道夫'],//光环MOD
        ['适应', '适应抗性'],//战甲MOD
        ['蚀骨寒霜', '冰冷之触'],//近战MOD
        ['生长怪奇', '奇异增长'],//战甲MOD
        ['生命值连接', '生命连接'],//宠物MOD
        ['渗透', '无孔不入'],//战甲MOD
        ['深渊之火', '亚特兰蒂斯火神'],//近战MOD
        ['慑人神速', '惊人神速'],//副武器MOD
        ['闪耀助燃', '闪电加速'],//战甲MOD
        ['杀伤计数', '清点战场'],//近战MOD
        ['人群驱散', '驱散敌群'],//宠物MOD
        ['热病打击', '狂热打击'],//近战MOD
        ['取回', '衔回猎物'],//宠物MOD
        ['驱逐力场', '永恒牢狱'],//战甲MOD
        ['驱逐 Infested', '驱逐异变体'],//副武器MOD
        ['驱逐 Grineer', '驱逐克隆尼'],//副武器MOD
        ['驱逐 Corpus', '驱逐科普斯'],//副武器MOD
        ['侵略领土', '领地侵略'],//宠物MOD
        ['切割刃缘', '切割利刃'],//空战MOD
        ['强力切换', '活跃切换'],//战甲MOD
        ['强化刀片', '强化刀锋'],//空战MOD
        ['欺幻魔灯', '迷醉幻梦'],//战甲MOD
        ['破碎声波', '超声碎裂'],//战甲MOD
        ['漂移接触', '游离触点'],//近战MOD
        ['匿踪窜升', '隐蔽奔流'],//延展MOD
        ['纳米涂覆', '纳米涂料'],//主武器MOD
        ['目标入定', '目标定位'],//战甲MOD
        ['母神悲歌', '盖亚之黄昏'],//近战MOD
        ['魔导修复', '魔术师修复'],//赋能
        ['魔导热熔', '魔术师熔断'],//赋能
        ['魔导驱动', '魔术师驾驭'],//赋能
        ['魔导近点', '魔术师异常'],//赋能
        ['魔导干扰', '魔术师干扰'],//赋能
        ['魔导复位', '魔术师还原'],//赋能
        ['魔导封锁', '魔术师封锁'],//赋能
        ['魔导防火墙', '魔术师防火墙'],//赋能
        ['魔导穿破', '魔术师穿刺'],//赋能
        ['魔导触媒', '魔术师催化剂'],//赋能
        ['魔导超载', '魔术师超载'],//赋能
        ['磨锋之爪', '利爪'],//宠物MOD
        ['灭亡 Infested', '异变体克星'],//主武器MOD
        ['灭亡 Grineer', '克隆尼克星'],//主武器MOD
        ['灭亡 Corpus', '科普斯克星'],//主武器MOD
        ['猛爆致病', '破甲突变'],//战甲MOD
        ['螺钻打击', '螺旋打击'],//近战MOD
        ['漏斗状云', '漏斗云'],//战甲MOD
        ['猎人追踪', '猎手的追踪'],//组合MOD
        ['猎人战备', '猎手的军火'],//组合MOD
        ['猎人协力', '猎手的协同'],//组合MOD
        ['猎人肾上腺素', '猎手的奋勇'],//组合MOD
        ['猎人命令', '猎手的命令'],//组合MOD
        ['猎人骨锯', '猎手的骨锯'],//近战MOD
        ['猎人复元', '猎手的恢复'],//组合MOD
        ['烈焰爆震', '火海地震'],//战甲MOD
        ['连牙追袭', '利牙追袭'],//近战MOD
        ['力量窜升', '能量奔流'],//延展MOD
        ['冷却液外泄', '冷气外泄'],//宠物MOD
        ['冷静与疯狂', '平和-狂躁'],//战甲MOD
        ['类星钻体', '星体钻刺'],//空战MOD
        ['雷射瞄具', '激光校准'],//主武器MOD
        ['狼鱼咬咬', '狼鱼噬咬'],//近战MOD
        ['矿石凝视', '矿化凝视'],//战甲MOD
        ['狂化突击', '狂化猛袭'],//战甲MOD
        ['快速休整', '短暂喘息'],//光环MOD
        ['空飞灵巧', '空之迅捷'],//组合MOD
        ['空飞俯瞰', '空之俯瞰'],//组合MOD
        ['空飞边际', '空之边际'],//组合MOD
        ['啃咬压制', '中和'],//宠物MOD
        ['菌株热毒', '菌株狂热'],//组合MOD
        ['巨大石者', '泰坦岩灵'],//战甲MOD
        ['狙击枪弹药搜集者', '狙击枪清道夫'],//光环MOD
        ['净化 Infested', '净化异变体'],//主武器MOD
        ['净化 Grineer', '净化克隆尼'],//主武器MOD
        ['净化 Corpus', '净化科普斯'],//主武器MOD
        ['精算蓄能', '精确偏转'],//宠物MOD
        ['精神狂怒', '心智掌控'],//战甲MOD
        ['晶管屏障', '导体之盾'],//战甲MOD
        ['金属纤维', '合金纤维'],//宠物MOD
        ['矫捷窜升', '敏捷奔流'],//延展MOD
        ['狡诈窜升', '灵巧奔流'],//延展MOD
        ['角斗士威猛', '角斗士的力量'],//组合MOD
        ['角斗士圣盾', '角斗士的壁垒'],//组合MOD
        ['角斗士钳制', '角斗士的恶毒'],//组合MOD
        ['角斗士猛突', '角斗士的迅疾'],//组合MOD
        ['角斗士灵巧', '角斗士的灵敏'],//组合MOD
        ['角斗士决心', '角斗士的决心'],//组合MOD
        ['践踏加固', '强固践踏'],//战甲MOD
        ['坚忍窜升', '坚毅奔流'],//延展MOD
        ['坚决专注', '决心专精'],//空战MOD
        ['尖牙连射', '锯齿弹链'],//主武器MOD
        ['加力燃烧', '后燃装置'],//空战MOD
        ['技法引力', '技术牵引'],//组合MOD
        ['技法强化', '技术强化'],//组合MOD
        ['技法猛袭', '技术侵袭'],//组合MOD
        ['技法连带', '技术衍生'],//组合MOD
        ['集中箭矢', '千钧一箭'],//战甲MOD
        ['急速偏斜', '急速充能'],//宠物MOD
        ['急进猛突', '暴击冲动'],//近战MOD
        ['汲能榨取', '能量剥夺'],//战甲MOD
        ['激冷装填', '冰冷装填'],//主武器MOD
        ['积秽骁龙', '污损骁龙'],//近战MOD
        ['机甲强化', '机械赋能'],//组合MOD
        ['机甲脉冲', '机械脉冲'],//组合MOD
        ['机甲充能', '机械充能'],//组合MOD
        ['机甲超载', '机械过载'],//组合MOD
        ['火神闪击', '火神猛袭'],//近战MOD
        ['火绫守护', '金霞护身'],//战甲MOD
        ['火成碎流', '焰涌川流'],//战甲MOD
        ['彗星爆发', '彗星冲击'],//空战MOD
        ['毁灭扩展', '毁灭延伸'],//副武器MOD
        ['毁灭 Infested', '惩击异变体'],//近战MOD
        ['毁灭 Grineer', '惩击克隆尼'],//近战MOD
        ['毁灭 Corpus', '惩击科普斯'],//近战MOD
        ['挥击', '横扫'],//宠物MOD
        ['簧压膛室', '弹簧承载式箭头'],//主武器MOD
        ['黄道碎裂', '星座撕裂'],//空战MOD
        ['缓动惊骇', '破胆恐惧'],//战甲MOD
        ['化像之道', '石像之路'],//战甲MOD
        ['华彩刀剑', '幻彩剑刃'],//战甲MOD
        ['花开怪奇', '奇异绽放'],//战甲MOD
        ['护盾充能', '加速充能'],//宠物MOD
        ['红晶枪管', '赤晶枪管'],//空战MOD
        ['和平挑衅', '轻声挑拨'],//战甲MOD
        ['合成解构', '合成拆解'],//组合MOD
        ['合成充能', '合成蓄能'],//组合MOD
        ['耗弱链接', '耗弱联结'],//战甲MOD
        ['嚎声', '怒吼'],//宠物MOD
        ['寒流来袭', '骤冷寒潮'],//空战MOD
        ['关键焦点', '暴击专精'],//空战MOD
        ['构造强化', '强化生命力'],//宠物MOD
        ['构造裂缝', '石壁碎裂'],//战甲MOD
        ['感染噬咬', '感染咬噬'],//宠物MOD
        ['复仇亡灵', '惩戒赤晶'],//近战MOD
        ['凤凰新生', '凤凰重生'],//战甲MOD
        ['分子转化', '分子转换'],//宠物MOD
        ['分裂槌音', '分裂鼓点'],//战甲MOD
        ['非晶变压器', '无态晶变压器'],//空战MOD
        ['非凡技巧', '近战技巧'],//近战MOD
        ['反转脉冲', '反制脉冲'],//战甲MOD
        ['翻滚防护', '翻滚庇护'],//战甲MOD
        ['乏能迅敏', '残血敏捷'],//副武器MOD
        ['二元性状', '二元一体'],//战甲MOD
        ['恶怨厅', '恶怨殿堂'],//战甲MOD
        ['动力回弹', '动能弹射'],//主武器MOD
        ['定位辅助', '瞄准辅助'],//副武器MOD
        ['电击奇兵', '电击震荡'],//战甲MOD
        ['电击加速', '雷霆烈风'],//战甲MOD
        ['电弧线圈', '弧光陷阱'],//宠物MOD
        ['电光脉冲', '电子脉冲'],//宠物MOD
        ['抵消虫群', '无懈虫群'],//战甲MOD
        ['低温外壳', '低温子弹'],//空战MOD
        ['刀翼闪击', '锋翅闪击'],//战甲MOD
        ['刀锋弹舞', '枪林刃舞'],//近战MOD
        ['弹药储转箱', '弹药箱'],//宠物MOD
        ['弹匣增幅', '弹夹增幅'],//主武器MOD
        ['弹头导引', '斥候'],//副武器MOD
        ['刺骨战吼', '刺耳号角'],//战甲MOD
        ['磁吸释放', '磁场释放'],//战甲MOD
        ['创口溃烂', '持久伤口'],//近战MOD
        ['串联弹匣', '串联弹夹'],//副武器MOD
        ['穿透力', '强力穿透'],//主武器MOD
        ['穿甲伤害', '穿甲攻击'],//主武器MOD
        ['穿刺抛体', '穿刺弹道'],//战甲MOD
        ['宠物治疗套件', '宠物急救包'],//宠物MOD
        ['冲击巨力', '冲突武力'],//近战MOD
        ['冲刺提升', '急速冲刺'],//光环MOD
        ['持续火力', '快速装弹'],//副武器MOD
        ['持久誓约', '永结契约'],//战甲MOD
        ['惩击洗礼', '重射洗礼'],//战甲MOD
        ['成长之力', '能量增长'],//光环MOD
        ['残余', '多余部件'],//宠物MOD
        ['残酷组合', '残酷连击'],//近战MOD
        ['残酷无息', '残酷光环'],//战甲MOD
        ['步枪弹药搜集者', '步枪清道夫'],//光环MOD
        ['不朽打击', '耐久打击'],//近战MOD
        ['不竭贪婪', '饕餮异变'],//战甲MOD
        ['病原弹头', '病毒子弹'],//副武器MOD
        ['冰冷雪崩', '冰结雪崩'],//战甲MOD
        ['冰封护罩', '极寒护罩'],//战甲MOD
        ['冰风暴', '寒冰风暴'],//副武器MOD
        ['冰冻双颚', '冰霜下颚'],//宠物MOD
        ['表演时间', '急速射击'],//主武器MOD
        ['庇护焚炉', '守护香炉'],//战甲MOD
        ['爆炸戏法', '多重变奏'],//战甲MOD
        ['爆发装填', '灵巧快手'],//主武器MOD
        ['包覆游云', '云雾缭绕'],//战甲MOD
        ['摆荡钩索', '飞悬钩索'],//战甲MOD
        ['Mesa的华尔兹', '圣枪圆舞'],//战甲MOD
        ['Helminth凶恶终结', '寄生凶恶终结'],//宠物MOD
        ['Archwing枪械行家', '反重力枪械专家'],//空战MOD
//特殊
        ['月神', '索玛'],//主武器

    ])

    replaceText(document.body)

    const bodyObserver = new MutationObserver(mutations => {
      mutations.forEach(mutation => {
        mutation.addedNodes.forEach(addedNode => replaceText(addedNode))
      })
    })
    bodyObserver.observe(document.body, { childList: true, subtree: true })

    function replaceText(node) {
      nodeForEach(node).forEach(htmlnode => {
        i18n.forEach((value, index) => {
          // includes可直接使用 === 以提高匹配精度
          const textReg = new RegExp(index, 'g')
          if (htmlnode instanceof Text && htmlnode.nodeValue.includes(index))
            htmlnode.nodeValue = htmlnode.nodeValue.replace(textReg, value)
          else if (htmlnode instanceof HTMLInputElement && htmlnode.value.includes(index))
            htmlnode.value = htmlnode.value.replace(textReg, value)
        })
      })
    }

    function nodeForEach(node) {
      const list = []
      if (node.childNodes.length === 0) list.push(node)
      else {
        node.childNodes.forEach(child => {
          if (child.childNodes.length === 0) list.push(child)
          else list.push(...nodeForEach(child))
        })
      }
      return list
    }
})();