// ==UserScript==
// @name         剑网三万宝楼账号外观图片预览、爱剑三外观外观图标预览图片【电脑端使用】
// @version      0.3.6
// @license      MIT
// @description  为剑网三万宝楼出售的角色详情增加外观预览，我关注的外观增加预览，购买外观界面增加预览，鼠标点击外观图标上可以看到弹出框展示外观；同时添加外观的别名展示，方便对照，额外为爱剑三外观增加快捷的外观预览
// @run-at       document-end
// @namespace    https://tcatche.github.io/
// @author       tcatche
// @match        https://jx3.seasunwbl.com/buyer*
// @match        https://jx3.seasunwbl.com/follow*
// @match        https://www.aijx3.cn/wblwg/
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/462746/%E5%89%91%E7%BD%91%E4%B8%89%E4%B8%87%E5%AE%9D%E6%A5%BC%E8%B4%A6%E5%8F%B7%E5%A4%96%E8%A7%82%E5%9B%BE%E7%89%87%E9%A2%84%E8%A7%88%E3%80%81%E7%88%B1%E5%89%91%E4%B8%89%E5%A4%96%E8%A7%82%E5%A4%96%E8%A7%82%E5%9B%BE%E6%A0%87%E9%A2%84%E8%A7%88%E5%9B%BE%E7%89%87%E3%80%90%E7%94%B5%E8%84%91%E7%AB%AF%E4%BD%BF%E7%94%A8%E3%80%91.user.js
// @updateURL https://update.greasyfork.org/scripts/462746/%E5%89%91%E7%BD%91%E4%B8%89%E4%B8%87%E5%AE%9D%E6%A5%BC%E8%B4%A6%E5%8F%B7%E5%A4%96%E8%A7%82%E5%9B%BE%E7%89%87%E9%A2%84%E8%A7%88%E3%80%81%E7%88%B1%E5%89%91%E4%B8%89%E5%A4%96%E8%A7%82%E5%A4%96%E8%A7%82%E5%9B%BE%E6%A0%87%E9%A2%84%E8%A7%88%E5%9B%BE%E7%89%87%E3%80%90%E7%94%B5%E8%84%91%E7%AB%AF%E4%BD%BF%E7%94%A8%E3%80%91.meta.js
// ==/UserScript==

(function() {

  const nameMap = JSON.parse('{"金陵凤":"一代金","金发璨月蝶心":"狐金","金发因陀罗":"猴金","金发忆广寒":"兔金","金发春庭昼":"鼠金","金发尽昭华":"中秋金","金发月华半胧":"鸡金","金发溶金卷波":"蝶金","金发浮生乐":"喵金","金发陌上相思":"考金","金发山亭燕月":"国金","金发淡月微波":"倒闭金","金发凤归云":"狗金","金发琉璃卷云":"龙女金","金发洛邑流华":"玫瑰金","金发烨熠":"猪金","金发天山月明":"丝路金","金发琼露":"珊瑚金","金发飞灵":"飒金","金发金云垂翼":"苍金","如归乐金发":"如归金","金发卷烟霞":"角金","金发凤羽涟":"凤金","金发时光无竞":"时光金","金发迷金醉梦":"牛金","金发弦月落":"巴卡金","金发漫卷云舒":"云金","金发漫卷云舒新":"新云金","金发凤仙":"凤仙金","金发月升蘅芷":"香蕉金","金发昼锦":"虎金","金发观山鉴水":"呱金","金发楹香雪":"楹香雪金发","金发卧梦楼兰":"女仆金","金发金欹翠翘":"四代中秋金","金发璨星浮光":"雪金","金发琉璃幻":"海金","金发俏小仙":"俏仙金发","金发蔷薇星夜":"蔷薇金","金发穆月澄芳":"穆金","金发清露吟蝶":"水母金","金发龙章凤姿":"龙金","金发登云峰":"三代金","琼枝金鹊月出金发":"澄琼枝金发","琼枝金鹊清影金发":"绿琼枝金发","琼枝金鹊聆风金发":"白琼枝金发","琼枝金鹊红妆金发":"红琼枝金发","游园惊梦脂雨金发":"紫游园金发","游园惊梦沉烟金发":"绿游园金发","游园惊梦暮卷金发":"红游园金发","游园惊梦袅晴金发":"粉游园金发","游园惊梦韶光金发":"白游园金发","游园惊梦醉软金发":"蓝游园金发","游园惊梦韶光金发新":"新白游园金","游园惊梦袅晴金发新":"新粉游园金","游园惊梦暮卷金发新":"新红游园金","游园惊梦沉烟金发新":"新绿游园金","游园惊梦脂雨金发新":"新紫游园金","游园惊梦醉软金发新":"新蓝游园金","海岛冰轮孤光金发":"白海岛金发","海岛冰轮悬金金发":"金海岛金发","海岛冰轮流霜金发":"蓝海岛金发","海岛冰轮斩月金发":"黑海岛金发","竹影清风梢光金发":"竹影梢光金发","竹影清风梦境金发":"竹影梦境金发","竹影清风墨花金发":"竹影墨花金发","竹影清风紫茸金发":"竹影紫茸金发","竹影清风火莲金发":"竹影火莲金发","人间情重红豆金发":"红人间金发","人间情重恺悌金发":"黑人间金发","人间情重长思金发":"绿人间金发","人间情重纯瑛金发":"紫人间金发","人间情重秋芳金发":"黄人间金发","雨山前青灯金发":"青雨山前金发","雨山前玉枕金发":"白雨山前金发","雨山前离枝金发":"红雨山前金发","雨山前若木金发":"紫雨山前金发","幽昙月影苍韵金发":"绿幽昙金发","幽昙月影初晨金发":"金幽昙金发","幽昙月影墨染金发":"黑幽昙金发","幽昙月影阑珊金发":"红幽昙金发","幽昙月影琼玉金发":"白幽昙金发","幽馥引莹金发":"白幽馥金发","幽馥引妍金发":"紫幽馥金发","幽馥引绛金发":"红幽馥金发","幽馥引玄金发":"黑幽馥金发","幽馥引芽金发":"蓝幽馥金发","龙隐织梦金发":"白龙隐金发","龙隐浩渺金发":"绿龙隐金发","龙隐潜夜金发":"黑龙隐金发","龙隐落霜金发":"蓝龙隐金发","龙隐星月金发":"紫龙隐金发","卿如故":"卿如故黑发","四周年红发":"四红","红发赤影":"五红","红发火卷珠帘":"六红","红发烨华":"七红","红发赤辰凌风":"八红","红发流焰飞渊":"九红","红发棠羽":"十红","红发光跃桃浪":"十一红","红发红尘一枝":"十二红","红发临镜灼华":"十三红","红发向朝晖":"十四红","红发彤霞":"羊红","红发曙景华年":"猴红","红弦别夜":"鸡红","红发凤带金屏":"狗红","红发敛殷":"猪红","红发染枫意":"鼠红","红发载欢":"牛红","红发丹鸿影":"虎红","红发煌曜":"兔红","红发京华梦":"龙红","灰发星虹":"二代灰","灰发楹香雪":"楹香雪灰发","灰发坠虚欢远霄":"三代金灰发","灰发坠虚欢重寒":"银灰坠虚欢","石蕊凤仙":"凤仙粉","胭脂琼枝萝":"紫发","凤仙礼盒":"粉发盒子","楹香雪礼盒":"灰金发盒子","红尘一枝礼盒":"王红盒子","月隐鬓今生":"一代蓝中秋白","月隐鬓古影":"一代粉中秋白","雪泥鸿颜":"一代七夕白","韶华春秋发":"二代七夕白","秋叶凝霜发":"一代重阳白","舟雨眠暮霭发":"一代花朝白白","舟雨眠疏霖发":"一代花朝粉白","舟雨眠江行发":"一代花朝绿白","舟雨眠烟渺发":"一代花朝黄白","月归重云扶光发":"狗白","月归重云兮和发":"猫白","霜月星河发":"白端午白发","夜阑风雨发":"黑端午白发","海晏拨云白发":"狄仁杰白","云锦丹绮白发":"二代元宵白","宛曲流云白发":"二代重阳白","月梦清秋白发":"三代中秋白","相思云鸢发":"三代七夕白","雪月交晖发":"49白","寒山拥炉白发":"棉袄白","远行客古道白发":"白腿白","远行客烛影白发":"红腿白","远行客千重白发":"蓝腿白","蓬山归岚白发":"二代花朝白","曼纱旋舞白发":"丝路白","泠月兰芳白发":"泠月白发","凌霄踏云白发":"踏云白发","飞天舞阙白发":"飞天白发","嬿婉同心白发":"四代七夕白发","越吟歌酒棠满白发":"四代中秋粉白发","越吟歌酒霜月白发":"四代中秋蓝白发","晓烟露痕漱月白发":"绿盒白发","晓烟露痕紫萸白发":"紫盒白发","玄影腾蛟白发":"小白龙白发","谪仙远怀白发":"黑谪仙白发","谪仙英菲白发":"绿谪仙白发","谪仙情思白发":"蓝谪仙白发","谪仙明江白发":"白金谪仙白发","万里乘风白发":"乘风白发","铃语鸣蝉曦光白发":"白楼兰白发","铃语鸣蝉沉夜白发":"黑楼兰白发","如归乐白发":"如归白发","疏雨入帘白发":"澡盒白发","云外飞皇白发":"飞皇白发","幽阑碎雪白发":"幽阑白发","松间鹊影白发":"同人白发","乘风九垓白发":"二代乘风白发","比翼相思白发":"五代七夕白发","望舒撩月凉空白发":"绿中秋白发","望舒撩月花彤白发":"蓝中秋白发","望舒撩月韶秀白发":"粉中秋白发","望舒撩月魏花白发":"紫中秋白发","解星织羽宫禁白发":"紫重阳白发","解星织羽莹莹白发":"黄重阳白发","翩云破月晓梦白发":"黑同人白发","翩云破月倚香白发":"粉同人白发","玉玲珑墨心白发":"墨心白发","玉玲珑浮岚白发":"浮岚白发","菩提禅音净尘白发":"净尘白发","菩提禅音素妆白发":"粉菩提白发","菩提禅音华月白发":"黄菩提白发","菩提禅音霜镜白发":"霜镜白发","凤舞韶华入梦白发":"入梦白发","凤舞韶华薄雾白发":"薄雾白发","凤舞韶华烨然白发":"烨然白发","凤舞韶华晚日白发":"晚日白发","凤舞韶华流萤白发":"流萤白发","曲塘流风思澄白发":"红兔白","曲塘流风清蔚白发":"蓝兔白","琼枝金鹊月出白发":"澄琼枝白发","琼枝金鹊清影白发":"绿琼枝白发","琼枝金鹊聆风白发":"白琼枝白发","琼枝金鹊红妆白发":"红琼枝白发","沧海潮生白发":"沧海白发","笙歌连昼玉壶白发":"唐风玉壶白发","笙歌连昼韶颜白发":"唐风韶颜白发","红尘归客晖照白发":"黑红尘白发","红尘归客霜烟白发":"白红尘白发","宴天宫妙岩白发":"黑狮白发","宴天宫彤华白发":"白狮白发","游园惊梦醉软白发":"蓝游园白发","游园惊梦脂雨白发":"紫游园白发","游园惊梦沉烟白发":"绿游园白发","游园惊梦暮卷白发":"红游园白发","游园惊梦袅晴白发":"粉游园白发","游园惊梦韶光白发":"白游园白发","幽桃落香瑟宁白发":"原色幽香白发","幽桃落香霜徊白发":"紫幽香白发","幽桃落香景韶白发":"蓝幽香白发","幽桃落香萋明白发":"粉幽香白发","浮金跃影白发":"小金龙白发","游园惊梦韶光白发新":"新白游园白","游园惊梦袅晴白发新":"新粉游园白","游园惊梦暮卷白发新":"新红游园白","游园惊梦沉烟白发新":"新绿游园白","游园惊梦脂雨白发新":"新紫游园白","游园惊梦醉软白发新":"新蓝游园白","明光满缃影白发":"黑明光白发","明光满绛痕白发":"白明光白发","吟沧浪白发":"竹笛白发","梦舞飞旋白发":"小熊白发","醉羽霓裳白发":"孔雀白发","鉴松影质明白发":"质明白发","鉴松影日昃白发":"日昃白发","鉴松影三更白发":"三更白发","鉴松影隅中白发":"隅中白发","花醉良辰凤卜白发":"红六七白发","花醉良辰鸾俦白发":"白六七白发","人间花月白发":"芙蓉白发","淡芳盈香白发":"六代中秋白发","枕月人间白发":"二胡白发","海岛冰轮孤光白发":"白海岛白发","海岛冰轮悬金白发":"金海岛白发","海岛冰轮流霜白发":"蓝海岛白发","海岛冰轮斩月白发":"黑海岛白发","宴清嘉和闻溪白发":"五代绿重阳白发","宴清嘉和长慕白发":"五代黄重阳白发","宴清嘉和浅绮白发":"五代紫重阳白发","竹影清风梢光白发":"竹影梢光白发","竹影清风梦境白发":"竹影梦境白发","竹影清风墨花白发":"竹影墨花白发","竹影清风紫茸白发":"竹影紫茸白发","竹影清风火莲白发":"竹影火莲白发","此间清风秋闲白发":"原色异域白发","此间清风玉霜白发":"蓝异域白发","素袖清波流影白发":"绿水袖白发","素袖清波照粼白发":"蓝水袖白发","揽诸素纨白发":"白懒猪白发","揽诸玄鞘白发":"黑懒猪白发","揽诸青矢白发":"绿懒猪白发","揽诸赤旖白发":"红懒猪白发","归梦长夜歌白发":"蓝琵琶白发","归梦长朝弦白发":"红琵琶白发","明月逐云白发":"蝴蝶白发","遥春知岁白发":"红梅盒白发","冰雪逐梦白发":"花滑白发","剑拭星芒白发":"星源白发","忘川旧梦潜怀白发":"白忘川白发","忘川旧梦前尘白发":"蓝忘川白发","忘川旧梦三生白发":"粉忘川白发","忘川旧梦牵念白发":"紫忘川白发","广陵叙梦白发":"古琴盒白发","人间情重红豆白发":"红人间白发","人间情重恺悌白发":"黑人间白发","人间情重长思白发":"绿人间白发","人间情重纯瑛白发":"紫人间白发","人间情重秋芳白发":"黄人间白发","辰星若幻白发":"星辰白发","稚梦童欢羊白发":"羊盒白发","稚梦童欢狼白发":"狼盒白发","弦歌引白发":"箜篌白发","玉露仙音白发":"山海白发","雨山前青灯白发":"青雨山前白发","雨山前玉枕白发":"白雨山前白发","雨山前离枝白发":"红雨山前白发","雨山前若木白发":"紫雨山前白发","良缘有期白发":"七七白发","璧辉影沉桂序白发":"七中黄盒白发","璧辉影沉泫露白发":"七中白盒白发","幽昙月影苍韵白发":"绿幽昙白发","幽昙月影初晨白发":"金幽昙白发","幽昙月影墨染白发":"黑幽昙白发","幽昙月影阑珊白发":"红幽昙白发","幽昙月影琼玉白发":"白幽昙白发","云霞流绮白发":"雏菊白发","风雷如御白发":"弓盒白发","爻月祭霜白发":"白爻月白发","爻月祭玄白发":"紫爻月白发","爻月祭苍白发":"黑爻月白发","玄玉绮光鸣景白发":"红雪人白发","玄玉绮光斯若白发":"白雪人白发","镖客行白发":"镖盒白发","滇林雨幽境白发":"黑傣族白发","滇林雨祈愿白发":"黄傣族白发","滇林雨寻意白发":"绿傣族白发","滇林雨知南白发":"蓝滇林白发","爻月祭素白发":"绿爻月白发","坠夜流金白发":"金鳞盒白发","东风入律白发":"除夕盒白发","山水行白发":"NPC白发","酒御东风白发":"卿酒盒白发","清光彩璨琉华白发":"蓝钻石盒白发","清光彩璨珠夜白发":"粉钻石盒白发","繁星映雪白发":"不良人盒白发","椿山漫把酒白发":"红椿山白发","椿山漫故人白发":"黑椿山白发","椿山漫江南白发":"紫椿山白发","椿山漫重逢白发":"蓝椿山白发","花照阡陌白发":"踏青白发","青霄丹罗白发":"青霄盒白发","回首妖眸芒灵白发":"金白妖眸盒白发","回首妖眸狐鸣白发":"红白妖眸盒白发","回首妖眸轮回白发":"红黑妖眸盒白发","回首妖眸永生白发":"棕黑妖眸盒白发","玉雪灵龙白发":"灵龙白发","溪雨濯虹白发":"虹兔盒白发","玉冰飞韵白发":"蓝兔盒白发","圆舞之诗白发":"圆舞盒白发","拈花笑白发":"拈花盒白发","一点沧洲潋滟白发":"蓝沧洲盒白发","一点沧洲绯光白发":"粉沧洲盒白发","一点沧洲白沙白发":"紫沧洲盒白发","一点沧洲长夜白发":"黑沧洲盒白发","一点沧洲薄暮白发":"黄沧洲盒白发","遥步通天白发":"遥步盒白发","持君令绶紫白发":"紫持君盒白发","持君令华玉白发":"白持君盒白发","持君令纡朱白发":"红持君盒白发","持君令印金白发":"金持君盒白发","玉清月流白发":"八七盒白发","暮光逾明清白发":"白八中白发","暮光逾明墀白发":"黑八中白发","秋辉映梦白发":"六代重阳白发","幽馥引莹白发":"白幽馥白发","幽馥引妍白发":"紫幽馥白发","幽馥引绛白发":"红幽馥白发","幽馥引玄白发":"黑幽馥白发","幽馥引芽白发":"蓝幽馥白发","青山远黛白发":"青山盒白发","天星长坠白发":"天星盒白发","龙隐织梦白发":"白龙隐白发","龙隐浩渺白发":"绿龙隐白发","龙隐潜夜白发":"黑龙隐白发","龙隐落霜白发":"蓝龙隐白发","龙隐星月白发":"紫龙隐白发","红香照雪白发":"红香盒白发","悠游九阙白发":"游龙盒白发","吉祥颂泽福白发":"红吉祥白发","吉祥颂可宝白发":"蓝吉祥白发","吉祥颂天恩白发":"紫吉祥白发","吉祥颂恒长白发":"绿吉祥白发","绮梦之章白发":"绮梦白发","神鹿灵心晴鸣白发":"原色鹿白发","神鹿灵心晓澈白发":"粉鹿白发","十五夜观灯锦砌白发":"紫观灯盒白发","十五夜观灯封霜白发":"白观灯盒白发","十五夜观灯绮歌白发":"红观灯盒白发","十五夜观灯落梅白发":"蓝观灯盒白发","十五夜观灯南涧白发":"黄观灯盒白发","海阔天空白发":"海阔盒白发","神龙盖世白发":"神龙白发","灵紫月泪白发":"茄盒白发","妙乐天音白发":"妙乐盒白发","鹭汐辞雾晖白发":"白鹭汐辞白发","鹭汐辞轻霭白发":"蓝鹭汐辞白发","鹭汐辞谲云白发":"粉鹭汐辞白发","鹭汐辞逐影白发":"黑鹭汐辞白发","龙吟四海白发":"龙吟盒白发","莲台清咏白发":"莲台盒白发","蓬山归岚黑发":"二代花朝黑","袖手升平发":"元宵黑","曼纱旋舞黑发":"丝路黑","海晏拨云黑发":"狄仁杰黑","泠月兰芳黑发":"泠月黑发","凌霄踏云黑发":"踏云黑发","飞天舞阙黑发":"飞天黑发","嬿婉同心黑发":"四代七夕黑发","越吟歌酒棠满黑发":"四代中秋粉黑发","越吟歌酒霜月黑发":"四代中秋蓝黑发","晓烟露痕漱月黑发":"绿盒黑发","晓烟露痕紫萸黑发":"紫盒黑发","玄影腾蛟黑发":"小白龙黑发","谪仙远怀黑发":"黑谪仙黑发","谪仙英菲黑发":"绿谪仙黑发","谪仙情思黑发":"蓝谪仙黑发","谪仙明江黑发":"白金谪仙黑发","万里乘风黑发":"乘风黑发","铃语鸣蝉曦光黑发":"白楼兰黑发","铃语鸣蝉沉夜黑发":"黑楼兰黑发","如归乐殷黑发":"红如归黑发","如归乐黎黑发":"黑如归黑发","如归乐荼黑发":"白如归黑发","如归乐黛黑发":"蓝如归黑发","如归乐绾黑发":"紫如归黑发","如归乐月黑发":"绿如归黑发","疏雨入帘黑发":"澡盒黑发","云外飞皇黑发":"飞皇黑发","幽阑碎雪黑发":"幽阑黑发","松间鹊影黑发":"同人黑发","乘风九垓黑发":"二代乘风黑发","比翼相思黑发":"五代七夕黑发","望舒撩月凉空黑发":"绿中秋黑发","望舒撩月花彤黑发":"蓝中秋黑发","望舒撩月韶秀黑发":"粉中秋黑发","望舒撩月魏花黑发":"紫中秋黑发","解星织羽宫禁黑发":"紫重阳黑发","解星织羽莹莹黑发":"黄重阳黑发","翩云破月晓梦黑发":"黑同人黑发","翩云破月倚香黑发":"粉同人黑发","玉玲珑墨心黑发":"墨心黑发","玉玲珑浮岚黑发":"浮岚黑发","菩提禅音净尘黑发":"净尘黑发","菩提禅音素妆黑发":"素妆黑发","菩提禅音华月黑发":"华月黑发","菩提禅音霜镜黑发":"霜镜黑发","凤舞韶华入梦黑发":"入梦黑发","凤舞韶华薄雾黑发":"薄雾黑发","凤舞韶华烨然黑发":"烨然黑发","凤舞韶华晚日黑发":"晚日黑发","凤舞韶华流萤黑发":"流萤黑发","曲塘流风思澄黑发":"红兔黑","曲塘流风清蔚黑发":"蓝兔黑","琼枝金鹊月出黑发":"澄琼枝黑发","琼枝金鹊清影黑发":"绿琼枝黑发","琼枝金鹊聆风黑发":"白琼枝黑发","琼枝金鹊红妆黑发":"红琼枝黑发","沧海潮生黑发":"沧海黑发","笙歌连昼玉壶黑发":"唐风玉壶黑发","笙歌连昼韶颜黑发":"唐风韶颜黑发","红尘归客晖照黑发":"黑红尘黑发","红尘归客霜烟黑发":"白红尘黑发","宴天宫妙岩黑发":"黑狮黑发","宴天宫彤华黑发":"白狮黑发","游园惊梦醉软黑发":"蓝游园黑发","游园惊梦脂雨黑发":"紫游园黑发","游园惊梦沉烟黑发":"绿游园黑发","游园惊梦暮卷黑发":"红游园黑发","游园惊梦袅晴黑发":"粉游园黑发","游园惊梦韶光黑发":"白游园黑发","幽桃落香瑟宁黑发":"原色幽香黑发","幽桃落香霜徊黑发":"紫幽香黑发","幽桃落香景韶黑发":"蓝幽香黑发","幽桃落香萋明黑发":"粉幽香黑发","浮金跃影黑发":"小金龙黑发","游园惊梦韶光黑发新":"新白游园黑","游园惊梦袅晴黑发新":"新粉游园黑","游园惊梦暮卷黑发新":"新红游园黑","游园惊梦沉烟黑发新":"新绿游园黑","游园惊梦脂雨黑发新":"新紫游园黑","游园惊梦醉软黑发新":"新蓝游园黑","明光满缃影黑发":"黑明光黑发","明光满绛痕黑发":"白明光黑发","吟沧浪黑发":"竹笛黑发","梦舞飞旋黑发":"小熊黑发","醉羽霓裳黑发":"孔雀黑发","花醉良辰凤卜黑发":"红六七黑发","花醉良辰鸾俦黑发":"白六七黑发","黑发红尘一枝":"十二黑","人间花月黑发":"芙蓉黑发","淡芳盈香黑发":"六代中秋黑发","枕月人间黑发":"二胡黑发","海岛冰轮孤光黑发":"白海岛黑发","海岛冰轮悬金黑发":"金海岛黑发","海岛冰轮流霜黑发":"蓝海岛黑发","海岛冰轮斩月黑发":"黑海岛黑发","宴清嘉和闻溪黑发":"五代绿重阳黑发","宴清嘉和长慕黑发":"五代黄重阳黑发","宴清嘉和浅绮黑发":"五代紫重阳黑发","竹影清风梢光黑发":"竹影梢光黑发","竹影清风梦境黑发":"竹影梦境黑发","竹影清风墨花黑发":"竹影墨花黑发","竹影清风紫茸黑发":"竹影紫茸黑发","竹影清风火莲黑发":"竹影火莲黑发","此间清风秋闲黑发":"原色异域黑发","此间清风玉霜黑发":"蓝异域黑发","素袖清波流影黑发":"绿水袖黑发","素袖清波照粼黑发":"蓝水袖黑发","揽诸素纨黑发":"白懒猪黑发","揽诸玄鞘黑发":"黑懒猪黑发","揽诸青矢黑发":"绿懒猪黑发","揽诸赤旖黑发":"红懒猪黑发","归梦长夜歌黑发":"蓝琵琶黑发","归梦长朝弦黑发":"红琵琶黑发","明月逐云黑发":"蝴蝶黑发","遥春知岁黑发":"红梅盒黑发","冰雪逐梦黑发":"花滑黑发","剑拭星芒黑发":"星源黑发","忘川旧梦潜怀黑发":"白忘川黑发","忘川旧梦前尘黑发":"蓝忘川黑发","忘川旧梦三生黑发":"粉忘川黑发","忘川旧梦牵念黑发":"紫忘川黑发","广陵叙梦黑发":"古琴黑发","人间情重红豆黑发":"红人间黑发","人间情重恺悌黑发":"黑人间黑发","人间情重长思黑发":"绿人间黑发","人间情重纯瑛黑发":"紫人间黑发","人间情重秋芳黑发":"黄人间黑发","辰星若幻黑发":"星辰黑发","稚梦童欢羊黑发":"羊盒黑发","稚梦童欢狼黑发":"狼盒黑发","弦歌引黑发":"箜篌黑发","玉露仙音黑发":"山海黑发","雨山前青灯黑发":"青雨山前黑发","雨山前玉枕黑发":"白雨山前黑发","雨山前离枝黑发":"红雨山前黑发","雨山前若木黑发":"紫雨山前黑发","良缘有期黑发":"七七黑发","璧辉影沉桂序黑发":"七中黄盒黑发","璧辉影沉泫露黑发":"七中白盒黑发","幽昙月影苍韵黑发":"绿幽昙黑发","幽昙月影初晨黑发":"金幽昙黑发","幽昙月影墨染黑发":"黑幽昙黑发","幽昙月影阑珊黑发":"红幽昙黑发","幽昙月影琼玉黑发":"白幽昙黑发","云霞流绮黑发":"雏菊黑发","风雷如御黑发":"弓盒黑发","玄玉绮光鸣景黑发":"红玄玉黑发","玄玉绮光斯若黑发":"白玄玉黑发","镖客行黑发":"镖盒黑发","滇林雨幽境黑发":"黑傣族黑发","滇林雨祈愿黑发":"黄傣族黑发","滇林雨寻意黑发":"绿傣族黑发","滇林雨知南黑发":"蓝傣族黑发","爻月祭素黑发":"绿爻月黑发","坠夜流金黑发":"金鳞盒黑发","东风入律黑发":"除夕盒黑发","山水行黑发":"NPC黑发","酒御东风黑发":"卿酒盒黑发","清光彩璨琉华黑发":"蓝钻石盒黑发","清光彩璨珠夜黑发":"粉钻石盒黑发","繁星映雪黑发":"不良人盒黑发","椿山漫把酒黑发":"红椿山黑发","滇林雨森象黑发":"白傣族盒黑发","椿山漫故人黑发":"黑椿山黑发","椿山漫江南黑发":"紫椿山黑发","椿山漫重逢黑发":"蓝椿山黑发","花照阡陌黑发":"踏青黑发","青霄丹罗黑发":"青霄盒黑发","回首妖眸芒灵黑发":"金白妖眸盒黑发","回首妖眸狐鸣黑发":"红白妖眸盒黑发","回首妖眸轮回黑发":"红黑妖眸盒黑发","回首妖眸永生黑发":"棕黑妖眸盒黑发","玉雪灵龙黑发":"灵龙盒黑发","溪雨濯虹黑发":"虹猫盒黑发","玉冰飞韵黑发":"蓝兔盒黑发","圆舞之诗黑发":"圆舞盒黑发","拈花笑黑发":"拈花盒黑发","一点沧洲潋滟黑发":"蓝沧洲盒黑发","一点沧洲绯光黑发":"粉沧洲盒黑发","一点沧洲白沙黑发":"紫沧洲盒黑发","一点沧洲长夜黑发":"黑沧洲盒黑发","一点沧洲薄暮黑发":"黄沧洲盒黑发","遥步通天黑发":"遥步盒黑发","持君令绶紫黑发":"紫持君盒黑发","持君令华玉黑发":"白持君盒黑发","持君令纡朱黑发":"红持君盒黑发","持君令印金黑发":"金持君盒黑发","玉清月流黑发":"八七盒黑发","暮光逾明清黑发":"白八中黑发","暮光逾明墀黑发":"黑八中黑发","秋辉映梦黑发":"六代重阳黑发","幽馥引莹黑发":"白幽馥黑发","幽馥引妍黑发":"紫幽馥黑发","幽馥引绛黑发":"红幽馥黑发","幽馥引玄黑发":"黑幽馥黑发","幽馥引芽黑发":"蓝幽馥黑发","青山远黛黑发":"青山盒黑发","天星长坠黑发":"天星盒黑发","龙隐织梦黑发":"白龙隐黑发","龙隐浩渺黑发":"绿龙隐黑发","龙隐潜夜黑发":"黑龙隐黑发","龙隐落霜黑发":"蓝龙隐黑发","龙隐星月黑发":"紫龙隐黑发","红香照雪黑发":"红香盒黑发","悠游九阙黑发":"游龙盒黑发","吉祥颂泽福黑发":"红吉祥黑发","吉祥颂可宝黑发":"蓝吉祥黑发","吉祥颂天恩黑发":"紫吉祥黑发","吉祥颂恒长黑发":"绿吉祥黑发","神鹿灵心晴鸣黑发":"原色鹿黑发","神鹿灵心晓澈黑发":"粉鹿黑发","十五夜观灯锦砌黑发":"紫观灯盒黑发","十五夜观灯封霜黑发":"白观灯盒黑发","十五夜观灯绮歌黑发":"黄观灯盒黑发","十五夜观灯南涧黑发":"蓝观灯盒黑发","十五夜观灯落梅黑发":"红观灯盒黑发","海阔天空黑发":"海阔盒黑发","神龙盖世黑发":"神龙黑发","灵紫月泪黑发":"茄盒黑发","妙乐天音黑发":"妙乐盒黑发","鹭汐辞雾晖黑发":"白鹭汐辞黑发","鹭汐辞谲云黑发":"粉鹭汐辞黑发","鹭汐辞逐影黑发":"黑鹭汐辞黑发","鹭汐辞轻霭黑发":"蓝鹭汐辞黑发","龙吟四海黑发":"龙吟盒黑发","莲台清咏黑发":"莲台盒黑发","夜斩白月吟":"黑金夜斩白","夜斩白华年":"白金夜斩白","沧海间烟扣":"粉白菜","沧海间逝水":"紫白菜","繁烛灿":"粉繁","繁月升":"橙繁","彩云归繁花":"红彩云","彩云归桑节":"蓝彩云","罗姆之舞皓质":"白螺母","罗姆之舞碧华":"蓝螺母","玉蟒游龙珥":"黑玉蟒","玉蟒游龙鲜":"红玉蟒","风露霜华咏":"红风露","风露霜华蚀":"蓝风露","风华倾国谁懂":"紫风华","风华倾国时难":"黑风华","贺华岁谷雨":"谷雨","贺华岁情阅":"情阅","阳春海":"蓝阳春","阳春冰":"白阳春","紧那罗歌波吟":"黑紧那","紧那罗歌晓镜":"红紧那","墨韵青髓霓":"蓝墨韵","墨韵青髓玄":"红墨韵","捕风捉影玄索":"捕风玄索","捕风捉影纵鹰":"捕风纵鹰","花开云隐秋菊":"蓝花开","花开云隐春松":"绿花开","策马弯弓河洲":"策马河洲","策马弯弓若如":"策马若如","火舞阳炎未翔":"火舞未翔","火舞阳炎杏甜":"火舞杏甜","桃花流水清兮":"蓝公主","桃花流水情悦":"粉公主","风不欺绿野":"绿不欺","风不欺素晚":"蓝不欺","闇换年轮宝扇":"黑年轮","闇换年轮馔玉":"红年轮","闇换年轮绸绦":"黄年轮","闇换年轮杏芳":"蓝年轮","云间金月月影":"黄娃娃","云间金月点漆":"蓝娃娃","云间金月镶云":"粉娃娃","云间金月星野":"白娃娃","人面春风剪翼":"蓝人面","人面春风华香":"粉人面","九曲东溟西天":"红九曲","九曲东溟渊缘":"蓝九曲","金陵意气福源":"白金陵","金陵意气吉兆":"蓝金陵","金陵意气鸿图":"粉金陵","金陵意气春风":"黄金陵","半霄江醉礼盒":"半霄江醉","月宵花雾礼盒":"月宵花雾","楚山暮云礼盒":"楚山暮云","流夜隐微礼盒":"280流夜衣服","浪海浮波礼盒":"浪海礼盒","点寒星礼盒":"点寒星","玉悬窗礼盒":"玉悬窗","琴台顾礼盒":"琴台顾","疏照清光礼盒":"疏照盒","盈露游江礼盒":"盈露游江","笑语盈海礼盒":"笑语盈海","重阙锦色礼盒":"重阙锦色衣服","玉妆裁叶礼盒":"玉妆礼盒","九壤垂绫横慧":"白九壤","九壤垂绫絆染":"黄九壤","九壤垂绫焉何":"粉九壤","九壤垂绫灵运":"蓝九壤","兰庭轻罗凤香":"兰庭凤香","兰庭轻罗新翠":"兰庭新翠","兰庭轻罗冷绣":"兰庭冷绣","兰庭轻罗金烬":"兰庭金烬","禹梦九天紫羽":"黑九天","禹梦九天蓝翼":"蓝九天","禹梦九天胭脂":"红九天","禹梦九天缃黄":"紫九天","长天秋鸿嫣红":"红长天","长天秋鸿湖蓝":"绿长天","长天秋鸿黍麦":"蓝长天","长天秋鸿天霜":"白长天","封川云色江云":"粉封川","封川云色迷津":"紫封川","封川云色渭青":"绿封川","封川云色惆月":"白封川","盛装舞步冬阳":"红舞步","盛装舞步薄嗅":"粉舞步","盛装舞步霰冰":"蓝舞步","盛装舞步浅语":"紫舞步","沐云飞今宵":"紫云飞","沐云飞前欢":"红云飞","沐云飞春信":"绿云飞","沐云飞棹月":"蓝沐云","月凝清宵流蕴":"紫玫瑰","月凝清宵高烛":"红玫瑰","月凝清宵品玉":"白玫瑰","月凝清宵嗅腻":"黄玫瑰","微草凌波武陵":"微草武陵","微草凌波暮雨":"微草暮雨","微草凌波团浓":"微草团浓","微草凌波盘京":"微草盘京","天涯暮归空亭":"天涯空亭","天涯暮归游浦":"天涯游浦","天涯暮归宴陵":"黑天涯","天涯暮归旌湖":"天涯旌湖","重天冥寞梨棠":"重天梨棠","重天冥寞飞笙":"重天飞笙","重天冥寞照晚":"重天照晚","重天冥寞夜歌":"重天夜歌","踏月乱红春水":"踏月春水","踏月乱红锦衣":"踏月锦衣","踏月乱红沧浪":"踏月沧浪","踏月乱红横塘":"踏月横塘","踏月乱红濯香":"踏月濯香","踏月乱红幽梦":"踏月幽梦","幽舞华芳":"打歌服","鸢露白月霁茗":"鸢露霁茗","鸢露白月洛翎":"鸢露洛翎","鸢露白月暮鸾":"鸢露暮鸾","鸢露白月琼华":"鸢露琼华","月寒杳音赪丹":"月寒赪丹","月寒杳音蛱蝶":"月寒蛱蝶","月寒杳音凌苍":"月寒凌苍","月寒杳音庭兰":"月寒庭兰","雪衣貂裘寒川":"雪衣寒川","雪衣貂裘寒江":"雪衣寒江","雪衣貂裘寒山":"雪衣寒山","雪衣貂裘寒月":"雪衣寒月","雪衣貂裘·月寒":"雪衣月寒","牵云曳雪红梅":"牵云红梅","牵云曳雪碧屏":"牵云碧屏","牵云曳雪金鲤":"牵云金鲤","牵云曳雪秋华":"牵云秋华","牵云曳雪雪舟":"牵云雪舟","牵云曳雪玉人":"牵云玉人","望云引凤绛霞":"望云绛霞","望云引凤春潮":"望云春潮","望云引凤玉烛":"望云玉烛","望云引凤山椿":"望云山椿","望云引凤华胥":"望云华胥","望云引凤垂杨":"望云垂杨","侠影飒沓流光":"侠影流光","侠影飒沓飞瀑":"侠影飞瀑","侠影飒沓静庭":"侠影静庭","侠影飒沓空山":"侠影空山","冷霜华重霏微":"冷霜霏微","冷霜华重槛菊":"冷霜槛菊","冷霜华重芳萼":"冷霜芳萼","冷霜华重敛翠":"冷霜敛翠","中宵露白霜渊":"中宵霜渊","中宵白露渊霜":"中宵渊霜","中宵白露霆露":"中宵霆露","中宵白露幽檀":"中宵幽檀","中宵白露瞳星":"中宵瞳星","中宵白露靖墨":"中宵靖墨","中宵白露染枫":"中宵染枫","雾影仙风霜奈":"雾影霜奈","雾影仙风绛英":"雾影绛英","雾影仙风枯荷":"雾影枯荷","雾影仙风孤鸿":"雾影孤鸿","兰若春夏渝州":"兰若渝州","兰若春夏豆蔻":"兰若豆蔻","兰若春夏暮归":"兰若暮归","兰若春夏青溪":"兰若青溪","飒西风龙旌":"白西风","飒西风陵烟":"橘红西风","飒西风雪回":"紫西风","飒西风丹壑":"黄西风","飒西风苍璧":"黑红西风","飒西风清江":"蓝西风","寒梅雪琼日暮":"寒梅日暮","寒梅雪琼竹月":"寒梅竹月","寒梅雪琼淡云":"寒梅淡云","寒梅雪琼晚萼":"寒梅晚萼","寒梅雪琼玉露":"寒梅玉露","寒梅雪琼空山":"寒梅空山","容与逍遥永逸":"容与永逸","容与逍遥自适":"容与自适","容与逍遥忘忧":"容与忘忧","容与逍遥攸游":"容与攸游","长安着锦檐月":"黄长安","长安着锦碎玉":"绿长安","长安着锦远澜":"紫长安","长安着锦折枝":"粉长安","清夜幽怀依涵":"依涵","清夜幽怀沉笙":"沉笙","清夜幽怀星居":"清夜星居","清夜幽怀挽砚":"挽砚","枕戈听漏魅生":"黑枕戈","枕戈听漏寥歌":"蓝枕戈","枕戈听漏夜梨":"白枕戈","枕戈听漏将醉":"黄枕戈","楚山暮云流光":"楚山流光","楚山暮云破晓":"楚山破晓","楚山暮云初晨":"楚山初晨","楚山暮云余晖":"楚山余晖","半霄江醉赤珠":"小红龙衣","半霄江醉玄寂":"小黑龙衣","盈露游江川陵":"盈露川陵","盈露游江鹤清":"盈露鹤清","盈露游江影悠":"盈露影悠","盈露游江珏茗":"盈露珏茗","流夜隐微窈蔚":"流夜窈蔚","流夜隐微辉墨":"流夜辉墨","流夜隐微寄雪":"流夜寄雪","流夜隐微娆绯":"流夜娆绯","笑语盈海欢声":"白泳衣","笑语盈海乐水":"黑泳衣","笑语盈海惬意":"黄泳衣","笑语盈海嬉戏":"蓝泳衣","天河对影缃桐":"绿天河","天河对影沁徽":"黑天河","箜篌踏歌阆海":"蓝水母","箜篌踏歌檀霞":"粉水母","浪海浮波浅风":"蓝浪海","浪海浮波斜昙":"粉浪海","浪海浮波琥珊":"绿浪海","浪海浮波沧兮":"黄浪海","疏照清光寂昼":"蓝清光","疏照清光空枝":"黄清光","疏照清光风露":"紫清光","疏照清光春驻":"黑清光","玉妆裁叶垂丝":"绿玉妆","玉妆裁叶朝雨":"蓝玉妆","玉妆裁叶轻尘":"白玉妆","玉妆裁叶春鸢":"粉玉妆","风露霜华晓":"风露晓","风露霜华沧":"粉风露","沧海间沉歌":"绿白菜","沧海间玉魄":"红白菜","夜斩白崇舟":"白夜斩","夜斩白陌隐":"黄夜斩","罗姆之舞弦月":"罗姆弦月","罗姆之舞拂秀":"罗姆拂秀","捕风捉影无痕":"捕风无痕","捕风捉影惊情":"捕风惊情","紧那罗歌飞涯":"紧那飞涯","紧那罗歌点霜":"紧那点霜","花开云隐凝芳":"花开凝芳","花开云隐蔓菁":"花开蔓菁","阳春霜":"粉阳春","阳春月":"黄阳春","墨韵青髓若茗":"白墨韵","墨韵青髓黛初":"墨韵黛初","玉蟒游龙蕴":"玉蟒蕴","玉蟒游龙胧":"玉蟒胧","风华倾国丹凤":"风华丹凤","风华倾国远黛":"风华远黛","沧海间浩瀚":"白白菜","罗姆之舞婵娟":"罗姆婵娟","罗姆之舞皓月":"罗姆皓月","贺华岁白堤":"白贺华岁","贺华岁可儿":"黑贺华岁","风华倾国浮光":"风华浮光","风华倾国冥苍":"风华冥苍","罗姆之舞烁金":"罗姆烁金","罗姆之舞澹银":"银罗姆","风华倾国深冕":"风华深冕","风华倾国韵金":"风华韵金","墨韵青髓墨玉":"墨韵墨玉","墨韵青髓绯烟":"墨韵绯烟","策马弯弓良宵":"策马良宵","策马弯弓雪月":"策马雪月","伏光乘龙流银":"伏光流银","伏光乘龙玄影":"伏光玄影","鸾凤合鸣婀娜":"鸾凤婀娜","鸾凤合鸣清波":"鸾凤清波","往生前夜嫣然":"往生嫣然","往生前夜阳炎":"往生阳炎","仙侣奇缘流彩":"仙侣流彩","仙侣奇缘洗碧":"仙侣洗碧","瑶池戏月春枝":"瑶池春枝","瑶池戏月暮风":"瑶池暮风","自在多罗净心":"自在净心","自在多罗无嗔":"自在无嗔","天选金月初雪":"复刻白二娃","天选金月春芳":"复刻粉二娃","天选金月谷雨":"复刻绿二娃","天选桃花念霄":"蓝二公主","天选桃花染素":"白二公主","天选桃花缃绮":"黄二公主","天选桃花樱草":"粉二公主","天选风不欺无忧":"粉不欺","天选风不欺无尘":"复刻蓝不欺","天选风不欺无惧":"紫不欺","天选风不欺无执":"复刻绿不欺","潇湘云水金霄":"黑潇湘","潇湘云水玄云":"潇湘玄云","凤舆龙驾错弦":"凤舆错弦","凤舆龙驾化雪":"凤舆化雪","瑞雪披霞兰露":"瑞雪兰露","瑞雪披霞烟霞":"瑞雪烟霞","天河对影清晏":"天河清晏","天河对影枕星":"天河枕星","雪山飞狐冰魄":"雪山冰魄","雪山飞狐云魂":"雪山云魂","重阙锦色明珰":"重阙明珰","重阙锦色珠箔":"重阙珠箔","重阙锦色春空":"重阙春空","重阙锦色碧宵":"重阙碧宵","重阙锦色天镜":"重阙天镜","重阙锦色赤松":"重阙赤松","榆塞度晚裂衿":"榆塞裂衿","榆塞度晚斩芒":"榆塞斩芒","榆塞度晚寒塘":"榆塞寒塘","榆塞度晚振锋":"榆塞振锋","榆塞度晚吹角":"榆塞吹角","榆塞度晚落旌":"榆塞落旌","尽奏清商绕纱":"尽奏绕纱","尽奏清商映妆":"尽奏映妆","尽奏清商故岸":"尽奏故岸","尽奏清商怅舟":"尽奏怅舟","尽奏清商晨岚":"尽奏晨岚","尽奏清商折笺":"尽奏折笺","一梦浮生辰风":"一梦辰风","一梦浮生飘摇":"一梦飘摇","凤舆龙驾皇华":"凤舆皇华","凤舆龙驾云门":"凤舆云门","谁家山泽风兮":"谁家风兮","谁家山泽雨兮":"谁家雨兮","自在多罗天龙":"红自在","自在多罗摩诃":"黄自在","潇湘云水青萝":"绿潇湘","潇湘云水丁香":"紫潇湘","鬼神泣未酬":"红黑鬼神泣","鬼神泣惊恶":"白黑鬼神泣","仙侣奇缘长生":"蓝仙侣","仙侣奇缘寄愁":"粉仙侣","瑞雪披霞焰倾":"瑞雪焰倾","瑞雪披霞琼潋":"瑞雪琼潋","楼兰旖语墨絮":"楼兰墨絮","楼兰旖语金露":"楼兰金露","河汉清云幽赏":"河汉幽赏","河汉清云绯玉":"河汉绯玉","玄月霜华春知":"复刻白玄月","玄月霜华浮景":"复刻粉玄月","纤云锦缆玉琳":"复刻白纤云","纤云锦缆尘露":"复刻绿纤云","绸云缇雨鹤书":"复刻蓝绸云","香凝寒诘花":"复刻红香凝","香凝寒月照":"复刻黄香凝","骑鲸客月缃":"复刻白骑鲸","骑鲸客潮平":"复刻黄骑鲸","三春拂露留墨":"复刻黑三春","三春拂露繁紫":"复刻紫三春","小楼寒萃光":"复刻白小楼","天选月凝绕情":"复刻红玫瑰","天选月凝轻罗":"复刻黑玫瑰","天选月凝云栽":"复刻白玫瑰","天选月凝春透":"复刻粉玫瑰","天选兰庭渺云":"复刻粉兰庭","天选兰庭烟霭":"复刻红兰庭","天选兰庭连潮":"复刻黄兰庭","天选兰庭细香":"复刻蓝兰庭","天选水云寒时霖":"复刻白水云","天选水云寒岚霏":"复刻蓝水云","天选水云寒晴霁":"复刻粉水云","天选水云寒云霆":"复刻紫水云","九阙天影":"黑盒衣","盘龙凤舞":"红盒衣","鹤影天青":"青盒衣","云锦梦华":"蓝盒衣","天穹掠影":"唐盒衣","北望天狼":"白盒衣","陌上窈窕":"粉盒衣","玄影腾蛟":"小白龙衣","染墨千秋":"花盒衣","剑歌惊月":"叽盒衣","浮屠明音":"秃盒衣","碧翎叠云":"鸽盒衣","日月无心":"喵盒衣","碧海云仙":"伞盒衣","霜岱应元":"刀盒衣","虞渊引梦":"毒盒衣","曼纱旋舞":"丝路盒衣","飞天舞阙":"飞天盒衣","凌霄踏云":"踏云盒衣","海晏拨云":"狄仁杰盒衣","云中雪霁":"猪盒衣","寒山拥炉":"棉袄盒衣","晓烟露痕漱月":"重阳绿盒衣","晓烟露痕紫萸":"重阳紫盒衣","雪月交晖":"雪月盒衣","泠月兰芳":"泠月衣","袖手升平":"一代元宵衣","云锦丹绮":"二代元宵衣","千古岚空今生":"一代中秋蓝衣","千古岚空古影":"一代中秋粉衣","月梦清秋":"三代中秋衣","越吟歌酒棠满":"四代中秋粉衣","越吟歌酒霜月":"四代中秋蓝衣","秋池春水":"一代七夕衣","韶华春秋":"二代七夕衣","相思云鸢":"三代七夕衣","嬿婉同心":"四代七夕衣","秋叶凝霜":"一代重阳衣","宛曲流云":"二代重阳衣","舟雨眠疏霖":"花朝粉盒衣","舟雨眠暮霭":"花朝白盒衣","舟雨眠烟渺":"花朝黄盒衣","舟雨眠江行":"花朝绿盒衣","蓬山归岚":"二代花朝衣","霜月星河":"端午白盒衣","夜阑风雨":"端午黑盒衣","月归重云扶光":"狗盒衣","月归重云兮和":"猫盒衣","远行客古道":"白腿盒衣","远行客烛影":"红腿盒衣","远行客千重":"蓝腿盒衣","谪仙远怀":"黑谪仙衣","谪仙英菲":"绿谪仙衣","谪仙明江":"白金谪仙衣","谪仙情思":"蓝谪仙衣","斩夜无常":"雪盒衣","万里乘风":"一代乘风衣","浮世兰舟兮故":"粉鼠盒衣","浮世兰舟疏衍":"蓝鼠盒衣","晴岚绘":"三代元宵衣","山吹樱雪":"三代花朝衣","铃语鸣蝉曦光":"白楼兰衣","铃语鸣蝉沉夜":"黑楼兰衣","如归乐殷":"红如归衣","如归乐黎":"黄如归衣","如归乐荼":"白如归衣","如归乐黛":"蓝如归衣","如归乐绾":"粉如归衣","如归乐月":"绿如归衣","疏雨入帘":"澡盒衣","歃血关山":"苍盒衣","短褐狂裘":"丐盒衣","云外飞皇":"蘑菇盒衣","幽阑碎雪":"棋盒衣","乘风九垓":"二代乘风盒衣","松间鹊影":"同人盒衣","云岚叠岫":"云岚衣","迷金繁影":"迷金衣","比翼相思":"五七盒衣","望舒撩月花彤":"蓝中秋盒衣","望舒撩月凉空":"绿中秋盒衣","望舒撩月韶秀":"粉中秋盒衣","望舒撩月魏花":"紫中秋盒衣","解星织羽宫禁":"紫重阳衣","解星织羽莹莹":"黄重阳衣","翩云破月晓梦":"黑同人衣","翩云破月倚香":"粉同人衣","玉玲珑墨心":"黑玲珑衣","玉玲珑浮岚":"蓝玲珑衣","菩提禅音净尘":"白菩提衣","菩提禅音素妆":"粉菩提衣","菩提禅音华月":"黄菩提衣","菩提禅音霜镜":"蓝菩提衣","广漠听星":"星演衣","月轻语":"旗袍衣","凤舞韶华入梦":"金凤舞衣","凤舞韶华薄雾":"白凤舞衣","凤舞韶华烨然":"红凤舞衣","凤舞韶华晚日":"黑凤舞衣","凤舞韶华流萤":"粉凤舞衣","曲塘流风思澄":"红曲塘衣","曲塘流风清蔚":"蓝曲塘衣","琼枝金鹊月出":"金琼枝衣","琼枝金鹊清影":"绿琼枝衣","琼枝金鹊聆风":"白琼枝衣","琼枝金鹊红妆":"红琼枝衣","尘间清欢":"牛盒衣","沧海潮生":"沧海衣","笙歌连昼玉壶":"唐风玉壶衣","笙歌连昼韶颜":"唐风韶颜衣","红尘归客晖照":"黑红尘衣","红尘归客霜烟":"白红尘衣","宴天宫妙岩":"黑狮衣","宴天宫彤华":"白狮衣","游园惊梦醉软":"蓝游园衣","游园惊梦脂雨":"紫游园衣","游园惊梦沉烟":"绿游园衣","游园惊梦暮卷":"红游园衣","游园惊梦袅晴":"粉游园衣","游园惊梦韶光":"白游园衣","幽桃落香瑟宁":"原色幽香衣","幽桃落香霜徊":"紫幽香衣","幽桃落香景韶":"蓝幽香衣","幽桃落香萋明":"粉幽香衣","浮金跃影":"小金龙衣","霁月雪青":"二代花盒衣","明光满缃影":"黑明光衣","明光满绛痕":"白明光衣","吟沧浪":"竹笛衣","梦舞飞旋":"小熊衣","醉羽霓裳":"孔雀衣服","鉴松影质明":"鉴松影质明衣服","鉴松影日昃":"鉴松影日昃衣服","鉴松影三更":"鉴松影三更衣服","鉴松影隅中":"鉴松影隅中衣服","花醉良辰凤卜":"红六七盒衣","花醉良辰鸾俦":"白六七盒衣","青池泠月":"新青盒衣","人间花月":"芙蓉盒衣","淡芳盈香":"六代中秋衣","枕月人间":"二胡盒衣","宴清嘉和闻溪":"五代绿重阳衣","宴清嘉和长慕":"五代黄重阳衣","宴清嘉和浅绮":"五代紫重阳衣","海岛冰轮孤光":"白海岛衣","海岛冰轮悬金":"金海岛衣","海岛冰轮流霜":"蓝海岛衣","海岛冰轮斩月":"黑海岛衣","竹影清风梢光":"竹影梢光衣","竹影清风梦境":"竹影梦境衣","竹影清风墨花":"竹影墨花衣","竹影清风紫茸":"竹影紫茸衣","竹影清风火莲":"竹影火莲衣","绿野迷仙":"药盒衣","此间清风秋闲":"原色异域衣","此间清风玉霜":"蓝异域衣","素袖清波流影":"绿水袖衣","素袖清波照粼":"蓝水袖衣","吉祥颂可宝":"蓝吉祥衣","归梦长夜歌":"蓝琵琶衣","归梦长朝弦":"红琵琶衣","琼羽飞鸿":"虎盒衣","明月逐云":"蝴蝶盒衣","遥春知岁":"红梅盒衣","冰雪逐梦":"花滑盒衣","剑拭星芒":"星源盒衣","忘川旧梦潜怀":"白忘川盒衣","忘川旧梦前尘":"蓝忘川盒衣","忘川旧梦三生":"粉忘川盒衣","忘川旧梦牵念":"紫忘川盒衣","广陵叙梦":"古琴盒衣","人间情重红豆":"红人间盒衣","人间情重恺悌":"黑人间盒衣","人间情重长思":"绿人间盒衣","人间情重纯瑛":"紫人间盒衣","人间情重秋芳":"黄人间盒衣","辰星若幻":"星辰盒衣","稚梦童欢羊":"羊盒衣","稚梦童欢狼":"狼盒衣","弦歌引":"箜篌盒衣","玉露仙音":"山神盒衣","雨山前青灯":"青雨山盒衣","雨山前玉枕":"白雨山盒衣","雨山前离枝":"红雨山盒衣","雨山前若木":"紫雨山盒衣","良缘有期":"七七盒衣","蝶梦终霄":"二代毒盒衣","曲江游":"曲江游盒衣","璧辉影沉桂序":"七中黄盒衣","璧辉影沉泫露":"七中白盒衣","乘梦虚舟":"绣球衣","风刀逐浪":"刀宗衣","云霞流绮":"雏菊衣","幽昙月影苍韵":"绿幽昙衣","幽昙月影初晨":"金幽昙衣","幽昙月影墨染":"黑幽昙衣","幽昙月影阑珊":"红幽昙衣","幽昙月影琼玉":"白幽昙衣","风雷如御":"弓盒衣","爻月祭霜":"白爻月祭","爻月祭玄":"紫爻月祭","爻月祭苍":"黑爻月祭","玄玉绮光鸣景":"红雪人衣","玄玉绮光斯若":"白雪人衣","镖客行":"镖盒衣","滇林雨幽境":"黑傣族衣","滇林雨祈愿":"黄傣族衣","滇林雨寻意":"绿傣族衣","滇林雨知南":"蓝傣族衣","爻月祭素":"绿爻月祭","霜落轻裘":"兔盒衣","坠夜流金":"金鳞盒衣","东风入律":"除夕盒衣","酒御东风":"卿酒盒衣","清光彩璨珠夜":"粉钻石盒衣","清光彩璨琉华":"蓝钻石盒衣","繁星映雪":"不良人盒衣","椿山漫把酒":"红椿山衣","滇林雨森象":"白傣族盒衣","椿山漫故人":"黑椿山衣","椿山漫江南":"紫椿山衣","椿山漫重逢":"蓝椿山衣","花照阡陌":"踏青盒衣","回首妖眸芒灵":"金白妖眸盒衣","回首妖眸狐鸣":"红白妖眸盒衣","回首妖眸轮回":"红黑妖眸盒衣","回首妖眸永生":"棕黑妖眸盒衣","一念莲华":"莲华盒衣","玉雪灵龙":"灵龙盒衣","溪雨濯虹":"虹兔盒衣","玉冰飞韵":"蓝兔盒衣","圆舞之诗":"圆舞盒衣","拈花笑":"拈花盒衣","一点沧洲潋滟":"蓝沧洲盒衣","一点沧洲绯光":"粉沧洲盒衣","一点沧洲白沙":"紫沧洲盒衣","一点沧洲长夜":"黑沧洲盒衣","一点沧洲薄暮":"黄沧洲盒衣","云旌望捷":"云旌盒衣","遥步通天":"遥步盒衣","持君令绶紫":"紫持君盒衣","持君令华玉":"白持君盒衣","持君令纡朱":"红持君盒衣","持君令印金":"金持君盒衣","玉清月流":"八七盒衣","暮光逾明清":"白八中衣","暮光逾明墀":"黑八中衣","秋辉映梦":"六代重阳衣","伴灵引羽":"弓盒衣","青山远黛":"青山盒衣","幽馥引莹":"白幽馥衣","幽馥引妍":"紫幽馥衣","幽馥引绛":"红幽馥衣","幽馥引玄":"黑幽馥衣","幽馥引芽":"蓝幽馥衣","天星长坠":"天星盒衣","龙隐织梦":"白龙隐衣","龙隐浩渺":"绿龙隐衣","龙隐潜夜":"黑龙隐衣","龙隐落霜":"蓝龙隐衣","龙隐星月":"紫龙隐衣","红香照雪":"红香盒衣","云瑞腾龙":"龙盒衣","悠游九阙":"游龙盒衣","吉祥颂泽福":"红吉祥衣","吉祥颂天恩":"紫吉祥衣","吉祥颂恒长":"绿吉祥衣","绮梦之章":"婚纱衣","神鹿灵心晴鸣":"原色鹿衣服","神鹿灵心晓澈":"粉鹿衣服","十五夜观灯锦砌":"紫观灯盒衣","十五夜观灯封霜":"白观灯盒衣","十五夜观灯绮歌":"红观灯盒衣","十五夜观灯落梅":"黄观灯盒衣","十五夜观灯南涧":"蓝观灯盒衣","海阔天空":"海阔盒衣","神龙盖世":"神龙盒衣","灵紫月泪":"茄盒衣","妙乐天音":"妙乐盒衣","鹭汐辞雾晖":"白鹭汐辞衣","鹭汐辞轻霭":"蓝鹭汐辞","鹭汐辞谲云":"粉鹭汐辞衣","鹭汐辞逐影":"黑鹭汐辞衣","龙吟四海":"龙吟盒衣","莲台清咏":"莲台盒衣","九阙天影礼盒":"黑盒","曼纱旋舞礼盒":"丝路盒","雪月交晖礼盒":"雪月盒","凌霄踏云礼盒":"踏云盒","剑歌惊月礼盒":"叽盒","浮屠明音礼盒":"秃盒","海晏拨云礼盒":"狄仁杰盒","曲塘流风思澄礼盒":"红曲塘盒","盘龙凤舞礼盒":"红盒","曲塘流风清蔚礼盒":"蓝曲塘盒","碧翎叠云礼盒":"歌盒","日月无心礼盒":"喵盒","玄影腾蛟礼盒":"小白龙","云中雪霁礼盒":"猪盒","幽阑碎雪礼盒":"棋盒","月轻语礼盒":"旗袍盒","染墨千秋礼盒":"花盒","云外飞皇礼盒":"蘑菇盒","霁月雪青礼盒":"二代万花盒子","万里乘风礼盒":"一代乘风","陌上窈窕礼盒":"粉盒","乘风九垓礼盒":"二代乘风","云岚叠岫礼盒":"二代粉盒","云锦梦华礼盒":"蓝盒","远行客古道礼盒":"白腿盒","远行客烛影礼盒":"红腿盒","霜岱应元礼盒":"貂盒","虞渊引梦礼盒":"毒盒","远行客千重礼盒":"蓝腿盒","泠月兰芳礼盒":"泠月盒","碧海云仙礼盒":"蓬莱盒","广漠听星礼盒":"灯盒","飞天舞阙礼盒":"飞天盒","斩夜无常礼盒":"雪盒","谪仙情思礼盒":"蓝谪仙","谪仙远怀礼盒":"黑谪仙","鹤影天青礼盒":"青盒","浮世兰舟兮故礼盒":"粉鼠盒","谪仙英菲礼盒":"绿谪仙","浮世兰舟疏衍礼盒":"蓝鼠盒","谪仙明江礼盒":"白金谪仙","天穹掠影礼盒":"唐盒","如归乐殷礼盒":"红如归乐","北望天狼礼盒":"白盒","如归乐黎礼盒":"黑如归乐","如归乐荼礼盒":"白如归乐","歃血关山礼盒":"苍盒","如归乐黛礼盒":"蓝如归乐","短褐狂裘礼盒":"丐盒","如归乐绾礼盒":"粉如归乐","迷金繁影礼盒":"迷金盒","如归乐月礼盒":"绿如归乐","尘间清欢礼盒":"牛盒","疏雨入帘礼盒":"澡盒","青池泠月礼盒":"新青盒","风刀逐浪礼盒":"刀宗盒","玉玲珑墨心礼盒":"黑玲珑盒","玉玲珑浮岚礼盒":"蓝玲珑盒","沧海潮生礼盒":"沧海盒","笙歌连昼玉壶礼盒":"唐风玉壶盒","笙歌连昼韶颜礼盒":"唐风韶颜盒","红尘归客晖照礼盒":"黑四元盒子","红尘归客霜烟礼盒":"白四元盒子","宴天宫妙岩礼盒":"黑狮盒","宴天宫彤华礼盒":"白狮盒","幽桃落香瑟宁礼盒":"原色幽香盒","幽桃落香霜徊礼盒":"紫幽香盒","幽桃落香景韶礼盒":"蓝幽香盒","幽桃落香萋明礼盒":"粉幽香盒","浮金跃影礼盒":"小金龙盒","明光满缃影礼盒":"黑明光盒","明光满绛痕礼盒":"白明光盒","吟沧浪礼盒":"竹笛盒","梦舞飞旋礼盒":"小熊盒","醉羽霓裳礼盒":"孔雀盒","人间花月礼盒":"芙蓉盒","枕月人间礼盒":"二胡盒","宴清嘉和闻溪礼盒":"五代绿重阳盒","宴清嘉和长慕礼盒":"五代黄重阳盒","宴清嘉和浅绮礼盒":"五代紫重阳盒","绿野迷仙礼盒":"药盒","此间清风秋闲礼盒":"原色异域盒","此间清风玉霜礼盒":"蓝异域盒","素袖清波流影礼盒":"绿水袖盒","素袖清波照粼礼盒":"蓝水袖盒","归梦长夜歌礼盒":"蓝琵琶盒","归梦长朝弦礼盒":"红琵琶盒","琼羽飞鸿礼盒":"虎盒","明月逐云礼盒":"蝴蝶盒","遥春知岁礼盒":"红梅盒","冰雪逐梦礼盒":"花滑盒","剑拭星芒礼盒":"星源盒","忘川旧梦潜怀礼盒":"白忘川盒","忘川旧梦前尘礼盒":"蓝忘川盒","忘川旧梦三生礼盒":"粉忘川盒","忘川旧梦牵念礼盒":"紫忘川盒","广陵叙梦礼盒":"古琴盒","辰星若幻礼盒":"星辰盒","稚梦童欢羊礼盒":"羊盒","稚梦童欢狼礼盒":"狼盒","弦歌引礼盒":"箜篌盒","玉露仙音礼盒":"山神盒","蝶梦终霄礼盒":"二代毒盒","曲江游礼盒":"曲江游盒","乘梦虚舟礼盒":"绣球盒","云霞流绮礼盒":"雏菊盒","风雷如御礼盒":"弓盒","玄玉绮光鸣景礼盒":"红雪人盒","玄玉绮光斯若礼盒":"白雪人盒","镖客行礼盒":"镖盒","霜落轻裘礼盒":"兔盒","坠夜流金礼盒":"蛇盒","东风入律礼盒":"除夕盒","酒御东风礼盒":"卿酒盒","清光彩璨琉华礼盒":"蓝钻盒","清光彩璨珠夜礼盒":"粉钻盒","繁星映雪礼盒":"不良人盒","花照阡陌礼盒":"踏青盒","青霄丹罗礼盒":"青霄盒","一念莲华礼盒":"莲华盒","玉雪灵龙礼盒":"灵龙盒","溪雨濯虹礼盒":"虹猫盒","玉冰飞韵礼盒":"蓝兔盒","圆舞之诗礼盒":"圆舞盒","拈花笑礼盒":"拈花盒","云旌望捷礼盒":"云旌盒","遥步通天礼盒":"西游盒","玉清月流礼盒":"八七盒","暮光逾明清礼盒":"白中秋盒","暮光逾明墀礼盒":"黑中秋盒","秋辉映梦礼盒":"六代重阳盒","伴灵引羽礼盒":"弓盒","青山远黛礼盒":"青山盒","天星长坠礼盒":"天星盒","红香照雪礼盒":"红香盒","悠游九阙礼盒":"游龙盒","绮梦之章礼盒":"婚纱盒","神鹿灵心晴鸣礼盒":"原色鹿盒","神鹿灵心晓澈礼盒":"粉鹿盒子","海阔天空礼盒":"海蓝盒","神龙盖世礼盒":"神龙盒","灵紫月泪礼盒":"茄盒","妙乐天音礼盒":"妙乐盒","澜云意礼盒":"二代中秋","霜月星河礼盒":"白端午","夜阑风雨礼盒":"黑端午","蓬山归岚礼盒":"二代花朝","月归重云扶光礼盒":"狗盒","月归重云兮和礼盒":"猫盒","春水鸿颜礼盒":"一代七夕","韶华春秋礼盒":"二代七夕","相思云鸢礼盒":"三代七夕","嬿婉同心礼盒":"四代七夕","比翼相思礼盒":"五代七夕","岚空月隐礼盒今生":"一代中秋蓝","岚空月隐礼盒古影":"一代中秋粉","月梦清秋礼盒":"三代中秋","越吟歌酒棠满礼盒":"四代中秋粉","越吟歌酒霜月礼盒":"四代中秋蓝","秋叶凝霜礼盒":"一代重阳","宛曲流云礼盒":"二代重阳","晓烟露痕漱月礼盒":"三代绿重阳","晓烟露痕紫萸礼盒":"三代紫重阳","解星织羽宫禁礼盒":"四代重阳紫盒","解星织羽莹莹礼盒":"四代重阳黄盒","袖手升平礼盒":"一代元宵","云锦丹绮礼盒":"二代元宵","舟雨眠疏霖礼盒":"一代花朝粉","舟雨眠暮霭礼盒":"一代花朝白","舟雨眠烟渺礼盒":"一代花朝黄","舟雨眠江行礼盒":"一代花朝绿","寒山拥炉礼盒":"棉袄盒","晴岚绘礼盒":"三代元宵","山吹樱雪礼盒":"山吹樱雪","铃语鸣蝉曦光礼盒":"白楼兰","铃语鸣蝉沉夜礼盒":"黑楼兰","望舒撩月花彤礼盒":"望舒花彤盒","望舒撩月凉空礼盒":"望舒凉空盒","望舒撩月韶秀礼盒":"望舒韶秀盒","望舒撩月魏花礼盒":"望舒魏花盒","花醉良辰凤卜礼盒":"红六七盒","花醉良辰鸾俦礼盒":"白六七盒","淡芳盈香礼盒":"六代中秋盒","特舟雨眠礼盒":"一代花朝黑","良缘有期礼盒":"七七盒子","璧辉影沉桂序礼盒":"七代中秋黄盒","璧辉影沉泫露礼盒":"七代中秋白盒","云瑞腾龙礼盒":"龙盒","龙吟四海礼盒":"龙吟盒","莲台清咏礼盒":"莲台盒","松间鹊影礼盒标准":"松间盒(标)","松间鹊影礼盒豪华":"松间盒(豪)","翩云破月晓梦标准":"黑翩云盒(标)","翩云破月晓梦豪华":"黑翩云盒(豪)","翩云破月倚香标准":"粉翩云盒(标)","翩云破月倚香豪华":"粉翩云盒(豪)","凤舞韶华入梦标准":"金凤舞盒(标)","凤舞韶华入梦豪华":"金凤舞盒(豪)","凤舞韶华薄雾标准":"白凤舞盒(标)","凤舞韶华薄雾豪华":"白凤舞盒(豪)","凤舞韶华烨然标准":"红凤舞盒(标)","凤舞韶华烨然豪华":"红凤舞盒(豪)","凤舞韶华晚日标准":"黑凤舞盒(标)","凤舞韶华晚日豪华":"黑凤舞盒(豪)","凤舞韶华流萤礼盒":"粉凤舞盒(豪)","菩提禅音净尘标准":"白菩提盒(标)","菩提禅音净尘豪华":"白菩提盒(豪)","菩提禅音素妆标准":"粉菩提盒(标)","菩提禅音素妆豪华":"粉菩提盒(豪)","菩提禅音华月标准":"黄菩提盒(标)","菩提禅音华月豪华":"黄菩提盒(豪)","菩提禅音霜镜标准":"蓝菩提盒(标)","菩提禅音霜镜豪华":"蓝菩提盒(豪)","琼枝金鹊月出标准":"金琼枝盒(标)","琼枝金鹊月出豪华":"金琼枝盒(豪)","琼枝金鹊清影标准":"绿琼枝盒(标)","琼枝金鹊清影豪华":"绿琼枝盒(豪)","琼枝金鹊聆风标准":"白琼枝盒(标)","琼枝金鹊聆风豪华":"白琼枝盒(豪)","琼枝金鹊红妆标准":"红琼枝盒(标)","琼枝金鹊红妆豪华":"红琼枝盒(豪)","游园惊梦醉软标准":"蓝游园盒(标)","游园惊梦脂雨标准":"紫游园盒(标)","游园惊梦沉烟标准":"绿游园盒(标)","游园惊梦暮卷标准":"红游园盒(标)","游园惊梦袅晴标准":"粉游园盒(标)","游园惊梦韶光标准":"白游园盒(标)","游园惊梦醉软豪华":"蓝游园盒(豪)","游园惊梦脂雨豪华":"紫游园盒(豪)","游园惊梦沉烟豪华":"绿游园盒(豪)","游园惊梦暮卷豪华":"红游园盒(豪)","游园惊梦袅晴豪华":"粉游园盒(豪)","游园惊梦韶光豪华":"白游园盒(豪)","鉴松影质明标准":"松影质明盒(标)","鉴松影日昃标准":"松影日昃盒(标)","鉴松影三更标准":"松影三更盒(标)","鉴松影隅中标准":"松影隅中盒(标)","鉴松影质明豪华":"松影质明盒(豪)","鉴松影日昃豪华":"松影日昃盒(豪)","鉴松影三更豪华":"松影三更盒(豪)","鉴松影隅中豪华":"松影隅中盒(豪)","海岛冰轮孤光标准":"海岛孤光盒(标)","海岛冰轮悬金标准":"海岛悬金盒(标)","海岛冰轮流霜标准":"海岛流霜盒(标)","海岛冰轮斩月标准":"海岛斩月盒(标)","海岛冰轮孤光豪华":"海岛孤光盒(豪)","海岛冰轮悬金豪华":"海岛悬金盒(豪)","海岛冰轮流霜豪华":"海岛流霜盒(豪)","海岛冰轮斩月豪华":"海岛斩月盒(豪)","竹影清风梢光标准":"竹影梢光盒(标)","竹影清风梦境标准":"竹影梦境盒(标)","竹影清风墨花标准":"竹影墨花盒(标)","竹影清风紫茸标准":"竹影紫茸盒(标)","竹影清风梢光豪华":"竹影梢光盒(豪)","竹影清风梦境豪华":"竹影梦境盒(豪)","竹影清风墨花豪华":"竹影墨花盒(豪)","竹影清风紫茸豪华":"竹影紫茸盒(豪)","竹影清风火莲豪华":"竹影火莲盒(豪)","揽诸素纨标准":"揽诸素纨盒(标)","揽诸玄鞘标准":"揽诸玄鞘盒(标)","揽诸青矢标准":"揽诸青矢盒(标)","揽诸赤旖标准":"揽诸赤旖盒(标)","揽诸素纨豪华":"揽诸素纨盒(豪)","揽诸玄鞘豪华":"揽诸玄鞘盒(豪)","揽诸青矢豪华":"揽诸青矢盒(豪)","揽诸赤旖豪华":"揽诸赤旖盒(豪)","人间情重红豆标准":"红人间盒(标)","人间情重红豆豪华":"红人间盒(豪)","人间情重恺悌标准":"黑人间盒(标)","人间情重恺悌豪华":"黑人间盒(豪)","人间情重长思标准":"绿人间盒(标)","人间情重长思豪华":"绿人间盒(豪)","人间情重纯瑛标准":"紫人间盒(标)","人间情重纯瑛豪华":"紫人间盒(豪)","人间情重秋芳标准":"黄人间盒(标)","人间情重秋芳豪华":"黄人间盒(豪)","雨山前青灯标准":"青雨山盒(标)","雨山前玉枕标准":"白雨山盒(标)","雨山前离枝标准":"红雨山盒(标)","雨山前若木标准":"紫雨山盒(标)","雨山前青灯豪华":"青雨山盒(豪)","回首妖眸芒灵标准":"金白妖龙盒(标)","雨山前玉枕豪华":"白雨山盒(豪)","回首妖眸狐鸣标准":"红白妖龙盒(标)","雨山前离枝豪华":"红雨山盒(豪)","回首妖眸轮回标准":"红黑妖龙盒(标)","雨山前若木豪华":"紫雨山盒(豪)","回首妖眸永生标准":"棕黑妖龙盒(标)","竹露响暮云标准":"竹露响暮云(标)","回首妖眸芒灵豪华":"金白妖龙盒(豪)","竹露响霜色标准":"竹露响霜色(标)","回首妖眸狐鸣豪华":"红白妖龙盒(豪)","竹露响紫檀标准":"竹露响紫檀(标)","回首妖眸轮回豪华":"红黑妖龙盒(豪)","竹露响黄栌标准":"竹露响黄栌(标)","回首妖眸永生豪华":"棕黑妖龙盒(豪)","竹露响丹砂标准":"竹露响丹砂(标)","竹露响暮云豪华":"竹露响暮云(豪)","竹露响霜色豪华":"竹露响霜色(豪)","竹露响紫檀豪华":"竹露响紫檀(豪)","竹露响黄栌豪华":"竹露响黄栌(豪)","竹露响丹砂豪华":"竹露响丹砂(豪)","幽昙月影苍韵豪华":"绿幽昙(豪)","幽昙月影初晨豪华":"金幽昙(豪)","一点沧洲潋滟标准":"蓝沧州盒(标)","幽昙月影墨染豪华":"黑幽昙(豪)","一点沧洲绯光标准":"粉沧州盒(标)","幽昙月影阑珊豪华":"红幽昙(豪)","一点沧洲白沙标准":"紫沧州盒(标)","幽昙月影琼玉豪华":"白幽昙(豪)","一点沧洲长夜标准":"黑沧州盒(标)","幽昙月影苍韵标准":"绿幽昙(标)","一点沧洲薄暮标准":"黄沧州盒(标)","幽昙月影初晨标准":"金幽昙(标)","一点沧洲潋滟豪华":"蓝沧州盒(豪)","幽昙月影墨染标准":"黑幽昙(标)","一点沧洲绯光豪华":"粉沧州盒(豪)","幽昙月影阑珊标准":"红幽昙(标)","一点沧洲白沙豪华":"紫沧州盒(豪)","幽昙月影琼玉标准":"白幽昙(标)","一点沧洲长夜豪华":"黑沧州盒(豪)","爻月祭霜豪华":"白爻月祭(豪)","一点沧洲薄暮豪华":"黄沧州盒(豪)","爻月祭玄豪华":"黑爻月祭(豪)","爻月祭苍豪华":"灰爻月祭(豪)","爻月祭霜标准":"白爻月祭(标)","爻月祭玄标准":"黑爻月祭(标)","持君令绶紫豪华":"紫持君令(豪)","爻月祭苍标准":"灰爻月祭(标)","持君令华玉豪华":"白持君令(豪)","滇林雨幽境豪华":"黑傣族盒(豪)","持君令纡朱豪华":"红持君令(豪)","滇林雨祈愿豪华":"黄傣族盒(豪)","持君令印金豪华":"金持君令(豪)","滇林雨寻意豪华":"绿傣族盒(豪)","持君令绶紫标准":"紫持君令(标)","滇林雨知南豪华":"蓝傣族盒(豪)","持君令华玉标准":"白持君令(标)","滇林雨幽境标准":"黑傣族盒(标)","持君令纡朱标准":"红持君令(标)","滇林雨祈愿标准":"黄傣族盒(标)","持君令印金标准":"金持君令(标)","滇林雨寻意标准":"绿傣族盒(标)","滇林雨知南标准":"蓝傣族盒(标)","爻月祭素标准":"绿爻月祭(标)","爻月祭素豪华":"绿爻月祭(豪)","滇林雨森象标准":"白傣族盒(标)","椿山漫把酒标准":"红椿山盒(标)","椿山漫故人标准":"黑椿山盒(标)","幽馥引莹豪华":"白幽馥(豪)","椿山漫江南标准":"紫椿山盒(标)","幽馥引妍豪华":"紫幽馥(豪)","幽馥引绛豪华":"红幽馥(豪)","椿山漫重逢标准":"蓝椿山盒(标)","幽馥引玄豪华":"黑幽馥(豪)","椿山漫把酒豪华":"红椿山盒(豪)","幽馥引芽豪华":"蓝幽馥(豪)","椿山漫故人豪华":"黑椿山盒(豪)","幽馥引莹标准":"白幽馥(标)","椿山漫江南豪华":"紫椿山盒(豪)","幽馥引妍标准":"紫幽馥(标)","椿山漫重逢豪华":"蓝椿山盒(豪)","幽馥引绛标准":"红幽馥(标)","幽馥引玄标准":"黑幽馥(标)","幽馥引芽标准":"蓝幽馥(标)","龙隐织梦豪华":"白龙隐(豪)","龙隐浩渺豪华":"绿龙隐(豪)","龙隐潜夜豪华":"黑龙隐(豪)","龙隐落霜豪华":"蓝龙隐(豪)","龙隐星月豪华":"紫龙隐(豪)","龙隐织梦标准":"白龙隐(标)","龙隐浩渺标准":"绿龙隐(标)","龙隐潜夜标准":"黑龙隐(标)","龙隐落霜标准":"蓝龙隐(标)","龙隐星月标准":"紫龙隐(标)","吉祥颂泽福标准":"红吉祥盒(标)","吉祥颂可宝标准":"蓝吉祥盒(标)","吉祥颂天恩标准":"紫吉祥盒(标)","吉祥颂恒长标准":"绿吉祥盒(标)","吉祥颂泽福豪华":"红吉祥盒(豪)","吉祥颂可宝豪华":"蓝吉祥盒(豪)","吉祥颂天恩豪华":"紫吉祥盒(豪)","吉祥颂恒长豪华":"绿吉祥盒(豪)","十五夜观灯锦砌标准":"紫观灯盒(标)","十五夜观灯封霜标准":"白观灯盒(标)","十五夜观灯绮歌标准":"红观灯盒(标)","十五夜观灯落梅标准":"黄观灯盒(标)","十五夜观灯南涧标准":"蓝观灯盒(标)","十五夜观灯锦砌豪华":"紫观灯盒(豪)","十五夜观灯封霜豪华":"白观灯盒(豪)","十五夜观灯绮歌豪华":"红观灯盒(豪)","十五夜观灯落梅豪华":"黄观灯盒(豪)","十五夜观灯南涧豪华":"蓝观灯盒(豪)","鹭汐辞雾晖标准":"白鹭汐辞标准","鹭汐辞雾晖笠标准":"白鹭汐辞笠标准","鹭汐辞轻霭标准":"蓝鹭汐辞标准","鹭汐辞轻霭笠标准":"蓝鹭汐辞笠标准","鹭汐辞谲云标准":"粉鹭汐辞标准","鹭汐辞谲云笠标准":"粉鹭汐辞笠标准","鹭汐辞逐影标准":"黑鹭汐辞标准","鹭汐辞逐影笠标准":"黑鹭汐辞笠标准","鹭汐辞雾晖笠豪华":"白鹭汐辞笠豪华","鹭汐辞雾晖豪华":"白鹭汐辞豪华","鹭汐辞谲云笠豪华":"粉鹭汐辞笠豪华","鹭汐辞谲云豪华":"粉鹭汐辞豪华","鹭汐辞轻霭笠豪华":"蓝鹭汐辞笠豪华","鹭汐辞轻霭豪华":"蓝鹭汐辞豪华","鹭汐辞逐影笠豪华":"黑鹭汐辞笠豪华","鹭汐辞逐影豪华":"黑鹭汐辞豪华","回首妖眸礼盒标准":"标准妖眸礼盒","回首妖眸礼盒豪华":"豪华妖眸礼盒","宴天宫礼盒":"狮盒子","宴清嘉和礼盒":"五代重阳盒子","幽桃落香礼盒":"幽桃落香盒子","归梦长礼盒":"琵琶盒子","忘川旧梦礼盒":"忘川盒","揽诸礼盒标准":"揽诸盒子标准版","揽诸礼盒豪华":"懒猪盒子豪华版","曲塘流风礼盒":"曲塘盒","望舒撩月礼盒":"五中盒","此间清风礼盒":"异域盒子","海岛冰轮礼盒标准":"海岛冰轮盒子标准版","海岛冰轮礼盒豪华":"海岛冰轮盒子豪华版","清光彩璨礼盒":"钻石盒","游园惊梦礼盒标准":"游园惊梦标准版","游园惊梦礼盒豪华":"游园惊梦豪华版","玄玉绮光礼盒":"雪人盒子","琼枝金鹊礼盒标准":"标准琼枝金鹊","琼枝金鹊礼盒豪华":"豪华琼枝金鹊","璧辉影沉礼盒":"七中盒子","红尘归客礼盒":"四元盒子","翩云破月礼盒":"翩云盒","花醉良辰礼盒":"六七盒子","菩提禅音礼盒":"菩提盒子","解星织羽礼盒":"四代重阳盒子","吉祥颂礼盒标准":"标准吉祥颂礼盒","吉祥颂礼盒豪华":"豪华吉祥颂礼盒","千秋岁皎灵素媚":"狐狸毛","山河颂六翼流苏":"六翼","定风波君子如龙":"一代黄","定风波黑枭散羽":"一代黑","定风波烽火连城":"一代红","定风波苍穹之握":"一代白","定风波白虹惊天":"一代粉","定风波离魄幽梦":"一代紫","留春令祚白翎":"二代白","留春令越沧溟":"二代紫","留春令千樱乱":"二代粉","留春令绛纱蕴":"二代红","留春令云叠浪":"二代蓝","留春令栽火莲":"二代黑","夏初临霏雨延泽":"三代蓝","夏初临一步银华":"三代粉","夏初临肆翼漆纱":"幺蛾子","夏初临枭皇浴火":"三代黑","夏初临深宵余梦":"三代银黑","夏初临凰尾白绫":"三代黄","山河颂周公御龙":"周公御龙","山河颂云莲素荷":"荷花","山河颂金池观鱼":"金鱼","山河颂剑意白虹":"特效粉","山河颂青翎翠羽":"孔雀披风","千秋岁琼御孤鸾":"树杈","千秋岁天火流丹":"喵罗干","千秋岁暗夜星辰":"暗夜","千秋岁天辉抱月":"天辉","千秋岁钰瓣千华":"钰瓣","梅雪馨浮刃飒沓":"浮刃","梅雪馨暮紫须臾":"毒罗干","梅雪馨河汉飞星":"河汉","梅雪馨红菱相忆":"红尖叫","梅雪馨鸿度几何":"喷火龙","梅雪馨凤翎鸣冬":"长歌干","高唐云梦锋芒傲骨":"狼头","高唐云梦兰陵幽思":"燕子","高唐云梦青霄北斗":"羽毛","高唐云梦秋渚夜雨":"黑白荷花","高唐云梦桃源春晓":"画卷","高唐云梦落英解语":"粉牡丹","宿世明光皇穷绝封":"黑笋干","宿世明光血凰流火":"火鸡毛","宿世明光月华织光":"白莲花","宿世明光莹扇轻罗":"蓝扇子","宿世明光血色惊鸿":"红酒瓶","宿世明光紫烟薄云":"紫荷花","金风玉露山樱语":"山樱语","金风玉露鹤梳翎":"仙鹤干","金风玉露晴云紫氛":"小蝴蝶","金风玉露素玉鸾翔":"素玉","金风玉露澹烟生":"星空","金风玉露青青子衿":"绿白菜披风","万态皆寐黄龙乘云":"龙头","万态皆寐栩栩蝶翼":"大蝴蝶","万态皆寐丛云凋雪":"炸毛","万态皆寐丛云真意":"顺毛","万态皆寐重缦轻罗":"紫蕨菜","万态皆寐鎏金火凰":"红凤凰","大千高华玉树琼葩":"玉树","大千高华云汉月痕":"蓝月亮","大千高华易水寒":"海浪","大千高华蝶偶嬉尘":"兔子","大千高华紫霄凤翎":"紫凤凰","大千高华迷星黯渊":"迷星黯渊","琼树玉堂化翼归":"化翼归","琼树玉堂枝妆曲":"枝妆曲","琼树玉堂九重冥":"九重冥","琼树玉堂几度春":"几度春","琼树玉堂雨流泉":"雨流泉","琼树玉堂明如雪":"明如雪","沉醉东风玲珑意":"玲珑意","沉醉东风透碧宵":"透碧宵","沉醉东风千风羽":"千风羽","沉醉东风飞凰乐":"飞凰乐","沉醉东风业火劫":"业火劫","沉醉东风琼芳引":"琼芳引","烟雨笙歌庭棠疏帘":"庭棠疏帘","烟雨笙歌征鸿点苍":"征鸿点苍","烟雨笙歌天玄御影":"八周黑","烟雨笙歌汉宫飞鸾":"汉宫飞鸾","烟雨笙歌沧海飞尘":"八周年孔雀","烟雨笙歌古亭镜花":"古亭镜花","山河入画侧帽风流":"黄山河","山河入画点墨凝湘":"白山河","山河入画星河云梦":"新星空","山河入画灼灼桃夭":"粉山河","山河入画玄墨焰凰":"黑山河","山河入画丹枫翊麾":"枫叶","锦堂画春千家烟雨":"千家烟雨","锦堂画春九天玄影":"九天玄影","锦堂画春瑞鹤仙羽":"瑞鹤仙羽","锦堂画春烟雨岚山":"烟雨岚山","锦堂画春鸾歌凤舞":"鸾歌凤舞","锦堂画春云破月开":"云破月开","杯酒疏风松鹤如谦":"黑狄仁杰","杯酒疏风玉棠云盏":"白狄仁杰","鲤庭授道御殿樱":"粉鲤鱼","鲤庭授道九纹龙":"黑鲤鱼","鲤庭授道绯秋翠":"绿鲤鱼","夜烬无声":"黑狐裘","玉振天音":"白狐裘","九日流澜执墨":"流岚黑披风","九日流澜流岚":"流岚白披风","璨粹华雀浅情":"华雀粉披风","璨粹华雀晚风":"华雀蓝披风","北望关山":"双十二黑披风","霜花无香":"双十二白披风","翩梦相逢岚萦":"蓝蝶梦披风","翩梦相逢衾香":"粉蝶梦披风","云棠叠梦遮月":"蓝云棠披风","云棠叠梦岁风":"紫云棠披风","霜落轻裘披风":"灵狐披风","仲夏回廊":"仲夏披风","浮蕊袭香":"紫蝴蝶披风","绮梦映玉":"白婚纱披风","绮梦阑夕":"黑婚纱披风","盘龙凤舞披风":"红盒子披风","九阙天影披风":"黑盒子披风","云锦梦华披风":"蓝盒子披风","鹤影天青披风":"青盒子披风","天穹掠影披风":"唐盒子披风","北望天狼披风":"白盒子披风","澜云意披风":"二代中秋披风","陌上窈窕披风":"粉盒子披风","染墨千秋披风":"花盒子披风","剑歌惊月披风":"叽盒子披风","浮屠明音披风":"秃盒子披风","碧翎叠云披风":"歌盒子披风","碧海云仙披风":"蓬莱盒子披风","云中雪霁披风":"猪盒子披风","日月无心披风":"喵盒子披风","霜岱应元披风":"刀盒子披风","虞渊引梦披风":"毒盒子披风","斩夜无常披风":"雪盒子披风","浮世兰舟兮故披风":"粉鼠盒子披风","浮世兰舟疏衍披风":"蓝鼠盒子披风","歃血关山披风":"苍盒子披风","短褐狂裘披风":"丐盒子披风","云岚叠岫披风":"云岚盒披风","迷金繁影披风":"迷金盒披风","广漠听星披风":"星演披风","尘间清欢披风":"牛盒披风","霁月雪青披风":"二代花盒披风","青池泠月披风":"新青盒子披风","绿野迷仙披风":"药盒披风","琼羽飞鸿披风":"虎盒披风","蝶梦终霄披风":"二代毒盒披风","风刀逐浪披风":"刀宗盒披风","一念莲华披风":"莲华盒披风","云旌望捷披风":"云旌盒披风","伴灵引羽披风":"弓盒披风","云瑞腾龙披风":"龙盒披风","九日流澜礼盒":"九日流澜","翩梦相逢礼盒":"蝴蝶披风盒子","绮梦礼盒":"绮梦披风礼盒","青霄浩气披风":"战服浩气","赤羽逍遥披风":"战服恶人","流岚玉心礼盒":"流岚玉心眼饰盒","玄思金边镜":"金眼镜","太初银丝镜":"银眼镜","秋意金韵镜":"金秋镜","暮烟蝶魂镜":"蓝蝶镜","琼骨玉心镜":"琼骨镜","流岚飞莹镜":"流岚镜","轻绒爪扑雪左":"粉猫爪左","轻绒爪漆夜左":"黑猫爪左","轻绒爪点墨左":"白猫爪左","轻绒爪飞尘左":"黄猫爪左","震鳞潜沉月左":"白鲨手左","震鳞潜荒夜左":"黑鲨手左","震鳞潜金乌左":"金鲨手左","重绒锦素夜左":"熊猫手左","重绒锦橙风左":"娇虎左手","轻绒爪扑雪右":"粉猫爪右","轻绒爪漆夜右":"黑猫爪右","轻绒爪点墨右":"白猫爪右","轻绒爪飞尘右":"黄猫爪右","震鳞潜沉月右":"白鲨手右","震鳞潜荒夜右":"黑鲨手右","震鳞潜金乌右":"金鲨手右","重绒锦素夜右":"熊猫手右","重绒锦橙风右":"娇虎右手","九阙天影左":"黑盒左肩","云中雪霁左":"猪盒左肩","云岚叠岫左":"二代粉盒左肩","云锦梦华左":"蓝盒左肩","剑歌惊月左":"叽盒左肩","北望天狼左":"白盒左肩","天穹掠影左":"唐盒左肩","斩夜无常左":"雪盒左肩","日月无心左":"喵盒左肩","染墨千秋左":"花盒左肩","歃血关山左":"苍盒左肩","浮世兰舟兮故左":"粉鼠盒左肩","浮世兰舟疏衍左":"蓝鼠盒左肩","浮屠明音左":"秃盒左肩","澜云意左":"二代中秋左肩","盘龙凤舞左":"红盒左肩","短褐狂裘左":"丐盒左肩","碧海云仙左":"蓬莱盒左肩","碧翎叠云左":"歌盒左肩","虞渊引梦左":"毒盒左肩","陌上窈窕左":"粉盒左肩","霜岱应元左":"貂盒左肩","鹤影天青左":"青盒左肩","迷金繁影左":"迷金盒左肩","广漠听星左":"灯盒左肩","尘间清欢左":"牛盒左肩","霁月雪青左":"二代花盒左肩","青池泠月左":"新青盒左肩","绿野迷仙左":"药盒左肩","琼羽飞鸿左":"虎盒左肩","觅花踪碧空左":"蓝蝴蝶左肩","觅花踪秋帐左":"粉蝴蝶左肩","觅花踪黄云左":"黄蝴蝶左肩","蝶梦终霄左":"二代毒盒左肩","风刀逐浪左":"刀宗盒左肩","霜落轻裘左":"灵狐盒左肩","海升霞蔚紫极左":"紫水母左肩","海升霞蔚霁景左":"蓝水母左肩","海升霞蔚飞露左":"白水母左肩","一念莲华左":"莲华盒左","漱玉寒火绸左":"火冰晶左肩","漱玉寒紫殿左":"紫冰晶左肩","漱玉寒冰青左":"白冰晶左肩","云旌望捷左":"云旌盒左肩","伴灵引羽左":"弓盒左肩","云瑞腾龙左":"龙盒左肩","九阙天影右":"黑盒右肩","云中雪霁右":"猪盒右肩","云岚叠岫右":"二代粉盒右肩","云锦梦华右":"蓝盒右肩","剑歌惊月右":"叽盒右肩","北望天狼右":"白盒右肩","天穹掠影右":"唐盒右肩","斩夜无常右":"雪盒右肩","日月无心右":"喵盒右肩","染墨千秋右":"花盒右肩","歃血关山右":"苍盒右肩","浮世兰舟兮故右":"粉鼠盒右肩","浮世兰舟疏衍右":"蓝鼠盒右肩","浮屠明音右":"秃盒右肩","盘龙凤舞右":"红盒右肩","短褐狂裘右":"丐盒右肩","碧海云仙右":"蓬莱盒右肩","碧翎叠云右":"歌盒右肩","虞渊引梦右":"毒盒右肩","陌上窈窕右":"粉盒右肩","霜岱应元右":"貂盒右肩","鹤影天青右":"青盒右肩","迷金繁影右":"迷金盒右肩","广漠听星右":"灯盒右肩","尘间清欢右":"牛盒右肩","霁月雪青右":"二代花盒右肩","青池泠月右":"新青盒右肩","绿野迷仙右":"药盒右肩","琼羽飞鸿右":"虎盒右肩","觅花踪碧空右":"蓝蝴蝶右肩","觅花踪秋帐右":"粉蝴蝶右肩","觅花踪黄云右":"黄蝴蝶右肩","蝶梦终霄右":"二代毒盒右肩","风刀逐浪右":"刀宗盒右肩","霜落轻裘右":"灵狐盒右肩","海升霞蔚紫极右":"紫水母右肩","海升霞蔚霁景右":"蓝水母右肩","海升霞蔚飞露右":"白水母右肩","一念莲华右":"莲华盒右","漱玉寒火绸右":"火冰晶右肩","漱玉寒紫殿右":"紫冰晶右肩","漱玉寒冰青右":"白冰晶右肩","云旌望捷右":"云旌盒右肩","伴灵引羽右":"弓盒右肩","云瑞腾龙右":"龙盒右肩","漱玉寒冰青礼盒":"白冰晶肩饰","漱玉寒火绸礼盒":"红冰晶肩饰","漱玉寒紫殿礼盒":"紫冰晶肩饰","觅花踪碧空礼盒":"蓝蝴蝶肩饰","觅花踪秋帐礼盒":"粉蝴蝶肩饰","觅花踪黄云礼盒":"黄蝴蝶肩饰","百灵礼盒":"百灵尾巴盒子","弦歌落曲":"梨园面具","珠玉拂帘":"珠帘面挂","晓月笼纱":"紫纱面挂","如意金箍":"金箍","鬼域返魂":"返魂","鬼域怀梦":"怀梦","鬼域扶桑":"扶桑","霜角悬月":"白面具","鹿鸣野渡":"黑面具","玉兔假面":"玉兔面具","火兔假面":"火兔面具","慢羊羊白胡子":"慢羊羊","捧玉团":"兔兔面具","灵龙万方凝阙":"红龙角","灵龙万方垂光":"紫龙角","织云镜屏":"白流光面挂","织云浮暮":"黑流光面挂","疏影寒墨":"黑绷带眼罩","轻雾沐羽":"灵羽面挂","缠梦飞仙白练":"白练眼罩","缠梦飞仙夜织":"夜织眼罩","大光相":"大光相面挂","梦回小楼":"青霄盒挂件","蜀中百变重葛":"喷火小熊猫","寻珍味虎仔":"白虎仔","抛玉燕":"毽子","舞云飞":"曲云伞","韶华春秋燕歌行":"燕歌行","凤引金琯":"二代重阳笛子","鹤影天青水云寂":"青盒子伞","幽兰韵":"618挂件","凰舞凤歌曦光":"白楼兰伞","凰舞凤歌沉夜":"黑楼兰伞","弈局弈思":"棋盘","蛮蛮":"五七盒挂件","仲秋之夜花彤":"仲秋花彤","仲秋之夜凉空":"仲秋凉空","仲秋之夜韶秀":"仲秋韶秀","仲秋之夜魏花":"仲秋魏花","芳枝绘卷思澄":"红曲塘挂件","芳枝绘卷清蔚":"蓝曲塘挂件","金盏琉璃灯玉壶":"唐风玉壶挂件","金盏琉璃灯韶颜":"唐风韶颜挂件","缠丝分水刺晖照":"黑红尘挂件","缠丝分水刺霜烟":"白红尘挂件","万品龙烛妙岩":"黑狮烟斗","万品龙烛彤华":"白狮烟斗","映鳞波":"小金龙挂件","柯亭笛":"竹笛背挂","雪团团":"小熊挂件","闲摇羽扇":"孔雀挂件","云屏红烛凤卜":"红六七挂件","云屏红烛鸾俦":"白六七挂件","长生梦":"芙蓉挂件","秋晖繁英":"六代中秋挂件","桂枝":"二胡挂件","竹驳金筹闻溪":"五代绿重阳挂件","竹驳金筹长慕":"五代黄重阳挂件","竹驳金筹浅绮":"五代紫重阳挂件","清波衔河流影":"绿水袖挂件","清波衔河照粼":"蓝水袖挂件","明月霜夜歌":"蓝琵琶挂件","明月霜朝弦":"红琵琶挂件","垂云晚风":"蝴蝶挂件","岁时浓":"红梅挂件","我武惟扬":"花滑挂件","朝暮潜怀":"白忘川挂件","朝暮前尘":"蓝忘川挂件","朝暮三生":"粉忘川挂件","朝暮牵念":"紫忘川挂件","叙梦":"古琴挂件","苍青灵引":"星辰挂件","懒羊羊的雪糕棒":"雪糕棒","红太狼的平底锅":"平底锅","鸾凤引":"箜篌挂件","愿景在壶":"山神挂件","霜风云隐秋霁":"一代重阳黑伞","醉枝归":"七七挂件","烟霞结芳":"曲江游挂件","题闲愁桂序":"七中黄盒挂件","题闲愁泫露":"七中白盒挂件","若水清江":"绣球盒挂件","一汪春":"雏菊挂件","镜花白虹":"弓盒挂件","融融一冬鸣景":"红玄玉挂件","融融一冬斯若":"白玄玉挂件","绒玉团":"除夕挂件","鲸歌幻梦琉华":"蓝钻石盒挂件","鲸歌幻梦珠夜":"粉钻石盒挂件","龙泉":"不良人盒挂件","梨花入月":"踏青挂件","蓝芽兔":"灵龙盒子背挂","侧耳倾听":"圆舞盒挂件","踏莲台":"拈花盒子挂件","连枝飞露":"八七盒挂件","徊灵风清":"黑八中背挂","徊灵风墀":"黑八中背挂","十方幻音":"六代重阳挂件","幽梦仙子":"青山盒背挂","日月相推":"天星盒挂件","眠眠熊":"红香盒背挂熊","飞龙引":"游龙盒背挂","不解缘":"婚纱盒背挂","漠飞音晴鸣":"原色鹿挂件","漠飞音晓澈":"粉鹿挂件","大侠包子铺":"神龙挂件","幻星筒":"灵紫盒背挂","闲弄阮":"妙乐盒背挂","如意壶":"龙吟盒子背挂","玉净瓶":"莲台盒背挂","绮如红瑰":"玫瑰挂件","兔团团":"兔尾","狼绒绒":"狼尾","鹤影天青碧宵羽":"青盒子折扇","鹤影天青瑶池月":"青盒子团扇","贯白虹烛影":"红刀","贯白虹古道":"白刀","贯白虹千重":"蓝刀","谁客京华缃影":"黑明光挂件","谁客京华绛痕":"白明光挂件","逐山海":"竹笛腰挂","驭海":"鲸鱼尾巴","簇浪":"鲨鱼尾巴","素心":"不良人腰挂","百灵狐九尾":"狐九尾腰挂","百灵兔月茸":"兔月茸腰挂","百灵吼玉轮":"吼玉轮腰挂","百灵驰如电":"驰如电腰挂","灵龙万方礼盒":"龙角盒子","织云礼盒":"流光面挂盒","喵呜绒团礼盒":"虹猫蓝兔盒","狐兔奇缘礼盒":"狐兔耳朵盒子","画乌犍礼盒":"画乌犍","苗疆发冠礼盒":"苗疆帽子","遥海趣礼盒":"遥海趣","青青无忧礼盒":"喜羊羊帽子","鸣野食苹礼盒":"鹿角帽子","神通变换礼盒":"非人哉帽盒子","悠悠童心礼盒":"喜羊羊尾巴","忘川旧梦牵念帽":"紫忘川帽","暮光逾明墀帽":"黑暮光帽","暮光逾明清帽":"白八中帽","特舟雨眠帽":"花朝黑帽","稚梦童欢狼帽":"狼盒帽","稚梦童欢羊帽":"羊盒帽","菩提禅音素妆帽":"粉菩提帽","蓝兔霜颜":"蓝兔盒帽","虹猫流焰":"虹猫盒帽","舟雨眠江行帽":"花朝绿帽","舟雨眠暮霭帽":"花朝白帽","舟雨眠疏霖帽":"花朝粉帽","舟雨眠烟渺帽":"花朝黄帽","远行客古道帽":"白斗笠","远行客千重帽":"蓝斗笠","远行客烛影帽":"红斗笠","谪仙远怀帽":"黑谪仙帽","谪仙英菲帽":"绿谪仙帽","谪仙明江帽":"白金谪仙帽","谪仙情思帽":"蓝谪仙帽","菩提禅音净尘帽":"白菩提帽","菩提禅音华月帽":"黄菩提帽","菩提禅音霜镜帽":"蓝菩提帽","忘川旧梦潜怀帽":"白忘川帽","忘川旧梦前尘帽":"蓝忘川帽","忘川旧梦三生帽":"粉忘川帽","绮梦之章帽":"绮梦帽","鹭汐辞雾晖帽":"白鹭汐辞帽","鹭汐辞轻霭帽":"蓝鹭汐辞帽","鹭汐辞谲云帽":"粉鹭汐辞帽","鹭汐辞逐影帽":"黑鹭汐辞帽","熊小猫":"熊小猫帽","猫小熊":"猫小熊帽","粉兔繁云蕊色":"粉兔帽子","莎丽紫玉烟岚":"莎丽紫帽","蓝兔霜润冰清":"蓝兔冰帽","虹猫长虹击浪":"虹猫红帽","西宫胃宿":"大圣须须","逗逗阑风长雨":"逗逗绿帽","食苹":"银鹿角","鸣野":"金鹿角","绮梦冠":"婚纱皇冠","狐之聪瑞雪":"白狐耳","狐之聪墨客":"黑狐耳","兔之巧百伶":"兔耳","狐之聪瑞雪小":"小白狐耳","狐之聪墨客小":"小黑狐耳","兔之巧百伶小":"小兔耳","神通变换九尾狐":"九尾狐帽","神通变换白龙":"白龙帽","神通变换玉兔":"玉兔帽","像韵一星如月":"土红头像","像韵凌霄踏云":"踏云头像","像韵华璨":"凤金头像","像韵向朝晖":"十四红头像","像韵时光无竞":"精灵金头像","像韵清露吟蝶":"露金吟蝶","像韵游园惊梦":"游园头像","像韵溪雨濯虹":"虹猫头像","像韵玉冰飞韵":"像韵蓝兔","像韵琉璃幻":"海金头像","像韵稚梦童欢狼":"狼头像","像韵稚梦童欢羊":"羊头像","像韵蔷薇星夜":"蔷薇头像","像韵酒御东风":"卿酒头像","像韵龙吟伏光":"苍云金头像","像韵京华梦":"龙红头像","像韵绮梦之章":"婚纱头像","像韵龙章凤姿":"龙金头像","像韵海阔天空":"像韵海阔","像韵坠虚欢":"三代灰头像","像韵龙吟四海":"龙吟盒头像","像韵莲台清咏":"莲台盒头像","九尾狐意洋洋":"小九尾头像","凌虹像韵谱":"四代头像","大衍之韵礼盒":"二代头像","战捷像韵谱":"三代头象","许君折桂礼盒":"一代头像","寰锋游羽":"刀宗脚印","引锐流虹":"灵羽脚印","月凝":"玫瑰脚印","欧":"欧气脚印","五湖四海书":"四代脚印","山海异兽册":"三代脚印","执定六合书":"六代脚印","纵横六合书":"五代脚印","逍遥江湖册":"二代脚印","闻名天下书":"一代脚印","挂宠滚滚":"滚滚","挂宠飞鼠礼盒":"飞鼠挂宠","挂宠辰昊":"大雕","挂宠团团":"团团","挂宠肉肉":"肉肉","挂宠闹闹":"闹闹","挂宠丸子":"丸子","挂宠萌萌":"萌萌","挂宠橘胖":"橘胖","挂宠弦月":"灰兔","挂宠琉云":"胡萝卜兔","挂宠雪絮":"白兔","挂宠舞铃":"小熊猫舞铃","挂宠执夷":"小熊猫执夷","挂宠斩浪":"小熊猫斩浪","玄凤鹦歌":"玄凤","雪凤杰克":"雪凤","黑凤护国":"黑凤","挂宠小冰酪":"白豹","挂宠小洪炉":"灰豹","挂宠绥绥":"红狐","挂宠容华":"黄狐","挂宠亭亭":"白狐","挂宠小酥山":"黑豹","挂宠小黑猫":"挂宠小黑喵","挂宠豆丁":"灰龙猫","挂宠汤圆":"白龙猫","挂宠芝麻":"黑龙猫","挂宠金系":"金猴","挂宠岳山":"黑猴","挂宠瑞云":"白猴","挂宠糖饼子":"糖饼子","挂宠枫火儿":"枫火儿","挂宠小书呆":"小书呆","挂宠玉腰奴":"白松鼠","挂宠糖栗子":"棕松鼠","挂宠开心果":"黑松鼠","挂宠智多星":"灰猫头鹰","挂宠锦书生":"白猫头鹰","挂宠小夫子":"黄猫头鹰","挂宠绒团团":"浅黄老虎","挂宠宿明明":"深黄老虎","挂宠喵呜呜":"白老虎","挂宠酷鸭":"小黑鸭","挂宠谢鸭":"小黄鸭","挂宠嗨鸭":"小白鸭","挂宠竹萌萌":"竹萌萌","挂宠抱团团":"抱团团","挂宠蓝丫丫":"蓝丫丫","挂宠嘿啾":"文鸟嘿啾","挂宠噗啾":"文鸟噗啾","挂宠圆啾":"文鸟圆啾","挂宠墨颂颂":"墨颂颂","挂宠霜雅雅":"霜雅雅","挂宠浅风风":"浅风风","挂宠苍小龙":"蓝龙","挂宠赤小龙":"红龙","挂宠帝小龙":"粉龙","挂宠小九尾":"九尾狐","幽舞华芳佩囊":"打歌服包","月兔归":"白兔包","杳凝霜":"蓝兔包","步铃吟":"猫包","沐望乡":"狗包","浅花":"花朝佩囊","游澜":"佩囊游澜","疏星冷":"瓜子囊","雪月交晖佩囊":"雪月囊","千蛟影肃云":"肃云","千蛟影翻墨":"翻墨","流徽玄枝":"黑马","红梅悬芳":"红马","天河落星":"小樱马","驰凌轻絮":"雪马","胡玉鎏金":"跃荷马","龙马行空":"白龙马","弦月华璨":"弦月马","乌霆":"帮会黑豹","赤兔飞虹":"劲足赤兔飞虹","赤兔道轻":"劲足赤兔道轻","赤兔衍羽":"劲足赤兔衍羽","赤兔怒风":"劲足赤兔怒风","赤兔骤风":"劲足赤兔骤风","流徽玄枝礼盒":"黑马礼盒","红梅悬芳礼盒":"粉马礼盒","胡玉鎏金礼盒":"跃荷主题马盒","龙马行空礼盒":"白龙马礼盒","弦月华璨礼盒":"弦月马礼盒","红梅悬芳头饰":"红梅马头","红梅悬芳足饰":"红梅马足","红梅悬芳鞍饰":"红梅马鞍","红梅悬芳马饰":"红梅马饰","金羁饰影华灿":"金羁华灿马饰","金羁饰影华灿头饰":"金羁华灿头饰","金羁饰影华灿足饰":"金羁华灿足饰","金羁饰影华灿鞍饰":"金羁华灿鞍饰","金羁饰影桃夭":"金羁桃夭马饰","金羁饰影桃夭头饰":"金羁桃夭头饰","金羁饰影桃夭足饰":"金羁桃夭足饰","金羁饰影桃夭鞍饰":"金羁桃夭鞍饰","金羁饰影湛然":"金羁湛然马饰","金羁饰影湛然头饰":"金羁湛然头饰","金羁饰影湛然足饰":"金羁湛然足饰","金羁饰影湛然鞍饰":"金羁湛然鞍饰","龙马行空头饰":"白龙马头饰","龙马行空足饰":"白龙马足饰","龙马行空鞍饰":"白龙马鞍饰","龙马行空马饰":"白龙马马饰","弦月华璨头饰":"弦月马头饰","弦月华璨足饰":"弦月马足饰","弦月华璨鞍饰":"弦月马鞍饰","弦月华璨马饰":"弦月马饰","宠物箱倾爵":"酒御宠物","宠物箱小天蓬":"西游盒宠物","宠物箱小福":"沧海宠物","宠物箱摘星":"星源跟宠","宠物箱炭球":"踏云宠物","宠物箱破浪":"乘风猪","宠物箱蓝小兔":"宠物蓝小兔","宠物箱虹小猫":"虹猫宠物","宠物箱风风":"乘风鸡仔","宠物箱雪团":"宠物雪团","摹铸图特":"门派武器券","摹铸图珍品":"小橙武券","摹铸图稀世":"大橙武券","摹铸图稀世贰":"120CW拓印","摹铸谱珍品":"普通武器券","凌虹金戈盒":"四代武器","定海归潮礼盒":"一代武器","战捷金戈盒":"三代武器","芙蕖醉影礼盒":"二代武器","封冰金戈盒":"六代武器","群英争衡封冰礼盒":"九届大师赛188礼盒","武林无双封冰礼盒":"九届大师赛376礼盒"}');

  function getWGAliasName(realName) {
    return nameMap[realName.replace(/·|（|）/g, '')] || '';
  }
  function log(...args) {
    if (localStorage.getItem('log')) {
      console.log(...args);
    }
  }
  log('cloth init');

  const style = document.createElement('style');
  const emptyUrl = 'https://jx3wbl.xoyocdn.com/img/bg-empty.13dfbabf.png';
  style.textContent = `
    body {
      --cloth-main-color: #149EA8;
      --cloth-border-color: #69c3ca;
    }
    .cloth-preview-wrapper {
      opacity: 0;
      position: fixed;
      z-index: 999999999;
      transition: all .2s;
      opacity: 0;
      pointer-events: none;
    }
    .cloth-preview-wrapper.show {
      opacity: 1;
      pointer-events: unset;
    }
    .cloth-preview-mask {
      width: 100%;
      height: 100%;
      position: fixed;
      content: '';
      top: 0;
      left: 0;
      background: rgba(0, 0, 0, 0.65);
    }
    .cloth-preview-inner {
      position: fixed;
      top: 50%;
      left: 50%;
      border-radius: 4px;
      transform: translate(-50%, -50%);
      box-shadow: 0 0 8px rgba(0, 0, 0, 0.6);
      background: #fff;
    }
    .cloth-preview-body {
      position: relative;
      background: url(${emptyUrl}) no-repeat;
      background-size: 80% 80%;
      background-position: center bottom;
      padding-top: 30px;
    }
    .dark .cloth-preview-body {
      background: #333;
    }
    .cloth-preview-close {
      position: absolute;
      text-align: center;
      font-size: 40px;
      line-height: 24px;
      right: 14px;
      top: 14px;
      cursor: pointer;
      font-weight: lighter;
      color: var(--cloth-main-color);
    }
    .cloth-preview-header {
      width: 100%;
      font-size: 18px;
      font-weight: bold;
      background: #dceef0;
      text-align: center;
      line-height: 60px;
      border-bottom: 1px solid var(--cloth-border-color);
    }
    .cloth-preview-img {
      width: 128vh;
      height: 72vh;
      max-width: 960px;
      max-height: 540px;
      object-fit: contain;
    }
    .empty .cloth-preview-img {
      opacity: 0;
    }
    .cloth-preview-empty {
      position: absolute;
      top: 50%;
      left: 50%;
      font-size: 24px;
      color: #999;
      transform: translate(-50%, -50%);
      display: none;
    }
    .empty .cloth-preview-empty {
      display: block;
    }
    .cloth-preview-loading {
      color: var(--cloth-main-color);
      position: absolute;
      top: 50%;
      left: 50%;
      display: none;
    }
    .cloth-preview-loading > div {
      color: var(--cloth-main-color);
    }
    .loading .cloth-preview-loading {
      display: block;
    }
    .loading .cloth-preview-img,
    .loading .cloth-preview-empty {
      opacity: 0;
    }
    .cloth-preview-mode {
      position: absolute;
      top: 12px;
      right: 12px;
      display: flex;
      align-items: center;
    }
    .cloth-preview-mode #previewMode {
      --background: var(--cloth-main-color);;
      --background-inner: #fff;
      --left: 0px;
      -webkit-appearance: none;
      -moz-appearance: none;
      width: 42px;
      height: 20px;
      border-radius: 10px;
      outline: none;
      display: inline-block;
      vertical-align: top;
      position: relative;
      margin: 0;
      cursor: pointer;
      background: var(--background);
      transition: background .3s, border-color .3s;
      margin: 0 4px;
    }
    .dark .cloth-preview-mode {
      color: #fff;
    }
    #previewMode:after {
      content: '';
      display: block;
      left: 2px;
      top: 2px;
      border-radius: 50%;
      width: 16px;
      height: 16px;
      position: absolute;
      transition: transform .4s, opacity .2s;
      background: var(--background-inner);
      transform: translateX(var(--left));
    }
    #previewMode:checked {
      --background-inner: #333;
      --left: 22px;
    }
    .cloth-highlight-text {
      color: var(--cloth-main-color);
    }
    img[data-name=*] {
      cursor: pointer;
    }
  `;
  document.body.appendChild(style);

  const isWBLPage = window.location.host.startsWith('jx3.seasunwbl.com');
  const isAIJX3Page = window.location.host.startsWith('www.aijx3.cn');
  const isWBLFollowPage = isWBLPage && window.location.pathname === '/follow';

  function waitConditionReady(condition) {
    return new Promise(resolve => {
      setInterval(() => {
        if (condition()) {
          resolve();
        }
      }, 50);
    })
  }

  // 判断当前名称对应的图片是否存在
  const isImageUrlValid = (imgUrl) => {
    if (!imgUrl.startsWith('http')) {
      imgUrl = `https://dl.pvp.xoyo.com/prod/icons/handbook/image/${imgUrl}-详情-1.png`;
    }
    log(imgUrl);
    return new Promise((resolve, reject) => {
      const imgObj = new Image();
      imgObj.src = imgUrl;
      imgObj.onload = function() {
        resolve(imgUrl);
      }
      imgObj.onerror = function() {
        reject()
      }
    })
  }

  // 判断祖先元素是否包含指定的class
  function isHasParentClass(ele, parentClass) {
    let currEle = ele.parentElement;
    while(currEle) {
      if (currEle.className.includes(parentClass)) {
        return true;
      }
      currEle = currEle.parentElement;
    }
    return false;
  }

  // 获取最近的包含指定的class的祖先元素
  function getParentContainClass(ele, parentClass) {
    let currEle = ele.parentElement;
    while(currEle) {
      if (currEle.className.includes(parentClass)) {
        return currEle;
      }
      currEle = currEle.parentElement;
    }
    return null;
  }

  class Preview {
    constructor() {
      this.cachedImg = JSON.parse(localStorage.getItem('cachedImg') || '{}');
      // previewWrapper
      const previewWrapperEle = document.createElement('div');
      previewWrapperEle.className = 'cloth-preview-wrapper';
      document.body.appendChild(previewWrapperEle);
      this.previewWrapperEle = previewWrapperEle;

      previewWrapperEle.innerHTML = `
        <div class="cloth-preview-mask"></div>
        <div class="cloth-preview-inner">
          <div class="cloth-preview-header"></div>
          <div class="cloth-preview-close">×</div>
          <div class="cloth-preview-body">
            <img class="cloth-preview-img" src=${emptyUrl} />
            <div class="cloth-preview-mode">
              <span>背景色：</span>
              <label for="previewMode">浅色</label>
              <input id="previewMode" type="checkbox">
              <label for="previewMode">深色</label>
            </div>
            <div class="cloth-preview-empty">暂无外观展示图</div>
            <div class="cloth-preview-loading">
              <div class="ant-spin ant-spin-lg ant-spin-spinning"><i aria-label="icon: loading" class="anticon anticon-loading ant-spin-dot"><svg viewBox="0 0 1024 1024" focusable="false" class="anticon-spin" data-icon="loading" width="1em" height="1em" fill="currentColor" aria-hidden="true"><path d="M988 548c-19.9 0-36-16.1-36-36 0-59.4-11.6-117-34.6-171.3a440.45 440.45 0 0 0-94.3-139.9 437.71 437.71 0 0 0-139.9-94.3C629 83.6 571.4 72 512 72c-19.9 0-36-16.1-36-36s16.1-36 36-36c69.1 0 136.2 13.5 199.3 40.3C772.3 66 827 103 874 150c47 47 83.9 101.8 109.7 162.7 26.7 63.1 40.2 130.2 40.2 199.3.1 19.9-16 36-35.9 36z"></path></svg></i></div>
            </div>
          </div>
        </div>
      `;
      this.previewTitleEle = previewWrapperEle.querySelector('.cloth-preview-header');
      this.previewImgEle = previewWrapperEle.querySelector('img.cloth-preview-img');

      // previewMask
      const previewMaskEle = previewWrapperEle.querySelector('.cloth-preview-mask');
      const previewCloseEle = previewWrapperEle.querySelector('.cloth-preview-close');
      previewMaskEle.onclick = this.toggle;
      previewCloseEle.onclick = this.toggle;

      const previewModeEle = document.getElementById('previewMode');
      previewModeEle.onchange = (event) => {
        if (event.target.checked) {
          this.previewWrapperEle.classList.add('dark');
        } else {
          this.previewWrapperEle.classList.remove('dark');
        }
      }
    }

    render = (name, type) => {
      if (!name) {
        return;
      }
      const nickName = getWGAliasName(name) ? `(别名：${getWGAliasName(name)})` : '';
      this.previewTitleEle.textContent = `${name}${nickName}`;
      this.toggle(true);
      if (type && !['外观礼盒', '上衣', '发型', '披风', '帽子', '挂宠', '肩饰'].includes(type)) {
        this.previewWrapperEle.classList.add('empty');
        return;
      }
      this.previewWrapperEle.classList.add('loading');
      this.findClothImage(name).then((imgResult) => {
        this.previewWrapperEle.classList.remove('loading');
        if (imgResult.url) {
          this.previewWrapperEle.classList.remove('empty');
          this.previewImgEle.src = imgResult.url;
        } else {
          this.previewWrapperEle.classList.add('empty');
        }
      });
    }

    toggle = (visible) => {
      if (typeof visible === 'boolean') {
        if (visible) {
          this.previewWrapperEle.classList.add('show');
        } else {
          this.previewWrapperEle.classList.remove('show');
        }
      } else {
        this.previewWrapperEle.classList.toggle('show');
      }
    }

    saveCache = (name, result) => {
      this.cachedImg[name] = result;
      if (result.url) {
        const saved = JSON.parse(localStorage.getItem('cachedImg') || '{}');
        saved[name] = result;
        localStorage.setItem('cachedImg', JSON.stringify(saved));
      }
    }

    // 找出当前名称对应的图片
    findClothImage = (name) => {
      if (this.cachedImg[name]) {
        return Promise.resolve(this.cachedImg[name]);
      }
      return isImageUrlValid(name).then(imgUrl => ({ url: imgUrl })).catch(() => {
        if (/^(红发|金发)·/.test(name)) {
          return {}
        }
        // 盒子散件
        if (/·(发|帽|黑发|白发|金发|衣|披风|左|右)$/.test(name)) {
          const basename = name.split('·').slice(0, -1).join('·');
          const basename2 = basename.replace('·', '');
          const boxTypes = ['礼盒', '·标准', '·豪华']

          const urlPaths = Array.from(new Set(boxTypes.map(type => `${basename2}${type}`).concat(boxTypes.map(type => `${basename}${type}`))));
          return Promise.any(urlPaths.map(imageName => isImageUrlValid(imageName).then(url => ({ name: imageName, url })))).catch(() => ({}))
        }
        return Promise.any([`${name}衣`, `${name}礼盒`, `${name}·标准`, `${name}·豪华`, `${name}礼盒`.replace(/·/g, '')].map(imageName => isImageUrlValid(imageName).then(url => ({ name: imageName, url })))).catch(() => ({}))
        // return {};
      }).then(({ name: imgName, url}) => {
        const result = {
          name: imgName || name,
          url,
        }
        this.saveCache(name, result)
        return result;
      })
    }
  }

  const preview = new Preview();

  // 打开图片预览窗口
  const handleShowPreview = (currentEle) => {
    let name;
    let type;
    if (isWBLPage) {
      name = currentEle.dataset.clothname;
      type = currentEle.dataset.clothtype;
    } else if (isAIJX3Page) {
      name = getParentContainClass(currentEle, 'el-table_1_column_2').nextElementSibling.querySelector('.text-primary').textContent;
    } else {
      return;
    }
    preview.render(name, type);
  }
  // 判断当前元素是否为可查看外观的元素
  const isPopElement = (ele) => {
    const isWBLPop = isWBLPage && ele.nodeName === 'IMG' && ele.dataset.clothname;
    const isAiJX3POP = isAIJX3Page && ele.nodeName === 'IMG' && isHasParentClass(ele,'el-table_1_column_2');
    return isWBLPop || isAiJX3POP;
  }

  function handleProcessSkinRow(skinRowNode) {
    const addedNode = skinRowNode;
    let firstColumn = addedNode.firstElementChild;
    if (isWBLFollowPage) {
      firstColumn = firstColumn.firstElementChild
    }
    const nameEle = firstColumn.lastElementChild;
    const name = nameEle.innerText?.trim();
    if (name && !/\(\w+\)/g.test(name)) {
      const aliceName = getWGAliasName(name);
      // const aliceName = name;
      if (aliceName) {
        nameEle.innerHTML += `<span class="cloth-highlight-text">(别名：${aliceName})</span>`;
      }
    }
    let imgEle = firstColumn.querySelector('.pimg');
    if (isWBLFollowPage) {
      imgEle = firstColumn.firstElementChild;
    }
    if (imgEle) {
      imgEle.setAttribute('title', '点击图标查看外观图片');
      imgEle.dataset.clothname = name;
    }
    if (!isWBLFollowPage && imgEle) {
      const type = firstColumn.nextElementSibling.innerText?.trim();
      imgEle.dataset.clothtype = type;
    }
  }

  if (isWBLPage) {
    // 创建一个观察器实例并传入回调函数
    new MutationObserver(function (mutationsList) {
      for (let { addedNodes } of mutationsList) {
        for (let addedNode of addedNodes) {
          // 买角色
          if (window.location.search.indexOf(('t=role')) > 0) {
            if (addedNode.className === 'app-web-components-modal-components-role-detail-styles-equip-row-item-m__appearanceRowItem--3VD91') {
              let supportedNode = Array.from(addedNode.querySelectorAll('.equip-icon'));
              // supportedNode = supportedNode.filter();
              supportedNode.forEach(theNode => {
                const name = theNode.lastElementChild.innerText?.trim();
                if (name) {
                  const aliceName = getWGAliasName(name);
                  if (aliceName) {
                    theNode.lastElementChild.innerHTML += `<span class="cloth-highlight-text">(别名：${aliceName})</span>`;
                  }
                }
                if (['shopExterior', 'hair', 'backCloak', 'pet'].includes(theNode.getAttribute('type'))) {
                  theNode.setAttribute('title', '点击图标查看外观图片');
                  const imgEle = theNode.querySelector('img');
                  if (imgEle) {
                    imgEle.dataset.clothname = name;
                  }

                }
              })
            }
          } else if (window.location.search.indexOf(('t=skin')) > 0) {
            // 买外观
            if (addedNode.className === 'app-web-page-buyer-components-skin-list-index-m__skinItem--2ek4U' || addedNode.className === 'app-web-page-follow-components-styles-components-m__followItemWrap--3niqc') {
              handleProcessSkinRow(addedNode);
            }
          }
        }
      }
    }).observe(document.body, { childList: true, subtree: true });
  }

  function init() {
    document.addEventListener('click', (evt) => {
      const currentEle = evt.target;
      if (isPopElement(currentEle)) {
        handleShowPreview(currentEle);
      }
    });
    if (isWBLPage) {
      waitConditionReady(() => window.location.search.indexOf(('t=skin')) > 0 && [
        ...document.querySelectorAll('.app-web-page-buyer-components-skin-list-index-m__skinItem--2ek4U'),
        ...document.querySelectorAll('.app-web-page-follow-components-styles-components-m__followItemWrap--3niqc'),
      ].length > 0).then(() => {
        const skinRowNodes = [
          ...document.querySelectorAll('.app-web-page-buyer-components-skin-list-index-m__skinItem--2ek4U'),
          ...document.querySelectorAll('.app-web-page-follow-components-styles-components-m__followItemWrap--3niqc'),
        ];
        skinRowNodes.forEach(handleProcessSkinRow);
      });
    }

  }
  init();
})();