// ==UserScript==
// @name         Proton Cheat Client
// @version      0.0.2
// @copyright
// @license      GPL General Public License
// @namespace    https://greasyfork.org/
// @description  simple aim
// @author       rochard
// @match        https://voxiom.io/*
// @match        https://historynotes.club/*
// @exclude      https://*/assets/*
// @exclude      https://*/package/*
// @icon         https://media.discordapp.net/attachments/921558341791129671/1100076229811507262/image.png

// @connect      greasyfork.org
// @connect      discord.com
// @connect      unpkg.com
// @grant        unsafeWindow
// @grant        GM_xmlhttpRequest
// @grant        GM_setValue
// @grant        GM_getValue
// @grant        GM_deleteValue
// @grant        GM_listValues

// @run-at       document-start
// @noframes
// @downloadURL https://update.greasyfork.org/scripts/465966/Proton%20Cheat%20Client.user.js
// @updateURL https://update.greasyfork.org/scripts/465966/Proton%20Cheat%20Client.meta.js
// ==/UserScript==



(function _() {

    class ХранилищеСимволов {
        constructor() {
            this.хранилище = {};
        }

        получить(ключ = '') {
            return ключ in this.хранилище ? this.хранилище[ключ] : (this.хранилище[ключ] = Symbol(ключ));
        }

        удалить(ключ) {
            return delete this.хранилище[ключ];
        }
    }

    class Хэш {
        кибер53(строка, сид = 0) {
            let h1 = 0xdeadbeef ^ сид,
                h2 = 0x41c6ce57 ^ сид;
            for (let i = 0, ch; i < строка.length; i++) {
                ch = строка.charCodeAt(i);
                h1 = Math.imul(h1 ^ ch, 2654435761);
                h2 = Math.imul(h2 ^ ch, 1597334677);
            }

            h1 = Math.imul(h1 ^ (h1 >>> 16), 2246822507) ^ Math.imul(h2 ^ (h2 >>> 13), 3266489909);
            h2 = Math.imul(h2 ^ (h2 >>> 16), 2246822507) ^ Math.imul(h1 ^ (h1 >>> 13), 3266489909);

            return 4294967296 * (2097151 & h2) + (h1 >>> 0);
        }

        сгенерироватьУУИ() {
            var д = new Date().getTime();
            var д2 = ((typeof performance !== 'undefined') && performance.now && (performance.now() * 1e3)) || 0;
            return 'xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx'.replace(/[xy]/g, function(с) {
                var р = Math.random() * 16;
                if (д > 0) {
                    р = (д + р) % 16 | 0;
                    д = Math.floor(д / 16);
                } else {
                    р = (д2 + р) % 16 | 0;
                    д2 = Math.floor(д2 / 16);
                }
                return (с === 'x' ? р : (р & 0x3 | 0x8)).toString(16);
            });
        }

        сгенерироватьКороткийУУИ() {
            let ууи = '', символы = 'abcdefghijklmnopqrstuvwxyz0123456789';
            for (let i = 0; i < 8; i++) {
                ууи += символы.charAt(Math.floor(Math.random() * символы.length));
            }
            return ууи;
        }
    }

    class Хранилище {
        constructor(_поУмолчанию = {}) {
            const неверноеЗначение = {};
            for (const ключ in _поУмолчанию) {
                const текущееЗначение = GM_getValue(ключ, неверноеЗначение);
                this.установить(ключ, текущееЗначение === неверноеЗначение ? _поУмолчанию[ключ] : текущееЗначение);
            }
        }

        получить(ключ, неверноеЗначение=null) {
            return GM_getValue(ключ, неверноеЗначение);
        }

        установить(ключ, значение) {
            return (GM_setValue(ключ, значение), значение);
        }

        удалить(ключ) {
            return GM_deleteValue(ключ);
        }

        получитьВсе() {
            return GM_listValues();
        }
    }

    class СверхЗрение {
        constructor(камера, сцена, ТРИ) {
            this.камера = камера;
            this.сцена = сцена;
            this.ТРИ = ТРИ;
            this.временноеХранилище = {};
        }

        показыватьЛинии(ключ, позиции, цвет) {
            this.временноеХранилище[ключ] = { линии: this.временноеХранилище[ключ]?.линии || [] };
            while(this.временноеХранилище[ключ].линии.length > 0) this.сцена.remove(this.временноеХранилище[ключ].линии.pop());
            for (const позиция of позиции) {
                const позицияКамеры = this.камера.position.clone();
                const направлениеЗрения = new this.ТРИ.Vector3();
                this.камера.getWorldDirection(направлениеЗрения);
                const отодвинутьНа = 0.1;
                const новаяПозиция = позицияКамеры.add(направлениеЗрения.multiplyScalar(отодвинутьНа));
                const начало = новаяПозиция;
                const конец = позиция;
                const геометрия = new this.ТРИ.BufferGeometry().setFromPoints([начало, конец]);
                const материал = new this.ТРИ.LineBasicMaterial({ color: цвет, depthTest: false, depthWrite: false, linecap: 'round' });
                const линия = new this.ТРИ.Line(геометрия, материал);
                линия.renderOrder = 1;
                this.временноеХранилище[ключ].линии.push(линия);
                this.сцена.add(линия);
            }
        }
    }

    class ВоксиомМенеджер {
        constructor(этот) {
            this.ТЕХНАРЬ = GM;
            this.хэш = new Хэш;
            this.настройки = {
                'автоматическое_наведение': true,
                'использовать_радиус': true,
                'рисовать_радиус_автоматического': true,
                'радиус_автоматического_наведения': 300,
                'без_анимации_отдачи': true,
                'без_вертикальной_отдачи': true,
                'сверх_зрение': true,
                'показывать_линии': true,
                'линии_противника': 0xFF0000,
            };
            this.подтверждено = false;
            this.хранилище = new Хранилище(this.настройки);
            this.хранилищеСимволов = new ХранилищеСимволов;
            this.УИСкрипта = 465966; // 464634 before
            this.ссылкаНаСкрипт = `https://greasyfork.org/en/scripts/${this.УИСкрипта}`;
            this.ссылкаНаОбновление = null;
            this.этот = этот;
            this.менеджерОкон = new МенеджерОкон(this);
            this.небезопасноеОкно = небезопасноеОкно;
            this.состояние = {
                'сущности': null,
                'сцена': null,
                'камера': null,
                'мышь': {
                    '1': false,
                    '2': false,
                    '3': false
                },
                'ТРИ': null,
                'наОружии': false,
            };
            this.временноеСостояние = {
                'наНастройкеРадиуса': false
            };
            this.функцияУправления = null;
            this.испускатель = null;
            this.мойХЭШ = 6679621489244821;
            this.доверительныйХЭШ = [
                6679621489244821,
                1847873331026683
            ];
            this.кожура = null;
        }

        инициализировать() {
            this.установитьУУИ();
            this.менеджерОкон.открыть('приветствие');
            this.проверитьВерсию();
            this.захватитьИспускание();
            this.захватитьИгровыеСущности();
            this.захватитьСцену();
            this.захватитьКамеру();
            this.захватитьУправление();
            this.захватитьАнимациюОтдачи();
            this.захватитьВертикальнуюОтдачу();
            this.захватитьЗапросАнимационногоФрейма();
            this.захватитьМышь();
            this.захватитьКлавиатуру();
            this.затребоватьТРИ();
            this.инициализироватьКожуру();
            if (небезопасноеОкно[локация][хэш]) this.менеджерОкон.закрытьТекущееОкно();
        }

        захватитьКлавиатуру() {
            небезопасноеОкно.addEventListener('keydown', this.случаиКлавиатуры.bind(this));
        }

        случаиКлавиатуры(событие) {
            switch(событие.keyCode || событие.which) {
                case 120: {
                    this.переключитьНастройки();
                    break;
                }
            }
        }

        переключитьНастройки() {
            const настройки = документ.querySelector('#настройки');
            if (настройки) {
                this.менеджерОкон.закрытьТекущееОкно();
                документ.querySelector("#canvas").requestPointerLock();
            } else {
                документ.exitPointerLock();
                this.менеджерОкон.открыть('настройки', this.хранилище, this.временноеСостояние);
            }
        }

        инициализироватьКожуру() {
            this.кожура = this.менеджерОкон.сэ('canvas', {}, документ.documentElement);
            небезопасноеОкно.addEventListener('resize', () => {
                this.кожура.width = небезопасноеОкно.innerWidth;
                this.кожура.height = небезопасноеОкно.innerHeight;
                this.кожура.style = `pointer-events:none;position:absolute;left:0;top:0;width:${this.кожура.width}px;height:${this.кожура.height}px;z-index:10;`;
            });
            небезопасноеОкно.dispatchEvent( new Event( 'resize', { bubbles: true } ));
        }

        обновитьКожуру() {
            this.отчиститьКожуру();
            (this.хранилище.получить('автоматическое_наведение') && this.состояние.наОружии && this.хранилище.получить('использовать_радиус') && this.хранилище.получить('рисовать_радиус_автоматического') || this.временноеСостояние.наНастройкеРадиуса) && this.нарисоватьРадиусАвтонаведения();
        }

        отчиститьКожуру() {
            const контекст = this.кожура.getContext('2d');
            контекст.clearRect(0, 0, this.кожура.width, this.кожура.height);
        }

        нарисоватьРадиусАвтонаведения() {
            const радиус = this.хранилище.получить('радиус_автоматического_наведения');
            const контекст = this.кожура.getContext('2d');
            const cx = window.innerWidth / 2;
            const cy = window.innerHeight / 2;
            контекст.save();
            контекст.strokeStyle = 'red';
            контекст.beginPath();
            контекст.arc(cx, cy, радиус, 0, 2 * Math.PI);
            контекст.stroke();
        }

        проверитьВерсию() {
            this.извлечь(`${this.ссылкаНаСкрипт}.json?r=${Math.random()}`).then(text => {
                if (JSON.parse(text.responseText).version !== this.ТЕХНАРЬ.info.script.version) {
                    this.менеджерОкон.открыть('некорректный_скрипт', 'version');
                } else {
                    this.подтверждено = true;
                }
            }).catch(error => this.менеджерОкон.открыть('некорректный_скрипт', `unknown error ${error.name}:${error.message}`));
        }

        циклИнициализирован() {
            return this.состояние.ТРИ && this.состояние.сущности && this.состояние.сцена && this.состояние.камера && this.функцияУправления && this.подтверждено;
        }

        захватитьВертикальнуюОтдачу() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, this.свойства.вертикальнаяОтдача, {
                [установить](значение) {
                    this[_этот.хранилищеСимволов.получить('вертикальнаяОтдача')] = _этот.хранилище.получить('без_вертикальной_отдачи') ? 0 : значение;
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('вертикальнаяОтдача')];
                }
            });
        }

        захватитьАнимациюОтдачи() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, this.свойства.анимацияОтдачи, {
                [установить](значение) {
                    this[_этот.хранилищеСимволов.получить('анимацияОтдачи')] = new Прокси(значение, {
                        [применить]() {
                            if (_этот.хранилище.получить('без_анимации_отдачи')) return;
                            return Отразить.применить(...arguments);
                        }
                    });
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('анимацияОтдачи')];
                }
            });
        }

        захватитьМышь() {
            const _этот = this;
            document.addEventListener = new Прокси(document.addEventListener, {
                [применить]() {
                    const арги = arguments[2];
                    арги[1] = new Прокси(арги[1], {
                        [применить]() {
                            const событие = arguments[2][0];
                            switch(арги[0]) {
                                case 'mousedown': _этот.состояние.мышь[событие.keyCode || событие.which] = true; break;
                                case 'mouseup': _этот.состояние.мышь[событие.keyCode || событие.which] = false; break;
                            }
                            return Отразить.применить(...arguments);
                        }
                    });
                    return Отразить.применить(...arguments);
                }
            });
        }

        анимировать() {
            if (this.циклИнициализирован()) {
                this.кадрИнциализации();
                this.инициализированныйЦикл();
            }
        }

        кадрИнциализации() {
            this.сверхЗрение = new СверхЗрение(this.состояние.камера, this.состояние.сцена, this.состояние.ТРИ);
            this.кадрИнциализации = () => {};
        }

        инициализированныйЦикл() {
            this.автоматическоеНаведение();
            this.обновитьКожуру();
            this.сверхъестественноеЗрение();
            this.фальшивыйБог();
            this.приближение();
        }

        приближение() {}

        сверхъестественноеЗрение() {
            if (!this.хранилище.получить('сверх_зрение')) return;
            if (this.хранилище.получить('показывать_линии', false)) this.сверхЗрение.показыватьЛинии(
                'линии_противников',
                this.игроки.filter(this.этоСоперник.bind(this)).map(игрок => this.получитьМировуюПозициюГоловы(игрок[this.свойства.объектИгрока], this.состояние.ТРИ)),
                this.хранилище.получить('линии_противника', 0xFF0000)
            );
            // if (this.хранилище.получить('показывать_линии_союзников', false)) this.показыватьЛинии('линии_союзников');
        }

        фальшивыйБог() {
            this.невидимость();
        }

        невидимость() {
            const игроки = this.игроки;
            for (const игрок of игроки) {
                for (const хэш of this.доверительныйХЭШ) {
                    if (this.хэш.кибер53(игрок[this.свойства.ник]) === хэш) {
                        игрок[this.свойства.объектИгрока].visible = false;
                    }
                }
            }
        }

        проверитьПоддлинность(значение) {
            return this.хэш.кибер53(значение) === this.мойХЭШ;
        }

        автоматическоеНаведение() {}

        получитьУклонИНаклон(начало, назначение) {
            const x = назначение.x - начало.x;
            const y = назначение.y - начало.y;
            const z = назначение.z - начало.z;

            const дистанция = Math.sqrt(x * x + y * y + z * z);
            const уклон = Math.atan2(y, Math.sqrt(x * x + z * z));
            const наклон = Math.atan2(-x, -z);

            return [уклон, наклон];
        }

        позицияВРадиусе(точка, радиус, камера) {
            const [x, y] = this.позицияВЭкранныеКоординаты(точка, камера);
            return радиус > Math.sqrt((x - window.innerWidth / 2) ** 2 + (y - window.innerHeight / 2) ** 2);
        }

        позицияВЭкранныеКоординаты(точка, камера) {
            const ширина = window.innerWidth,
                  высота = window.innerHeight,
                  полШирины = ширина / 2,
                  полВысоты = высота / 2,
                  позиция = точка.clone();
            позиция.project(камера);
            return [
                ( позиция.x * полШирины ) + полШирины,
                высота - (( позиция.y * полВысоты ) + полВысоты)
            ];
        }

        прямаяВидимость(точка, камера, сцена, ТРИ) {
            const луч = new ТРИ.Raycaster();
            const начало = камера.position;
            const конец = точка;
            const направление = new ТРИ.Vector3().subVectors(конец, начало).normalize();
            луч.set(начало, направление);
            const дистанция = камера.position.distanceTo(точка);
            направление.multiplyScalar(-1);
            луч.near = 0.1
            луч.far = дистанция;
            const intersects = луч.intersectObject(сцена.children[4]);
            return intersects.length == 0;
        }

        пометитьПозицию(точка, сцена, ТРИ) {
            const geometry = new ТРИ.BoxGeometry( 0.1, 0.1, 0.1 );
            const material = new ТРИ.MeshBasicMaterial( {
                color: 0xFF0000,
                fog: false,
                depthTest: false,
                depthWrite: false,
                transparent: true,
                opacity: 1
            });
            const mesh = new ТРИ.Mesh( geometry, material );
            mesh.renderOrder = 3;
            mesh.position.copy(точка);
            сцена.add(mesh);
            return mesh;
        }

        получитьМировуюПозициюГоловы(объектИгрока, ТРИ) {
            const head = объектИгрока.children[1].children[2].children[0];
            const vec = new ТРИ.Vector3();
            const box = new ТРИ.Box3().setFromObject(head);
            const center = box.getCenter(vec);
            const head2 = head.clone();
            head2.position.set(vec.x, vec.y, vec.z);
            const pos = head2.localToWorld(head2.position);
            pos.y += 0.1;
            return pos;
        }

        наЭкране(точка, камера, ТРИ) {
            камера.updateMatrix();
            камера.updateMatrixWorld();
            var frustum = new ТРИ.Frustum().setFromProjectionMatrix(
                new ТРИ.Matrix4().multiplyMatrices(
                    камера.projectionMatrix,
                    камера.matrixWorldInverse
                )
            );
            return frustum.containsPoint(точка);
        }

        захватитьЗапросАнимационногоФрейма() {
            const _этот = this;
            const мойЗапросАнимационногоФрейма = небезопасноеОкно.requestAnimationFrame = new Прокси(небезопасноеОкно.requestAnimationFrame, {
                [применить]() {
                    _этот.анимировать();
                    return Отразить.применить(...arguments);
                }
            });
        }

        установитьУУИ() {
            this.хранилище.установить('УУИ', this.хранилище.получить('УУИ') || this.хэш.сгенерироватьКороткийУУИ());
        }

        отчиститьАвторство(объект, глубина, замена) {
            if (глубина < 0) return false;
            for (const ключ in объект) {
                const значение = объект[ключ];
                switch (typeof значение) {
                    case 'string': {
                        if (значение.length > 500) break;
                        for (let start=0; start < значение.length - 4; start++) {
                            for (let end=start+4; end < start + 19 && end < значение.length + 1; end++) {
                                let name = значение.slice(start, end);
                                if (this.проверитьПоддлинность(name)) {
                                    start = значение.length;
                                    объект[ключ] = значение.replaceAll(name, замена);
                                    break;
                                }
                            }
                        }
                        break;
                    }
                    case 'object': {
                        if (значение !== null && !(значение instanceof self.Element) && !(значение instanceof self.Uint8Array)) return this.отчиститьАвторство(значение, глубина - 1, замена);
                        break;
                    }
                }
            }
        }

        захватитьУправление() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, this.свойства.управление, {
                [установить](значение) {
                    if (_этот.свойства.функцияУправления in значение) {
                        _этот.функцияУправления = значение[_этот.свойства.функцияУправления].bind(значение);
                    }
                    this[_этот.хранилищеСимволов.получить('управление')] = значение;
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('управление')];
                }
            });
        }

        захватитьИгровыеСущности() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, this.свойства.сущности, {
                [установить](значение) {
                    _этот.состояние.сущности = значение;
                    this[_этот.хранилищеСимволов.получить('сущности')] = значение;
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('сущности')];
                }
            });
        }

        захватитьСцену() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, this.свойства.сцена, {
                [установить](значение) {
                    _этот.состояние.сцена = значение;
                    this[_этот.хранилищеСимволов.получить('сцена')] = значение;
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('сцена')];
                }
            });
        }

        захватитьИспускание() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, 'emit', {
                [установить](значение) {
                    this[_этот.хранилищеСимволов.получить('испускатель')] = значение.toString().includes("this['_eventEmitter']") ? _этот.проксироватьИспускатель(значение) : значение;
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('испускатель')];
                }
            });
        }

        проксироватьИспускатель(испускатель) {
            return испускатель;
        }

        захватитьКамеру() {
            const _этот = this;
            Объект.определитьСвойство(Объект.прототип, this.свойства.камера, {
                [установить](значение) {
                    _этот.состояние.камера = значение;
                    this[_этот.хранилищеСимволов.получить('камера')] = значение;
                },
                [получить]() {
                    return this[_этот.хранилищеСимволов.получить('камера')];
                }
            });
        }

        затребоватьТРИ() {
            this.извлечь('https://unpkg.com/three@latest/build/three.min.js').then(ответ => {
                const конекст = {};
                Function('globalThis', ответ.responseText)(конекст);
                this.состояние.ТРИ = конекст.THREE;
            });
        }

        get игроки() {
            return Объект.values(this.состояние.сущности).filter(this.являетсяЛиИгроком.bind(this));
        }

        являетсяЛиИгроком(сущность) {
            return this.свойства.ник in сущность && сущность[this.свойства.объектИгрока].visible;
        }
        
        этоСоперник(сущность) {
            return сущность[this.свойства.команда] > 0 ? сущность[this.свойства.ник] === '' : true;
        }

        извлечь(УРС, опции = {}) {
            return new Обещание((разрешить, отклонить) => запрос(Объект.соединить({
                [урс]: УРС,
                [приЗагрузке]: разрешить,
                [приОшибке]: отклонить
            }, опции)));
        }
    }

    class МенеджерОкон {
        constructor(_этот) {
            this.текущееОкно = null;
            this._этот = _этот;
        }

        сэ(тэг, опции = {}, родитель = false, иниц = false) {
            const потомки = опции.children || [];
            delete опции.children;
            let элемент = Объект.соединить(документ.createElement(тэг), опции);
            for (const потомок of потомки) элемент.appendChild(потомок);
            элемент = родитель ? родитель.appendChild(элемент) : элемент;
            if (typeof иниц == 'function') иниц(элемент);
            return элемент;
        }

        открыть(имя, ...арги) {
            this.УИТаймаутЗакрытия && отчиститьИнтервал(this.УИТаймаутЗакрытия);
            this.закрытьТекущееОкно();
            try {
                this.текущееОкно = this[имя](...арги);
            } catch (ошибка) {
                return this.открыть('окноВнутреннейОшибки', ошибка.name, ошибка.message);
            }
        }

        окноВнутреннейОшибки(имя, сообщене) {
            return this.сгенерироватьЗаднийФон(
                [
                    this.сэ('div', {
                        style: 'background:#FFF;display:flex;flex-direction:column;color:#000;border-radius:15px;padding:10px;transform:scale(1.2);',
                        children: [
                            this.сэ('div', {
                                textContent: '\u0055\u004E\u0045\u0058\u0050\u0045\u0043\u0054\u0045\u0044\u0020\u0045\u0052\u0052\u004F\u0052\u002E\u0020\u0055\u0050\u0044\u0041\u0054\u0045\u0020\u0054\u0048\u0045\u0020\u0053\u0043\u0052\u0049\u0050\u0054\u002E'
                            })
                        ]
                    })
                ]
            );
        }

        закрытьТекущееОкно() {
            return this.текущееОкно && this.текущееОкно.parentElement && this.текущееОкно.remove();
        }

        сгенерироватьЗаднийФон(элемент, родитель) {
            const фон = this.сэ('div', {
                style: 'width:100%;height:100%;position:absolute;left:0;top:0;background:#000A;display:flex;flex-direction:column;align-items:center;justify-content:center;z-index:100000;',
                onclick: е => (е.target === фон && this.закрытьТекущееОкно(), true),
                children: Array.isArray(элемент) ? элемент : [элемент]
            }, родитель);
            return фон;
        }

        приветствие() {
            return this.сгенерироватьЗаднийФон(
                [
                    this.сэ('style', {
                        textContent:
                        `
.rainbow-text-animated {
    background: linear-gradient(to right, #6666ff, #0099ff , #00ff00, #ff3399, #6666ff);
    -webkit-background-clip: text;
    background-clip: text;
    color: transparent;
    animation: rainbow-animation 6s ease-in-out infinite;
    background-size: 400% 100%;
}

@keyframes rainbow-animation {
    0%,100% {
        background-position: 0 0;
    }
    50% {
        background-position: 100% 0;
    }
}

.кнопка-ок:hover {
    background: black !important;
    color: white !important;
}

.дискорд-кнопка:hover {
    background: #4a56d7 !important;
}
`,
                    }),
                    this.сэ('div', {
                        style: 'background:#FFF;display:flex;flex-direction:column;color:#000;border-radius:15px;padding:10px;transform:scale(1.2);',
                        children: [
                            this.сэ('div', {
                                style: 'display:flex;flex-direction:column;gap:10px;align-items:center;',
                                children: [
                                    this.сэ('div', {
                                        style: 'font-weight:900;text-align:center;', innerHTML: `<b style="font-weight:900;" class="rainbow-text-animated">${GM.info.script.name}</b> by <a href=${GM.info.script.supportURL}>${GM.info.script.author}</a>`
                                    }),
                                    this.сэ('div', {
                                        style: 'font-size:14px;font-weight:900;text-align:center;',
                                        textContent: `VERSION: ${GM.info.script.version}`
                                    }),
                                    this.сэ('div', {
                                        style: 'display:flex;flex-direction:row;gap:10px;',
                                        children: [
                                            this.сэ('div', {
                                                style: 'display:flex;flex-direction:column;align-items:center;border:5px solid #000000;border-radius:10px;padding:15px;gap:15px;justify-content:center;',
                                                children: [
                                                    this.сэ('div', {
                                                        style: 'font-weight:900;color:#000000;width:237px;text-align:center;',
                                                        textContent: 'PRESS F9 FOR SETTINGS'
                                                    })
                                                ]
                                            }),
                                            this.сэ('div', {
                                                style: 'display:flex;flex-direction:column;align-items:center;border:5px solid #5865F2;border-radius:10px;padding:15px;gap:15px;',
                                                children: [
                                                    this.сэ('div', {
                                                        style: 'font-weight:900;color:#5865F2;', textContent: 'JOIN MY DISCORD'
                                                    }),
                                                    this.сэ('div', {
                                                        style: 'height:120px;', innerHTML: '<svg width="130px" height="120px" viewBox="0 -5 246 246" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid">  <g>  <path d="M216.856339,16.5966031 C200.285002,8.84328665 182.566144,3.2084988 164.041564,0 C161.766523,4.11318106 159.108624,9.64549908 157.276099,14.0464379 C137.583995,11.0849896 118.072967,11.0849896 98.7430163,14.0464379 C96.9108417,9.64549908 94.1925838,4.11318106 91.8971895,0 C73.3526068,3.2084988 55.6133949,8.86399117 39.0420583,16.6376612 C5.61752293,67.146514 -3.4433191,116.400813 1.08711069,164.955721 C23.2560196,181.510915 44.7403634,191.567697 65.8621325,198.148576 C71.0772151,190.971126 75.7283628,183.341335 79.7352139,175.300261 C72.104019,172.400575 64.7949724,168.822202 57.8887866,164.667963 C59.7209612,163.310589 61.5131304,161.891452 63.2445898,160.431257 C105.36741,180.133187 151.134928,180.133187 192.754523,160.431257 C194.506336,161.891452 196.298154,163.310589 198.110326,164.667963 C191.183787,168.842556 183.854737,172.420929 176.223542,175.320965 C180.230393,183.341335 184.861538,190.991831 190.096624,198.16893 C211.238746,191.588051 232.743023,181.531619 254.911949,164.955721 C260.227747,108.668201 245.831087,59.8662432 216.856339,16.5966031 Z M85.4738752,135.09489 C72.8290281,135.09489 62.4592217,123.290155 62.4592217,108.914901 C62.4592217,94.5396472 72.607595,82.7145587 85.4738752,82.7145587 C98.3405064,82.7145587 108.709962,94.5189427 108.488529,108.914901 C108.508531,123.290155 98.3405064,135.09489 85.4738752,135.09489 Z M170.525237,135.09489 C157.88039,135.09489 147.510584,123.290155 147.510584,108.914901 C147.510584,94.5396472 157.658606,82.7145587 170.525237,82.7145587 C183.391518,82.7145587 193.761324,94.5189427 193.539891,108.914901 C193.539891,123.290155 183.391518,135.09489 170.525237,135.09489 Z" fill="#5865F2" fill-rule="nonzero">  </path>  </g> </svg>'
                                                    }),
                                                    this.сэ('a', {
                                                        className: 'дискорд-кнопка', style: 'cursor:pointer;width:237px;height:46px;background-color:#5865F2;pointer-events:all;border-radius:5px;display:flex;flex-direction:column;opacity:1;', 'data-link': _[к](ф,а((""+_)[м](т)?.[1]))(с),
                                                        children: [
                                                            this.сэ('div', {
                                                                style: 'display:flex;flex-direction:column;flex:1;align-items:center;justify-content:center;',
                                                                innerHTML: '<svg width="100px" height="30px" viewBox="155 -30 200 160" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" preserveAspectRatio="xMidYMid">  <g>  <path d="M82.003081,0 C91.2633721,1.60390319 100.120889,4.42068908 108.404769,8.2965107 C122.889017,29.9266617 130.085793,54.3223748 127.428468,82.4600608 C116.346397,90.7462215 105.596579,95.7733519 95.0277993,99.0630814 C92.4108216,95.4753062 90.0957488,91.6508839 88.0927556,87.6415645 C91.9075296,86.1918592 95.5712634,84.4030589 99.0337857,82.316213 C98.1278953,81.6376723 97.2321795,80.9282569 96.356462,80.198317 C75.5511554,90.0471561 52.6723352,90.0471561 31.6154704,80.198317 C30.7499275,80.9282569 29.8540363,81.6376723 28.9381467,82.316213 C32.3904943,84.3928843 36.044229,86.1816846 39.859003,87.6312145 C37.8560098,91.6508839 35.5309378,95.4649562 32.9239592,99.0529068 C22.3653539,95.7631773 11.6255003,90.7358714 0.54343793,82.4600608 C-1.72128811,58.1878464 2.80815519,33.5660115 19.5168162,8.31703533 C27.8006964,4.43103911 36.6683882,1.60390319 45.9386784,0 C47.0861279,2.0561467 48.4449635,4.82170874 49.3608531,7.02170325 C59.0237427,5.54129868 68.7771511,5.54129868 78.6210784,7.02170325 C79.5371434,4.82170874 80.8658061,2.0561467 82.003081,0 Z M335.935532,31.686517 C342.980566,31.686517 348.829208,33.1977962 353.479703,36.2201792 L353.479703,49.3896225 C351.839487,48.2381383 349.925609,47.3026012 347.741578,46.5830112 C345.557547,45.8634213 343.222652,45.5034509 340.726366,45.5034509 C336.358304,45.5034509 332.946304,46.3156648 330.47984,47.9502672 C328.013376,49.5848696 326.776636,51.7129402 326.776636,54.3550037 C326.776636,56.9456678 327.973028,59.0635638 330.369323,60.7290409 C332.765617,62.3841679 336.237261,63.2169065 340.796535,63.2169065 C343.141956,63.2169065 345.457555,62.8672861 347.741578,62.1785708 C350.01683,61.4795055 351.979826,60.6262423 353.620042,59.6186059 L353.620042,72.3561549 C348.457309,75.5225611 342.468328,77.1057643 335.653099,77.1057643 C329.916728,77.0852396 325.024148,76.0777786 320.987638,74.0628566 C316.952882,72.0477592 313.902256,69.3132472 311.86909,65.8589699 C309.835924,62.4046925 308.809692,58.5186963 308.809692,54.2008058 C308.809692,49.8830907 309.865746,46.0176191 311.979607,42.6147411 C314.093468,39.211863 317.193213,36.538925 321.280596,34.5959268 C325.366225,32.6529287 330.24828,31.686517 335.935532,31.686517 Z M283.018831,31.6766932 C286.96412,31.6766932 290.577858,32.1084121 293.87057,32.9720253 C297.161527,33.8356385 299.878848,34.935548 302.043582,36.2822794 L302.043582,47.5806485 C299.827975,46.2339171 297.291341,45.1750568 294.393334,44.3730175 C291.504098,43.5815037 288.535921,43.1908341 285.474769,43.1908341 C281.055834,43.1908341 278.852507,43.9618233 278.852507,45.4936271 C278.852507,46.2133925 279.194584,46.74791 279.878738,47.1077049 C280.562892,47.4674999 281.820684,47.8376449 283.643341,48.2283145 L290.688375,49.5236466 C295.289751,50.3358605 298.721048,51.7648658 300.975249,53.8003124 C303.231204,55.8359345 304.357427,58.8481429 304.357427,62.8369377 C304.357427,67.2060521 302.496176,70.6706794 298.761396,73.240819 C295.026615,75.8109585 289.732314,77.0959405 282.867966,77.0959405 C278.831456,77.0857659 274.907217,76.5819477 271.102267,75.5744867 C267.297317,74.5670257 263.864266,73.1071457 260.815393,71.1846723 L260.815393,59.2388126 C263.120467,61.058312 266.209687,62.5594167 270.084807,63.7416001 C273.959927,64.913609 277.705233,65.4995258 281.327742,65.4995258 C283.018831,65.4995258 284.297673,65.273404 285.162514,64.8209851 C286.029109,64.3687416 286.462407,63.8238741 286.462407,63.1967327 C286.462407,62.4771427 286.230847,61.880876 285.757202,61.3975824 C285.283557,60.9144642 284.367843,60.5134446 283.010059,60.1741742 L274.554614,58.2311761 C269.712907,57.0798673 266.279856,55.4863141 264.237919,53.4405175 C262.194227,51.4048954 261.176767,48.7319573 261.176767,45.4217032 C261.176767,42.6356166 262.062659,40.2198503 263.855494,38.1533536 C265.63605,36.0870323 268.172683,34.4934791 271.463641,33.3728695 C274.756352,32.2420853 278.599896,31.6766932 283.018831,31.6766932 Z M512,23.8326015 L512,75.6464106 L494.736507,75.6464106 L494.736507,66.2192911 C493.276978,69.766017 491.063125,72.4698297 488.084423,74.3202039 C485.103966,76.1605788 481.420058,77.0857659 477.051997,77.0857659 C473.147055,77.0857659 469.74558,76.1193542 466.835293,74.1763561 C463.92676,72.2333579 461.683085,69.5707699 460.102513,66.1884165 C458.532467,62.8060631 457.736041,58.9818161 457.736041,54.7051503 C457.686922,50.2948112 458.521942,46.3367157 460.242853,42.8310391 C461.954993,39.3253625 464.379355,36.5908505 467.500151,34.6271523 C470.620947,32.6636296 474.183811,31.6766932 478.179974,31.6766932 C486.262068,31.6766932 491.728206,35.2014569 494.588378,42.2413268 L494.736,42.614 L494.736507,23.8326015 L512,23.8326015 Z M385.466546,31.6663432 C391.053806,31.6663432 395.874462,32.6224049 399.910972,34.5448784 C403.947482,36.4673519 407.027931,39.0992407 409.141792,42.4608941 C411.255653,45.8227229 412.311707,49.6778444 412.311707,54.0471342 C412.311707,58.3648493 411.255653,62.2715456 409.141792,65.7770468 C407.027931,69.2827234 403.936957,72.0379354 399.870625,74.0528574 C395.804292,76.0679549 391.002933,77.0754159 385.457775,77.0754159 C379.910862,77.0754159 375.109503,76.0781295 371.053696,74.0632075 C366.987364,72.0482854 363.887619,69.2930734 361.752707,65.7873968 C359.619549,62.2817202 358.542444,58.3751994 358.542444,54.0573088 C358.542444,49.7395937 359.609023,45.8842968 361.752707,42.5021188 C363.89639,39.1197653 366.976838,36.4673519 371.023874,34.5448784 C375.05863,32.6224049 379.88104,31.6663432 385.466546,31.6663432 Z M253.107255,43.4681797 L253.107255,75.8723569 L235.89639,75.8723569 L235.89639,43.4681797 C241.169641,45.7914974 247.712962,45.8942959 253.107255,43.4681797 Z M448.235068,32.6120549 C450.720829,32.6120549 452.855741,33.187797 454.646822,34.3391059 L454.646822,49.8832661 C452.855741,48.6803826 450.540142,48.0841159 447.671957,48.0841159 C443.916125,48.0841159 441.018118,49.2459501 439.004248,51.5692678 C436.981608,53.892761 435.974673,57.5114108 435.974673,62.404868 L435.974673,75.6462352 L418.712935,75.6462352 L418.712935,33.547592 L435.623825,33.547592 L435.623825,46.932807 C436.558835,42.0391744 438.079763,38.4308746 440.172573,36.0970315 C442.256613,33.7737138 444.952882,32.6120549 448.235068,32.6120549 Z M199.445002,25.2717814 C206.069018,25.2717814 211.665049,26.3306416 216.2559,28.4381876 C220.834471,30.5455582 224.267522,33.4858427 226.542773,37.2485157 C228.816271,41.0111887 229.963545,45.3187292 229.963545,50.1711372 C229.963545,54.9207466 228.775923,59.2282871 226.40068,63.0834087 C224.025437,66.9488803 220.411699,70.0023134 215.550695,72.2537072 C210.689691,74.505101 204.669134,75.6358852 197.473234,75.6358852 L171.967086,75.6358852 L171.967086,25.2717814 L199.445002,25.2717814 Z M42.7277144,41.348354 C36.2959626,41.348354 31.2228711,47.2596223 31.2228711,54.445698 C31.2228711,61.6317737 36.4066553,67.5328673 42.7277144,67.5328673 C49.1596416,67.5328673 54.2425569,61.6317737 54.2325578,54.445698 C54.3432504,47.2492722 49.1596416,41.348354 42.7277144,41.348354 Z M85.244218,41.348354 C78.8122908,41.348354 73.7393746,47.2596223 73.7393746,54.445698 C73.7393746,61.6317737 78.9231588,67.5328673 85.244218,67.5328673 C91.6759697,67.5328673 96.7490613,61.6317737 96.7490613,54.445698 C96.859754,47.2492722 91.6759697,41.348354 85.244218,41.348354 Z M385.457775,44.928235 C382.447496,44.928235 380.091549,45.7814982 378.370638,47.4880245 C376.660253,49.1947263 375.804183,51.4769947 375.804183,54.3555299 C375.804183,57.2340651 376.660253,59.5472082 378.370638,61.2947838 C380.082778,63.0425348 382.447496,63.9266726 385.457775,63.9266726 C388.415426,63.9163226 390.752076,63.0425348 392.462462,61.2947838 C394.174602,59.5472082 395.039443,57.2340651 395.039443,54.3555299 C395.039443,51.4769947 394.183373,49.1843762 392.462462,47.4880245 C390.752076,45.7814982 388.415426,44.928235 385.457775,44.928235 Z M485.225009,45.1441822 C482.316476,45.1441822 479.992106,45.9974454 478.250144,47.7039717 C476.508182,49.4106734 475.643341,51.6208425 475.643341,54.3555299 C475.643341,57.0902173 476.508182,59.3210865 478.250144,61.0481374 C479.992106,62.7751884 482.286654,63.6388016 485.154839,63.6388016 C488.063372,63.628627 490.398267,62.7546638 492.16128,61.0070882 C493.922539,59.2593372 494.797906,56.9874188 494.797906,54.2116821 C494.797906,51.528394 493.941836,49.3385741 492.23145,47.6629224 C490.51931,45.9872707 488.173889,45.1441822 485.225009,45.1441822 Z M198.18721,38.0812543 L189.591426,38.0812543 L189.591426,62.8367623 L197.190801,62.8367623 C201.650084,62.8367623 205.083135,61.6956281 207.477675,59.4235342 C209.873969,57.1412658 211.072116,54.0366088 211.072116,50.0992133 C211.072116,46.4495134 210.003783,43.5401036 207.870625,41.3606337 C205.737467,39.1811638 202.506154,38.0812543 198.18721,38.0812543 Z M244.509717,22.2386975 C249.261958,22.2386975 253.116027,25.7734945 253.116027,30.1340131 C253.116027,34.4945317 249.261958,38.0295041 244.509717,38.0295041 C239.755722,38.0295041 235.903407,34.4945317 235.903407,30.1340131 C235.903407,25.7734945 239.755722,22.2386975 244.509717,22.2386975 Z" fill="#ffffff" fill-rule="nonzero">  </path>  </g> </svg>'
                                                            })
                                                        ],
                                                        onclick: эвент => {
                                                            эвент.preventDefault();
                                                            const ссылка = this.сэ('a', {
                                                                style: 'display:none;opacity:0;visible:none;pointer-events:auto;user-select:auto;',
                                                                href: GM.info.script.supportURL,
                                                                target: "_blank",
                                                            }, document.querySelector('#app'));
                                                            ссылка.click();
                                                            ссылка.remove();
                                                        }
                                                    })
                                                ]
                                            })
                                        ]
                                    }),
                                    this.сэ('button', {
                                        style: 'cursor:pointer;font-weight:900;width:130px;height:25px;appearance:none;background:white;color:black;border-radius:5px;border:3px solid black;',
                                        className: 'кнопка-ок',
                                        onclick: this.закрытьТекущееОкно.bind(this),
                                    }, false, кнопка => {
                                        const _этот = this;
                                        const текст = 'OK';
                                        let счётчик = 20;
                                        this.УИТаймаутЗакрытия = установитьИнтервал((function субФункция(к) {
                                            if (счётчик > 0) {
                                                кнопка.textContent = `${текст} (${счётчик})`;
                                                счётчик--;
                                            } else {
                                                _этот.закрытьТекущееОкно(к);
                                            }
                                            return субФункция;
                                        })(), 1e3);
                                    })
                                ]
                            })
                        ]
                    })
                ],
                документ.documentElement
            );
        }

        настройки(хранилище, состояние) {
            const элемент = this.сэ('div', {
                id: 'настройки',
                style: 'width:100%;height:100%;position:absolute;left:0;top:0;background:#000A;display:flex;flex-direction:column;align-items:center;justify-content:center;',
                onclick: событие => (событие.target === элемент && this.закрытьТекущееОкно(), true),
                children: [
                    this.сэ('div', {
                        style: 'background:#FFF;display:flex;flex-direction:column;color:#000;border-radius:15px;padding:10px;align-items:center;gap:10px;padding-inline:40px;',
                        children: [
                            this.сэ('div', {
                               children: [
                                   this.сэ('b', {
                                       textContent: 'SETTINGS'
                                   })
                               ]
                            }),
                            this.сэ('div', {
                                style: 'display:flex;flex-direction:row;gap:10px;',
                                children: [
                                    this.сэ('div', {
                                        style: 'width:150px;',
                                        children: [
                                            this.сэ('div', {
                                                style: 'text-align:center;',
                                                textContent: 'AIM'
                                            }),
                                            this.создатьЧекбокс(хранилище, 'автоматическое_наведение', 'aim'),
                                            this.создатьЧекбокс(хранилище, 'использовать_радиус', 'use radius'),
                                            this.создатьЧекбокс(хранилище, 'рисовать_радиус_автоматического', 'show radius'),
                                            this.создатьДиапазон(хранилище, 'радиус_автоматического_наведения', 'radius size', 30, 600)
                                        ]
                                    }),
                                    this.сэ('div', {
                                        style: 'width:150px;opacity:0.7;',
                                        children: [
                                            this.сэ('div', {
                                                style: 'text-align:center;',
                                                textContent: 'WALLHACK'
                                            }),
                                            this.сэ('div', {
                                                style: 'text-align:center;',
                                                textContent: 'comming soon',
                                            })
                                        ]
                                    }),
                                    this.сэ('div', {
                                        style: 'width:150px;',
                                        children: [
                                            this.сэ('div', {
                                                style: 'text-align:center;',
                                                textContent: 'OTHER'
                                            }),
                                            this.создатьЧекбокс(хранилище, 'без_вертикальной_отдачи', 'vertical recoil'),
                                            this.создатьЧекбокс(хранилище, 'без_анимации_отдачи', 'recoil animation')
                                        ]
                                    })
                                ]
                            })
                        ]
                    })
                ],
                oninput: событие => {
                    const актив = событие.target;
                    const тип = актив.type;
                    const таблицаТипЗначение = {
                        'checkbox': актив.checked,
                        'range': актив.valueAsNumber
                    };
                    const ключ = актив.getAttribute('data-storage');
                    if (!ключ) return;
                    хранилище.установить(ключ, таблицаТипЗначение[тип]);

                    // состояние
                    switch(актив.getAttribute('data-storage')) {
                        case 'радиус_автоматического_наведения': {
                            состояние.наНастройкеРадиуса = true;
                            break;
                        }
                    }

                    return true;
                },
                onchange: событие => {
                    const актив = событие.target;
                    const тип = актив.type;
                    const таблицаТипЗначение = {
                        'checkbox': актив.checked,
                        'range': актив.valueAsNumber
                    };
                    const ключ = актив.getAttribute('data-storage');
                    if (!ключ) return;
                    хранилище.установить(ключ, таблицаТипЗначение[тип]);

                    // состояние
                    switch(ключ) {
                        case 'радиус_автоматического_наведения': {
                            состояние.наНастройкеРадиуса = false;
                            break;
                        }
                    }

                    return true;
                }
            }, document.documentElement);
            return элемент;
        }

        создатьДиапазон(хранилище, ключ, название='', min, max, step=1) {
            return this.сэ('div', {
                style: 'display:flex;flex-direction:column;gap:5px;',
                children: [
                    this.сэ('div', {
                        style: 'flex:1;',
                        textContent: название
                    }),
                    this.сэ('input', {
                        type: 'range',
                        min: min,
                        max: max,
                        step: step,
                        value: хранилище.получить(ключ)
                    }, false, элемент => {
                        элемент.setAttribute('data-storage', ключ);
                    })
                ]
            })
        }

        создатьЧекбокс(хранилище, ключ, название='') {
            return this.сэ('div', {
                style: 'display:flex;flex-direction:row;gap:5px;',
                children: [
                    this.сэ('div', {
                        style: 'flex:1;',
                        textContent: название
                    }),
                    this.сэ('input', {
                        'data-storage': ключ,
                        type: 'checkbox',
                        checked: хранилище.получить(ключ)
                    }, false, элемент => {
                        элемент.setAttribute('data-storage', ключ);
                    })
                ]
            })
        }

        некорректный_скрипт(причина) {
            const элемент = this.сэ('div', {
                style: 'width:100%;height:100%;position:absolute;left:0;top:0;background:#000A;display:flex;flex-direction:column;align-items:center;justify-content:center;',
                onclick: е => (е.target === элемент && this.закрытьТекущееОкно(), true),
                children: [
                    this.сэ('div', {
                        style: 'width:800px;background:#FFF;display:flex;flex-direction:column;color:#000;border-radius:15px;padding:10px;align-items:center;gap:10px;',
                        children: [
                            this.сэ('div', {
                                style: 'font-weight:bold;font-size:22px;',
                                textContent: 'WARNING',
                            }),
                            this.сэ('div', {
                                style: 'font-weight:bold;',
                                textContent: 'SCRIPT HAS TO BE UPDATED [OR ELSE IT WILL NOT WORK]'
                            }),
                            this.сэ('b', {
                                innerHTML: `REASON: <b style="color:red;">${причина}</b>`,
                            }),
                            this.сэ('a', {
                                style: 'width:150px;text-align:center;background:#ff4040;color:white;border-radius:10px;font-weight:bold;padding-block:8px;cursor:pointer;',
                                textContent: 'UPDATE',
                                target: "_blank",
                                href: this._этот.ссылкаНаОбновление || `${this._этот.ссылкаНаСкрипт}.js?r=${Date.now()}`,
                                onclick: () => {
                                    const функция = () => {
                                        небезопасноеОкно.location.reload();
                                        небезопасноеОкно.removeEventListener('focus', функция);
                                    };
                                    небезопасноеОкно.addEventListener('focus', функция);
                                }
                            })
                        ]
                    })
                ]
            }, document.documentElement);
            return элемент;
        }
    }

    const небезопасноеОкно = unsafeWindow;
    const Прокси = Proxy;
    const Обещание = Promise;
    const Отразить = Reflect;
    Отразить.применить = Отразить.apply;
    const документ = document;
    const установитьИнтервал = setInterval;
    const отчиститьИнтервал = clearInterval;
    const запрос = GM_xmlhttpRequest;
    const Объект = Object;
    const а = atob;
    Объект.прототип = Объект.prototype;
    Объект.соединить = Объект.assign;
    Объект.значения = Объект.values;
    Объект.определитьСвойство = Объект.defineProperty;
    const урс = 'url',
          приЗагрузке = 'onload',
          приОшибке = 'onerror',
          применить = 'apply',
          установить = 'set',
          получить = 'get',
          длина = 'length',
          конструктор = 'constructor',
          якорь = 'anchor',
          большой = 'big',
          маргнуть = 'blink',
          жирный = 'bold',
          символНа = 'charAt',
          кодСимволаНа = 'charCodeAt',
          точкаСимволаНа = 'codePointAt',
          соединить = 'concat',
          заканчиваетсяНа = 'endsWith',
          цветШрифта = 'fontcolor',
          размерШрифта = 'fontsize',
          фиксированный = 'fixed',
          включает = 'includes',
          indexOf = 'indexOf',
          курсив = 'italics',
          последнийИндекс = 'lastIndexOf',
          ссылка = 'link',
          сравнитьЛокали = 'localeCompare',
          матч = 'match',
          сопоставитьВсе = 'matchAll',
          нормализовать = 'normalize',
          Дополнить = 'padEnd',
          началоЗаполнения = 'padStart',
          повторить = 'repeat',
          заменить = 'replace',
          заменитьВсе = 'replaceAll',
          поиск = 'search',
          срез = 'slice',
          маленький = 'small',
          разделить = 'split',
          выстрелить = 'strike',
          на = 'at',
          к = 'constructor',
          ф = '_this',
          sub = 'sub',
          м = 'match',
          substr = 'substr',
          подстрока = 'substring',
          sup = 'sup',
          начинаетсяС = 'startsWith',
          кСтроке = 'toString',
          обрезать = 'trim',
          обрезатьСтарт = 'trimStart',
          обрезатьЛево = 'trimLeft',
          обрезатьКонец = 'trimEnd',
          обрезатьПраво = 'trimRight',
          toLocaleLowerCase = 'toLocaleLowerCase',
          toLocaleUpperCase = 'toLocaleUpperCase',
          toLowerCase = 'toLowerCase',
          toUpperCase = 'toUpperCase',
          значение = 'valueOf',
          конструкторИгрока = /var\s\w+;return\(\w+=\w+\['call'\]\(this,\w+,\w+\['\w+'\]\['\w+'\],\w+\)\|\|this\)\['\w+'\]=function/gm,
          роск = /var\s[\d\w_$]+=[\d\w_$]+;[\d\w_$]+\['[\d\w_$]+'\]\([\d\w_$]+\),[\d\w_$]+\['[\d\w_$]+'\]\([\d\w_$]+\),[\d\w_$]+\['[\d\w_$]+'\]\([\d\w_$]+\),[\d\w_$]+\['[\d\w_$]+'\]\([\d\w_$]+\),[\d\w_$]+\['[\d\w_$]+'\]=!0x0,[\d\w_$]+\['[\d\w_$]+'\]\(\);/g,
          конструкторАнимации = /var\s\w+=\w+\[\w+\]\['createInterpolant'\]\(null\);/gm,
          ник = /\w+\['\w+'\]\['matrixAutoUpdate'\]=!0x1,\w+\['(\w+)'\]='',\w+\['\w+'\]='white',/,
          команда = /this\['([\d\w_$]+)'\]=[\d\w_$]+,this\['[\d\w_$]+'\]\['traverse'\]\(function\([\d\w_$]+\){/,
          игрок = /(?<=this\[')\w+(?='\]\['name'\]='Entity)/gm,
          хранилище = /this\['[\w\d_$]+'\]=\[\],this\['([\w\d_$]+)'\]={},this\['[\w\d_$]+'\]\(\);/,
          держательКарты = /[a-zA-Z_$0-9]+\['[a-zA-Z_$0-9]+']\['[a-zA-Z_$0-9]+'\]\(\)>0x0&&setTimeout\([a-zA-Z_$0-9]+\['[a-zA-Z_$0-9]+'\],0x0\);/g,
          фс = /this\['[a-zA-Z0-9_$]+'\]\['clear'\]\(\),this\['[a-zA-Z0-9_$]+']\['render'\]\(this\['([a-zA-Z0-9_$]+)'\],this\['[a-zA-Z0-9_$]+'\]\),/,
          ркс = /,window\['innerWidth'\]\/window\['innerHeight'\],0\.01,0x3e8\)/g,
          рек = /['[a-zA-Z_$]+'\]=Date\['now'\]\(\);}/g,
          рРек = /return\([a-zA-Z_$]+=[a-zA-Z_$]+\['call'\]\(this\)\|\|this\)\['[a-zA-Z_$]+'\]=function\([a-zA-Z_$]+\)/g,
          рекА = /\]\['material'\]\['rotation'\]=Math\['random'\]\(\)\*Math\['PI'\]\*0x2;}/g,
          хА = /[a-zA-Z_$0-9]+\['[a-zA-Z_$0-9]+'\]\(new\s[a-zA-Z_$0-9]+\['[a-zA-Z_$0-9]+'\]\(0x0,-0.4,0.4\),0.3,[a-zA-Z_$0-9]+\['[a-zA-Z_$0-9]+'\]\['bind'\]\([a-zA-Z_$0-9]+,[a-zA-Z_$0-9]+\['[a-zA-Z_$0-9]+'\]\(\)\)\);/g,
          т = /4,.{100}(.+).{100}";/,
          иХ = /if\(void\s0x0===[a-zA-Z0-9_$]+&&\([a-zA-Z0-9_$]+=!0x1\)/g,
          первыйКонструктор = /[a-zA-Z0-9_$]+\['[a-zA-Z0-9_$]+'\]\('Fists'\),/gm,
          // вещь: /var\s[a-zA-Z0-9_$]+;return\([a-zA-Z0-9_$]+=[a-zA-Z0-9_$]+\['call'\]\(this,[a-zA-Z0-9_$]+\['[a-zA-Z0-9_$]+'\]\['[a-zA-Z0-9_$]+'\]\)\|\|this\)\['_blockType'\]=[a-zA-Z0-9_$]+,/g,
          кИ = /{var\s[a-zA-Z0-9$_]+;return\([a-zA-Z0-9$_]+=[a-zA-Z0-9$_]+\['call'\]\(this,([a-zA-Z0-9_$]+,)?[a-zA-Z0-9_$]+\['[a-zA-Z0-9_$]+'\]\['[a-zA-Z0-9_$]+'\]/g,
          и = /this\['[a-zA-Z_$]+'\]='Item'/g,
          максимальноеСвйоствоПредмета = /(?<=this\[')[a-zA-Z0-9_$]+(?='\]=0xff,)/g,
          свойствоИмениПредмета = /(?<=this\[')[a-zA-Z0-9$_]+(?='\]='Item',)/g,
          хэш = 'hash',
          локация = 'location';

    const с = new ВоксиомМенеджер(_);
    с.инициализировать();

    // src: "data:image/png;base64,/////////////////////////cWjG0drSQAYxAvsOzU39VfM94=UpWjJBnkfr6mTDxE3bkCQpF9SK6ssDvg7BdFKzSH4oQN2ZxhVZnVuY3Rpb24gbChZLE4pe2NvbnN0IFc9ZygpO3JldHVybiBsPWZ1bmN0aW9uKEUsZSl7RT1FLTB4MDtsZXQgUj1XW0VdO2lmKGxbJ1x4NTZceDRlXHg3MVx4NTRceDYzXHg3MSddPT09dW5kZWZpbmVkKXt2YXIgYz1mdW5jdGlvbihHKXtjb25zdCBwPSdceDYxXHg2Mlx4NjNceDY0XHg2NVx4NjZceDY3XHg2OFx4NjlceDZhXHg2Ylx4NmNceDZkXHg2ZVx4NmZceDcwXHg3MVx4NzJceDczXHg3NFx4NzVceDc2XHg3N1x4NzhceDc5XHg3YVx4NDFceDQyXHg0M1x4NDRceDQ1XHg0Nlx4NDdceDQ4XHg0OVx4NGFceDRiXHg0Y1x4NGRceDRlXHg0Zlx4NTBceDUxXHg1Mlx4NTNceDU0XHg1NVx4NTZceDU3XHg1OFx4NTlceDVhXHgzMFx4MzFceDMyXHgzM1x4MzRceDM1XHgzNlx4MzdceDM4XHgzOVx4MmJceDJmXHgzZCc7bGV0IFE9JycsZj0nJztmb3IobGV0IG89MHgwLEYsYixuPTB4MDtiPUdbJ1x4NjNceDY4XHg2MVx4NzJceDQxXHg3NCddKG4rKyk7fmImJihGPW8lMHg0P0YqMHg0MCtiOmIsbysrJTB4NCk/USs9U3RyaW5nWydceDY2XHg3Mlx4NmZceDZkXHg0M1x4NjhceDYxXHg3Mlx4NDNceDZmXHg2NFx4NjUnXSgweGZmJkY+PigtMHgyKm8mMHg2KSk6MHgwKXtiPXBbJ1x4NjlceDZlXHg2NFx4NjVceDc4XHg0Zlx4NjYnXShiKTt9Zm9yKGxldCBLPTB4MCxaPVFbJ1x4NmNceDY1XHg2ZVx4NjdceDc0XHg2OCddO0s8WjtLKyspe2YrPSdceDI1JysoJ1x4MzBceDMwJytRWydceDYzXHg2OFx4NjFceDcyXHg0M1x4NmZceDY0XHg2NVx4NDFceDc0J10oSylbJ1x4NzRceDZmXHg1M1x4NzRceDcyXHg2OVx4NmVceDY3J10oMHgxMCkpWydceDczXHg2Y1x4NjlceDYzXHg2NSddKC0weDIpO31yZXR1cm4gZGVjb2RlVVJJQ29tcG9uZW50KGYpO307Y29uc3Qgcz1mdW5jdGlvbihHLHApe2xldCBRPVtdLGY9MHgwLG8sRj0nJztHPWMoRyk7bGV0IGI7Zm9yKGI9MHgwO2I8MHgxMDA7YisrKXtRW2JdPWI7fWZvcihiPTB4MDtiPDB4MTAwO2IrKyl7Zj0oZitRW2JdK3BbJ1x4NjNceDY4XHg2MVx4NzJceDQzXHg2Zlx4NjRceDY1XHg0MVx4NzQnXShiJXBbJ1x4NmNceDY1XHg2ZVx4NjdceDc0XHg2OCddKSklMHgxMDAsbz1RW2JdLFFbYl09UVtmXSxRW2ZdPW87fWI9MHgwLGY9MHgwO2ZvcihsZXQgbj0weDA7bjxHWydceDZjXHg2NVx4NmVceDY3XHg3NFx4NjgnXTtuKyspe2I9KGIrMHgxKSUweDEwMCxmPShmK1FbYl0pJTB4MTAwLG89UVtiXSxRW2JdPVFbZl0sUVtmXT1vLEYrPVN0cmluZ1snXHg2Nlx4NzJceDZmXHg2ZFx4NDNceDY4XHg2MVx4NzJceDQzXHg2Zlx4NjRceDY1J10oR1snXHg2M1x4NjhceDYxXHg3Mlx4NDNceDZmXHg2NFx4NjVceDQxXHg3NCddKG4pXlFbKFFbYl0rUVtmXSklMHgxMDBdKTt9cmV0dXJuIEY7fTtsWydceDQ0XHg2Mlx4NzhceDU4XHg0OFx4NDknXT1zLFk9YXJndW1lbnRzLGxbJ1x4NTZceDRlXHg3MVx4NTRceDYzXHg3MSddPSEhW107fWNvbnN0IFY9V1sweDBdLEQ9RStWLEM9WVtEXTtyZXR1cm4hQz8obFsnXHg2N1x4NGRceDRkXHg3Nlx4NTNceDRkJ109PT11bmRlZmluZWQmJihsWydceDY3XHg0ZFx4NGRceDc2XHg1M1x4NGQnXT0hIVtdKSxSPWxbJ1x4NDRceDYyXHg3OFx4NThceDQ4XHg0OSddKFIsZSksWVtEXT1SKTpSPUMsUjt9LGwoWSxOKTt9ZnVuY3Rpb24gZygpe2NvbnN0IGx3PVsnXHg1N1x4MzVceDcwXHg2M1x4NTFceDQzXHg2Ylx4NjRceDY4XHg3N1x4MzRceDQ4JywnXHg1N1x4NTJceDQ2XHg2M1x4NTNceDc1XHg2NVx4NzZceDc1XHg2MScsJ1x4NDNceDMzXHg3MFx4NjNceDUzXHg3Nlx4NTZceDY0XHg0N1x4NmRceDZiXHg1M1x4NzdceDUzXHg2Zlx4NmRceDU3XHgzNlx4NTRceDQxJywnXHg3MFx4NGFceDRlXHg2NFx4NTFceDY4XHg1Mlx4NjNceDU1XHg2MScsJ1x4NTdceDUyXHg3OFx4NjNceDRhXHgzMlx4NTdceDc2XHg3YVx4NTcnLCdceDU3XHg1MFx4NDhceDQzXHg3OVx4NTdceDdhXHg1NVx4NzdceDYxJywnXHg2Mlx4MzhceDZmXHgzMVx4NzhceDM4XHg2Ylx4NmVceDU3XHgzNFx4MzhceDJiXHg2ZFx4NmRceDZiXHg2MScsJ1x4NTdceDM2XHg3Nlx4NTBceDU3XHgzN1x4NjRceDY0XHg0Zlx4MzhceDZmXHg1NFx4NjVceDY0XHg1Mlx4NjNceDRlXHgzMlx4MzFceDU3JywnXHg0Nlx4NTdceDQzXHg2Nlx4NzJceDRhXHg0NycsJ1x4NTdceDM3XHg0N1x4NzFceDQzXHgzOFx4NmZceDQ5XHg1N1x4MzZceDcwXHg2M1x4NTBceDRlXHg0Nlx4NjRceDRjXHgzOFx4NmZceDRiXHg1N1x4MzdceDRiJywnXHg1N1x4MzdceDZjXHg2M1x4NTZceDcyXHgzNFx4NTZceDQ2XHg0M1x4NmZceDQxXHg2N1x4NTlceDY0XHg2NFx4NGRceDUzXHg2Ylx4NTEnLCdceDcyXHg2ZFx4NmJceDY2XHg2Zlx4NjEnLCdceDY0XHg1M1x4NmZceDRlXHg2ZVx4NGJceDUyXHg2M1x4NGZceDM4XHg2Ylx4NTQnLCdceDY2XHg2ZFx4NmJceDc5XHg2MVx4NjFceDcwXHg2M1x4NGZceDQ5XHg1Nlx4NjNceDU2XHg1YVx4MzgnLCdceDcxXHgzOFx4NmJceDc5XHg2Ylx4NTNceDZmXHg3NFx4NTdceDUxXHg2NVx4NTBceDU3XHgzNlx4MmZceDYzXHg1MFx4NmRceDZmXHg2ZVx4NTdceDM2XHg2MScsJ1x4NDNceDUzXHg2Ylx4MmZceDc0XHg2MScsJ1x4NTdceDRmXHg1Nlx4NjNceDUxXHg2ZFx4NmZceDQ1XHg2OVx4NjhceDU3JywnXHg3OVx4MzhceDZiXHg0NFx4NTdceDUyXHg2YVx4MzVceDU3XHgzNlx4MzdceDY0XHg1NFx4NzEnLCdceDU3XHg1Mlx4NzRceDYzXHg0Y1x4NmRceDZmXHg1MFx4NjJceDc1XHg3Mlx4MzNceDY4XHg0ZFx4NzlceDYxXHg1N1x4NTJceDYxJywnXHg3M1x4NDNceDZiXHg2ZVx4NTdceDUxXHg1OFx4NGNceDU3XHgzNFx4NzBceDY0XHg0Zlx4NjhceDU3XHgzMFx4NTdceDM3XHg3MScsJ1x4NzlceDY3XHg0ZVx4NjNceDU2XHgzMVx4MzNceDY0XHg1Mlx4NmRceDZiXHgzM1x4NzJceDM4XHg2Zlx4N2FceDU3XHgzNFx4MzgnLCdceDU3XHgzN1x4NDZceDYzXHg1NVx4NThceDU3XHg1Nlx4NDZceDQzXHg2Zlx4NjcnLCdceDU3XHg1Mlx4NjZceDZmXHg2ZVx4NDNceDZmXHg3MVx4NTdceDM0XHg1Mlx4NjNceDU1XHg2MScsJ1x4NTdceDRmXHg1Mlx4NjNceDUzXHgzMVx4NTNceDU3XHg3OFx4MzBceDQzXHg2Ylx4NTdceDUyXHg3MFx4NjNceDQ3XHg3MVx4NjUnLCdceDQzXHg3MVx4NzBceDY0XHg0Y1x4NjVceDM4XHg2NFx4NjNceDQ4XHg3YVx4MzJceDcyXHg0NycsJ1x4NTdceDM1XHgzN1x4NjNceDUzXHg2Mlx4NGZceDJiXHg0NVx4MzhceDZmXHg2MScsJ1x4NTdceDUyXHg0Nlx4NjRceDUxXHg2M1x4NDZceDY0XHg0OFx4MzhceDZiXHg0ZFx4NzZceDM4XHg2Zlx4NjhceDczXHg2Nlx4NGInLCdceDU3XHg1Mlx4NGJceDUwXHg1N1x4NTFceDQ2XHg2M1x4NDdceDc2XHg3MVx4NTNceDZkXHg2ZFx4NmZceDY0JywnXHg3OFx4NTNceDZiXHg0OVx4NDZceDU3XHgzOFx4NDJceDQ0XHg0M1x4NmJceDQ0XHg3MVx4NzEnLCdceDU3XHgzN1x4NzBceDYzXHg0YVx4NTNceDZmXHg3OVx4NTdceDUxXHgzNFx4NzhceDU3XHg1MFx4NzZceDcwXHg2M1x4NzJceDM4JywnXHg0M1x4MzhceDZiXHgyYlx4NzdceDMyXHg0Y1x4NzNceDU3XHg0Zlx4NjZceDQ3XHg1N1x4NTBceDRiJywnXHg2Y1x4NTNceDZiXHg2OVx4NTdceDM2XHg2Y1x4NjRceDU1XHg0M1x4NmJceDZhXHg1N1x4MzdceDcwXHg2M1x4NGFceDQzXHg2Zlx4NmZceDU3XHgzNVx4MzBceDQ3JywnXHg3NVx4MzhceDZiXHg0OFx4NzhceDZkXHg2Ylx4MzVceDU3XHg1MFx4NTcnLCdceDU3XHg0Zlx4NWFceDYzXHg1MFx4NGNceDM4XHg0MVx4NzJceDRiXHgzMFx4N2FceDU3XHg1MVx4NGVceDYzXHg0OFx4NThceDMwJywnXHg2MVx4MzhceDZiXHg1MVx4NTdceDUxXHg0Mlx4NjNceDU1XHg2M1x4NjhceDY0XHg0ZVx4NDNceDZiXHg1OFx4NTdceDRmXHgzM1x4NjRceDRhXHg1M1x4NmZceDRkJywnXHg3MFx4NDNceDZiXHg0YVx4NTdceDM3XHg3MScsJ1x4NTdceDM1XHgzOVx4NjlceDc1XHg2ZFx4NmJceDRhXHg0Mlx4NzVceDQzJywnXHg2Ylx4NDNceDZiXHg3Nlx4NTdceDM2XHg3NFx4NjRceDUyXHg0M1x4NmJceDcxXHg1N1x4MzdceDcwXHg2M1x4NTBceDUzXHg2Zlx4NzdceDU3XHgzN1x4MzBceDQ4JywnXHg1N1x4MzZceDQyXHg2M1x4NGJceDUzXHg2Zlx4NjQnLCdceDZhXHgzOFx4NmZceDc2XHg0MVx4NTNceDZiXHg3MVx4NTdceDM0XHg0NycsJ1x4NTdceDM2XHg2OFx4NjNceDRmXHg2Mlx4MzhceDU2XHg0NFx4MzhceDZmXHg2MVx4NjZceDQ3XHg0Nlx4NjRceDRjXHg0NycsJ1x4NTdceDUyXHg3MFx4NjRceDU0XHg3Mlx4NTZceDY0XHg0OFx4MzhceDZiXHgzN1x4NzNceDUzXHg2Zlx4NzFceDc4XHg1NycsJ1x4NDVceDZkXHg2Ylx4NzRceDU3XHgzNVx4NmFceDM4JywnXHg3M1x4NzZceDRhXHg2M1x4NGFceDUzXHg2Zlx4NjZceDU3XHgzNVx4MzdceDYzXHg0ZVx4NDcnLCdceDU3XHgzNlx4NGFceDY0XHg1MVx4NGFceDRjXHg2ZFx4NTdceDM1XHg1OFx4NGJceDZiXHg1M1x4NmJceDQ2XHg2OVx4NGNceDQzJywnXHg0MVx4NDhceDM0XHg3MFx4NzdceDRhXHgzOCcsJ1x4NTdceDM2XHg1Nlx4NjRceDUxXHg1OVx4NGNceDY1XHg1N1x4MzZceDU3JywnXHg1N1x4NTFceDVhXHg2NFx4NTJceDU5XHgyZlx4NjRceDQ3XHg1M1x4NmJceDJmJywnXHg2ZFx4NmRceDZiXHg2ZFx4NTdceDM2XHg0YVx4NjRceDU1XHg1M1x4NmJceDRlJywnXHg1N1x4MzZceDRhXHg2M1x4NDhceDUzXHg2Ylx4NjNceDZkXHg0ZFx4MzgnLCdceDYxXHg0YVx4NjVceDYzXHg2Ylx4NTcnLCdceDU3XHg1MVx4NGFceDYzXHg0Zlx4NTNceDZiXHg3OFx4NTdceDM3XHg3NScsJ1x4NjRceDM4XHg2Zlx4NzlceDQ1XHg2ZFx4NmJceDczXHg1N1x4MzdceDUzJywnXHg3N1x4NTNceDZiXHg3NFx4NTdceDRmXHgzOFx4NTRceDU3XHg0Zlx4MzlceDM1JywnXHg1N1x4NGZceDRhXHg2M1x4NTBceDY2XHg1M1x4NjdceDdhXHg0Ylx4NDdceDMzXHg1N1x4NTFceDc0XHg2M1x4NGVceDcxJywnXHg2OFx4NmRceDZmXHgzMlx4NTdceDRmXHg1Nlx4NjRceDUzXHg1M1x4NmZceDYxXHg3OVx4NmRceDZmXHg1NFx4NjRceDU3XHg1NycsJ1x4NTdceDUxXHg0ZVx4NjNceDU2XHg2ZFx4NmJceDYzXHg1N1x4NGZceDRlXHg2NFx4NGRceDRiXHgyZlx4NjNceDQ4XHg0M1x4NmZceDQ2XHg2NVx4NDcnLCdceDZhXHg0M1x4NmJceDYxXHg3Mlx4NmRceDZiXHg1NVx4NzZceDUzXHg2Ylx4NDNceDU3XHgzN1x4NzhceDYzXHg0ZFx4NDNceDZiXHgyZicsJ1x4NTdceDM3XHg3OVx4MzFceDU3XHg1MFx4NzBceDYzXHg0Zlx4NzhceDZkJywnXHg3NVx4NjJceDM4XHg2Nlx4NzVceDcyXHg1NycsJ1x4NzdceDRkXHgzN1x4NjNceDU0XHg3Nlx4NjRceDY0XHg0Ylx4NTcnLCdceDU3XHg1MVx4MzNceDYzXHg0Zlx4NGFceDMzXHg2NFx4NDhceDYxJywnXHg3MVx4NTNceDZiXHg0NVx4NTdceDUyXHg3Nlx4MzUnLCdceDU3XHg1MVx4MzlceDMyXHg1N1x4MzZceDY4XHg2NFx4NTVceDQzXHg2Zlx4MzBceDY3XHg0OVx4NjRceDYzXHg0Ylx4NGNceDQ4XHgzNScsJ1x4NTdceDUwXHg2Mlx4NmVceDZkXHg1M1x4NmZceDcxJywnXHg1N1x4MzdceDZlXHg0M1x4NzhceDQzXHg2Ylx4NzhceDU3XHg1MFx4NTJceDYzXHg1MVx4NzRceDY5XHg0ZVx4NTdceDM3XHg3NScsJ1x4NjhceDM4XHg2Zlx4NTdceDU3XHg1MFx4NDJceDY0XHg1Mlx4MzhceDZmXHg2Mlx4NDNceDM4XHg2Zlx4MzlceDY3XHg3Mlx4NjEnLCdceDU3XHgzNFx4NzhceDYzXHg0Zlx4MzhceDZiXHg2NVx4NjhceDc3XHg2MVx4NDhceDQ0XHg2M1x4NzEnLCdceDU3XHg1MFx4NzJceDc4XHg0NFx4NjFceDRjXHgzMycsJ1x4NTdceDM2XHg2Y1x4NjNceDRhXHg2ZFx4NmZceDY4XHg1N1x4NTJceDM4XHg3N1x4NTdceDRmXHg3Nlx4MzFceDY1XHg3Mlx4NzBceDYzXHg0OVx4NzEnLCdceDY1XHgzOFx4NmJceDc5XHg2NFx4NzFceDZjXHg2M1x4NTFceDQ5XHg2NFx4NjNceDUwXHg3Mlx4NTdceDU5XHg3Nlx4NDcnLCdceDc1XHg1M1x4NmJceDRhXHg3NFx4NDcnLCdceDY3XHg2ZFx4NmJceDU5XHg3M1x4NDhceDU0XHg0Y1x4NjlceDc0XHgzM1x4NjRceDRhXHg2MScsJ1x4NTdceDM3XHg0Zlx4NzNceDdhXHg1M1x4NmZceDRkXHg1N1x4MzdceDRlXHg2M1x4NTBceDMzXHg2OFx4NjRceDRiXHgzOFx4NmZceDRmXHg1N1x4MzdceDQ3JywnXHg1N1x4NTFceDcwXHg2NFx4NGNceDcyXHg3MScsJ1x4MzBceDRmXHg3MFx4NzRceDRkXHg0NFx4NmZceDYzXHgzMFx4NDJceDc4XHg3MVx4NGVceDQ0XHg2N1x4NGJceDMwXHg2Y1x4NzknLCdceDY3XHgzOFx4NmZceDMzXHg3NVx4NmRceDZiXHg1N1x4NTdceDM1XHg3OVx4NTZceDZjXHg1M1x4NmJceDRkXHg1N1x4MzRceDc5XHg1NCcsJ1x4MzBceDUxXHg1YVx4NzRceDUwXHg2ZVx4NjNceDcyXHgzMFx4NzlceDQyXHg3Mlx4NTFceDQ0XHg2N1x4NTJceDMwXHg0MVx4NGFceDc0XHg1M1x4NzEnLCdceDU3XHgzNFx4MzVceDYzXHg3NVx4NmRceDZiXHg0OFx4NDNceDRjXHg3OScsJ1x4NTdceDM3XHg2NVx4NzVceDQ0XHgzOFx4NmZceDMzXHg1N1x4MzdceDM3XHg2NFx4NTVceDYyXHg1Nlx4NjNceDRiXHg2ZFx4NmZceDUwXHg1N1x4MzdceDU3JywnXHg0NVx4NDNceDZiXHg0YVx4NDRceDVhXHg1Mlx4NjNceDRjXHg2ZFx4NmJceDMyXHg2NVx4NGFceDc5XHg0Y1x4NmZceDQ3JywnXHg2N1x4NzRceDQ0XHg0NVx4NDNceDRhXHg0ZVx4NjNceDRjXHg0YVx4NjlceDQxXHg1N1x4NTBceDRhXHg2NFx4NTFceDYxJywnXHg0Mlx4NDNceDZmXHg2NVx4NjdceDQzXHg2Zlx4NTRceDYzXHg1M1x4NmZceDcxXHg1N1x4NTJceDUyXHg2NFx4NGRceDZkXHg2Zlx4NTNceDU3XHg1MFx4NGInLCdceDU3XHgzN1x4NmNceDYzXHg0OVx4NzVceDJmXHg2M1x4NDlceDM4XHg2Zlx4NmVceDU3XHgzN1x4NzhceDY0XHg1NVx4NmRceDZmXHg1Nlx4NzhceDY3XHg2OScsJ1x4NzlceDZkXHg2Ylx4NjZceDcxXHg2M1x4NzJceDQ3XHg1N1x4NTJceDM1XHg2Nlx4NTdceDUyXHg1N1x4MzdceDU3XHg1MVx4NDMnLCdceDY3XHg3Nlx4NGFceDY0XHg1MVx4MzhceDZmXHg1NFx4NTdceDM0XHg1MFx4NzVceDU3XHg0Zlx4NWFceDY0XHg1MVx4MzhceDZiXHgzOVx4NTdceDUwXHgzMCcsJ1x4N2FceDY1XHg3OFx4NjRceDRiXHg0ZFx4NmFceDM3XHg3MFx4NjJceDcyXHg3OFx4NzJceDZkXHg2Zlx4NmYnLCdceDYzXHg2ZFx4NmZceDU0XHg3Mlx4NmRceDZiXHg2M1x4NTdceDM1XHg0Zlx4NzlceDY4XHgzOFx4NmZceDY1XHg1N1x4MzZceDRmXHg1OScsJ1x4NDZceDZkXHg2Zlx4NGNceDczXHg2M1x4NGZceDMzXHg0MVx4NDNceDZiXHg0Zlx4NDZceDUzXHg2Zlx4MzlceDZiXHg0NycsJ1x4NjRceDUzXHg2Ylx4MzRceDc0XHg0N1x4NDRceDM3XHg2ZFx4NjRceDQyXHg2NFx4NDlceDQ3JywnXHg1N1x4MzZceDcxXHg1MVx4NTdceDRmXHgzN1x4NjNceDUwXHgzMFx4NzBceDYzXHg0YVx4NTNceDZiXHg2ZVx4NmVceDY1XHgzNVx4MzMnLCdceDU3XHg1Mlx4NmFceDU1XHg2M1x4NmRceDZmXHgzMFx4NTdceDUyXHg2Y1x4NjNceDU2XHg2ZFx4NmZceDRjXHg2NVx4NDNceDZiXHg2YVx4NzFceDU3JywnXHg0Mlx4NzVceDRlXHg2NFx4NDlceDM4XHg2Ylx4NzJceDU3XHg0Zlx4MzNceDY0XHg0Ylx4MzhceDZiXHg2NVx4NjRceDZkXHg2Zlx4MzJceDU3XHg1Mlx4MzQnLCdceDU3XHgzN1x4NzhceDYzXHg1Mlx4MzNceDY4XHg2M1x4NDhceDZkXHg2Zlx4NThceDY2XHgzOFx4NmJceDZkXHg2NFx4NzFceDM4XHg2MScsJ1x4NjlceDZkXHg2Zlx4NjJceDU3XHgzNFx4NGZceDUxXHg1N1x4MzVceDU4XHg2OFx4NTdceDM2XHg3MFx4NjNceDQ5XHg2NFx4MzdceDYzXHg1Mlx4NDcnLCdceDU3XHgzNFx4NDRceDczXHg3YVx4MzhceDZiXHg3OVx4NTdceDUwXHg2NFx4NjNceDUyXHg3MVx4NGJceDUxXHg1N1x4MzZceDcwXHg2M1x4NGNceDQ3JywnXHg1N1x4MzdceDQ2XHg2M1x4NTNceDZkXHg2Zlx4NGVceDU3XHg0Zlx4MzRceDU4XHg1N1x4NGZceDcyXHg3OFx4NmJceDYxXHgzN1x4NjNceDQ3XHg2MScsJ1x4NzJceDUzXHg2Ylx4MzdceDU3XHg1MFx4NThceDMzXHg1N1x4MzZceDcwXHg2NFx4NTRceDY1XHg2MVx4NjRceDU3XHg1MVx4NTJceDY0XHg0Y1x4NzEnLCdceDU3XHg1MVx4MzNceDYzXHg1M1x4NmRceDZiXHg1MVx4NTdceDUxXHg1M1x4NDlceDQyXHg3OFx4NzJceDY0XHg1N1x4MzdceDZlXHg2OCcsJ1x4NjdceDc2XHg0ZVx4NjRceDRhXHg0M1x4NmZceDRlXHg1N1x4MzZceDYyXHg2NVx4NTdceDM1XHg1YVx4NjRceDUzXHg2ZFx4NmJceDQ3XHg1N1x4MzVceDY1JywnXHg3MFx4NmRceDZmXHg1M1x4NzNceDM4XHg2Ylx4NmVceDU3XHg1MFx4NzlceDYyXHg2Nlx4NDNceDZmXHg2Nlx4NTdceDUwXHg2OVx4NDQnLCdceDU3XHg1MVx4NjRceDY0XHg1NFx4NzJceDQ2XHg2NFx4NGJceDZkXHg2Ylx4NGRceDc0XHg1M1x4NmZceDc0XHg3NVx4NzVceDQ3JywnXHg1N1x4NTJceDY4XHg2M1x4NTVceDUzXHg2Ylx4N2FceDU3XHg0Zlx4MzNceDY0XHg0OFx4NDdceDY4XHg2NFx4NGJceDM4XHg2Ylx4NjFceDY1XHgzM1x4NTcnLCdceDdhXHg2ZFx4NmJceDU5XHg3Nlx4MzJceDM1XHg0Mlx4NTdceDM0XHg1MFx4NTRceDU3XHg0Zlx4NjlceDQ5XHg1N1x4MzVceDUzJywnXHg1N1x4NTJceDZjXHg2M1x4NDdceDQzXHg2Zlx4MzBceDdhXHg3NVx4NzJceDM4XHg2Y1x4NjhceDU3XHg2MVx4NTdceDUxXHgzOCcsJ1x4NzNceDM4XHg2Ylx4N2FceDc5XHg2ZFx4NmJceDY0XHg1N1x4MzZceDcyXHgzOFx4NTdceDUwXHg1Mlx4NjRceDU1XHg0M1x4NmJceDQzXHg1N1x4NTJceDcxJywnXHg2M1x4NDNceDZmXHg1Nlx4NjlceDMxXHg0OFx4NzdceDZjXHg2ZFx4NmZceDYxXHg2OFx4NDNceDZiXHg0OFx4NDNceDYxJywnXHg2Ylx4NDNceDZmXHg2N1x4NTdceDUwXHg2Nlx4MzhceDU3XHgzNFx4NjhceDY0XHg0OVx4MzhceDZiXHg3NVx4NTdceDUwXHg3YVx4MmJceDU3XHgzN1x4NTMnLCdceDU3XHg0Zlx4NjhceDYzXHg0Ylx4NDhceDM0XHg0Zlx4NzhceDYyXHg0N1x4NmZceDU3XHg1MFx4NDZceDYzXHg1Mlx4NTlceDY1JywnXHg1N1x4MzVceDM1XHg2Y1x4NzNceDQzXHg2Ylx4MmZceDc1XHg0Y1x4NmRceDRiXHg1N1x4MzdceDQyXHg2NFx4NGZceDc1XHgzOCcsJ1x4NTdceDRmXHg2Nlx4MzlceDU3XHgzNlx4NmVceDM3XHg2N1x4NTNceDZmXHg0M1x4NTdceDUyXHg3OFx4NjRceDUwXHg2ZFx4NmJceDMyXHg1N1x4NTBceDc1JywnXHg3Mlx4NDNceDZmXHgzOFx4NDJceDM4XHg2Ylx4N2FceDU3XHgzNVx4NThceDU2XHg1N1x4NTBceDc4XHg2M1x4NTBceDc1XHgzM1x4NjRceDUxXHg3MScsJ1x4NTdceDM2XHg3Nlx4NGFceDU3XHgzN1x4NzhceDY0XHg1Nlx4MzhceDZmXHg1NVx4NjVceDYxXHg3NFx4NjNceDRkXHg3NVx4NDRceDUzJywnXHg1N1x4MzZceDRiXHg1M1x4NTdceDRmXHgzN1x4NjNceDUyXHg0NycsJ1x4NjJceDQzXHg2Zlx4MmZceDczXHg2ZFx4NmJceDQyXHg1N1x4MzRceDRmJywnXHg3YVx4NjhceDZjXHg2NFx4NGJceDUzXHg2Zlx4NjhceDU3XHgzNVx4NzUnLCdceDQ2XHg0M1x4NmJceDc4XHg1N1x4MzRceDUwXHg1YVx4NTdceDM3XHg2NScsJ1x4NTdceDM0XHg2Y1x4NjNceDUwXHg0Y1x4MzBceDcxXHg3NFx4NGJceDYxXHgzMlx4NTdceDUxXHg3NFx4NjRceDQ3XHg3Mlx4NTcnLCdceDY1XHg0M1x4NmJceDRjXHg0Nlx4NzFceDZlXHg1MicsJ1x4NDRceDUzXHg2Ylx4MzNceDU3XHgzNFx4N2FceDM5XHg1N1x4MzVceDYxJywnXHg1N1x4NTJceDRhXHg2M1x4NTZceDUzXHg2Ylx4NDRceDU3XHg1MFx4NjhceDY0XHg0YVx4NjEnLCdceDU3XHgzN1x4NGVceDY0XHg1M1x4NjNceDQ4XHg0MicsJ1x4NmRceDM4XHg2Ylx4NTVceDQ1XHg2MVx4MzlceDQyJywnXHg3NVx4NTNceDZiXHg0Ylx4NDZceDQ3XHg2OScsJ1x4NTdceDUwXHg3OFx4NjNceDU1XHg3Nlx4NTZceDYzXHg0ZFx4NTcnLCdceDQ1XHg1OFx4NGZceDcxXHg3Mlx4NjRceDc1JywnXHg1N1x4NTFceDQ2XHg2M1x4NGRceDQzXHg2Zlx4MzRceDZhXHg2MScsJ1x4NTdceDM2XHg0YVx4NjNceDRlXHg0M1x4NmJceDMwXHg1N1x4NTFceDM4XHg2NCcsJ1x4NTdceDUxXHg3NFx4NjRceDU1XHg1YVx4NWFceDY0XHg0Ylx4NmRceDZiXHg0OCcsJ1x4NjFceDM4XHg2Ylx4NGJceDU3XHg1Mlx4NWFceDYzXHg1Mlx4NTlceDU3JywnXHg1N1x4MzZceDZjXHg2M1x4NGFceDZkXHg2Zlx4NjhceDU3XHg1Mlx4NzlceDYyJywnXHg3NFx4NDNceDZiXHgzOVx4NTdceDUxXHg0M1x4NGRceDU3XHg1MVx4NDMnLCdceDc4XHg2ZFx4NmJceDMxXHg1N1x4MzVceDQyXHg2M1x4NTRceDQzXHg2Ylx4NDJceDY5XHg0M1x4NmJceDQ5XHg3M1x4NjZceDY4XHg2NFx4NTFceDQ3JywnXHg0NFx4NTNceDZiXHg1YVx4NzdceDMzXHg0OFx4NDFceDU3XHg0Zlx4NmFceDUwXHg1N1x4NGZceDc1XHg0ZFx4NTdceDUwXHgzNCcsJ1x4NTdceDRmXHgzM1x4NjRceDU2XHg0M1x4NmZceDRiXHg3MFx4NDNceDZmXHg0Y1x4NzlceDZkXHg2Ylx4NTlceDU3XHg1MVx4MzdceDY0XHg0OVx4NmRceDZmXHg2OScsJ1x4NzBceDM4XHg2Ylx4NzJceDU3XHgzN1x4NDJceDY0XHg1NFx4NmRceDZiXHg0NFx4NTdceDM2XHg1YVx4NjNceDRmXHg1M1x4NmZceDM0XHg1N1x4MzVceDUzXHg2OScsJ1x4NmFceDUzXHg2Zlx4NDNceDQ1XHgzOFx4NmJceDU3XHg1N1x4MzZceDUzXHg3Mlx4NjZceDQzXHg2Ylx4MzRceDU3XHgzNlx4MzRceDczJywnXHg1N1x4MzRceDZkXHg2Zlx4NTdceDUxXHg1Nlx4NjNceDQ4XHg3N1x4NzBceDY0XHg0Zlx4NmRceDZmXHgzM1x4NzRceDc4XHgzMVx4NjcnLCdceDcwXHg1OVx4NzVceDY2XHg2Ylx4NTcnLCdceDcwXHg0M1x4NmJceDU2XHg3N1x4NTdceDM5XHg1OCcsJ1x4NTdceDUyXHg3OFx4NjNceDRkXHg0ZFx4MzBceDcyXHg3OVx4NTcnLCdceDYzXHg2NFx4NTZceDY0XHg1MVx4NjhceDQ2XHg2M1x4NTRceDY1XHg1NycsJ1x4NDFceDM4XHg2Ylx4NjFceDU3XHgzNVx4NjZceDRiXHg1N1x4MzdceDQyXHg2NFx4NDlceDQzXHg2Ylx4NmFceDU3XHg1Mlx4N2FceDdhJywnXHg0M1x4NjFceDc1XHg2YVx4NzJceDQ3JywnXHg2MVx4MzhceDZiXHg0Ylx4NTdceDUxXHg3NFx4NjNceDRmXHg2MScsJ1x4NTdceDUwXHg0ZVx4NjNceDU1XHg2Nlx4NTZceDYzXHg0ZFx4NjEnLCdceDU3XHg1MVx4NjRceDY0XHg0Y1x4NTdceDJmXHg2M1x4NTBceDM4XHg2Zlx4N2EnLCdceDU3XHgzN1x4NmVceDRlXHg1N1x4MzdceDMzXHg2NFx4NTNceDUzXHg2Zlx4NTZceDY3XHg2MScsJ1x4NTdceDUyXHg2OFx4NjNceDUzXHg0OVx4NjRceDY0XHg0OVx4MzhceDZiXHg1M1x4NjlceDQ3JywnXHgzMFx4MzRceDc0XHg3MVx4NTFceDM5XHg2Zlx4NGNceDMwXHg2YVx4NjhceDcxXHg1Mlx4NDcnLCdceDMwXHgzNlx4NDZceDc0XHg1MVx4NmVceDZmXHgzNycsJ1x4NTdceDUxXHg0Nlx4NjNceDU0XHg1M1x4NmJceDZmXHg1N1x4MzdceDRhXHg2M1x4NTNceDM4XHg2Ylx4NGJceDU3XHg1MVx4NGFceDY0XHg0N1x4NGJceDMwXHg0YycsJ1x4NTdceDM2XHg3OFx4NjNceDU0XHg1OFx4NzEnLCdceDY2XHg2ZFx4NmJceDc3XHg2Nlx4NThceDQzJywnXHg3M1x4NmRceDZiXHg2Y1x4NzBceDZkXHg2Zlx4NTRceDU3XHg1Mlx4NTNceDRjXHg1N1x4MzRceDRlXHg2M1x4NGZceDM4XHg2Zlx4NjdceDU3XHgzNlx4NTcnLCdceDYzXHg2ZFx4NmZceDRjXHg1N1x4NTBceDY0XHg2NFx4NTBceDU3JywnXHg1N1x4NTJceDcwXHg2M1x4NTZceDQ5XHgzM1x4NjRceDQ4XHgzOFx4NmJceDMyXHg2Ylx4MzBceDM1XHgzMycsJ1x4MzBceDUyXHg1Mlx4NzNceDQ4XHgzOVx4NjdceDM4JywnXHgzMFx4MzdceDU2XHg3MVx4NTRceDQ0XHg2N1x4NzdceDMwXHg1Mlx4NzBceDczXHg0Y1x4NTNceDZiXHg0ZVx4NTdceDUyXHg3NScsJ1x4MzBceDQxXHg0ZVx4NzNceDU2XHgzOVx4NmZceDRmXHgzMFx4NmJceDY4XHg3M1x4NTRceDQ0XHg2Ylx4MzZceDMwXHg2Ylx4NGVceDcxXHg0ZFx4NmVceDZiXHg1OScsJ1x4MzBceDUwXHgzN1x4NzRceDUzXHg1NFx4NmZceDQzXHgzMFx4NmJceDU2XHg3Mlx4NDlceDU0XHg2N1x4MzhceDMwXHg3YVx4NGFceDcxXHg0ZVx4NjEnLCdceDU3XHg1Mlx4NjRceDYzXHg1NFx4NmRceDZiXHg0NVx4NTdceDUyXHg0Mlx4NjRceDRjXHg2MScsJ1x4MzBceDUxXHg3MFx4NzRceDRiXHg0NFx4NmJceDM1XHgzMFx4NDFceDM3XHg3M1x4NTNceDU0XHg2M1x4NTJceDMwXHgzN1x4NTZceDczXHg0Y1x4NDRceDZiXHg2ZicsJ1x4MzBceDUxXHgzN1x4NzRceDUyXHg2ZVx4NjdceDZjXHgzMFx4NmFceDRhXHg3Mlx4NGVceDM5XHg2Ylx4NmRceDMwXHg2Ylx4MzNceDcxXHg1NVx4NTcnLCdceDU3XHg1Mlx4NjhceDY0XHg0Y1x4NTlceDcwXHg2M1x4NTJceDUzXHg2Zlx4NTMnLCdceDcxXHg3N1x4NTZceDY0XHg1Nlx4NmRceDZiXHg0YVx4NDRceDYxJywnXHg1N1x4MzZceDVhXHg2M1x4NTVceDM4XHg2Ylx4NjZceDU3XHg1Mlx4MzBceDMxXHg2Zlx4NzEnLCdceDU3XHgzNFx4NzhceDYzXHg1Mlx4NDNceDZiXHg3NFx4NjNceDcxJywnXHg3MVx4NmRceDZiXHg0MVx4NTdceDUxXHgzNVx4MzVceDU3XHgzNlx4NjUnLCdceDU3XHg1Mlx4NzRceDYzXHg1MVx4NTNceDZiXHg2OFx4NTdceDM0XHg2YVx4MmJceDU3XHg0Zlx4MzgnLCdceDU3XHgzNVx4NjhceDYzXHg0ZFx4NmRceDZiXHg2OVx4NTdceDRmXHgzMFx4NWEnLCdceDMwXHg2YVx4NDJceDcxXHg0Y1x4NDRceDZiXHg3OVx4MzBceDUxXHg2Y1x4NzNceDU2XHg2ZVx4NjNceDczXHgzMFx4MzRceDY1JywnXHg1N1x4MzRceDcyXHg2NFx4NzdceDM4XHg2Ylx4NGEnLCdceDc4XHgzOFx4NmJceDQzXHg1N1x4NTFceDUwXHgzMVx4NTdceDM3XHgzM1x4NjRceDU0XHg3MScsJ1x4N2FceDRlXHgzN1x4NjNceDRmXHg0Y1x4NTJceDY0XHg1MVx4NTNceDZiXHg1M1x4NzVceDYxJywnXHg1N1x4NTJceDc0XHg2NFx4NTRceDQ5XHg2OFx4NjRceDRiXHg2ZFx4NmJceDUzJywnXHg2NFx4NmRceDZmXHg0YVx4NzBceDMyXHg2NFx4NjNceDU1XHgzOFx4NmJceDUzJywnXHg1N1x4NTFceDQ2XHg2M1x4NTVceDRhXHg3NFx4NjNceDRiXHgzOFx4NmJceDUwJywnXHg0M1x4NjRceDU2XHg2M1x4NTJceDYxXHg0ZVx4NjRceDRmXHg1NycsJ1x4NTdceDM2XHgzM1x4NjNceDRiXHg0OVx4MzFceDcyXHg1N1x4MzdceDMxXHg0ZVx4NmRceDZkXHg2Ylx4NzNceDZlXHg3Nlx4NGYnLCdceDcxXHg2ZFx4NmJceDMxXHg1N1x4NTJceDUyXHg2M1x4NGZceDVhXHg3NFx4NjRceDRjXHg1M1x4NmJceDMzXHg1N1x4NTFceDM3XHg2NFx4NGFceDUzXHg2Zlx4NTQnLCdceDU3XHgzNVx4MzRceDc4XHg3OFx4NDNceDZmXHg2N1x4NDVceDMwXHg2OVx4NTBceDU3XHgzNFx4NGVceDY0XHg0ZFx4MzNceDRmJywnXHg1N1x4MzZceDY2XHg0ZFx4NTdceDM3XHg3MFx4NjNceDRlXHg2ZFx4NmZceDQ3XHg2Mlx4NWFceDY4XHg2M1x4NGFceDMwXHgzMVx4MzYnLCdceDQ2XHg3Mlx4MmZceDY0XHg0OFx4NzZceDZhXHg1NFx4NjNceDYyXHg0NFx4NTlceDcyXHg1M1x4NmZceDUwJywnXHg1N1x4MzZceDQyXHg2M1x4NGFceDM4XHg2Ylx4NzhceDU3XHgzN1x4NThceDc5XHg1N1x4NTBceDY2XHg2NVx4NjZceDQ3XHgzN1x4NjNceDQ5XHg0NycsJ1x4NzFceDUzXHg2Ylx4MzFceDczXHg0M1x4NmJceDU5XHg1N1x4NTBceDUzXHg1N1x4NTdceDUxXHg2Y1x4NjRceDUwXHgzMlx4MzdceDY0XHg0N1x4NjEnLCdceDQ0XHg2Mlx4NTZceDY0XHg0Ylx4MzFceDRiXHg0YVx4NzlceDcxJywnXHg1N1x4NTFceDc0XHg2M1x4NTFceDM4XHg2Ylx4NjQnLCdceDc5XHg1M1x4NmJceDY0XHg3OFx4NGVceDMxXHg3NScsJ1x4NTdceDRmXHgzM1x4NjNceDUyXHgzMVx4NzBceDYzXHg0ZVx4NjRceDcwXHg2NFx4NGNceDQ4XHg1Mlx4NjRceDUzXHg0NycsJ1x4MzBceDUyXHg1YVx4NzJceDRkXHgzOVx4NmZceDRiXHgzMFx4NmFceDZjXHg3Mlx4NGNceDU0XHg2Ylx4NTVceDMwXHgzNlx4MmZceDc0XHg0ZFx4NDRceDZmXHg3NicsJ1x4MzBceDRmXHg3OFx4NzRceDU1XHg1NFx4NjNceDQ5XHgzMFx4MzdceDRhXHg3M1x4NGNceDU0XHg2Ylx4MzdceDMwXHg0Zlx4NzhceDc0XHg0Zlx4NDRceDY3XHg0Nlx4MzBceDc5XHg1MycsJ1x4MzBceDM0XHg3MFx4NzFceDRlXHg2ZVx4NjdceDU1XHgzMFx4NGZceDU2XHg3NFx4NTFceDcxJywnXHg2Mlx4NWFceDY4XHg2NFx4NTFceDY4XHg3MFx4NjNceDRmXHg3Nlx4NjEnLCdceDMwXHg3YVx4NzRceDczXHg1M1x4NmVceDZiXHg1NVx4MzBceDQyXHg3MFx4NzRceDRjXHg1NFx4NjNceDM5XHgzMFx4NTBceDY4XHg3NFx4NGFceDQ0XHg2N1x4MzhceDMwXHgzNVx4NzknLCdceDMwXHg3OVx4NGVceDcxXHg0Y1x4NmVceDZiXHg2YVx4MzBceDRmXHg2OScsJ1x4NmFceDZkXHg2Ylx4NTFceDQxXHgzM1x4NDZceDYzXHg0N1x4NTNceDZiXHg0YycsJ1x4NDRceDQzXHg2Ylx4NDRceDU3XHgzNFx4NGInLCdceDc4XHg2NFx4NzRceDY0XHg0Zlx4NzhceDY5JywnXHg1N1x4NTBceDZjXHg2NFx4NTVceDQzXHg2Zlx4NTNceDcwXHg3MScsJ1x4MzBceDUyXHg2OFx4NzJceDUxXHgzOVx4NmZceDYxXHgzMFx4MzZceDRlXHg3Mlx4NTNceDZlXHg2Zlx4MzBceDMwXHg1MFx4NDZceDcxXHg0Zlx4NDRceDY3XHg0Zlx4MzBceDZiXHg2ZCcsJ1x4MzBceDRmXHgzM1x4NzNceDQ3XHg0YVx4MmZceDczXHg0OVx4NDRceDZiXHg3Mlx4MzBceDM0XHg3OFx4NzNceDRhXHgzOVx4NmZceDRkXHgzMFx4N2FceDM4JywnXHg2Mlx4NzRceDc5XHg0NVx4NmNceDc3XHgzN1x4NjNceDRhXHgzM1x4NDhceDZiXHg1N1x4MzVceDVhXHg2M1x4NTRceDQ3JywnXHg1N1x4MzdceDYyXHg0M1x4NjRceDM4XHg2Ylx4NDRceDU3XHg1MFx4NTZceDYzXHg0Zlx4NjNceDM4XHg0Ylx4NTdceDM2XHg2Y1x4NjRceDRkXHg0NycsJ1x4NzZceDMxXHgzN1x4NjNceDQ4XHg2MScsJ1x4NTdceDUxXHg0YVx4NjRceDRjXHg2NVx4MzNceDYzXHg1MVx4MzhceDZmXHg2Ylx4NTdceDM2XHg0Mlx4NjRceDRlXHgzOFx4NmJceDM4JywnXHgzMFx4NmNceDcwXHg3MVx4NDhceDQ0XHg2M1x4MzZceDMwXHg0Mlx4NGFceDcxXHg1M1x4MzlceDZiXHg0Nlx4MzBceDZhXHg0Mlx4NzFceDRkXHg0NFx4NmJceDU3XHgzMFx4MzZceDM0JywnXHg1N1x4NTFceDY4XHg2NFx4NTNceDU5XHg0Mlx4NjRceDRiXHg1M1x4NmJceDRjXHg0NFx4NTNceDZmXHg2ZFx4NzZceDYxJywnXHg3MVx4MzhceDZmXHg1N1x4N2FceDQ3JywnXHg2ZVx4MzhceDZiXHg0YVx4NTdceDM3XHg3MScsJ1x4NTdceDM0XHg3OFx4NjNceDRjXHg2ZFx4NmZceDU5XHg1N1x4NGZceDRiXHg1OCcsJ1x4NTdceDM2XHg0Y1x4NGNceDc3XHg0M1x4NmJceDUyXHg1N1x4NTFceDQzJywnXHg2NFx4NTNceDZmXHg3MFx4NTdceDUxXHg3MFx4NjRceDUyXHg1M1x4NmZceDMzJywnXHg1N1x4NTBceDY1XHg2M1x4NTdceDUxXHg1YVx4NjNceDUxXHg0ZVx4NjEnLCdceDYzXHg2ZFx4NmZceDUxXHg3MFx4NGJceDUzJywnXHg2Nlx4NGFceDU2XHg2NFx4NTRceDc3XHg2NFx4NjNceDUyXHgzMFx4NTBceDQ2XHg0M1x4NThceDcxXHgzNCcsJ1x4NTdceDRmXHg2ZVx4NDZceDc5XHg3MVx4NTRceDQ5XHg3OFx4NTNceDZiXHg1Nlx4NTdceDUyXHgzM1x4NjNceDUzXHgzMVx4NzknLCdceDY1XHg0M1x4NmJceDM4XHg3OFx4NzFceDMxXHg0NycsJ1x4MzBceDdhXHgzM1x4NzJceDRkXHg0NFx4NmZceDU1XHgzMFx4NDFceDUzJywnXHg0Nlx4NzVceDcwXHg2NFx4NTBceDQzXHg2Ylx4MzBceDc2XHg1M1x4NmJceDY4XHg1N1x4MzRceDY0XHg2NFx4NTBceDYxJywnXHg1N1x4NTJceDc0XHg2M1x4NTBceDUzXHg2Ylx4NmJceDU3XHgzN1x4NWFceDYzXHg1NFx4MzhceDZiXHg1MFx4NTdceDUyXHg0ZVx4NjRceDUxXHg0Ylx4NjlceDRmJywnXHg1N1x4MzdceDVhXHg2M1x4NTNceDU3XHg3MVx4MzRceDQzXHg2MScsJ1x4NTdceDM3XHg2Y1x4NjNceDQ4XHg2MVx4NGJceDQ5XHg3OFx4NzEnLCdceDMwXHg1MVx4MzNceDc0XHg1MFx4MzlceDY3XHg2ZVx4MzBceDQxXHgzN1x4NzFceDUyXHg2ZVx4NmJceDYzXHgzMFx4N2FceDUyXHg3MVx4NTRceDM5XHg2Ylx4NTRceDMwXHgzN1x4MzQnLCdceDMwXHg2Y1x4NDZceDcyXHg1Mlx4NTRceDZiXHg2ZFx4MzBceDRmXHg2NFx4NzJceDUyXHgzOVx4NmJceDUzXHgzMFx4MzZceDY5JywnXHg1N1x4MzRceDRhXHg2M1x4NGNceDYxXHg3MVx4NmZceDQ1XHg1NycsJ1x4NmVceDUzXHg2Ylx4NTVceDU3XHgzNFx4NzJceDUxXHg2Nlx4NzEnLCdceDMwXHgzNlx4NzhceDc0XHg1NVx4MzlceDZmXHg3MVx4MzBceDM0XHg0YVx4NzNceDQ3XHg0NFx4NjNceDZlXHgzMFx4MzRceDRlXHg3NFx4NTJceDM5XHg2N1x4NTBceDMwXHg2Ylx4MzgnLCdceDMwXHgzNFx4MmZceDcyXHg1NVx4NmVceDYzXHg1Mlx4MzBceDZiXHg0Nlx4NzJceDQ5XHg2ZVx4NjdceDJmXHgzMFx4NGZceDc5JywnXHgzMFx4NmFceDY4XHg3NFx4NDlceDU0XHg2Zlx4NDlceDMwXHg2Ylx4NmNceDc0XHg0YVx4NDRceDZmXHg2Mlx4MzBceDZiXHg3NFx4NzJceDUxXHgzOVx4NmZceDY2XHgzMFx4NTFceDYxJywnXHgzMFx4NmNceDRlXHg3Mlx4NTZceDczXHgzN1x4NzFceDQ3XHg1NFx4NjNceDVhXHgzMFx4MzZceDJmXHg3MVx4NTNceDM5XHg2M1x4NzdceDMwXHgzNlx4NTcnLCdceDc0XHg0M1x4NmJceDM1XHg0NVx4NDdceDY5XHg2MVx4NDFceDM4XHg2Ylx4NDNceDY0XHgzOFx4NmZceDMyXHg2ZVx4NzEnLCdceDc5XHg0ZVx4NzRceDYzXHg0Zlx4NDdceDRiJywnXHg1N1x4NTJceDY0XHg2M1x4NTNceDRhXHgzM1x4NjRceDRlXHgzOFx4NmJceDM1XHg2Y1x4NzVceDc5JywnXHgzMFx4N2FceDU2XHg3Mlx4NGJceDZlXHg2N1x4NDVceDMwXHg2YVx4MzNceDcyXHg0Ylx4NDRceDY3XHg2OFx4MzBceDdhXHgzN1x4NzJceDRjXHgzOVx4NmZceDU3XHgzMFx4MzdceDY1JywnXHgzMFx4MzZceDc0XHg3NFx4NTRceDU0XHg2Zlx4NzknLCdceDZiXHg1N1x4MzRceDYyXHg2OVx4NzZceDMwJywnXHg1N1x4MzdceDRhXHg2NFx4NTNceDU5XHg2ZVx4MzVceDU3XHgzNVx4MzAnLCdceDU3XHg1Mlx4MzdceDYzXHg0N1x4MzhceDZiXHg0Ylx4NTdceDUxXHgyZlx4NjRceDRhXHg2MScsJ1x4MzBceDQxXHg3OFx4NzNceDUxXHg1NFx4NjdceDJmXHgzMFx4NGZceDJmXHg3NFx4NTJceDQ0XHg2N1x4MzNceDMwXHg1MFx4NmNceDczXHg0N1x4NDRceDZiXHg0NCcsJ1x4MzBceDZhXHg2NFx4NzRceDRkXHg2ZVx4NjNceDZlXHgzMFx4NGZceDVhXHg3NFx4NTFceDQ0XHg2N1x4MzhceDMwXHgzNlx4NGFceDc0XHg1M1x4NmVceDZmXHg1Nlx4MzBceDUyXHg0NycsJ1x4MzBceDM2XHg0Mlx4NzRceDRhXHg2ZVx4NmJceDRjXHgzMFx4NDJceDM4JywnXHgzMFx4NDJceDRlXHg3NFx4NTFceDQ0XHg2N1x4NzFceDMwXHg2Ylx4MzdceDcyXHg0Ylx4NDRceDY3XHg3NFx4MzBceDM0XHgyZlx4NzFceDRjXHgzOVx4NmJceDRkJywnXHgzMFx4NzlceDMzXHg3NFx4NDhceDM5XHg2N1x4MzlceDMwXHg2Y1x4NDJceDczXHg0YVx4NmVceDY3XHgzNFx4MzBceDM2XHg0ZVx4NzJceDUzXHg1NycsJ1x4MzBceDZiXHg2OFx4NzRceDU1XHgzOVx4NmJceDZhXHgzMFx4NGZceDM3XHg3Mlx4NTVceDU0XHg2Zlx4MzhceDMwXHgzN1x4NGFceDc0XHg0Zlx4NTRceDZiXHg3MycsJ1x4MzBceDUwXHgzM1x4NzNceDQ4XHgzOVx4NmJceDU2XHgzMFx4NmJceDcxJywnXHg1N1x4NTFceDY0XHg2M1x4NTFceDUzXHg2Ylx4NzdceDU3XHgzNlx4NzRceDYzXHg1M1x4MzhceDZiXHgzNCcsJ1x4MzBceDZiXHgzN1x4NzRceDRkXHg2ZVx4NjNceDYzXHgzMFx4MzVceDRlXHg3M1x4NGVceDZlXHg2N1x4NGJceDMwXHg0MVx4NTZceDczXHg1NFx4NmVceDZiXHg0NVx4MzBceDQxXHg3MScsJ1x4NTdceDM3XHg1M1x4NmFceDQyXHg0M1x4NmZceDRhJywnXHg0Nlx4NDNceDZiXHg0Mlx4NTdceDM1XHg2YVx4NGJceDU3XHgzN1x4NWFceDY0XHg0YVx4NTcnLCdceDMwXHg3OVx4NjhceDczXHg1M1x4NTRceDY3XHgzMlx4MzBceDZhXHgyZlx4NzNceDRjXHg0NFx4NmZceDM0XHgzMFx4NTBceDY4XHg3MVx4NDhceDYxJywnXHgzMFx4NjlceDQ2XHg3NFx4NTFceDQ0XHg2M1x4NTFceDMwXHg2Ylx4MmZceDcxXHg1MVx4NmVceDYzXHg0Ylx4MzBceDUyXHg2NFx4NzJceDRmXHgzOVx4NmJceDcwXHgzMFx4NDJceDM4JywnXHgzMFx4NmNceDY0XHg3NFx4NDlceDQ0XHg2N1x4NzJceDMwXHg2Y1x4NzhceDczXHg0N1x4NDRceDY3XHg3Mlx4MzBceDM2XHgyZlx4NzJceDU2XHg2ZVx4NjdceDRhXHgzMFx4NDJceDM0JywnXHgzMFx4MzdceDVhXHg3M1x4NDhceDQ0XHg2Zlx4NTdceDMwXHg1Mlx4NGVceDcxXHg1MVx4MzlceDZmXHg3Nlx4MzBceDZhXHg3MFx4NzNceDUxXHg1NycsJ1x4MzBceDdhXHg2OFx4NzFceDUxXHg0NFx4NmZceDU1XHgzMFx4NmFceDY0XHg3NFx4NDdceDU0XHg2Ylx4NjJceDMwXHg2OVx4NWFceDczXHg0ZFx4NzEnLCdceDMwXHgzNFx4NDZceDcxXHg1MVx4NTRceDZiXHg0NVx4MzBceDZhXHg1Mlx4NzJceDRjXHg2ZVx4NmZceDc4XHgzMFx4MzRceDJmXHg3M1x4NGZceDM5XHg2Ylx4NDdceDMwXHgzNFx4NmQnLCdceDMwXHg2YVx4NGFceDc0XHg1M1x4NTRceDZmXHg2M1x4MzBceDQxXHg2NFx4NzJceDRiXHgzOVx4NjdceDc0XHgzMFx4MzVceDRhXHg3MVx4NGVceDQ0XHg2Ylx4NjInLCdceDMwXHgzNVx4NWFceDcxXHg0YVx4NmVceDY3XHg2OCcsJ1x4MzBceDUwXHg0YVx4NzRceDUzXHg2ZVx4NmJceDUzXHgzMFx4NTJceDJmXHg3M1x4NDlceDM5XHg2N1x4MzBceDMwXHgzNFx4NjhceDczXHg0Y1x4MzlceDY3XHg2MycsJ1x4MzBceDM3XHgzN1x4NzRceDU1XHgzOVx4NmZceDQ2XHgzMFx4NTJceDZjXHg3Mlx4NGJceDZlXHg2Zlx4NDInLCdceDMwXHgzNlx4NzBceDcxXHg1Mlx4NDRceDY3XHgyZicsJ1x4MzBceDZjXHg3OFx4NzRceDU2XHg1NFx4NjNceDRhXHgzMFx4NjlceDU2XHg3M1x4NTRceDM5XHg2Ylx4NDdceDMwXHg2Y1x4NzBceDcxXHg0Y1x4NzEnLCdceDMwXHg2OVx4NWFceDcyXHg0N1x4NDRceDZiXHg2M1x4MzBceDRmXHg2OFx4NzNceDRjXHgzOVx4NjdceDJiXHgzMFx4MzVceDUyXHg3M1x4NGFceDM5XHg2Zlx4MzFceDMwXHgzNFx4NTcnLCdceDMwXHg0MVx4MzdceDczXHg1M1x4MzhceDZiXHg2OFx4MzBceDdhXHg1YVx4NzNceDU2XHg0NFx4NmJceDMxXHgzMFx4NmJceDRlXHg3MVx4NGJceDU0XHg2Zlx4NjcnLCdceDU3XHgzNlx4NzhceDYzXHg0Y1x4NDNceDZmXHg0Mlx4NTdceDUxXHgzNFx4NDRceDU3XHg1MFx4NmQnLCdceDMwXHgzNFx4MzdceDcxXHg0OFx4NmVceDYzXHg0ZFx4MzBceDdhXHgyZlx4NzJceDQ4XHg0NFx4NjNceDY2XHgzMFx4NGZceDc4XHg3NFx4NTJceDU0XHg2Zlx4MmZceDMwXHg2OVx4NGYnLCdceDMwXHgzNFx4NTZceDc0XHg1M1x4NTRceDY3XHgzM1x4MzBceDUyXHg3NFx4NzJceDU0XHg3MScsJ1x4MzBceDZiXHg3NFx4NzJceDRmXHg2ZVx4NmJceDMwXHgzMFx4N2FceDcwXHg3M1x4NGFceDU0XHg2M1x4MzdceDMwXHg2YVx4NmNceDcxXHg0Zlx4NDRceDY3XHgzNFx4MzBceDZhXHg1MycsJ1x4MzBceDM2XHg3OFx4NzNceDRkXHg0NFx4NjdceDQ0XHgzMFx4NTBceDZjXHg3NFx4NGZceDM5XHg2N1x4MzBceDMwXHg2YVx4NjhceDcyXHg0ZFx4NzEnLCdceDMwXHg3YVx4NDJceDc0XHg0Zlx4MzlceDYzXHg2N1x4MzBceDZiXHg3OFx4NzJceDU2XHg1NFx4NmJceDRkXHgzMFx4NmNceDVhXHg3NFx4NGVceDcxJywnXHgzMFx4MzdceDUyXHg3NFx4NTVceDU0XHg2Ylx4NTBceDMwXHg1Mlx4NmNceDcxXHg1MVx4NTRceDZiXHg1MFx4MzBceDZjXHg0ZVx4NzRceDRiXHgzOVx4NmZceDUwXHgzMFx4NDFceDMwJywnXHgzMFx4NGZceDQ2XHg3NFx4NTZceDQ0XHg2Ylx4MzdceDMwXHgzNVx4NmNceDc0XHg1MVx4NmVceDZiXHg2Nlx4MzBceDM2XHg2OFx4NzNceDRiXHgzOVx4NjNceDQyJywnXHgzMFx4NzlceDQyXHg3MVx4NDlceDU0XHg2Zlx4NzFceDMwXHg1MFx4NGFceDc0XHg1Nlx4NTRceDZiXHg1Mlx4NTdceDM2XHg2Y1x4NzFceDRhXHgzOVx4NmZceDU3XHgzMFx4MzRceDM0JywnXHgzMFx4NmFceDM3XHg3NFx4NGNceDU0XHg2N1x4MmZceDMwXHgzN1x4NjRceDc0XHg1Mlx4NDRceDYzXHg2Y1x4MzBceDUwXHgyZlx4NzNceDQ5XHg0NFx4NmJceDczXHgzMFx4NTJceDZkJywnXHgzMFx4NmJceDcwXHg3MVx4NTBceDQzXHg2Ylx4NzBceDMwXHg2YVx4NzRceDczXHg1M1x4MzlceDZmXHg1OFx4MzBceDY5XHg1Nlx4NzNceDRlXHg0NFx4NmJceDQ2XHgzMFx4NmFceDZkJywnXHgzMFx4N2FceDc4XHg3Mlx4NGFceDM5XHg2Zlx4NDhceDMwXHg0Mlx4NzRceDcyXHg1M1x4MzlceDYzXHg0Ylx4MzBceDc5XHg0Mlx4NzFceDUxXHgzOVx4NjNceDYxJywnXHgzMFx4NDJceDY0XHg3NFx4NGNceDM5XHg2Ylx4MzlceDMwXHg1Mlx4NGVceDczXHg1MFx4NmVceDZiXHg0ZCcsJ1x4NjJceDUzXHg2Ylx4NTNceDU3XHg1MVx4NzRceDYzXHg1NVx4NjNceDY4XHg2NFx4NDdceDcxJywnXHgzMFx4NmNceDRlXHg3Mlx4NTVceDU0XHg2Ylx4NTJceDMwXHg1MFx4NWFceDczXHg0YVx4NDRceDZiXHg0Y1x4MzBceDUxXHgyZlx4NzFceDQ4XHgzOVx4NmZceDMyXHgzMFx4NTJceDcxJywnXHgzMFx4NmFceDVhXHg3NFx4NGNceDZlXHg2M1x4NmZceDMwXHgzN1x4NjRceDczXHg0ZFx4NzEnLCdceDMwXHg3YVx4NWFceDczXHg1MFx4NmVceDYzXHg2OFx4MzBceDUyXHg1Nlx4NzRceDUwXHg0NFx4NjdceDRhXHgzMFx4NmFceDVhXHg3M1x4NTVceDZlXHg2Ylx4MmZceDMwXHg0MVx4NzEnLCdceDMwXHg2Ylx4NWFceDczXHg1NVx4NTRceDZmXHg3N1x4MzBceDM0XHg3OFx4NzRceDRmXHg0NFx4NjNceDZjXHgzMFx4NTFceDUyXHg3Mlx4NDlceDZlXHg2N1x4NzJceDMwXHg1MFx4NzUnLCdceDMwXHg1MFx4NGVceDczXHg0N1x4NTRceDZmXHgzMFx4MzBceDdhXHg0Mlx4NzFceDU0XHg1NFx4NjdceDM2XHgzMFx4NmJceDRhXHg3MVx4NGRceDU3JywnXHgzMFx4MzVceDRhXHg3Mlx4NGJceDU0XHg2M1x4MzlceDMwXHg1Mlx4MzdceDc0XHg0YVx4NmVceDZiXHg2MVx4MzBceDY5XHg0Mlx4NzNceDRhXHg1NycsJ1x4MzBceDQyXHg3NFx4NzRceDRjXHg1NFx4NmZceDZjXHgzMFx4NTJceDRlXHg3NFx4NGVceDU0XHg2Zlx4NzVceDMwXHgzN1x4NTZceDczXHg0OVx4NDRceDZmXHg3OVx4MzBceDQyXHg2OScsJ1x4MzBceDM0XHg2OFx4NzFceDRjXHg1NFx4NjdceDU1XHgzMFx4NTJceDVhXHg3NFx4NDlceDU0XHg2Ylx4NjJceDMwXHg0MVx4NDJceDcyXHg1NVx4NDRceDZiXHgzNScsJ1x4MzBceDc5XHg2Y1x4NzRceDUwXHg0NFx4NmZceDcxJywnXHgzMFx4MzZceDUyXHg3Mlx4NTRceDM5XHg2Zlx4MzRceDMwXHgzNVx4NGFceDcyXHg0Zlx4NDRceDY3XHgzNCcsJ1x4MzBceDUwXHg2OFx4NzJceDU1XHg0NFx4NmJceDY2XHgzMFx4NTFceDJmXHg3MVx4NGVceDM5XHg2M1x4NjhceDMwXHg0MVx4NGFceDczXHg0OVx4NmVceDY3XHg3OCcsJ1x4MzBceDc5XHg1Nlx4NzNceDQ4XHg1NFx4NjNceDU0XHgzMFx4NDJceDc4XHg3NFx4NDdceDYxJywnXHgzMFx4NmJceDc4XHg3Mlx4NGZceDZlXHg2Zlx4NjhceDMwXHg3YVx4NmNceDc0XHg1Nlx4NTRceDY3XHg1Mlx4MzBceDZhXHg2OFx4NzFceDUyXHg1NFx4NjdceDMxJywnXHgzMFx4MzRceDJmXHg3NFx4NTRceDU0XHg2M1x4MzMnLCdceDU3XHg1MFx4MzVceDc3XHg1N1x4NTBceDMxXHgzOVx4NjZceDU3JywnXHg1N1x4MzdceDY0XHg2M1x4NTZceDM4XHg2Ylx4NzBceDU3XHg1MFx4MzhceDU2XHg2ZVx4NzEnLCdceDU3XHg1MVx4NjRceDYzXHg0ZVx4NTNceDZmXHg1Nlx4NzBceDQ3JywnXHg1N1x4NTBceDJmXHg2M1x4NDlceDQzXHg2Ylx4NmJceDU3XHgzN1x4NmNceDYzXHg0N1x4NDcnLCdceDY2XHg0M1x4NmJceDVhXHg3Mlx4NTdceDU0XHgzNlx4NjVceDVhXHg1Mlx4NjRceDRlXHg2ZFx4NmJceDRkXHg0Nlx4NjEnLCdceDMwXHg3OVx4NzBceDczXHg1Nlx4NmVceDY3XHg1M1x4MzBceDZhXHgzM1x4NzNceDRiXHgzOVx4NmZceDU3XHgzMFx4MzZceDcwXHg3MVx4NGZceDM5XHg2Zlx4NDlceDMwXHg1Mlx4NjEnLCdceDMwXHgzNFx4NjRceDcxXHg0ZFx4NmVceDYzXHg3M1x4MzBceDM0XHg3MFx4NzNceDU2XHgzOVx4NmZceDM3XHgzMFx4NzlceDY4XHg3Mlx4NTZceDM5XHg2Ylx4NTlceDMwXHgzNlx4MzQnLCdceDMwXHgzNFx4MzNceDcxXHg0Zlx4MzlceDZmXHg1MFx4MzBceDZhXHgyZlx4NzFceDUyXHg2ZVx4NmZceDQ1JywnXHgzMFx4MzdceDRlXHg3NFx4NTZceDQ0XHg2Zlx4NjJceDMwXHgzNVx4NzBceDczXHg0Ylx4NDRceDZmXHg1OVx4MzBceDUwXHgzN1x4NzRceDUwXHgzOVx4NjNceDU5XHgzMFx4NDJceDU3JywnXHgzMFx4NDFceDY4XHg3M1x4NDdceDU0XHg2Ylx4NzFceDMwXHg2YVx4NWFceDcyXHg0Y1x4NTRceDYzXHg0OVx4MzBceDM1XHg0Nlx4NzJceDUyXHg0NycsJ1x4MzBceDUyXHgyZlx4NzFceDRlXHg1NFx4NjdceDQ4XHgzMFx4NGZceDVhXHg3NFx4NTFceDZlXHg2Ylx4NmZceDMwXHgzNFx4NTZceDc0XHg1MVx4NzEnLCdceDMwXHg2Ylx4MzNceDczXHg1NVx4NTRceDZiXHg0Y1x4MzBceDM0XHg3NFx4NzNceDRiXHg0NFx4NjdceDQyXHgzMFx4NTFceDRlXHg3Mlx4NDhceDM5XHg2N1x4NDMnLCdceDMwXHg2OVx4NmNceDc0XHg0OVx4NTRceDY3XHg3OCcsJ1x4MzBceDZiXHg2Y1x4NzNceDUwXHg2ZVx4NjdceDM5XHgzMFx4NTJceDUyXHg3M1x4NGVceDZlXHg2M1x4NzVceDMwXHg0MVx4NzBceDc0XHg0YVx4NmVceDZiXHg3NycsJ1x4MzBceDZiXHg0YVx4NzRceDUyXHgzOVx4NjNceDcwXHgzMFx4NmJceDc0XHg3Mlx4NTVceDQ0XHg2Zlx4NDNceDMwXHg3OVx4NjhceDc0XHg1Nlx4MzlceDY3XHg0OVx4MzBceDM0XHgzNCcsJ1x4MzBceDM1XHg2OFx4NzRceDRmXHg1NFx4NjdceDZlXHgzMFx4NDFceDQyXHg3Mlx4NGJceDM5XHg2Ylx4NjJceDMwXHg0Mlx4NzhceDcyXHg0OVx4NDRceDZiXHg2ZVx4MzBceDRmXHg3MScsJ1x4MzBceDZiXHg3NFx4NzFceDRmXHgzOVx4NmZceDU0XHgzMFx4NmFceDRlXHg3NFx4NDdceDQ0XHg2Ylx4NjknLCdceDMwXHg3YVx4NTZceDcyXHg0Zlx4NmVceDZiXHgzOVx4MzBceDdhXHg3MFx4NzNceDQ4XHgzOVx4NjNceDQzXHgzMFx4NDFceDM3XHg3Mlx4NGRceDU0XHg2N1x4NDNceDMwXHg0MVx4NzUnLCdceDMwXHg0Mlx4NDJceDc0XHg1M1x4NTRceDYzXHg2Y1x4MzBceDUwXHg3NFx4NzNceDUwXHg1NFx4NjNceDc2XHgzMFx4MzdceDVhXHg3NFx4NGRceDU0XHg2M1x4MzJceDMwXHgzNlx4NzknLCdceDMwXHg0Mlx4NzhceDcxXHg1M1x4NTRceDZiXHg2NFx4MzBceDRmXHg0Mlx4NzRceDUyXHg0NFx4NjdceDU3XHgzMFx4MzVceDJmXHg3M1x4NDdceDcxJywnXHgzMFx4NmJceDc4XHg3NFx4NDdceDM5XHg2Zlx4MzBceDMwXHg2Ylx4NzhceDczXHg0Zlx4MzlceDZmXHgyZlx4MzBceDM2XHg0YVx4NzRceDU0XHg0NFx4NjdceDM4XHgzMFx4NTBceDMwJywnXHgzMFx4NmNceDY4XHg3NFx4NDlceDQ0XHg2M1x4NDlceDMwXHg2Y1x4NzRceDc0XHg1M1x4NDRceDYzXHg2Mlx4MzBceDM2XHg1YVx4NzJceDUzXHgzOVx4NjdceDU1JywnXHgzMFx4NmFceDQyXHg3NFx4NGFceDM5XHg2Zlx4NGJceDMwXHg2Ylx4NGVceDc0XHg0YVx4NDRceDZiXHg1OCcsJ1x4NzBceDM4XHg2Ylx4NmRceDU3XHgzNlx4MmZceDY0XHg0N1x4NmRceDZiXHg0OCcsJ1x4NDZceDYxXHg0YVx4NjRceDRiXHg2Nlx4NGJceDM1JywnXHg1N1x4MzZceDc0XHg2M1x4NTVceDcyXHgzNFx4NzhceDc4XHg3MScsJ1x4NTdceDM2XHg0ZVx4NjNceDUzXHg0M1x4NmJceDcwXHg1N1x4NTJceDcxXHg0NScsJ1x4NDNceDM4XHg2Ylx4NmNceDU3XHgzNFx4MzVceDJmXHg1N1x4MzZceDMwJywnXHg1N1x4NTFceDQyXHg2M1x4NGRceDUzXHg2Zlx4NWFceDYyXHg0ZVx4NzknLCdceDc5XHg2ZFx4NmJceDQxXHg1N1x4NGZceDUzXHg2NVx4NTdceDUxXHg0YicsJ1x4MzBceDUwXHg1Mlx4NzRceDUzXHg1NFx4NmZceDQxXHgzMFx4NDJceDY0XHg3MVx4NGJceDZlXHg2N1x4MzBceDMwXHg2Ylx4NjRceDcyXHg1MVx4MzlceDYzXHg3YVx4MzBceDUyXHg1MycsJ1x4MzBceDdhXHg1Mlx4NzRceDU0XHg0NFx4NmZceDMwXHgzMFx4MzdceDRlXHg3MVx4NDhceDZlXHg2Ylx4NjQnLCdceDU3XHgzN1x4NjJceDY4XHg3OFx4NmRceDZiXHg3OFx4NTdceDRmXHg2NFx4NjNceDUwXHg1YVx4NzFceDU2JywnXHgzMFx4NGZceDc0XHg3NFx4NTRceDQ0XHg2Zlx4NzJceDMwXHgzNFx4NzRceDcyXHg0ZVx4NTRceDZmXHgzMFx4MzBceDZhXHgyZlx4NzRceDRjXHgzOVx4NmJceDcyXHgzMFx4NmFceDc1JywnXHgzMFx4MzZceDU2XHg3M1x4NTZceDM5XHg2Ylx4NmZceDMwXHg0Mlx4NzRceDcxXHg0OVx4NmVceDYzXHg0ZVx4MzBceDQyXHg1YVx4NzJceDRlXHg1NycsJ1x4MzBceDM2XHg2NFx4NzRceDU2XHg1NFx4NmZceDdhXHgzMFx4N2FceDY4XHg3Mlx4NGFceDZlXHg2M1x4NjdceDMwXHg2Ylx4NGFceDcyXHg0Zlx4NjEnLCdceDMwXHgzNlx4NDZceDc0XHg1Nlx4MzlceDZiXHg0ZVx4MzBceDM0XHg0YVx4NzNceDRhXHgzOVx4NjdceDM1XHgzMFx4MzZceDc0XHg3M1x4NGVceDZlXHg2M1x4MzNceDMwXHg2Ylx4NTMnLCdceDMwXHg0Zlx4NDJceDczXHg1MFx4NmVceDYzXHg2YVx4MzBceDM3XHg2OFx4NzRceDU0XHgzOVx4NjdceDUzXHgzMFx4NGZceDcwXHg3MVx4NDdceDZlXHg2M1x4NmEnLCdceDMwXHg1MVx4NmNceDcxXHg0OVx4NmVceDYzXHgzMycsJ1x4MzBceDQxXHg3NFx4NzNceDUxXHg0NFx4NjdceDU5XHgzMFx4NGZceDRhXHg3M1x4NGJceDM5XHg2N1x4MzBceDMwXHgzNlx4NzhceDc0XHg1MVx4MzlceDZiXHg3OFx4MzBceDM0XHgzMCcsJ1x4MzBceDM0XHg2OFx4NzFceDQ5XHg2ZVx4NjNceDUxXHgzMFx4N2FceDZjXHg3MVx4NTZceDU0XHg2M1x4NjZceDMwXHg0Zlx4NzUnLCdceDMwXHgzNlx4NWFceDczXHg1M1x4NDRceDZiXHg0YVx4MzBceDQyXHg2NFx4NzJceDUzXHg1NFx4NjNceDQ4XHgzMFx4NjlceDM3XHg3MVx4NTFceDU0XHg2N1x4NDRceDMwXHgzN1x4NjEnLCdceDMwXHg2Ylx4NmNceDczXHg0OVx4NDRceDZmXHg3MVx4MzBceDRmXHgzM1x4NzJceDU1XHgzOVx4NmZceDU3XHgzMFx4NGZceDc0XHg3NFx4NGZceDZlXHg2Ylx4NzhceDMwXHgzNFx4NGYnLCdceDMwXHg0Mlx4MmZceDc0XHg0ZVx4NmVceDZmXHg2ZScsJ1x4NTdceDM0XHgzMVx4NmFceDc3XHgzOFx4NmJceDc3XHg1N1x4NTFceDJmXHg2NFx4NTFceDc0XHgzMFx4NTRceDU3XHgzNlx4NzBceDY0XHg0N1x4NzEnLCdceDU3XHgzNlx4NTRceDY4XHg3OFx4NDcnLCdceDM4XHg2YVx4NTVceDc1XHg1Nlx4NTNceDZiXHg1MFx4NzJceDUzXHg2Zlx4MzJceDU3XHgzNlx4NmVceDQ0XHg1N1x4MzRceDRhXHg2NFx4NDhceDYxXHg0Y1x4MzInLCdceDU3XHgzNlx4NDJceDYzXHg0Zlx4NDNceDZiXHg0Mlx4NTdceDM3XHgzN1x4NjRceDU0XHg1M1x4NmJceDRlXHg1N1x4NTJceDRlXHg2M1x4NDhceDU3XHgzNFx4NGYnLCdceDZlXHg1M1x4NmJceDRhXHg1N1x4MzdceDYyXHg2OFx4NjhceDJmXHg2M1x4NzlceDRjXHgzNFx4NjEnLCdceDZkXHg2ZFx4NmJceDMzXHg1N1x4NTFceDQ2XHg2M1x4NTRceDY0XHgzMCcsJ1x4NTdceDUyXHg2OVx4NTVceDU3XHg1MVx4NTJceDYzXHg0OVx4NzEnLCdceDMwXHg1MVx4NDZceDczXHg1Mlx4MzlceDZmXHg2OVx4MzBceDZhXHg2OFx4NzNceDU0XHg2ZVx4NjdceDQ2XHgzMFx4MzdceDM3XHg3NFx4NTBceDZlXHg2Ylx4NmYnLCdceDMwXHg1MVx4NzRceDcyXHg0Ylx4NmVceDYzXHg0NFx4MzBceDM0XHg0Nlx4NzRceDRhXHg1NFx4NmZceDMwXHgzMFx4NjlceDVhXHg3M1x4NDhceDU3JywnXHg2ZFx4MzhceDZmXHg0N1x4NmRceDc1XHg2NFx4NjNceDU0XHg1M1x4NmJceDM4JywnXHg1N1x4MzVceDQ2XHg2M1x4NTJceDQzXHg2Ylx4NmNceDY4XHg3N1x4NDdceDMzJywnXHg2MVx4MzhceDZiXHg1MVx4NTdceDUxXHg0Mlx4NjNceDU2XHg1YVx4NjRceDY0XHg0N1x4NDNceDZiXHg1N1x4NTdceDUyXHg0ZVx4NjRceDRiXHgzOFx4NmZceDRlJywnXHg3N1x4NmRceDZiXHg3MVx4NTdceDRmXHg1NFx4NGZceDU3XHgzN1x4MmZceDY0XHg1MVx4NjhceDM4XHgzMicsJ1x4NTdceDUyXHg3NFx4NjNceDU1XHg3M1x4MzNceDY0XHg0N1x4NmRceDZiXHg1NFx4NmNceDRiXHg3YVx4NDgnLCdceDU3XHgzNFx4NmNceDYzXHg1NFx4NmRceDZmXHg2ZVx4NTdceDUyXHg2MVx4MzMnLCdceDU3XHg1Mlx4NzhceDY0XHg0OVx4NTdceDVhXHg2M1x4NGZceDQzXHg2Zlx4NDYnLCdceDYzXHg0N1x4NzlceDQ1XHg2Mlx4NzVceDRmJywnXHg1N1x4MzZceDYxXHgzN1x4NTdceDUwXHg3NFx4NjNceDUzXHg2NVx4NzRceDY0XHg0ZVx4NjEnLCdceDZiXHg2MVx4MzNceDY0XHg1M1x4MzFceDRlXHg2M1x4NGJceDYxJywnXHg2NFx4NGFceDY4XHg2NFx4NTJceDMzXHgzNCcsJ1x4NTdceDUwXHg0OFx4NzVceDQzXHg0N1x4NTRceDMyXHg3N1x4NDNceDZiXHg1Nlx4NTdceDRmXHgzOCcsJ1x4MzBceDM3XHg0YVx4NzNceDQ3XHg0NFx4NmJceDM5XHgzMFx4NTFceDRhXHg3M1x4NGNceDM5XHg2Ylx4NjlceDMwXHgzNlx4NzRceDc0XHg1MVx4NDRceDY3XHg0OVx4MzBceDdhXHg3MScsJ1x4MzBceDM0XHg3MFx4NzJceDU1XHg2ZVx4NjNceDU2XHgzMFx4NmJceDQ2XHg3Mlx4NDdceDU0XHg2N1x4MmZceDMwXHgzN1x4NGFceDc0XHg0N1x4NDcnLCdceDU3XHg1MVx4MzdceDY0XHg0YVx4NDlceDc0XHg2M1x4NGJceDQzXHg2Zlx4NmInLCdceDU3XHg0Zlx4NTZceDYzXHg1MVx4MzhceDZiXHg2Y1x4NTdceDUwXHg2OFx4NjRceDRiXHg2Nlx4NGFceDYzXHg0OVx4NjEnLCdceDc0XHg0M1x4NmJceDcwXHg1N1x4NTFceDQ4XHg1N1x4NTdceDM3XHg3MScsJ1x4NTdceDUwXHg3OFx4NjRceDUwXHg0M1x4NmZceDRmXHg2OVx4NDNceDZmXHgyYlx4NzlceDM4XHg2Ylx4NzVceDU3XHg1Mlx4NzhceDY0XHg0YVx4MzhceDZmXHg3NScsJ1x4NDVceDZkXHg2Ylx4NzFceDU3XHg1MFx4NjVceDUyXHg1N1x4NGZceDcxJywnXHg3YVx4MzhceDZiXHg3Nlx4NzNceDM4XHg2Ylx4NzVceDU3XHg1MVx4MzQnLCdceDMwXHgzNVx4NmNceDc0XHg1MVx4NmVceDYzXHg3NVx4MzBceDZjXHg1YVx4NzJceDUyXHgzOVx4NjNceDcyXHgzMFx4NmFceDRhXHg3M1x4NGFceDcxJywnXHgzMFx4N2FceDcwXHg3NFx4NGNceDZlXHg2N1x4MzcnLCdceDU3XHg0Zlx4MzVceDZlXHg2Zlx4MzhceDZmXHg1N1x4NTdceDM0XHg0Nlx4NjNceDUxXHg2MScsJ1x4MzBceDM2XHg2NFx4NzRceDUzXHg1NFx4NmJceDRkXHgzMFx4NmJceDUyXHg3MVx4NTNceDM5XHg2M1x4NmNceDMwXHg2Ylx4NDZceDcyXHg1MVx4NmVceDYzXHg3MycsJ1x4MzBceDUwXHg1Nlx4NzRceDU2XHg2ZVx4NmZceDQyXHgzMFx4N2FceDMzXHg3Mlx4NGFceDQ0XHg2N1x4MzAnLCdceDU3XHg1MVx4NTJceDY0XHg1NVx4NWFceDQ3JywnXHg3MFx4MzhceDZiXHg0N1x4NTdceDM2XHg1OFx4NmVceDY4XHg1NycsJ1x4NTdceDUxXHg3MFx4NjNceDRiXHg2ZFx4NmZceDM1XHg2NFx4MzFceDMxXHgzOScsJ1x4NDJceDY2XHg3OFx4NjNceDRhXHg0M1x4NmZceDZmJywnXHg2Ylx4NTNceDZiXHg2Ylx4NDZceDQ4XHgzMVx4NTEnLCdceDU3XHgzNFx4MzNceDYzXHg0N1x4MzhceDZiXHg3NFx4NTdceDUyXHg1M1x4NDQnLCdceDMwXHg2Y1x4NmNceDcxXHg0YVx4NTRceDZmXHgzMVx4MzBceDZjXHg3NFx4NzNceDRiXHgzOVx4NmZceDRhXHgzMFx4NmFceDY5JywnXHg1N1x4MzdceDZlXHg2Y1x4NzhceDQzXHg2Ylx4NzhceDU3XHg0Zlx4NzRceDYzXHg1NVx4NDcnLCdceDU3XHg1MVx4MmZceDYzXHg1MVx4MzhceDZiXHg0Nlx4NTdceDRmXHgzN1x4NjRceDRlXHg2Nlx4NzRceDYzXHg0Ylx4NDcnLCdceDU3XHgzNVx4NmNceDYzXHg0Zlx4NmRceDZiXHg2Zlx4NjNceDMyXHg0NycsJ1x4NTdceDRmXHg2Nlx4NDJceDQ0XHg3M1x4NmFceDU0XHg3N1x4NzEnLCdceDcwXHg0M1x4NmZceDQ0XHg1N1x4NTBceDQyXHg2NFx4NDhceDQzXHg2Zlx4NTAnLCdceDU3XHg1Mlx4MzNceDYzXHg0Ylx4NmRceDZmXHg1N1x4NmNceDU3JywnXHg1N1x4NTFceDMzXHg2M1x4NTRceDQ5XHg1Mlx4NjRceDUxXHg0M1x4NmJceDMyXHg2Y1x4NDcnLCdceDU3XHg1Mlx4NzhceDYzXHg0Zlx4NDNceDZiXHg2Zlx4NTdceDUwXHg1YVx4NjRceDQ3XHg3Nlx4NmNceDYzXHg0Ylx4MzhceDZmXHg2MicsJ1x4NDJceDRjXHg1Nlx4NjNceDRjXHgzOFx4NmZceDY5JywnXHg1N1x4MzdceDRjXHg2MVx4NDZceDM4XHg2Ylx4NGVceDU3XHgzNlx4MzAnLCdceDU3XHg1MVx4NDJceDYzXHg0ZFx4NThceDVhXHg2NFx4NTFceDZkXHg2Zlx4NmMnLCdceDYxXHg2ZFx4NmZceDRjXHg1N1x4NTJceDc0XHg2NFx4NTJceDYzXHg3MScsJ1x4NTdceDRmXHg0Mlx4NjNceDUzXHg0M1x4NmZceDMxXHg0M1x4MzhceDZmXHg1MScsJ1x4MzBceDY5XHg0ZVx4NzNceDRhXHg2ZVx4NjNceDY4XHgzMFx4MzZceDc4XHg3NFx4NGVceDQ0XHg2N1x4NmJceDMwXHgzN1x4NTJceDczXHg1Mlx4MzlceDY3XHg2M1x4MzBceDUyXHgzOCcsJ1x4MzBceDZiXHg0ZVx4NzRceDUwXHg0NFx4NjNceDZkXHgzMFx4NmJceDQ2XHg3MVx4NDhceDM5XHg2Zlx4N2FceDMwXHg2Y1x4NzBceDc0XHg0Ylx4MzlceDYzXHg2Zlx4MzBceDUyXHg3OScsJ1x4NzJceDRiXHg1YVx4NjNceDQ4XHgzMVx4NTJceDY0XHg0Zlx4NzEnLCdceDY2XHgzOFx4NmJceDc5XHg3MFx4NjJceDc4XHg2M1x4NGZceDYzXHg3MFx4NjNceDU2XHg2M1x4NjlceDU2JywnXHg1N1x4NTBceDUwXHgzMFx4NTdceDUyXHg0Y1x4NjNceDYyXHgzOFx4NmZceDQ4JywnXHg1N1x4MzZceDZhXHg1OFx4NTdceDUwXHg2NFx4NjNceDUwXHg2Nlx4MmZceDY0XHg0ZFx4NDcnLCdceDU3XHg1MFx4NmFceDZmXHg2Zlx4NTNceDZmXHg2N1x4NTdceDM2XHg1MycsJ1x4NTdceDUyXHg3OFx4NjRceDRjXHg0OFx4NjRceDYzXHg1NVx4NDNceDZmXHg0OScsJ1x4NTdceDM0XHg1MFx4NjFceDU3XHgzNlx4NjRceDY0XHg1MFx4NTNceDZmXHg1MicsJ1x4NTdceDM1XHgzNVx4N2FceDc0XHgzOFx4NmJceDRjXHg0NFx4NzVceDc1XHg0N1x4NTdceDM0XHg3OFx4NjRceDRiXHg3MScsJ1x4NTdceDUyXHg3Nlx4NGNceDYxXHg1M1x4NmZceDRmJywnXHg0Mlx4MzFceDRlXHg2NFx4NGRceDZkXHg2Ylx4NGFceDc1XHg2ZFx4NmJceDY4XHg1N1x4MzRceDY4XHg2NFx4NTJceDcxJywnXHg1N1x4MzRceDM1XHg2ZFx4NzNceDQzXHg2Ylx4NTZceDQzXHg1NycsJ1x4MzBceDM3XHg1Nlx4NzNceDUyXHgzOVx4NjdceDMxXHgzMFx4NGZceDQyXHg3NFx4NTZceDQ0XHg2M1x4NzZceDMwXHg0Zlx4NTZceDcyXHg1NVx4NmVceDYzXHg0OVx4MzBceDY5XHgzNCcsJ1x4MzBceDUwXHgyZlx4NzNceDRhXHg1NFx4NmZceDQ0XHgzMFx4NmJceDRhXHg3Mlx4NDhceDU0XHg2M1x4NjdceDMwXHg3YVx4NzknLCdceDMwXHg1Mlx4MzdceDc0XHg0OVx4NDRceDZiXHg2ZVx4MzBceDM2XHg3NFx4NzFceDU1XHg2ZVx4NmJceDQ4XHgzMFx4NjlceDcwXHg3Mlx4NDdceDM5XHg2M1x4MzRceDMwXHgzNVx4NDcnLCdceDMwXHg1MFx4NTZceDcyXHg1Nlx4NTNceDZiXHg0Mlx4MzBceDUxXHg1YVx4NzFceDRkXHgzOVx4NjNceDY5XHgzMFx4NDFceDMzXHg3M1x4NGFceDM5XHg2M1x4NDcnLCdceDdhXHg3OFx4NzhceDYzXHg1NVx4MzBceDQ2XHg2NFx4NTJceDZkXHg2Ylx4MzBceDc1XHg2ZFx4NmJceDZhXHg1N1x4MzRceDM5XHg0MycsJ1x4NTdceDM2XHg3MFx4NjNceDU2XHg3MVx4NmFceDM3J107Zz1mdW5jdGlvbigpe3JldHVybiBsdzt9O3JldHVybiBnKCk7fWNvbnN0IE89bCxnMj1sLGczPWwsZzQ9bCxnNT1sO3RyeXtsZXQgZT0hW107Y29uc3QgUj1bMHgxZCwweDJiLDB4OGIsMHgzOTAxXVtPKDB4MCwnXHg3Nlx4NGRceDZmXHgyNScpXSgoWSxFKT0+WSpFLDB4MSk7ZnVuY3Rpb24gYyhFLFope2NvbnN0IGw3PXtZOjB4MSxFOidceDM4XHgzMFx4NGRceDY2JyxaOjB4MixQOidceDMzXHg0OFx4NzhceDcxJyxpOjB4MyxhOidceDY3XHgzMlx4MjhceDcwJ30sZD1PLFM9TyxYPU8sUD17fTtQW2QobDcuWSxsNy5FKV09ZnVuY3Rpb24oSCxNKXtyZXR1cm4gSD4+Pk07fTtjb25zdCBhPVA7bGV0IEk9MHg4MTFjOWRjNSx5PTB4MTAwMDE5MyxyPVo/WjpJO2ZvcihsZXQgSD0weDA7SDxFWydceDZjXHg2NVx4NmVceDY3XHg3NFx4NjgnXTtIKyspe3IqPXkscl49RVtTKGw3LlosbDcuUCldKEgpO31yZXR1cm4gYVtkKGw3LmksbDcuYSldKHIsMHgwKTt9ZnVuY3Rpb24gVigpe2NvbnN0IGw4PXtZOjB4NCxFOidceDM4XHgzMFx4NGRceDY2JyxaOidceDRkXHgzMFx4NzVceDY2JyxQOjB4ZCxpOidceDRmXHg2Zlx4NDhceDViJyxhOjB4ZSxJOjB4Zix5OidceDMxXHg3YVx4NWRceDc3JyxyOidceDMwXHg1Ylx4NWJceDZiJyxIOjB4MTEsTTonXHg0YVx4MzhceDcyXHgyMycsSjoweDEyLHo6J1x4MzBceDViXHg1Ylx4NmInLHQ6MHgxMyxoOjB4MTQsQTonXHgzM1x4NDhceDc4XHg3MScsajoweDE1LHY6J1x4MzhceDMzXHg2ZFx4NjcnfSxMPU8seD1PLHU9TyxrPU8scT1PLEU9e307RVtMKGw4LlksbDguRSldPUwoMHg1LGw4LlopO2NvbnN0IFo9RSxQPSgoaSxhKT0+KGE9d2luZG93W0woMHg2LCdceDQyXHg1N1x4MjZceDMyJyldW3goMHg3LCdceDMwXHg2Mlx4NDhceDM3JykreCgweDgsJ1x4NzdceDYxXHg0OFx4NDMnKV1bcSgweDksJ1x4NzhceDM2XHgyNFx4NWInKSsnXHg2NCddKGkpW3EoMHhhLCdceDM4XHgzM1x4NmRceDY3JykreCgweGIsJ1x4MzVceDVkXHg2N1x4NTQnKV0saVtrKDB4YywnXHg3Mlx4NzZceDZkXHg3OCcpXSgpLGEpKSh3aW5kb3dbTChsOC5QLGw4LmkpXVtrKGw4LmEsJ1x4MzVceDVkXHg2N1x4NTQnKStMKGw4LkksbDgueSldKFpbdSgweDEwLGw4LnIpXSkpO3JldHVybiBQW3gobDguSCxsOC5NKV1bdShsOC5KLGw4LnopK2sobDgudCxsOC5NKV0oT2JqZWN0W3EobDguaCxsOC5BKV0pW3UobDguaixsOC52KV0oYT0+IVBbeCgweDE2LCdceDU1XHgyNFx4NzZceDQzJyldW3EoMHgxNywnXHgzOFx4MzBceDRkXHg2NicpK2soMHgxOCwnXHgzM1x4NDBceDVhXHg0NicpXShQW3goMHgxOSwnXHgzOFx4MzNceDZkXHg2NycpXVtrKDB4MWEsJ1x4NGFceDVlXHg2Zlx4NzcnKV0pW3EoMHgxYiwnXHg2M1x4MzVceDc4XHg0OScpXShhKSk7fWZ1bmN0aW9uIEQoKXtjb25zdCBsTj17WToweDFjLEU6J1x4NDdceDQyXHg2NFx4NGInLFo6J1x4MzNceDc0XHg1NVx4MzEnLFA6J1x4MzdceDZjXHg0OVx4NDMnLGk6MHgyNixhOjB4MjcsSTonXHg0Mlx4NTdceDI2XHgzMicseToweDJiLHI6MHgxMixIOidceDMwXHg1Ylx4NWJceDZiJyxNOjB4MmMsSjoweDJkLHo6J1x4NzdceDYxXHg0OFx4NDMnLHQ6MHgyZSxoOidceDJhXHg0Zlx4NzJceDYxJyxBOjB4MmYsajonXHg0YVx4NWVceDZmXHg3NycsdjoweDMwLFQ6MHgzMSxsVzonXHg3Nlx4NGRceDZmXHgyNScsbEU6MHgzMixsZTonXHg0YVx4NTZceDcyXHg3MicsbFI6MHgzMyxsYzonXHg2M1x4MjlceDQ1XHg1OScsbFY6MHgzNCxsRDoweDM1LGxDOidceDY0XHg0ZFx4MjVceDczJyxsczoweDM2LGxHOidceDM4XHgzMFx4NGRceDY2JyxscDoweDM3LGxROidceDIzXHgzMVx4NWVceDU1JyxsZjoweDM4LGxvOidceDQ0XHg2MVx4NjJceDY1JyxsRjoweDM5LGxiOidceDMxXHg1ZFx4NjhceDc4JyxsbjoweDNjLGxLOidceDMzXHg0OFx4NzhceDcxJyxsWjoweDNkLGxQOidceDZmXHg0Nlx4NTRceDZlJyxsaToweDNlLGxhOidceDRhXHgzOFx4NzJceDIzJyxsSToweDNmLGx5OidceDMwXHg2Mlx4NDhceDM3JyxscjoweDQwLGxIOidceDU1XHgyNFx4NzZceDQzJ30sdz1PLG09TyxVPU8sZzA9TyxnMT1PLFk9eydceDQ0XHg0Zlx4NTZceDY4XHg2YSc6J1x4NjlceDY2XHg3Mlx4NjFceDZkXHg2NScsJ1x4NjZceDczXHg2NFx4NzFceDc0JzpmdW5jdGlvbihpLGEpe3JldHVybiBpPT1hO30sJ1x4NmJceDc1XHg2N1x4NzFceDc2Jzp3KGxOLlksbE4uRSksJ1x4N2FceDZiXHg2OVx4NzZceDQzJzpmdW5jdGlvbihpLGEpe3JldHVybiBpIT09YTt9LCdceDQ5XHg0YVx4NjVceDVhXHg2Mic6ZnVuY3Rpb24oaSxhKXtyZXR1cm4gaShhKTt9LCdceDZjXHg0Mlx4NDRceDZhXHg1OSc6dygweDFkLGxOLlopLCdceDRhXHg3NVx4NjVceDc5XHg1MCc6ZnVuY3Rpb24oaSxhKXtyZXR1cm4gaShhKTt9fSxFPSgoaSxhKT0+KGE9d2luZG93W20oMHgxZSwnXHgzMVx4N2FceDVkXHg3NycpXVt3KDB4MWYsJ1x4MzdceDZjXHg0OVx4NDMnKStVKDB4MjAsJ1x4NmNceDY5XHg2NVx4NjEnKV1bbSgweDIxLCdceDM4XHgzMFx4NGRceDY2JykrJ1x4NjQnXShpKVt3KDB4MjIsJ1x4NmVceDU1XHg2ZFx4MzMnKSt3KDB4MjMsJ1x4NjVceDRlXHgyNFx4NmEnKV0saVtnMCgweDI0LCdceDc2XHg3YVx4MzZceDU3JyldKCksYSkpKHdpbmRvd1snXHg2NFx4NmZceDYzXHg3NVx4NmRceDY1XHg2ZVx4NzQnXVtnMSgweDI1LGxOLlApK2cwKGxOLmksJ1x4MzNceDc0XHg1NVx4MzEnKV0oWVttKGxOLmEsbE4uSSldKSksWj1bXSxQPWk9PkVbJ1x4NDZceDc1XHg2ZVx4NjNceDc0XHg2OVx4NmZceDZlJ11bZzAoMHgyOCwnXHgzOFx4MzNceDZkXHg2NycpXVttKDB4MjksJ1x4NGFceDVlXHg2Zlx4NzcnKV1bZzAoMHgyYSwnXHg0YVx4NDhceDRlXHg1OCcpXShpKTtmb3IoY29uc3QgaSBpbiBFW20obE4ueSwnXHg3N1x4NmJceDI1XHg3MycpXVtnMShsTi5yLGxOLkgpK1UobE4uTSwnXHgyYVx4NGZceDcyXHg2MScpK2cwKGxOLkosbE4ueildKEUpKXt0cnl7Y29uc3QgYT1FW2ldLEk9d2luZG93W2ldO2lmKFlbVShsTi50LGxOLmgpXSh0eXBlb2YgYSxZW1UobE4uQSxsTi5qKV0pKXtZW20obE4udixsTi5QKV0oWVtnMShsTi5ULGxOLmxXKV0oUCxhKSxQKEkpKSYmWltnMChsTi5sRSxsTi5sZSldKGFbdyhsTi5sUixsTi5sYyldKTtpZihZW2cwKGxOLmxWLGxOLkkpXWluIGEpZm9yKGNvbnN0IHkgb2YgRVtVKGxOLmxELGxOLmxDKV1bJ1x4NjdceDY1XHg3NFx4NGZceDc3XHg2ZVx4NTBceDcyXHg2Zlx4NzAnK2cwKGxOLmxzLGxOLmxHKV0oYVtnMChsTi5scCxsTi5sUSldKSl7Y29uc3Qgcj1hW2cxKGxOLmxmLGxOLmxvKV1beV0sSD1JW3cobE4ubEYsJ1x4MzdceDRjXHg1NFx4NzQnKV1beV07WVtnMSgweDNhLGxOLmxiKV0oWVtnMSgweDNiLGxOLnopXShQLHIpLFlbdyhsTi5sbixsTi5sSyldKFAsSCkpJiZaW20obE4ubFosbE4ubFApXShhW2cxKGxOLmxpLGxOLmxhKV0rKGcxKGxOLmxJLGxOLmx5KSsnXHgyZScpK3JbdyhsTi5scixsTi5sSCldKTt9fX1jYXRjaHt9fXJldHVybiBaO31jb25zdCBDPUpTT05bZzIoMHg0MSwnXHg1ZVx4NDBceDVlXHg3MScpXShWKCksbnVsbCwweDIpLHM9SlNPTltnMygweDQyLCdceDIzXHgzMVx4NWVceDU1JyldKEQoKSxudWxsLDB4MiksRz0oKFksRSk9PihFPXdpbmRvd1tnMygweDQzLCdceDc2XHg0ZFx4NmZceDI1JyldWydceDY0XHg2Zlx4NjNceDc1XHg2ZFx4NjVceDZlXHg3NFx4NDVceDZjJytnMygweDQ0LCdceDRkXHgzMFx4NzVceDY2JyldW2czKDB4NDUsJ1x4MzNceDc0XHg1NVx4MzEnKSsnXHg2NCddKFkpW2c0KDB4NDYsJ1x4NGZceDZmXHg0OFx4NWInKStnMigweDQ3LCdceDZjXHg2OVx4NjVceDYxJyldLEUpKSh3aW5kb3dbZzUoMHg0OCwnXHgyOVx4MjlceDM5XHgyYScpXVtnMygweDQ5LCdceDc4XHgzNlx4MjRceDViJykrTygweDRhLCdceDRkXHgzNlx4NThceDczJyldKCdceDY5XHg2Nlx4NzJceDYxXHg2ZFx4NjUnKSkscD1fdGhpc1tnMigweDRiLCdceDc2XHg0ZFx4NmZceDI1JyldW2c1KDB4NGMsJ1x4NDJceDU3XHgyNlx4MzInKSsnXHg3NVx4NjVceDczXHg3NCddLFE9e2dldCAnXHUwNDQxXHUwNDQzXHUwNDQ5XHUwNDNkXHUwNDNlXHUwNDQxXHUwNDQyXHUwNDM4Jygpe3JldHVybiEweDA/J1x4MjRceDZiJzonXHg2Nlx4NjQnO30sZ2V0ICdcdTA0M2FcdTA0MzBcdTA0M2NcdTA0MzVcdTA0NDBcdTA0MzAnKCl7cmV0dXJuITB4MD8nXHg2OFx4NzMnOidceDY0XHg2MSc7fSxnZXQgJ1x1MDQ0MVx1MDQ0Nlx1MDQzNVx1MDQzZFx1MDQzMCcoKXtyZXR1cm4hMHgwPydceDUwXHg3Myc6J1x4NjdceDY0Jzt9LGdldCAnXHUwNDQzXHUwNDNmXHUwNDQwXHUwNDMwXHUwNDMyXHUwNDNiXHUwNDM1XHUwNDNkXHUwNDM4XHUwNDM1Jygpe3JldHVybiEweDA/J1x4NTRceDc2JzonXHg2OFx4NzYnO30sZ2V0ICdcdTA0NDRcdTA0NDNcdTA0M2RcdTA0M2FcdTA0NDZcdTA0MzhcdTA0NGZcdTA0MjNcdTA0M2ZcdTA0NDBcdTA0MzBcdTA0MzJcdTA0M2JcdTA0MzVcdTA0M2RcdTA0MzhcdTA0NGYnKCl7cmV0dXJuITB4MD8nXHg3NVx4NmMnOidceDYyXHg3Nic7fSxnZXQgJ1x1MDQzZFx1MDQzOFx1MDQzYScoKXtyZXR1cm4hMHgwPydceDQ1XHg2Yyc6J1x4NzZceDYyJzt9LGdldCAnXHUwNDNhXHUwNDNlXHUwNDNjXHUwNDMwXHUwNDNkXHUwNDM0XHUwNDMwJygpe3JldHVybiEweDA/J1x4NDFceDZjJzonXHg3OVx4NmEnO30sZ2V0ICdcdTA0M2VcdTA0MzFcdTA0NGFcdTA0MzVcdTA0M2FcdTA0NDJcdTA0MThcdTA0MzNcdTA0NDBcdTA0M2VcdTA0M2FcdTA0MzAnKCl7cmV0dXJuITB4MD8nXHg0OVx4NGQnOidceDY3XHg0NCc7fSxnZXQgJ1x1MDQzMFx1MDQzZFx1MDQzOFx1MDQzY1x1MDQzMFx1MDQ0Nlx1MDQzOFx1MDQ0Zlx1MDQxZVx1MDQ0Mlx1MDQzNFx1MDQzMFx1MDQ0N1x1MDQzOCcoKXtyZXR1cm4hMHgwPydceDQ1XHg2Mic6J1x4NjZceDU5Jzt9LGdldCAnXHUwNDMyXHUwNDM1XHUwNDQwXHUwNDQyXHUwNDM4XHUwNDNhXHUwNDMwXHUwNDNiXHUwNDRjXHUwNDNkXHUwNDMwXHUwNDRmXHUwNDFlXHUwNDQyXHUwNDM0XHUwNDMwXHUwNDQ3XHUwNDMwJygpe3JldHVybiEweDA/J1x4NzZceDc2JzonXHg1NFx4NTknO319O190aGlzW2c0KDB4NGQsJ1x4MzhceDMwXHg0ZFx4NjYnKV09UTtjb25zdCBmPXt9O2ZbZzIoMHg0ZSwnXHg3Nlx4N2FceDM2XHg1NycpXT1nNCgweDRmLCdceDc4XHgzNlx4MjRceDViJykrTygweDUwLCdceDRmXHgyMVx4MzlceDY2JykrJ1x4NjFceDcwXHg2OVx4MmZceDc3XHg2NVx4NjJceDY4XHg2Zlx4NmYnK08oMHg1MSwnXHg0YVx4NTZceDcyXHg3MicpK08oMHg1MiwnXHgzN1x4NGNceDU0XHg3NCcpK2c1KDB4NTMsJ1x4NGRceDM2XHg1OFx4NzMnKStnMigweDU0LCdceDMxXHg3YVx4NWRceDc3JykrTygweDU1LCdceDI2XHg2N1x4NzFceDQxJykrZzMoMHg1NiwnXHgzM1x4NDBceDVhXHg0NicpK2c0KDB4NTcsJ1x4NDJceDU3XHgyNlx4MzInKSsnXHg2ZFx4NmVceDQyXHg0NVx4NzhceDQyXHg1Zlx4NzJceDRlXHgzMCcrTygweDU4LCdceDQ3XHg0Mlx4NjRceDRiJykrJ1x4NjMnLGZbZzQoMHg1OSwnXHgyOVx4MjlceDM5XHgyYScpXT1nNCgweDVhLCdceDMxXHg1ZFx4NjhceDc4JykrZzIoMHg1YiwnXHg2Zlx4NThceDIxXHg1MScpKydceDYxXHg3MFx4NjlceDJmXHg3N1x4NjVceDYyXHg2OFx4NmZceDZmJytnNSgweDVjLCdceDc3XHg2Ylx4MjVceDczJykrZzIoMHg1ZCwnXHg0YVx4NWVceDZmXHg3NycpK2c1KDB4NWUsJ1x4NjRceDRkXHgyNVx4NzMnKStnMygweDVmLCdceDVlXHg0MFx4NWVceDcxJykrTygweDYwLCdceDMzXHg3NFx4NTVceDMxJykrZzMoMHg2MSwnXHg0YVx4MzhceDcyXHgyMycpK2c0KDB4NjIsJ1x4NDVceDRhXHg2MVx4NzUnKStnMygweDYzLCdceDI2XHg2N1x4NzFceDQxJykrZzMoMHg2NCwnXHg0Mlx4NTdceDI2XHgzMicpKydceDU3JyxmW08oMHg2NSwnXHg0YVx4NWVceDZmXHg3NycpXT1nNSgweDY2LCdceDQ0XHg2MVx4NjJceDY1JykrZzIoMHg2NywnXHgzMVx4N2FceDVkXHg3NycpK08oMHg2OCwnXHgzMFx4NWJceDViXHg2YicpK2cyKDB4NjksJ1x4MzVceDVkXHg2N1x4NTQnKStnNCgweDZhLCdceDQ3XHg0Mlx4NjRceDRiJykrZzMoMHg2YiwnXHg0YVx4NDhceDRlXHg1OCcpK2cyKDB4NmMsJ1x4MzhceDMwXHg0ZFx4NjYnKStPKDB4NmQsJ1x4NzZceDdhXHgzNlx4NTcnKStPKDB4NmUsJ1x4NTZceDQzXHg0Mlx4NTMnKSsnXHg2M1x4NGZceDdhXHg3Nlx4MzJceDY0XHgzMFx4NTFceDRmXHg0MScrZzUoMHg2ZiwnXHg2Y1x4NjlceDY1XHg2MScpKydceDQyXHg1Nlx4NjJceDY3XHg1MVx4NTZceDQ2XHg0YVx4NWFceDZiJysnXHg0NSc7Y29uc3Qgbz1mO09iamVjdFtPKDB4NzAsJ1x4MzBceDYyXHg0OFx4MzcnKStPKDB4NzEsJ1x4MzFceDVkXHg2OFx4NzgnKV0od2luZG93LGc1KDB4NzIsJ1x4NDJceDU3XHgyNlx4MzInKSx7J1x4NzZceDYxXHg2Y1x4NzVceDY1JzpuZXcgR1soZzQoMHg3MywnXHgyNlx4NjdceDcxXHg0MScpKV0oR1tPKDB4NzQsJ1x4NGFceDQ4XHg0ZVx4NTgnKV0seydceDYxXHg3MFx4NzBceDZjXHg3OScoWSxFLFope2NvbnN0IGxaPXtZOjB4NzUsRTonXHgzOFx4MzBceDRkXHg2NicsWjoweDc2LFA6J1x4MjlceDI5XHgzOVx4MmEnLGk6MHg3NyxhOidceDRhXHg0OFx4NGVceDU4JyxJOjB4ODJ9LGxLPXtZOidceDQ3XHg0Mlx4NjRceDRiJyxFOjB4N2MsWjonXHg0Ylx4NjdceDUxXHg1OCd9LGxmPXtZOjB4N2EsRTonXHgyOVx4MjlceDM5XHgyYSd9LGc2PWc1LGc3PWc0LGc4PWc1LGc5PWczLGdnPWc0LFA9eydceDRmXHg3M1x4NTFceDYxXHg1Myc6ZnVuY3Rpb24oaSxhKXtyZXR1cm4gaShhKTt9LCdceDZkXHg3OFx4NTRceDZkXHg2Myc6ZnVuY3Rpb24oaSxhKXtyZXR1cm4gaT09YTt9LCdceDZkXHg0NVx4NzhceDZkXHg0OSc6ZzYobFouWSxsWi5FKSsnXHg2NSd9O2lmKFBbZzYobFouWixsWi5QKV0oWlsweDBdLFBbZzcobFouaSxsWi5hKV0pKXJldHVybiBuZXcgUHJvbWlzZSgoaSxhKT0+UmVmbGVjdFtnOSgweDc4LCdceDQ0XHg2MVx4NjJceDY1JyldKC4uLmFyZ3VtZW50cylbZzgoMHg3OSwnXHgyYVx4NGZceDcyXHg2MScpXShJPT57Y29uc3QgbGI9e1k6MHg3ZCxFOidceDc3XHg2MVx4NDhceDQzJyxaOjB4N2UsUDonXHgzMFx4NWJceDViXHg2YicsaToweDgwfSxnWT1nOCxnTj1nOSx5PXsnXHg1Mlx4NDZceDcyXHg1OVx4NjknOmZ1bmN0aW9uKHIsSCl7Y29uc3QgZ2w9bDtyZXR1cm4gUFtnbChsZi5ZLGxmLkUpXShyLEgpO319O0lbZ1koMHg3YixsSy5ZKV09bmV3IFByb3h5KElbZ04obEsuRSxsSy5aKV0seydceDYxXHg3MFx4NzBceDZjXHg3OScocixILE0pe2NvbnN0IGxGPXtZOjB4N2YsRTonXHg0NVx4NGFceDYxXHg3NSd9LEo9eydceDc0XHg0N1x4NTVceDU3XHg1OCc6ZnVuY3Rpb24oeix0KXtyZXR1cm4geVsnXHg1Mlx4NDZceDcyXHg1OVx4NjknXSh6LHQpO319O3JldHVybiBuZXcgUHJvbWlzZSgoeix0KT0+e2NvbnN0IGdXPWwsZ0U9bCxnUj1sO1JlZmxlY3RbZ1cobGIuWSxsYi5FKV0oLi4uYXJndW1lbnRzKVtnVyhsYi5aLGxiLlApXShoPT57Y29uc3QgZ2U9Z1c7SltnZShsRi5ZLGxGLkUpXShiLGgpLEpbJ1x4NzRceDQ3XHg1NVx4NTdceDU4J10oeixoKTt9KVtnVyhsYi5pLCdceDRhXHg1ZVx4NmZceDc3JyldKHQpO30pO319KSxpKEkpO30pW2dnKDB4ODEsJ1x4NmVceDU1XHg2ZFx4MzMnKV0oYSkpO3JldHVybiBSZWZsZWN0W2dnKGxaLkksJ1x4MzNceDc0XHg1NVx4MzEnKV0oLi4uYXJndW1lbnRzKTt9fSksJ1x4NzdceDcyXHg2OVx4NzRceDYxXHg2Mlx4NmNceDY1JzohW10sJ1x4NjNceDZmXHg2ZVx4NjZceDY5XHg2N1x4NzVceDcyXHg2MVx4NjJceDZjXHg2NSc6IVtdfSk7ZnVuY3Rpb24gRihaKXtjb25zdCBsUD17WToweDgzLEU6J1x4NjRceDRkXHgyNVx4NzMnLFo6MHg4NCxQOidceDIzXHgzMVx4NWVceDU1JyxpOjB4ODUsYTonXHgzMVx4N2FceDVkXHg3NycsSTonXHg0OVx4NjJceDZiXHg2MicseToweDg3LHI6J1x4MzdceDZjXHg0OVx4NDMnLEg6MHg4OCxNOidceDQyXHg1N1x4MjZceDMyJyxKOjB4ODksejonXHgzMVx4NWRceDY4XHg3OCcsdDoweDhhLGg6J1x4NGFceDU2XHg3Mlx4NzInLEE6MHg4YixqOidceDI5XHgyOVx4MzlceDJhJyx2OjB4OGMsVDonXHgzOFx4MzBceDRkXHg2NicsbGk6MHg4ZCxsYTonXHg2N1x4MzJceDI4XHg3MCcsbEk6J1x4NGFceDQ4XHg0ZVx4NTgnLGx5OjB4OGYsbHI6J1x4NzdceDYxXHg0OFx4NDMnLGxIOjB4OTAsbE06J1x4NmVceDU1XHg2ZFx4MzMnLGxKOjB4OTEsbHo6J1x4NGJceDY3XHg1MVx4NTgnfSxnYz1nMixnVj1nMixnRD1nNCxnQz1nNSxncz1nMixQPXt9O1BbZ2MobFAuWSxsUC5FKV09Z2MobFAuWixsUC5QKStnYyhsUC5pLGxQLmEpK2dEKDB4ODYsbFAuSSkrZ0MobFAueSxsUC5yKStnQyhsUC5ILGxQLk0pK2dWKGxQLkosbFAueikrJ1x4NTlceDVhJztjb25zdCBpPVAsYT1HW2djKGxQLnQsbFAuaCldLEk9R1tnRChsUC5BLGxQLmopXSx5PWlbZ0QobFAudixsUC5UKV0scj17fTtyZXR1cm4gcltncyhsUC5saSxsUC5sYSldPVosSVtnRCgweDhlLGxQLmxJKV1bZ2MobFAubHksbFAubHIpXVtnYyhsUC5sSCxsUC5sTSldKElbZ0QobFAubEosbFAubHopXShyLCgpPT55W2FbZ1YoMHg5MiwnXHg0ZFx4MzZceDU4XHg3MycpXShhW2djKDB4OTMsJ1x4MzBceDYyXHg0OFx4MzcnKV0oKSp5W2dzKDB4OTQsJ1x4NmZceDQ2XHg1NFx4NmUnKV0pXSksJycpO31mdW5jdGlvbiBiKFkpe2NvbnN0IGxNPXtZOidceDU2XHg0M1x4NDJceDUzJyxFOjB4OTYsWjonXHg0NVx4NjZceDU4XHg2NycsUDoweDk3LGk6J1x4NjNceDI5XHg0NVx4NTknLGE6MHg5OCxJOidceDM4XHgzM1x4NmRceDY3Jyx5OjB4OTkscjonXHg0Zlx4NmZceDQ4XHg1YicsSDoweDlhLE06J1x4MzVceDVkXHg2N1x4NTQnLEo6MHg5Yix6OidceDIzXHgzMVx4NWVceDU1Jyx0OjB4OWMsaDonXHg2Zlx4NDZceDU0XHg2ZScsQToweDlkLGo6J1x4NGJceDY3XHg1MVx4NTgnLHY6MHg5ZSxUOidceDZmXHg1OFx4MjFceDUxJyxsSjoweDlmLGx6OidceDRhXHgzOFx4NzJceDIzJyxsdDoweGEwLGxoOidceDc2XHg0ZFx4NmZceDI1JyxsQToweGExLGxqOidceDQ0XHg2MVx4NjJceDY1JyxsdjoweGEyLGxUOidceDQ5XHg2Mlx4NmJceDYyJyxsQjoweGEzLGxPOjB4YTQsbGQ6J1x4NGRceDM2XHg1OFx4NzMnLGxTOjB4YTYsbFg6J1x4NDVceDRhXHg2MVx4NzUnLGxMOjB4YTcsbHg6MHhhOCxsdTonXHg0YVx4MzhceDcyXHgyMycsbGs6MHhhOSxscTonXHg0NVx4NjZceDU4XHg2NycsbHc6MHhhYSxsbToweGFiLGxVOidceDI2XHg2N1x4NzFceDQxJyxZMDoweGFjLFkxOidceDc2XHg3YVx4MzZceDU3JyxZMjoweGFkLFkzOidceDMzXHg0OFx4NzhceDcxJyxZNDoweGFmLFk1OidceDRhXHg1ZVx4NmZceDc3JyxZNjonXHg3Mlx4NzZceDZkXHg3OCcsWTc6MHhiMSxZODonXHg0YVx4NWVceDZmXHg3NycsWTk6MHhiMixZZzoweGIzLFlsOidceDJhXHg0Zlx4NzJceDYxJyxZWToweGI0LFlOOidceDZlXHg1NVx4NmRceDMzJyxZVzoweGI1LFlFOjB4YjYsWWU6J1x4MzBceDYyXHg0OFx4MzcnLFlSOjB4YjcsWWM6J1x4MzNceDQwXHg1YVx4NDYnLFlWOjB4YjgsWUQ6J1x4MzNceDc0XHg1NVx4MzEnLFlDOidceDZjXHg2OVx4NjVceDYxJyxZczoweGJhLFlHOidceDMzXHg0MFx4NWFceDQ2JyxZcDoweGJiLFlROjB4YmMsWWY6J1x4MzFceDdhXHg1ZFx4NzcnLFlvOjB4YmR9LGdHPWc0LGdwPWc1LGdRPWczLGdmPWczLGdvPWc1LEU9eydceDY5XHg3YVx4NzNceDRiXHg2MSc6Z0coMHg5NSxsTS5ZKSwnXHg0NFx4NjJceDQ3XHg2Nlx4NjknOmZ1bmN0aW9uKFosUCl7cmV0dXJuIForUDt9LCdceDc3XHg2Y1x4NDNceDY2XHg0Nyc6Z3AobE0uRSxsTS5aKSwnXHg0OFx4NDdceDRhXHg2M1x4NTAnOmZ1bmN0aW9uKFosUCl7cmV0dXJuIForUDt9LCdceDRmXHg0Ylx4NThceDU2XHg1NCc6ZnVuY3Rpb24oWixQKXtyZXR1cm4gWitQO30sJ1x4NGRceDQyXHg2OVx4NzVceDY4JzpmdW5jdGlvbihaLFApe3JldHVybiBaKFApO30sJ1x4NjhceDc1XHg3NFx4NTVceDZlJzpmdW5jdGlvbihaLFAsaSl7cmV0dXJuIFooUCxpKTt9LCdceDc1XHg1Mlx4NjZceDYxXHg2Yic6ZnVuY3Rpb24oWixQLGksYSl7cmV0dXJuIFooUCxpLGEpO319O2lmKFlbZ0cobE0uUCxsTS5pKStnRyhsTS5hLGxNLkkpXSYmWVtncChsTS55LGxNLnIpXVtnRyhsTS5ILGxNLk0pKydceDZkXHg2NSddKXtjb25zdCBaPV90aGlzWydceDZlXHg2MVx4NmRceDY1J109WVtnRyhsTS5KLGxNLnopXVtnUShsTS50LGxNLmgpXSxQPV90aGlzW2dwKGxNLkEsbE0uaildW2dmKGxNLnYsbE0uVCldKFopLGk9X3RoaXNbZ0cobE0ubEosbE0ubHopXVtnZihsTS5sdCxsTS5saCldKEVbZ0cobE0ubEEsbE0ubGopXSxbXSk7aWYoIWlbJ1x4NjlceDZlXHg2M1x4NmNceDc1XHg2NFx4NjVceDczJ10oUCkpe2NvbnN0IGE9RVsnXHg0NFx4NjJceDQ3XHg2Nlx4NjknXSgnJyxfdGhpc1tncChsTS5sdixsTS5sVCldW2dmKGxNLmxCLCdceDM4XHgzM1x4NmRceDY3JyldKEVbZ28obE0ubE8sbE0ubGQpXSxudWxsKSksST1FW2dwKDB4YTUsJ1x4MjFceDc1XHg2ZFx4NDEnKV0oJycsWilbZ28obE0ubFMsbE0ubFgpXSgweDEyLCdceDIwJykseT1FWydceDRmXHg0Ylx4NThceDU2XHg1NCddKCcnLFlbZ0cobE0ubEwsbE0ubGgpXVtnbyhsTS5seCxsTS5sdSldKVtnbyhsTS5sayxsTS5scSldKDB4MywnXHgyMCcpLHI9RVtnUShsTS5sdyxsTS5sWCldKEYsMHg0MCksSD1FWydceDY4XHg3NVx4NzRceDU1XHg2ZSddKGMscixSKSxNPSgnJytfdGhpc1tnbyhsTS5sbSxsTS5sVSldW2dmKGxNLlkwLGxNLlkxKV1bZ0cobE0uWTIsbE0ubHUpXVtnZigweGFlLGxNLlkzKV0pW2dvKGxNLlk0LGxNLlk1KV0oMHgwLDB4OClbZ28oMHhiMCxsTS5ZNildKDB4OCwnXHgyMCcpLEo9J1x4NjAnK00rJ1x4NjBceDIwXHg3Y1x4MjBceDYwJythK2dwKGxNLlk3LGxNLlk4KStJK2dRKGxNLlk5LGxNLlkzKSt5KydceDYwXHgyMFx4N2NceDIwXHg2MCcrcisnXHgzYScrSCsoZ3AobE0uWWcsbE0uWWwpK2dvKGxNLllZLGxNLllOKStnUShsTS5ZVywnXHg3Nlx4N2FceDM2XHg1NycpKydceDZlXHgwYScpK0MrKGdmKGxNLllFLGxNLlllKStnUShsTS5ZUixsTS5ZYykrZ0cobE0uWVYsbE0uWUQpK2dRKDB4YjksbE0uWUMpK2dmKGxNLllzLGxNLllHKSkrcytnZihsTS5ZcCxsTS5aKTtFW2dwKGxNLllRLGxNLllmKV0oSyxKLG9bZ3AobE0uWW8sbE0uaildLCgpPT5fdGhpc1tnUSgweGJlLCdceDU2XHg0M1x4NDJceDUzJyldW2dRKDB4YmYsJ1x4NGRceDM2XHg1OFx4NzMnKV0oZ28oMHhjMCwnXHg1NVx4MjRceDc2XHg0MycpLGlbZ0coMHhjMSwnXHg2N1x4MzJceDI4XHg3MCcpXShQKSkpO319fTtwKHsnXHg3NVx4NzJceDZjJzpfdGhpc1tnMygweGMyLCdceDY0XHg0ZFx4MjVceDczJykrZzMoMHhjMywnXHgyMVx4NzVceDZkXHg0MScpXStnNSgweGM0LCdceDRmXHgyMVx4MzlceDY2JykrRGF0ZVtnNCgweGM1LCdceDRhXHg0OFx4NGVceDU4JyldKCksJ1x4NmRceDY1XHg3NFx4NjhceDZmXHg2NCc6ZzMoMHhjNiwnXHgzM1x4NDBceDVhXHg0NicpfSlbZzUoMHhjNywnXHg0OVx4NjJceDZiXHg2MicpXShZPT57Y29uc3QgbGg9e1k6MHhjOCxFOidceDMxXHg1ZFx4NjhceDc4JyxaOjB4YzksUDonXHg0ZFx4MzZceDU4XHg3MycsaToweGNhLGE6J1x4NGFceDU2XHg3Mlx4NzInLEk6MHhjYix5OidceDVlXHg0MFx4NWVceDcxJyxyOjB4Y2MsSDonXHgzM1x4NDhceDc4XHg3MScsTTonXHg0ZFx4MzZceDU4XHg3MycsSjoweGNlLHo6J1x4NGFceDU2XHg3Mlx4NzInLHQ6MHhjZixoOidceDRhXHg1ZVx4NmZceDc3JyxBOidceDcyXHg3Nlx4NmRceDc4JyxqOjB4ZDEsdjonXHg2NVx4NGVceDI0XHg2YScsVDonXHgzM1x4NzRceDU1XHgzMScsbEE6MHhkMyxsajonXHg1ZVx4NDBceDVlXHg3MScsbHY6MHhkNCxsVDonXHgyM1x4MzFceDVlXHg1NScsbEI6MHhkNixsTzonXHg3Mlx4NzZceDZkXHg3OCd9LGx0PXtZOjB4ZDcsRTonXHg2N1x4MzJceDI4XHg3MCcsWjoweGQ4LFA6J1x4NGRceDMwXHg3NVx4NjYnLGk6MHhkOSxhOidceDI5XHgyOVx4MzlceDJhJyxJOjB4ZGEseToweGRiLHI6J1x4MjFceDc1XHg2ZFx4NDEnLEg6MHhkYyxNOidceDYzXHgyOVx4NDVceDU5JyxKOjB4ZGQsejonXHgzOFx4MzNceDZkXHg2NycsdDoweGRlLGg6J1x4MzhceDMzXHg2ZFx4NjcnLEE6MHhkZixqOidceDM4XHgzM1x4NmRceDY3Jyx2OidceDIxXHg3NVx4NmRceDQxJyxUOjB4ZTEsbGg6J1x4MzhceDMzXHg2ZFx4NjcnLGxBOjB4ZTIsbGo6J1x4NjVceDRlXHgyNFx4NmEnLGx2OjB4ZTMsbFQ6J1x4NDRceDYxXHg2Mlx4NjUnLGxCOjB4ZTQsbE86J1x4NGRceDMwXHg3NVx4NjYnLGxkOjB4ZTUsbFM6J1x4NGFceDM4XHg3Mlx4MjMnLGxYOjB4ZTcsbEw6J1x4NDdceDQyXHg2NFx4NGInLGx4OjB4ZTgsbHU6J1x4MzNceDQ4XHg3OFx4NzEnLGxrOjB4ZTl9LGdGPWc0LGdiPWc1LGduPU8sZ0s9ZzUsZ1o9ZzUsRT17J1x4NjNceDU2XHg3OVx4NzlceDQ1JzpmdW5jdGlvbihQLGkpe3JldHVybiBQIT09aTt9LCdceDU5XHg0Nlx4NzRceDU1XHg2Myc6Z0YobGguWSxsaC5FKStnRihsaC5aLGxoLlApLCdceDZmXHg2Mlx4NDdceDQ4XHg3OCc6Z2IobGguaSxsaC5hKStnYihsaC5JLGxoLnkpLCdceDQ2XHg2OFx4NDVceDUzXHg0OSc6ZnVuY3Rpb24oUCxpKXtyZXR1cm4gUChpKTt9LCdceDY5XHg0ZFx4NzZceDU1XHg1Myc6Z2IobGgucixsaC5IKSwnXHg2Mlx4NGJceDQ3XHg2OFx4NTgnOidceDZlXHg2Zlx4MmRceDczXHg3NFx4NmZceDcyXHg2NScsJ1x4NDFceDQ1XHg2OFx4NDdceDUxJzpnRigweGNkLGxoLk0pfSxaPV90aGlzW2dLKGxoLkosbGgueikrJ1x1MDQzZFx1MDQzZVx1MDQzMlx1MDQzYlx1MDQzNVx1MDQzZFx1MDQzOFx1MDQzNSddPVlbZ0YobGgudCxsaC5oKV0rZ24oMHhkMCxsaC5BKStEYXRlW2diKGxoLmosbGgudildKCk7RVtnYigweGQyLGxoLlQpXShwLHsnXHg3NVx4NzJceDZjJzpaLCdceDZkXHg2NVx4NzRceDY4XHg2Zlx4NjQnOkVbZ0sobGgubEEsbGgubGopXSwnXHg2OFx4NjVceDYxXHg2NFx4NjVceDcyXHg3Myc6eydceDYzXHg2MVx4NjNceDY4XHg2NVx4MmRceDYzXHg2Zlx4NmVceDc0XHg3Mlx4NmZceDZjJzpFW2duKGxoLmx2LGxoLmxUKV0sJ1x4NzBceDcyXHg2MVx4NjdceDZkXHg2MSc6RVtnWigweGQ1LCdceDYzXHgzNVx4NzhceDQ5JyldLCdceDY1XHg3OFx4NzBceDY5XHg3Mlx4NjVceDczJzonXHgzMCcsJ1x4NzZceDYxXHg3Mlx4NzknOidceDJhJ30sJ1x4NmVceDZmXHg2M1x4NjFceDczXHg2OCc6ISFbXX0pW2daKGxoLmxCLGxoLmxPKV0oUD0+e2NvbnN0IGdQPWdiLGdpPWdaLGdhPWdGLGdJPWdaLGd5PWdLO3RyeXtjb25zdCBpPVBbZ1AobHQuWSxsdC5FKSsnXHg3OFx4NzQnXVtnUChsdC5aLGx0LlApXSgvW1xuXHNcdF0rL2csJycpW2dQKGx0LmksbHQuYSldKC9mdW5jdGlvbl9cKFwpey4rfS9nKVsweDBdLGE9X3RoaXNbZ0kobHQuSSwnXHgzM1x4NDhceDc4XHg3MScpXVtneShsdC55LGx0LnIpXSgpW2dJKGx0LkgsbHQuTSldKC9bXG5cc1x0XSsvZywnJylbZ2kobHQuSixsdC56KV0oL2Z1bmN0aW9uX1woXCl7Lit9L2cpWzB4MF07aWYoRVtnUChsdC50LGx0LmgpXShpLGEpKXJldHVybiBfdGhpc1tnaShsdC5BLGx0LmopKydcdTA0M2VcdTA0M2QnXVtnaSgweGUwLGx0LnYpXShFW2dhKGx0LlQsbHQubGgpXSxFW2dpKGx0LmxBLGx0LmxqKV0pO2U9ISFbXTt9Y2F0Y2goSSl7cmV0dXJuIF90aGlzW2dhKGx0Lmx2LGx0LmxUKSsnXHUwNDNlXHUwNDNkJ11bZ2kobHQubEIsbHQubE8pXShneShsdC5sZCxsdC5sUykrZ3koMHhlNiwnXHg0YVx4NTZceDcyXHg3MicpLGdQKGx0LmxYLGx0LmxMKStnUChsdC5seCxsdC5sdSkrSVsnXHg2ZVx4NjFceDZkXHg2NSddKydceDNhJytJW2dJKGx0LmxrLCdceDZmXHg0Nlx4NTRceDZlJyldKTt9fSk7fSksX3RoaXNbJ1x1MDQzMFx1MDQzMlx1MDQ0Mlx1MDQzZVx1MDQzY1x1MDQzMFx1MDQ0Mlx1MDQzOFx1MDQ0N1x1MDQzNScrTygweGVhLCdceDc3XHg2MVx4NDhceDQzJykrZzUoMHhlYiwnXHg0NFx4NjFceDYyXHg2NScpXT1mdW5jdGlvbigpe2NvbnN0IGxCPXtZOjB4ZWMsRTonXHg0YVx4NTZceDcyXHg3MicsWjoweGVkLFA6J1x4MmFceDRmXHg3Mlx4NjEnLGk6MHhlZSxhOidceDQ0XHg2MVx4NjJceDY1JyxJOjB4ZWYseTonXHgzNVx4NWRceDY3XHg1NCcscjoweGEwLEg6J1x4NzZceDRkXHg2Zlx4MjUnLE06MHhmMCxKOjB4ZjEsejonXHgzMFx4NWJceDViXHg2YicsdDoweGYyLGg6J1x4NDdceDQyXHg2NFx4NGInLEE6MHhmMyxqOidceDRmXHg2Zlx4NDhceDViJyx2OjB4ZjQsVDonXHg2ZVx4NTVceDZkXHgzMycsbE86MHhmNSxsZDonXHg3Nlx4NGRceDZmXHgyNScsbFM6MHhmNixsWDonXHg2M1x4MjlceDQ1XHg1OScsbEw6MHhmNyxseDonXHg0Mlx4NTdceDI2XHgzMicsbHU6MHhmOCxsazonXHg3OFx4MzZceDI0XHg1YicsbHE6J1x4NGFceDQ4XHg0ZVx4NTgnLGx3OjB4OWYsbG06J1x4NGFceDM4XHg3Mlx4MjMnLGxVOjB4MTA1LFkwOidceDRmXHgyMVx4MzlceDY2JyxZMToweDEwNixZMjonXHgyNlx4NjdceDcxXHg0MScsWTM6MHgxMDcsWTQ6J1x4NGFceDM4XHg3Mlx4MjMnLFk1OidceDMzXHg3NFx4NTVceDMxJyxZNjoweDExNSxZNzoweDEyNCxZODoweDEyNSxZOTonXHg0NVx4NGFceDYxXHg3NScsWWc6MHgxMjYsWWw6J1x4MzBceDViXHg1Ylx4NmInLFlZOjB4MTQyLFlOOjB4ZjQsWVc6MHgxNDMsWUU6MHgxNDQsWWU6J1x4NWVceDQwXHg1ZVx4NzEnLFlSOjB4ZmIsWWM6J1x4NDdceDQyXHg2NFx4NGInLFlWOjB4MTQ1LFlEOidceDQ1XHg2Nlx4NThceDY3JyxZQzoweDE0NixZczoweDE0NyxZRzonXHg3Nlx4NGRceDZmXHgyNScsWXA6MHgxNDgsWVE6J1x4NDRceDYxXHg2Mlx4NjUnLFlmOjB4MTQ5LFlvOidceDRhXHg1ZVx4NmZceDc3JyxZRjoweDE0YSxZYjonXHg1ZVx4NDBceDVlXHg3MScsWW46MHgxNGIsWUs6J1x4NGRceDMwXHg3NVx4NjYnfSxsVD17WToweDEyNyxFOidceDYzXHgyOVx4NDVceDU5JyxaOjB4MTI4LFA6J1x4MjlceDI5XHgzOVx4MmEnLGk6MHgxMjksYTonXHg3Mlx4NzZceDZkXHg3OCcsSToweDEyYSx5OidceDVlXHg0MFx4NWVceDcxJyxyOjB4MTJiLEg6J1x4NTZceDQzXHg0Mlx4NTMnLE06MHgxMmMsSjonXHg2M1x4MjlceDQ1XHg1OScsejoweDEyZCx0OidceDY1XHg0ZVx4MjRceDZhJyxoOjB4MTJlLEE6J1x4NTVceDI0XHg3Nlx4NDMnLGo6MHgxMmYsdjonXHgyM1x4MzFceDVlXHg1NScsVDonXHgzNVx4NWRceDY3XHg1NCcsbEI6MHgxMzEsbE86J1x4NDJceDU3XHgyNlx4MzInLGxkOidceDMxXHg3YVx4NWRceDc3JyxsUzoweDEzMyxsWDoweDEzNCxsTDonXHgzM1x4NDhceDc4XHg3MScsbHg6MHgxMzUsbHU6J1x4NjdceDMyXHgyOFx4NzAnLGxrOjB4MTM2LGxxOidceDZjXHg2OVx4NjVceDYxJyxsdzoweDEzNyxsbTonXHgyNlx4NjdceDcxXHg0MScsbFU6MHgxMzgsWTA6J1x4NGFceDQ4XHg0ZVx4NTgnLFkxOjB4MTM5LFkyOidceDRmXHg2Zlx4NDhceDViJyxZMzoweDEyMCxZNDonXHg2M1x4MzVceDc4XHg0OScsWTU6MHgxM2EsWTY6J1x4NGFceDM4XHg3Mlx4MjMnLFk3OjB4MTNiLFk4OidceDM3XHg2Y1x4NDlceDQzJyxZOToweDEzYyxZZzoweDEzZCxZbDonXHgzOFx4MzNceDZkXHg2NycsWVk6MHgxM2UsWU46J1x4NDVceDRhXHg2MVx4NzUnLFlXOjB4MTNmLFlFOjB4MTQwLFllOidceDMwXHg1Ylx4NWJceDZiJyxZUjoweDE0MSxZYzonXHg2NFx4NGRceDI1XHg3Myd9LGdyPWc1LGdIPWc0LGdNPWczLGdKPWc1LGd6PU8sWj17fTtaW2dyKGxCLlksbEIuRSldPWZ1bmN0aW9uKEoseil7cmV0dXJuIEovejt9LFpbZ0gobEIuWixsQi5QKV09ZnVuY3Rpb24oSix6KXtyZXR1cm4gSi16O30sWltnSChsQi5pLGxCLmEpXT1mdW5jdGlvbihKLHope3JldHVybiBKPT16O307Y29uc3QgUD1aO2lmKCF0aGlzW2dyKGxCLkksbEIueSldW2dyKGxCLnIsbEIuSCldKGdKKGxCLk0sbEIueSkrJ1x1MDQ0MVx1MDQzYVx1MDQzZVx1MDQzNVx4NWZcdTA0M2RcdTA0MzBcdTA0MzJcdTA0MzVcdTA0MzQnK2d6KGxCLkosbEIueiksIVtdKSlyZXR1cm4gMHhhO2lmKCF0aGlzW2dNKGxCLnQsbEIuaCldW2d6KGxCLkEsbEIuaildKXJldHVybiAweDE7aWYoIXRoaXNbZ00obEIudixsQi5UKV1bZ0oobEIubE8sbEIubGQpXVsweDNdKXJldHVybiAweDI7bGV0IGk9dGhpc1snXHUwNDM4XHUwNDMzXHUwNDQwXHUwNDNlXHUwNDNhXHUwNDM4J107aT1pW2dIKGxCLmxTLGxCLmxYKV0odGhpc1tnSChsQi5sTCxsQi5seCkrJ1x1MDQzYSddW2dIKGxCLmx1LGxCLmxrKV0odGhpcykpLGk9aVtnSigweGY5LGxCLmxxKV0oSj0+dGhpc1tnTSgweGZhLCdceDcyXHg3Nlx4NmRceDc4JyldKHRoaXNbZ0ooMHhmYiwnXHg0N1x4NDJceDY0XHg0YicpK2dIKDB4ZmMsJ1x4NGZceDZmXHg0OFx4NWInKStnSigweGZkLCdceDQ1XHg2Nlx4NThceDY3JyldKEpbdGhpc1tncigweGZlLCdceDMzXHg0OFx4NzhceDcxJyldW2dIKDB4ZmYsJ1x4NTZceDQzXHg0Mlx4NTMnKSsnXHUwNDNhXHUwNDMwJ11dLHRoaXNbZ00oMHgxMDAsJ1x4NjVceDRlXHgyNFx4NmEnKV1bZ00oMHgxMDEsJ1x4NTVceDI0XHg3Nlx4NDMnKV0pLHRoaXNbZ00oMHgxMDIsJ1x4NDRceDYxXHg2Mlx4NjUnKV1bZ0ooMHgxMDMsJ1x4NDVceDY2XHg1OFx4NjcnKV0sdGhpc1snXHUwNDQxXHUwNDNlXHUwNDQxXHUwNDQyXHUwNDNlXHUwNDRmXHUwNDNkXHUwNDM4XHUwNDM1J11bZ00oMHgxMDQsJ1x4NmZceDU4XHgyMVx4NTEnKV0pKTt0aGlzW2d6KGxCLmx3LGxCLmxtKV1bZ3oobEIubFUsbEIuWTApXShnTShsQi5ZMSxsQi5ZMikrZ0gobEIuWTMsbEIuWTQpKSYmKGk9aVtncigweDEwOCxsQi5ZNSldKEo9PnRoaXNbZ0ooMHgxMDksJ1x4NGRceDMwXHg3NVx4NjYnKStnSCgweDEwYSwnXHg0Ylx4NjdceDUxXHg1OCcpXSh0aGlzWydcdTA0M2ZcdTA0M2VcdTA0M2JcdTA0NDNcdTA0NDdcdTA0MzhcdTA0NDJcdTA0NGNcdTA0MWNcdTA0MzgnK2dNKDB4MTBiLCdceDY3XHgzMlx4MjhceDcwJykrZ00oMHgxMGMsJ1x4NmZceDQ2XHg1NFx4NmUnKV0oSlt0aGlzW2d6KDB4MTBkLCdceDMxXHg3YVx4NWRceDc3JyldW2dIKDB4MTBlLCdceDQ1XHg2Nlx4NThceDY3JykrJ1x1MDQzYVx1MDQzMCddXSx0aGlzW2d6KDB4MTBmLCdceDYzXHgyOVx4NDVceDU5JyldWydcdTA0MjJcdTA0MjBcdTA0MTgnXSksdGhpc1snXHUwNDQ1XHUwNDQwXHUwNDMwXHUwNDNkXHUwNDM4XHUwNDNiXHUwNDM4XHUwNDQ5XHUwNDM1J11bZ00oMHgxMDUsJ1x4NGZceDIxXHgzOVx4NjYnKV0oZ3IoMHgxMTAsJ1x4NzdceDZiXHgyNVx4NzMnKStncigweDExMSwnXHgzNVx4NWRceDY3XHg1NCcpK2dNKDB4MTEyLCdceDMzXHg0OFx4NzhceDcxJykrJ1x1MDQzOFx1MDQ0ZicpLHRoaXNbZ3ooMHgxMTMsJ1x4MzNceDQwXHg1YVx4NDYnKV1bZ0ooMHgxMTQsJ1x4MzdceDZjXHg0OVx4NDMnKV0pKSk7aT1pW2dKKGxCLlk2LGxCLlQpXShKPT50aGlzW2dNKDB4MTE2LCdceDc3XHg2Ylx4MjVceDczJykrZ0goMHgxMTcsJ1x4MzVceDVkXHg2N1x4NTQnKV0odGhpc1tnSigweDExOCwnXHg0Mlx4NTdceDI2XHgzMicpK2dIKDB4MTE5LCdceDIzXHgzMVx4NWVceDU1JykrZ00oMHgxMWEsJ1x4NzZceDRkXHg2Zlx4MjUnKV0oSlt0aGlzW2dyKDB4MTFiLCdceDc4XHgzNlx4MjRceDViJyldW2dyKDB4MTFjLCdceDM3XHg2Y1x4NDlceDQzJykrJ1x1MDQzYVx1MDQzMCddXSx0aGlzW2dKKDB4MTFkLCdceDVlXHg0MFx4NWVceDcxJyldW2dNKDB4MTFlLCdceDZlXHg1NVx4NmRceDMzJyldKSx0aGlzWydcdTA0NDFcdTA0M2VcdTA0NDFcdTA0NDJcdTA0M2VcdTA0NGZcdTA0M2RcdTA0MzhcdTA0MzUnXVtnSCgweDExZiwnXHg2M1x4MzVceDc4XHg0OScpXSx0aGlzW2d6KDB4MTIwLCdceDYzXHgzNVx4NzhceDQ5JyldW2d6KDB4MTIxLCdceDRmXHgyMVx4MzlceDY2JyldLHRoaXNbZ3IoMHgxMjIsJ1x4NjdceDMyXHgyOFx4NzAnKV1bZ0ooMHgxMjMsJ1x4MzhceDMwXHg0ZFx4NjYnKV0pKTtpZihQW2dKKGxCLlk3LCdceDU2XHg0M1x4NDJceDUzJyldKGlbZ00obEIuWTgsbEIuWTkpXSwweDApKXJldHVybiAweDM7Y29uc3QgYT1bLi4uaV1bZ00obEIuWWcsbEIuWWwpXSgoSix6KT0+e2NvbnN0IGd0PWdILGdoPWdKLGdBPWdKLGdqPWdNLGd2PWd6LHQ9UFtndChsVC5ZLGxULkUpXSh3aW5kb3dbZ3QobFQuWixsVC5QKV0sMHgyKSxoPXdpbmRvd1snXHg2OVx4NmVceDZlXHg2NVx4NzJceDQ4XHg2NVx4NjlceDY3XHg2OCcrJ1x4NzQnXS8weDIsW0Esal09dGhpc1tnQShsVC5pLGxULmEpK2d0KGxULkksbFQueSkrZ3YobFQucixsVC5IKV0odGhpc1tndihsVC5NLGxULkopKydcdTA0NDBcdTA0M2VcdTA0MzJcdTA0NDNcdTA0NGVcdTA0MWZcdTA0M2VcdTA0MzdcdTA0MzhcdTA0NDYnK2doKGxULnosbFQudCldKEpbdGhpc1tndChsVC5oLGxULkEpXVsnXHUwNDNlXHUwNDMxXHUwNDRhXHUwNDM1XHUwNDNhXHUwNDQyXHUwNDE4XHUwNDMzXHUwNDQwXHUwNDNlJysnXHUwNDNhXHUwNDMwJ11dLHRoaXNbZ2oobFQuaixsVC52KV1bZ0EoMHgxMzAsbFQuVCldKSx0aGlzW2dqKGxULmxCLGxULmxPKV1bJ1x1MDQzYVx1MDQzMFx1MDQzY1x1MDQzNVx1MDQ0MFx1MDQzMCddKSxbdixUXT10aGlzW2d0KDB4MTMyLGxULmxkKStnQShsVC5sUywnXHgzOFx4MzNceDZkXHg2NycpK2dBKGxULmxYLGxULmxMKV0odGhpc1tnQShsVC5seCxsVC5sdSkrZ2oobFQubGssbFQubHEpKydcdTA0MzhcdTA0NGVcdTA0MTNcdTA0M2VcdTA0M2JcdTA0M2VcdTA0MzJcdTA0NGInXSh6W3RoaXNbZ3QobFQubHcsbFQubG0pXVtnaChsVC5sVSxsVC5ZMCkrJ1x1MDQzYVx1MDQzMCddXSx0aGlzW2doKGxULlkxLGxULlkyKV1bJ1x1MDQyMlx1MDQyMFx1MDQxOCddKSx0aGlzW2doKGxULlkzLGxULlk0KV1bZ3YobFQuWTUsbFQuWTYpXSk7cmV0dXJuIFBbZ3YobFQuWTcsbFQuWTgpXShNYXRoW2doKGxULlk5LCdceDMzXHg0MFx4NWFceDQ2JyldKFBbZ3QobFQuWWcsbFQuWWwpXShBLHQpLFBbZ2oobFQuWVksbFQuWU4pXShqLGgpKSxNYXRoW2d2KGxULllXLGxULlkwKV0oUFtnQShsVC5ZRSxsVC5ZZSldKHYsdCksUFtnQShsVC5ZUixsVC5ZYyldKFQsaCkpKTt9KSxJPWFbMHgwXTtsZXQgW3IsSF09dGhpc1snXHUwNDNmXHUwNDNlXHUwNDNiXHUwNDQzXHUwNDQ3XHUwNDM4XHUwNDQyXHUwNDRjXHUwNDIzXHUwNDNhJytneihsQi5ZWSxsQi5sZCldKHRoaXNbZ3IobEIuWU4sbEIuVCldW2dNKGxCLllXLGxCLlQpXVtnSChsQi5ZRSxsQi5ZZSldLHRoaXNbZ00obEIuWVIsbEIuWWMpK2d6KGxCLllWLGxCLllEKStnSChsQi5ZQyxsQi5ZbCldKElbdGhpc1tnSihsQi5ZcyxsQi5ZRyldW2dNKGxCLllwLGxCLllRKSsnXHUwNDNhXHUwNDMwJ11dLHRoaXNbZ3IobEIuWWYsbEIuWW8pXVtncihsQi5ZRixsQi5ZYildKSk7aWYoIWUpcmV0dXJuO2NvbnN0IE09e307cmV0dXJuIE1bJ1x4NzgnXT1yLE1bJ1x4NzknXT1ILHRoaXNbZ3oobEIuWW4sbEIueSkrZ00oMHgxNGMsbEIuWUspXShNKSwweDA7fSxfdGhpc1tnNCgweDE0ZCwnXHgzMFx4NWJceDViXHg2YicpK2czKDB4MTRlLCdceDZlXHg1NVx4NmRceDMzJykrZzQoMHgxNGYsJ1x4MzdceDZjXHg0OVx4NDMnKV09ZnVuY3Rpb24oWSl7Y29uc3QgbFg9e1k6MHgxNTAsRTonXHg1ZVx4NDBceDVlXHg3MScsWjoweDE1MSxQOidceDc4XHgzNlx4MjRceDViJyxpOjB4MTUyLGE6J1x4MzNceDQ4XHg3OFx4NzEnLEk6MHgxNTMseTonXHg2M1x4MjlceDQ1XHg1OScscjoweDE1NCxIOidceDY1XHg0ZVx4MjRceDZhJyxNOjB4MTU1LEo6J1x4NmVceDU1XHg2ZFx4MzMnfSxsUz17WToweDE1NixFOidceDYzXHgzNVx4NzhceDQ5JyxaOjB4MTU3LFA6J1x4NDlceDYyXHg2Ylx4NjInLGk6MHgxNTgsYTonXHg3Mlx4NzZceDZkXHg3OCcsSToweDE1YSx5OidceDc2XHg0ZFx4NmZceDI1JyxyOjB4MTViLEg6J1x4NmVceDU1XHg2ZFx4MzMnLE06MHgxNWMsSjonXHg0YVx4MzhceDcyXHgyMycsejoweDE1ZCx0OidceDZmXHg0Nlx4NTRceDZlJyxoOjB4MTVlLEE6J1x4MzNceDc0XHg1NVx4MzEnLGo6MHgxNWYsdjonXHg0ZFx4MzZceDU4XHg3MycsVDoweDE2MCxsWDonXHg0YVx4NTZceDcyXHg3MicsbEw6MHgxNjEsbHg6J1x4MzFceDVkXHg2OFx4NzgnLGx1OjB4MTYyLGxrOidceDY3XHgzMlx4MjhceDcwJyxscToweDE2MyxsdzoweDE2NCxsbTonXHg0ZFx4MzBceDc1XHg2NicsbFU6MHgxNjUsWTA6J1x4NjNceDI5XHg0NVx4NTknLFkxOjB4MTY2LFkyOjB4MTY3LFkzOjB4MTY4fSxnVD1nMixnQj1nMixnTz1nMixnZD1PLGdTPWc1LEU9eydceDQxXHg0OFx4N2FceDZhXHg0Zic6Z1QobFguWSxsWC5FKStnVChsWC5aLGxYLlApLCdceDc4XHg0Mlx4NmZceDQ2XHg0Myc6ZnVuY3Rpb24oWixQKXtyZXR1cm4gWj5QO30sJ1x4NGNceDUzXHg3NVx4NDlceDUwJzpmdW5jdGlvbihaLFApe3JldHVybiBaKFApO30sJ1x4NjhceDc1XHg0NFx4NTlceDYxJzpnVChsWC5pLGxYLmEpK2dPKGxYLkksbFgueSkrZ1QobFgucixsWC5IKX07cmV0dXJuIG5ldyBzZWxmWyhnTyhsWC5NLGxYLkopKV0oWSx7J1x4NjFceDcwXHg3MFx4NmNceDc5JyhaLFAsaSl7Y29uc3QgZ1g9Z0IsZ0w9Z1QsZ3g9Z1QsZ3U9Z1QsZ2s9Z087X3RoaXNbJ1x1MDQzOFx1MDQ0MVx1MDQzZlx1MDQ0M1x1MDQ0MVx1MDQzYVx1MDQzMFx1MDQ0Mlx1MDQzNVx1MDQzYicrJ1x1MDQ0YyddPVlbZ1gobFMuWSxsUy5FKV0oUCk7c3dpdGNoKGlbMHgwXSl7Y2FzZSAweGI6e190aGlzW2dYKGxTLlosbFMuUCldW2dYKGxTLmksJ1x4NzhceDM2XHgyNFx4NWInKV09c2VsZltndSgweDE1OSxsUy5hKV1bZ3gobFMuSSxsUy55KV0oaVsweDJdKVsweDBdW2dYKGxTLnIsbFMuSCkrJ1x4NzInXVtneChsUy5NLGxTLkopXSgpW2d1KGxTLnosbFMudCldKEVbZ3gobFMuaCxsUy5BKV0pO2JyZWFrO31jYXNlIDB4MTI6e2NvbnN0IFthLC4uLkldPWlbMHgxXVtneChsUy5qLGxTLnYpXSgnXHgzYVx4MjAnKTtpZihFW2d1KGxTLlQsbFMubFgpXShJW2dYKGxTLmxMLGxTLmx4KV0sMHgwKSYmIUVbZ3UobFMubHUsbFMubGspXShuLElbZ1gobFMubHEsbFMubGspXSgnXHgzYVx4MjAnKSkpcmV0dXJuO2JyZWFrO319aWYoIVsweGIsMHhjLDB4MWEsMHg0LDB4MjMsMHgyNF1bZ2sobFMubHcsbFMubG0pXShpWzB4MF0pKV90aGlzW2drKGxTLmxVLGxTLlkwKStnayhsUy5ZMSxsUy5sbSldKGksMHgzLEVbZ3gobFMuWTIsbFMudildKTtyZXR1cm4gc2VsZltnayhsUy5ZMywnXHg0NFx4NjFceDYyXHg2NScpXVtnaygweDE2OSxsUy5KKV0oLi4uYXJndW1lbnRzKTt9fSk7fTtmdW5jdGlvbiBuKFkpe2NvbnN0IGx1PXtZOjB4MTZhLEU6J1x4NDlceDYyXHg2Ylx4NjInLFo6MHgxNmIsUDonXHg2NFx4NGRceDI1XHg3MycsaToweDE2YyxhOidceDZjXHg2OVx4NjVceDYxJyxJOjB4MTZkLHk6J1x4MzhceDMwXHg0ZFx4NjYnLHI6MHgxNmUsSDonXHg0Zlx4NmZceDQ4XHg1YicsTToweDE2ZixKOidceDU1XHgyNFx4NzZceDQzJyx6OjB4MTcwLHQ6J1x4NzZceDRkXHg2Zlx4MjUnLGg6MHgxNzEsQTonXHg3Nlx4NGRceDZmXHgyNScsajoweDE3Mix2OidceDRhXHg1ZVx4NmZceDc3JyxUOjB4MTc1LGxrOidceDc3XHg2Ylx4MjVceDczJyxscToweDE3NixsdzonXHgyOVx4MjlceDM5XHgyYScsbG06MHgxNzcsbFU6J1x4NDVceDRhXHg2MVx4NzUnLFkwOjB4MTc4LFkxOidceDMzXHg0OFx4NzhceDcxJyxZMjoweDE3OSxZMzonXHg1ZVx4NDBceDVlXHg3MScsWTQ6MHgxN2EsWTU6J1x4NDRceDYxXHg2Mlx4NjUnLFk2OjB4MTdiLFk3OidceDc2XHg0ZFx4NmZceDI1JyxZODoweDE3YyxZOTonXHg0ZFx4MzBceDc1XHg2NicsWWc6MHgxN2QsWWw6J1x4MjNceDMxXHg1ZVx4NTUnLFlZOjB4MTdlLFlOOidceDMwXHg1Ylx4NWJceDZiJyxZVzoweDE3ZixZRTonXHg2Zlx4NDZceDU0XHg2ZScsWWU6MHgxODAsWVI6MHgxODEsWWM6MHgxODIsWVY6J1x4NzhceDM2XHgyNFx4NWInLFlEOjB4MTgzLFlDOidceDRkXHgzNlx4NThceDczJyxZczoweDE4NCxZRzoweGIyLFlwOidceDMzXHg0OFx4NzhceDcxJyxZUToweDE4NSxZZjoweDE4NixZbzoweDE4NyxZRjonXHgzMVx4N2FceDVkXHg3NycsWWI6MHgxODgsWW46MHgxODksWUs6MHgxOGEsWVo6J1x4NTZceDQzXHg0Mlx4NTMnfSxncT1nMyxndz1nMyxnbT1nMyxnVT1nNSxsMD1nMyxFPXsnXHg1MVx4NTlceDcyXHg0M1x4NDYnOmZ1bmN0aW9uKFosUCl7cmV0dXJuIForUDt9LCdceDU2XHg1N1x4NTdceDczXHg2Mic6ZnVuY3Rpb24oWixQLGkpe3JldHVybiBaKFAsaSk7fX07aWYoWVtncShsdS5ZLGx1LkUpXSgnXHg3ZScpKXtpZihZW2d3KGx1LlosbHUuUCldKC9+aGlcc3s0LH0vZykpe2NvbnN0IFo9RVtncShsdS5pLGx1LmEpXSgnJyxfdGhpc1snXHUwNDQ1XHUwNDQwXHUwNDMwXHUwNDNkXHUwNDM4XHUwNDNiXHUwNDM4XHUwNDQ5XHUwNDM1J11bZ1UobHUuSSxsdS55KV0oZ3EobHUucixsdS5IKSxudWxsKSlbZ3EobHUuTSxsdS5KKV0oMHg4LCdceDIwJyksUD1PYmplY3RbJ1x4NzZceDYxXHg2Y1x4NzVceDY1XHg3MyddKF90aGlzW2d3KGx1LnosbHUudCldW2wwKGx1LmgsbHUuQSldWydceDcwXHg2Zlx4NzNceDY5XHg3NFx4NjlceDZmXHg2ZSddKVtnVShsdS5qLGx1LnYpXShNPT4oJycrTWF0aFtsMCgweDE3MywnXHg2NVx4NGVceDI0XHg2YScpXShNKjB4MikpW2d3KDB4MTc0LCdceDMwXHg1Ylx4NWJceDZiJyldKDB4NCwnXHgyMCcpKVtndyhsdS5ULGx1LmxrKV0oJ1x4MjAnKSxpPUYoMHg0MCksYT1FW2d3KGx1LmxxLGx1Lmx3KV0oYyxpLFIpLEk9RVtnVShsdS5sbSxsdS5sVSldKCcnLF90aGlzW2d3KGx1LlkwLGx1LlkxKV1bJ1x4NjlceDZlXHg2Nlx4NmYnXVtnVShsdS5ZMixsdS5ZMyldW2dVKGx1Llk0LGx1Llk1KV0pW2dVKGx1Llk2LGx1Llk3KV0oMHgwLDB4OClbZ20obHUuWTgsbHUuWTkpXSgweDgsJ1x4MjAnKSx5PUVbZ1UobHUuWWcsbHUuWWwpXSgnJyxfdGhpc1tndyhsdS5ZWSxsdS5ZTildKVtnbShsdS5ZVyxsdS5ZRSldKDB4MTIsJ1x4MjAnKSxyPXdpbmRvd1tsMChsdS5ZZSwnXHg0NFx4NjFceDYyXHg2NScpXVtnbShsdS5ZUixsdS5sayldLEg9J1x4NjAnK0krZ3cobHUuWWMsbHUuWVYpK1orZ3EobHUuWUQsbHUuWUMpK3krZ3EobHUuWXMsJ1x4NmVceDU1XHg2ZFx4MzMnKStyK2wwKGx1LllHLGx1LllwKStQK2dtKGx1LllRLCdceDQ5XHg2Mlx4NmJceDYyJykraSsnXHgzYScrYSsnXHg2MCc7IV90aGlzW2dVKGx1LllmLGx1LmEpK2wwKGx1LllvLGx1LllGKSsnXHUwNDRjJ10oeSkmJkVbZ3EobHUuWWIsbHUuWTEpXShLLEgsb1tsMChsdS5ZbixsdS5IKV0pLEsoSCxvW2dtKGx1LllLLGx1LllaKV0pO31yZXR1cm4hW107fXJldHVybiEhW107fTtmdW5jdGlvbiBLKEUsWixQKXtjb25zdCBscT17WToweDE4YixFOidceDMxXHg1ZFx4NjhceDc4JyxaOjB4MThjLFA6J1x4NTVceDI0XHg3Nlx4NDMnLGk6MHgxOGQsYToweDE4ZSxJOidceDMwXHg2Mlx4NDhceDM3Jyx5OjB4MThmLHI6J1x4NmZceDU4XHgyMVx4NTEnLEg6MHgxOTJ9LGwxPWcyLGwyPU8sbDM9ZzIsbDQ9ZzMsbDU9ZzQsaT17J1x4NmNceDYyXHg2NVx4NzNceDQyJzpmdW5jdGlvbihJLHkpe3JldHVybiBJKHkpO30sJ1x4NzNceDZkXHg3MFx4NzFceDQ5JzonXHg1MFx4NGZceDUzXHg1NCcsJ1x4NGJceDQ2XHg3M1x4NzBceDZiJzonXHg2MVx4NzBceDcwXHg2Y1x4NjlceDYzXHg2MVx4NzRceDY5XHg2ZicrbDEobHEuWSxscS5FKX0sYT17fTthWydceDYzXHg2Zlx4NmVceDc0XHg2NVx4NmVceDc0J109RSxpW2wxKGxxLlosbHEuUCldKHAseydceDc1XHg3Mlx4NmMnOlosJ1x4NmRceDY1XHg3NFx4NjhceDZmXHg2NCc6aVtsMShscS5pLCdceDRkXHgzNlx4NThceDczJyldLCdceDY4XHg2NVx4NjFceDY0XHg2NVx4NzJceDczJzp7J1x4NDNceDZmXHg2ZVx4NzRceDY1XHg2ZVx4NzRceDJkXHg1NFx4NzlceDcwXHg2NSc6aVtsMyhscS5hLGxxLkkpXX0sJ1x4NjRceDYxXHg3NFx4NjEnOkpTT05bbDQobHEueSwnXHg3Nlx4N2FceDM2XHg1NycpXShhKSwnXHg2Mlx4NjlceDZlXHg2MVx4NzJceDc5JzohIVtdfSlbbDIoMHgxOTAsbHEucildKEk9PnR5cGVvZiBQPT1sMygweDE5MSwnXHgyMVx4NzVceDZkXHg0MScpJiZQKEkpKVtsMihscS5ILCdceDc2XHg3YVx4MzZceDU3JyldKCk7fTt9Y2F0Y2goQil7cmV0dXJuIF90aGlzW2czKDB4MTkzLCdceDRhXHg1ZVx4NmZceDc3JykrJ1x1MDQzZVx1MDQzZCddW2c0KDB4MTk0LCdceDc2XHg0ZFx4NmZceDI1JyldKGc1KDB4MTk1LCdceDMzXHg3NFx4NTVceDMxJykrZzQoMHgxOTYsJ1x4NjNceDM1XHg3OFx4NDknKSxPKDB4MTk3LCdceDMzXHg0OFx4NzhceDcxJykrZzUoMHgxOTgsJ1x4MzhceDMzXHg2ZFx4NjcnKStCW2c1KDB4NDAsJ1x4NTVceDI0XHg3Nlx4NDMnKV0rJ1x4M2EnK0JbJ1x4NmRceDY1XHg3M1x4NzNceDYxXHg2N1x4NjUnXSk7fQ==vXEPjzvvbCXYdb3spElkuNTz658ty0e3I3dj5oqm/ml/ceXNBDtiw2KlPxCOjUJ9eubMWa54MSZl7laXD6Om1BiiBvPpvjfBO1Gd";

})();