// ==UserScript==
// @name 🍫
// @namespace https://forum.blackrussia.online
// @version 0.1.6.8
// @description Для борьбы с техническими шоколадками🍫
// @author L.Rovenni
// @match https://forum.blackrussia.online/index.php?threads/*
// @include https://forum.blackrussia.online/index.php?threads/
// @grant none
// @license MIT
// @collaborator
// @icon https://icons.iconarchive.com/icons/thesquid.ink/free-flat-sample/128/support-icon.png
// @downloadURL https://update.greasyfork.org/scripts/466945/%F0%9F%8D%AB.user.js
// @updateURL https://update.greasyfork.org/scripts/466945/%F0%9F%8D%AB.meta.js
// ==/UserScript==

(function () {
'use strict';
const UNACCEPT_PREFIX = 4; // префикс отказано
const PIN_PREFIX = 2; //  префикс закрепить	
const COMMAND_PREFIX = 10; // команде проекта
const CLOSE_PREFIX = 7; // префикс закрыто
const DECIDED_PREFIX = 6; // префикс решено
const TECHADM_PREFIX = 13 // теху администратору
const WATCHED_PREFIX = 9; // рассмотрено
const WAIT_PREFIX = 14; // ожидание (для переноса в баг-трекер)
const NO_PREFIX = 0;
const buttons = [
{
	title: 'Приветсвие',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	'[CENTER] текст [/CENTER][/FONT][/SIZE]',
},
{
  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ  Для Логировщиков ᅠ ᅠ ᅠᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ',
},
{
	title: 'Рассмотрение',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	'[CENTER]Ваша тема взята на рассмотрение, ожидайте ответ в течение 24-х часов.[/CENTER][/FONT][/SIZE]',
	prefix: PIN_PREFIX,
	status: true,
},
{
	title: 'Ожидайте вердикта Куратора',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	"[CENTER]Ваша тема закреплена и ожидает вердикта <u>Куратора Технический специалистов</u>.<br>" +
	'[CENTER]<u>Создавать подобные темы не нужно</u>.[/CENTER][/FONT][/SIZE]',
	prefix: PIN_PREFIX,
	status: true,
},
{
	title: 'ДУБЛИРОВАНИЕ',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	"[CENTER]Данная тема является <u>дубликатом вашей предыдущей темы</u>.<br>Пожалуйста, <u><b>прекратите создавать идентичные или похожие темы - иначе Ваш форумный аккаунт может быть заблокирован</b></u>.<br><br>" +
	 '[CENTER][url=https://postimg.cc/bsXCpZM1][img]https://i.postimg.cc/bsXCpZM1/image.gif[/img][/url][/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Будете разблокированы',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Произошла ошибка, будете разблокированы, приношу извинения за предоставленные неудобства.[/CENTER][/FONT][/SIZE]<br?'+
	'[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Форма подачи "ЖБ НА ТЕХ"',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	"[CENTER]Пожалуйста, заполните форму, создав новую тему: Название темы с NickName технического специалиста<br>Пример:<br> Lev_Kalashnikov | махинации<br>[QUOTE]01. Ваш игровой никнейм:<br>02. Игровой никнейм технического специалиста:<br>03. Сервер, на котором Вы играете:<br>04. Описание ситуации (описать максимально подробно и раскрыто):<br>05. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>06. Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/QUOTE]<br>" +
	 '[CENTER][url=https://postimg.cc/bsXCpZM1][img]https://i.postimg.cc/bsXCpZM1/image.gif[/img][/url][/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Срок подачи жб',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER] С момента выдачи наказания прошло более 7-ми дней.<br>Рассмотрение невозможно[center]<br>'+
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	 '[CENTER][url=https://postimg.cc/bsXCpZM1][img]https://i.postimg.cc/bsXCpZM1/image.gif[/img][/url][/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Вам в Технический раздел',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	"[CENTER]Ваша тема не как не относится к жалобам на технических специалистов, обратитесь с данной темой в <u>технический раздел вашего сервера</u>  [URL='https://forum.blackrussia.online/index.php?forums/Технический-раздел-lime.365/']клик[/URL]<br>" +
	 '[CENTER][url=https://postimg.cc/bsXCpZM1][img]https://i.postimg.cc/bsXCpZM1/image.gif[/img][/url][/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'обжалование не подлежит вообще',
	content: 
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Ваше наказание обжалованию не подлежит.<br>Вы получили блокировку за серьезное наказание, которое невозможно обжаловать/обнулить." +
	'[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Наказание будет снижено',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Проверив вашу историю наказаний, было принято решение о снижении наказания.<br>Будьте аккуратнее в следующие разы, ведь на встречу пойти мы врятли сможем." +
	'[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Восст.доступа к аккаунту',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к странице во ВКонтакте[/U], то сбросить пароль или пин-код Вы всегда сможете обратившись в официальное сообщество проекта - https://vk.com/blackrussia.online.<br> Либо в телеграмм бот - https://t.me/br_helper_bot.<br> Напишите «Начать» в личные сообщения группы/бота, затем выберите нужные Вам функции.<br><br>" +
	"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к почте[/U], то сбросить пароль или пин-код Вы всегда сможете при вводе пароля на сервере. После подключения к серверу нажмите на кнопку «Войти в аккаунт», затем выберите кнопку «Восстановить пароль», после чего на Вашу почту будет отправлено письмо с одноразовым кодом восстановления.<br><br>" +
	"[CENTER]Если Вы [U]не обезопасили свой аккаунт - его невозможно вернуть[/U]. Игрок самостоятельно несет отвественность за безопаность своего аккаунта.<br><br>" +
	'[CENTER]К сожалению, иногда решение подобных вопросов требует много времени. Надеемся, что Вы сможете восстановить доступ к аккаунту!<br>  [I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
	prefix: WATCHED_PREFIX,
	status: false,
},
{
	title: 'Нет окна блокировки',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	"[CENTER]Без окна о блокировке тема не подлежит рассмотрению - создайте новую тему, приложив окно блокировки с фото-хостинга [URL='https://yapx.ru/']yapx.ru[/URL], [URL='https://imgur.com/']imgur.com[/URL], [URL='https://www.youtube.com/']youtube.com[/URL],[URL='https://imgbb.com']ImgBB.com[/URL](все кликабетильно).<br>" +
	'[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Правила восстановления',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений: https://clck.ru/NeHEQ. Вы создали тему, которая не относится к технической проблеме. Имущество не будет восстановлено.[/CENTER]<br><br>" +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
    prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Донат',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Система построена таким образом, что деньги не спишутся, пока наша платформа не уведомит платежную систему о зачислении BLACK COINS. Для проверки зачисления BLACK COINS необходимо ввести в игре команду: /donat.<br>' +
	'[CENTER]В остальных же случаях, если не были зачислены BLACK COINS — вероятнее всего, была допущена ошибка при вводе реквизитов. К нашему сожалению, из-за большого количества попыток обмана, мы перестали рассматривать подобные жалобы. Вам необходимо быть внимательными при осуществлении покупок.<br>' +
	'[CENTER]Если Вы считаете, что ошибки быть не может и с момента оплаты не прошло более 14 дней, то в обязательном порядке обратитесь в данное сообщество для дальнейшего решения: https://vk.com/br_tech.<br>' +
	'[CENTER][I]Решено[/I].[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
{
	title: 'Сервер не отвечает',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Если у Вас встречаются такие проблемы, как «Сервер не отвечает», не отображаются сервера в лаунчере, не удаётся выполнить вход на сайт/форум, попробуйте совершить следующие действия: <br><br>" +
	"[LEFT]• Сменить IP-адрес любыми средствами; <br>" +
	"[LEFT]• Переключиться на Wi-Fi/мобильный интернет или на любую доступную сеть; <br>"+
	"[LEFT]• Использование VPN; <br>"+
	"[LEFT]• Перезагрузка роутера.<br><br>" +

	"[CENTER]Если методы выше не помогли, то переходим к следующим шагам: <br><br>" +

	'[LEFT]1. Устанавливаем приложение «1.1.1.1: Faster & Safer Internet» Ссылка: https://clck.ru/ZP6Av и переходим в него.<br>'+
	'[LEFT]2. Соглашаемся со всей политикой приложения.<br>'+
	'[LEFT]3. Нажимаем на ползунок и ждем, когда текст изменится на «Подключено».<br>'+
	'[LEFT]4. Проверяем: Отображаются ли серверы? Удается ли выполнить вход в игру? Работают ли другие источники (сайт, форум)? <br>' +

	"[CENTER]📹 Включение продемонстрировано на видео: https://youtu.be/Wft0j69b9dk[/CENTER][/FONT][/SIZE]",
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Жалобы',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[LEFT]Обратитесь в раздел «Жалобы» Вашего сервера:<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.54/'][B]Сервер №1 | Red[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.98/'][B]Сервер №2 | Green[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.138/'][B]Сервер №3 | Blue[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.174/'][B]Сервер №4 | Yellow[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.251/'][B]Сервер №5 | Orange[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.291/'][B]Сервер №6 | Purple[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.331/'][B]Сервер №7 | Lime[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.373/'][B]Сервер №8 | Pink[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.414/'][B]Сервер №9 | Cherry[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.467/'][B]Сервер №10 | Black[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.498/'][B]Сервер №11 | Indigo[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.654/'][B]Сервер №12 | White[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.655/'][B]Сервер №13 | Magenta[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.619/'][B]Сервер №14 | Crimson[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.700/'][B]Сервер №15 | Gold[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.720/'][B]Сервер №16 | Azure[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.763/'][B]Сервер №17 | Platinum[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.822/'] [B] Сервер №18 | Aqua[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.863/'][B]Сервер №19 | Gray[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.932/'] [B]Сервер №20 | Ice [/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/%D0%96%D0%B0%D0%BB%D0%BE%D0%B1%D1%8B.972/'] [B]Сервер №21 | Chilli [/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1014/'] [B]Сервер №22 | Choco [/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1060/'] [B]Сервер №23 | Moscow[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1102/'] [B]Сервер №24 | SPB[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1145/']Сервер №25 | UFA → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1212/']Сервер №26 | SOCHI → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1254/']Сервер №27 | KAZAN → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1298/']Сервер №28 | SAMARA → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1340/']Сервер №29 | ROSTOV→ нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1380/']Сервер №30 | ANAPA→ нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1422/']Сервер №31 | EKB→ нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?forums/Жалобы.1466/']Сервер №32 | KRASNODAR→ нажмите сюда[/URL]<br>" +
	 '[CENTER][url=https://postimg.cc/bsXCpZM1][img]https://i.postimg.cc/bsXCpZM1/image.gif[/img][/url][/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Выдача компенсации',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	"[CENTER]Ваше игровое имущество/денежные средства будут восстановлены в течение месяца. <br>Убедительная просьба, не менять никнейм до момента восстановления.<br>" +
    '[CENTER]Для активации восстановления используйте команды:[COLOR=rgb(255, 213, 51)]/roulette[/COLOR], [COLOR=rgb(255, 213, 51)]/recovery[/COLOR].[/CENTER]<br>' +
	'[CENTER]Решено.[/CENTER][/FONT][/SIZE]',
    status: false,
    prefix: DECIDED_PREFIX,
},
{
	title: 'Переустановите игру',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Возможно в файлах вашей игры присутствуют постороннее оборудование(дополнения/изменения).<br>" +
	"[CENTER]Рекомендуется удалить полностью лаунчер и связанные с ним файлы и установить игру заново с официального сайта - [URL='https://blackrussia.online']перейти[/URL]. <br>" +
	'[CENTER][I]Решено[/I].[/CENTER][/FONT][/SIZE]',
	prefix: DECIDED_PREFIX,
	status: false,
},
{
	title: 'Актуально?',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Ваше обращение актуально?[/CENTER][/FONT][/SIZE]",
	prefix: NO_PREFIX,
	status: true,
},
{
	title: 'Отсутствие ответа',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]По техническими соображениям было принято решение закрыть данное обращение.<br><br>" +
	"[CENTER]Пожалуйста, если данная проблема все ещё актуальна, оставьте новую заявку в данном разделе.<br>" +
	'[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'НЕ ОТНОСИТСЯ',
	content:
    '[CENTER][B][FONT=trebuchet ms][SIZE=3][IMG]https://i.postimg.cc/fLbh6XZF/fotor-2023-5-23-23-54-22.png[/IMG][/SIZE][/FONT][/B][SIZE=3][FONT=trebuchet ms] [/CENTER]<br>' +
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "[CENTER][SIZE=3][FONT=trebuchet ms][B][IMG]https://i.yapx.ru/GFL6g.png[/IMG][/CENTER]<br>" +
	'[CENTER]Ваше обращение не относится к жалобам на технических специалистов.<br>' +
	 '[CENTER][url=https://postimg.cc/bsXCpZM1][img]https://i.postimg.cc/bsXCpZM1/image.gif[/img][/url][/CENTER]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'ᅠ ᅠᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ ᅠ  Для Форумников  ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ ᅠ',
},
{
	title: 'Почему у меня пропали все темы из раздела Жалобы?',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Раздел 'Жалобы' переводен в приватный режим, а именно:<br>Тему созданную пользователем пожет видеть <b>он</b> сам и <b>администрация сервера</b>.<br>Ознакомиться с формой подачи тем в тот или иной раздел можно по данной ссылке: [URL='https://forum.blackrussia.online/index.php?forums/Правила-подачи-жалоб.202/']клик[/URL]<br>Приятного времяприпровождения на нашем форуме<br><i>Закрыто</i>. [/CENTER][/FONT][/SIZE]",
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'ФОРМА',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Пожалуйста, заполните форму, создав новую тему: <br>[CODE]01. Ваш игровой никнейм:<br>02. Сервер, на котором Вы играете:<br>03. Суть Вашей возникшей проблемы (описать максимально подробно и раскрыто): <br>04. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>05. Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/CODE]<br><br>" +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'ПРАВИЛА РАЗДЕЛА',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Пожалуйста, убедительная просьба, ознакомиться с назначением данного раздела в котором Вы создали тему, так как Ваш запрос не относится к технической проблеме.<br>Что принимается в тех разделе:<br>Если возникли технические проблемы, которые так или иначе связаны с игровым модом<br>Форма заполнения:<br>[QUOTE]<br>[FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]01.[/COLOR] Ваш игровой никнейм:<br>[COLOR=rgb(226, 80, 65)]02.[/COLOR] Сервер, на котором Вы играете:<br>[COLOR=rgb(226, 80, 65)]03.[/COLOR] Суть возникшей проблемы (описать максимально подробно и раскрыто):<br>[COLOR=rgb(226, 80, 65)]04.[/COLOR] Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>[COLOR=rgb(226, 80, 65)]05.[/COLOR] Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/SIZE][/FONT][/QUOTE]<br>[/CENTER]<br><br>[CENTER][FONT=verdana][SIZE=7][COLOR=rgb(226, 80, 65)][U]Если возникли технические проблемы, которые так или иначе связаны с вылетами из игры и любыми другими проблемами клиента[/U][/COLOR][/SIZE][/FONT][/CENTER]<br><br>[QUOTE]<br>[FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]01. [/COLOR]Ваш игровой ник:<br>[COLOR=rgb(226, 80, 65)]02. [/COLOR]Сервер:<br>[COLOR=rgb(226, 80, 65)]03.[/COLOR] Тип проблемы: Обрыв соединения | Проблема с ReCAPTCHA | Краш игры (закрытие игры) | Другое [Выбрать один вариант ответа]<br>[COLOR=rgb(226, 80, 65)]04. [/COLOR]Действия, которые привели к этому (при вылетах, по возможности предоставлять место сбоя):<br>[COLOR=rgb(226, 80, 65)]05.[/COLOR] Как часто данная проблема:<br>[COLOR=rgb(226, 80, 65)]06.[/COLOR] Полное название мобильного телефона:<br>[COLOR=rgb(226, 80, 65)]07.[/COLOR] Версия Android:<br>[COLOR=rgb(226, 80, 65)]08. [/COLOR]Дата и время (по МСК):<br>[COLOR=rgb(226, 80, 65)]09. [/COLOR]Связь с Вами по Telegram/VK:[/SIZE][/FONT][/QUOTE]" +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Передано логисту для проверки',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Ваша тема закрплена и передана <u>Техническому специалисту по логированию для дальйнешего вердикта</u>,ожидайте ответ в данной теме.<br><br>" +
	'[CENTER]Создавать новые темы с данной проблемой — не нужно.[/CENTER][/FONT][/SIZE]',
	prefix: TECHADM_PREFIX,
	status: true,
},
{
	title: 'ЖБ на ТЕХОВ',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Вы получили наказание от технического специалиста Вашего сервера. Вам следует обратиться в раздел «Жалобы на технических специалистов» — в случае, если Вы не согласны с наказанием.<br><br>' +
	'[CENTER]Ссылка на раздел, где можно оформить жалобу на технического специалиста: https://clck.ru/ThmZA <br><br>' +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'ТЕСТЕРАМ',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Ваша тема передана на тестирование.[/CENTER][/FONT][/SIZE]",
  	prefix: WAIT_PREFIX,
  	status: false,
},
{
	title: 'Ответ от ТЕСТЕРОВ',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
	'[CENTER]Ответ от тестерского отдела дан выше. <br><br>' +
	'[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
  prefix: CLOSE_PREFIX,
  status: false,
},
{
	title: 'Пропали вещи с аукциона',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Если вы выставили свои вещи на аукцион а их никто не купил, то воспользуйтесь командой [COLOR=rgb(251, 160, 38)]/reward[/COLOR]<br> В случае отсутствии вещей там, приложите скриншоты с +/time в новой теме<br>Закрыто. [/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Если не работают ссылки',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]По техническим причинам данное действие невозможно, пожалуйста воспользуйтесь копированием ссылки от сюда:<br>[img]https://i.ibb.co/SX77Fgw/photo-2022-08-20-16-31-57.jpg[/img]<br>Если данный способ не помогает, то используйте сервис сокращения ссылок [URL='https://clck.ru']клик[/URL][/CENTER]"+
	'[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'В раздел Госс Организаций.',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Ваша тема не относиться к техническому разделу, пожалуйста оставьте ваше заявление в соответствующем разделе Государственных Организаций вашего сервера.[/CENTER]<br><br>'+
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'В раздел Криминальных Организаций',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Ваша тема не относиться к техническому разделу, пожалуйста оставьте ваше заявление в соответствующем разделе Криминальных Организаций вашего сервера [/CENTER]'+
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Жб на адм',
	content:	
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER] Если вы не согласны с выданным наказанием от администратора сервера и прошло не более 48-ех часов с момента выдачи наказания, обратитесь в раздел Жалобы на администрацию вашего сервера.<br>" +
	'[CENTER] Решено, закрыто.[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
{
	title: 'Жб на лидеров',
	content:	
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER] Ваше обращение не относиться к техническому разделу, обратитесь в раздел 'Жалобы на Лидеров'вашего сервера.<br>" +
	'[CENTER] Решено, закрыто.[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
{
	title: 'Жб на игроков',
	content:	
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Данная тема не относится к техническому разделу, вам нужно создать данную тему в разделе жалоб на игроков вашего сервера, если не прошло более 3-ех дней с момента нарушения.<br>" +
	'[CENTER]Решено, закрыто.[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
{
	title: 'Обжалования',
	content:	
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Вы получили наказание от администратора своего сервера, для его снижения/обжалования обратитесь в раздел <<Обжалования>> вашего сервера .<br>" +
	'[CENTER]Решено, закрыто.[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
{
	title: 'Донат',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Система построена таким образом, что деньги не спишутся, пока наша платформа не уведомит платежную систему о зачислении BLACK COINS. Для проверки зачисления BLACK COINS необходимо ввести в игре команду: /donat.<br>' +
	'[CENTER]В остальных же случаях, если не были зачислены BLACK COINS — вероятнее всего, была допущена ошибка при вводе реквизитов. К нашему сожалению, из-за большого количества попыток обмана, мы перестали рассматривать подобные жалобы. Вам необходимо быть внимательными при осуществлении покупок. <br>' +
	'[CENTER]Если Вы считаете, что ошибки быть не может и с момента оплаты не прошло более 14 дней, то в обязательном порядке обратитесь в данное сообщество для дальнейшего решения: https://vk.com/br_tech.<br>' +
	'[CENTER][I]Решено[/I].[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
},
{
	title: 'Слетел аккаунт',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Аккаунт не может пропасть или аннулироваться просто так. Даже если Вы меняете ник, используете кнопки «починить игру» или «сброс настроек» - Ваш аккаунт не удаляется. Система работает иначе.<br><br>" +
	"[CENTER]Проверьте ввод своих данных: пароль, никнейм и сервер. Зачастую игроки просто забывают ввести актуальные данные и считают, что их аккаунт был удален. Будьте внимательны!" +
	'[CENTER]Как ввести никнейм (на случай, если сменили в игре, но не поменяли в клиенте): https://youtu.be/c8rhVwkoFaU [/CENTER] <br><br>' +
	'[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
  prefix: WATCHED_PREFIX,
  status: false,
},
{
	title: 'ДУБЛИРОВАНИЕ',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Данная тема является <u>дубликатом вашей предыдущей темы</u>.<br>Пожалуйста, <u><b>прекратите создавать идентичные или похожие темы - иначе Ваш форумный аккаунт может быть заблокирован</b></u>.<br><br>" +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Если нет скринов/видео',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Без доказательств (в частности скриншоты или видео) – решить проблему не получится. Если доказательства найдутся - создайте новую тему, приложив доказательства с фото-хостинга [URL='https://yapx.ru/']yapx.ru[/URL], [URL='https://imgur.com/']imgur.com[/URL], [URL='https://www.youtube.com/']youtube.com[/URL],[URL='https://imgbb.com']ImgBB.com[/URL](все кликабельно).<br>" +
	'[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Будет исправленно',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Данная недоработка будет проверена и исправлена. Спасибо, ценим Ваш вклад в развите проекта.<br>" +
	'[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
	prefix: WATCHED_PREFIX,
	status: false,
},
{
	title: 'Исправлено',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Данная недоработка была исправлена. Спасибо, ценим Ваш вклад в развите проекта.<br>" +
	'[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
	status: false,
	prefix: WATCHED_PREFIX,
},
{
	title: 'Если не тот пароль',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к странице во ВКонтакте[/U], то сбросить пароль или пин-код Вы всегда сможете обратившись в официальное сообщество проекта - https://vk.com/blackrussia.online. Напишите «Начать» в личные сообщения группы, затем выберите нужные Вам функции.<br>" +
	"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к почте[/U], то сбросить пароль или пин-код Вы всегда сможете при вводе пароля на сервере. После подключения к серверу нажмите на кнопку «Войти в аккаунт», затем выберите кнопку «Восстановить пароль», после чего на Вашу почту будет отправлено письмо с кодом восстановления.<br>" +
    "[CENTER]Если Вы [U]не обезопасили свой аккаунт - его невозможно вернуть[/U]. Игрок самостоятельно несет отвественность за безопаность своего аккаунта.<br>" +
    '[CENTER]К сожалению, иногда решение подобных вопросов требует много времени. Надеемся, что Вы сможете восстановить доступ к аккаунту!<br> [I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
	prefix: WATCHED_PREFIX,
	status: false,
},
{
	title: 'Правила восстановления',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений: https://clck.ru/NeHEQ. Вы создали тему, которая не относится к технической проблеме. Имущество не будет восстановлено.[/CENTER]<br><br>" +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
    prefix: UNACCEPT_PREFIX,
	status: false,
},	
{
	title: 'КРАШ/ВЫЛЕТ',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]В том случае, если Вы вылетели из игры во время игрового процесса (произошел краш), в обязательном порядке необходимо обратиться в данную тему в любом техническом разделе [img]https://i.ibb.co/sPhBGjx/NVIDIA-Share-1-Tde-EHim0u.png[/img][/CENTER]<br>" +
	"[CENTER][CODE]01. Ваш игровой никнейм: <br> 02. Сервер: <br> 03. Тип проблемы: Обрыв соединения | Проблема с ReCAPTCHA | Краш игры (закрытие игры) | Другое [Выбрать один вариант ответа] <br> 04. Действия, которые привели к этому (при вылетах, по возможности предоставлять место сбоя): <br> 05. Как часто данная проблема: <br> 06. Полное название мобильного телефона: <br> 07. Версия Android: <br> 08. Дата и время (по МСК): <br> 09. Связь с Вами по Telegram/VK:[/CODE]<br><br>" +
	'[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
	prefix: UNACCEPT_PREFIX,
	status: false,
},
{
	title: 'Баг ФСИН(не выпустило)',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER]Скоро будете выпущены,ожидайте.[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
	},
{
	title: 'ХОЧУ СТАТЬ АДМ/ХЕЛПЕРОМ',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Команда технических специалистов не решает назначение на какую-либо должность, которая присутствует на проекте. Для этого существуют заявления в главном разделе Вашего игрового сервера, где Вы можете ознакомиться с открытыми должностями и формами подач. Приятной игры и желаем удачи в карьерной лестнице!<br><br>" +
	'[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Команде проекта',
	content: 
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Ваша тема закреплена и находится на рассмотрении у команды проекта. Пожалуйста, ожидайте выноса вердикта разработчиков."+
	"[CENTER] Создавать новые темы с данной проблемой — не нужно, ожидайте ответа в данной теме. Если проблема решится - Вы всегда можете оставить своё сообщение в этой теме.<br>",
	prefix: COMMAND_PREFIX,
	status: true,
},
{
	title: 'Известно КП',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	"[CENTER]Команде проекта уже известно о данной проблеме, она обязательно будет рассмотрена и исправлена. Спасибо за Ваше обращение!<br><br>" +
	'[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Улучшения для серверов',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER] Ваша тема не относится к технической проблеме, если вы хотите предложить изменения в игровом моде - обратитесь в раздел <br> [URL="https://forum.blackrussia.online/index.php?categories/Предложения-по-улучшению.656/"] Предложения по улучшению → нажмите сюда[/URL].<br> [/CENTER][/FONT][/SIZE]' ,
	prefix: CLOSE_PREFIX,
	status: false,
},
{
	title: 'Вам нужны все прошивки',
	content:
	'[SIZE=4][FONT=Veranda][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' + 
	'[CENTER] Для активации какой либо прошивки необходимо поставить все детали данного типа "SPORT" "SPORT+" и т.п.<br>Закрыто[/CENTER][/FONT][/SIZE]',
	prefix: CLOSE_PREFIX,
	status: false,
    },
      ];

  $(document).ready(() => {
    // Загрузка скрипта для обработки шаблонов
    $('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');

    // Добавление кнопок при загрузке страницы
    addButton('На рассмотрение','pin');
    addButton('Тех. Специалисту', 'Texy');
    addButton('Закрыто', 'Zakrito');
    addButton('Ответы', 'selectAnswer');

    // Поиск информации о теме
    const threadData = getThreadData();

    $('button#pin').click(() => editThreadData(PINN_PREFIX, false));
    $('button#accepted').click(() => editThreadData(ACCСEPT_PREFIX, false));
    $('button#Ga').click(() => editThreadData(GA_PREFIX, false));
    $('button#Spec').click(() => editThreadData(SPECY_PREFIX, trufalsee));
    $('button#teamProject').click(() => editThreadData(COMMAND_PREFIX, false));
    $('button#unaccept').click(() => editThreadData(UNACCСEPT_PREFIX, false));
    $('button#Texy').click(() => editThreadData(TEXY_PREFIX, false));
    $('button#Resheno').click(() => editThreadData(RESHENO_PREFIX, false));
    $('button#Zakrito').click(() => editThreadData(CLOSE_PREFIX, false));

    $(`button#selectAnswer`).click(() => {
      XF.alert(buttonsMarkup(buttons), null, 'Выберите ответ:');
      buttons.forEach((btn, id) => {
        if (id > 0) {
          $(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
        }
        else {
          $(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
        }
      });
    });
  });

  function addButton(name, id) {
    $('.button--icon--reply').before(
      `<button type="button" class="button rippleButton" id="${id}" style="margin: 3px;">${name}</button>`,
    );
  }

  function buttonsMarkup(buttons) {
    return `<div class="select_answer">${buttons
  .map(
  (btn, i) =>
    `<button id="answers-${i}" class="button--primary button ` +
    `rippleButton" style="margin:5px"><span class="button-text">${btn.title}</span></button>`,
  )
  .join('')}</div>`;
  }

  function pasteContent(id, data = {}, send = false) {
    const template = Handlebars.compile(buttons[id].content);
    if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();

    $('span.fr-placeholder').empty();
    $('div.fr-element.fr-view p').append(template(data));
    $('a.overlay-titleCloser').trigger('click');

    if (send == true) {
      editThreadData(buttons[id].prefix, buttons[id].status);
      $('.button--icon.button--icon--reply.rippleButton').trigger('click');
    }
  }

  function getThreadData() {
    const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
    const authorName = $('a.username').html();
    const hours = new Date().getHours();
    return {
      user: {
        id: authorID,
        name: authorName,
        mention: `[USER=${authorID}]${authorName}[/USER]`,
      },
        greeting: () =>
	4 < hours && hours <= 11
	  ? 'Здравствуйте'
	  : 11 < hours && hours <= 15
	  ? 'Здравствуйте'
	  : 15 < hours && hours <= 21
	  ? 'Здравствуйте'
	  : 'Здравствуйте',
};

  }

    function editThreadData(prefix, pin = false) {
// Получаем заголовок темы, так как он необходим при запросе
	const threadTitle = $('.p-title-value')[0].lastChild.textContent;

	if(pin == true){
		fetch(`${document.URL}edit`, {
		  method: 'POST',
		  body: getFormData({
			prefix_id: prefix,
			title: threadTitle,
              discussion_open: 1,
			_xfToken: XF.config.csrf,
			_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
			_xfWithData: 1,
			_xfResponseType: 'json',
		  }),
		}).then(() => location.reload());
	} else {
		fetch(`${document.URL}edit`, {
		  method: 'POST',
		  body: getFormData({
			prefix_id: prefix,
			title: threadTitle,
               discussion_open: 1,
           			pin: 1,
			_xfToken: XF.config.csrf,
			_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
			_xfWithData: 1,
			_xfResponseType: 'json',
		  }),
		}).then(() => location.reload());
	}




 if(pin == false){
		fetch(`${document.URL}edit`, {
		  method: 'POST',
		  body: getFormData({
			prefix_id: prefix,
			title: threadTitle,
                           			_xfToken: XF.config.csrf,
			_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
			_xfWithData: 1,
			_xfResponseType: 'json',
		  }),
		}).then(() => location.reload());
	} else  {
		fetch(`${document.URL}edit`, {
		  method: 'POST',
		  body: getFormData({
			prefix_id: prefix,
               						pin: 1,
			_xfToken: XF.config.csrf,
			_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
			_xfWithData: 1,
			_xfResponseType: 'json',
		  }),
		}).then(() => location.reload());
		   }


function moveThread(prefix, type) {
// Получаем заголовок темы, так как он необходим при запросе
const threadTitle = $('.p-title-value')[0].lastChild.textContent;

fetch(`${document.URL}move`, {
  method: 'POST',
  body: getFormData({
	prefix_id: prefix,
	      discussion_open: 1,
	target_node_id: type,
	FireBrickirect_type: 'none',
	notify_watchers: 1,
	starter_alert: 1,
	starter_alert_reason: "",
	_xfToken: XF.config.csrf,
	_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
	_xfWithData: 1,
	_xfResponseType: 'json',
  }),
}).then(() => location.reload());
}

function getFormData(data) {
	const formData = new FormData();
	Object.entries(data).forEach(i => formData.append(i[0], i[1]));
	return formData;
  }
    }
})();