// ==UserScript==
// @name         连铸
// @namespace    your-namespace
// @version      1.3.1
// @description  1305
// @match        http://hangang.bjjxlc.com/mobile/cglb/*
// @match        https://hangang.bjjxlc.com/mobile/cglb/*
// @grant        none
// @license      MIT
// @downloadURL https://update.greasyfork.org/scripts/468124/%E8%BF%9E%E9%93%B8.user.js
// @updateURL https://update.greasyfork.org/scripts/468124/%E8%BF%9E%E9%93%B8.meta.js
// ==/UserScript==

(function() {
  'use strict';
  var data = [
      ["id","ti","type","tim","daan","A","B","C","D","E","F"],
      ["1","49757","单选题","连铸坯的形状缺陷主要指铸坯的脱方和","A"],
      ["2","49932","判断题","沸腾钢比镇静钢的表面质量好但成材率低","错"],
      ["3","49725","单选题","在铸坯横断面和纵断面上出现的碳磷和硫等元素的浓度偏差称为铸坯的","A"],
      ["4","49720","单选题","未保护浇铸时可能产生废品","C"],
      ["5","49948","判断题","钢液的凝固不仅是一个钢液由液体转变为固体的物态变化过程而且也是一个复杂的物理化学变化过程","对"],
      ["6","49933","判断题","负滑脱率结晶器平均振动速度拉坯速度拉坯速度100","对"],
      ["7","49721","单选题","弧形连铸机弧形段内外弧喷水量是","B"],
      ["8","49903","判断题","铸坯凝固过程中有4个脆性转变区","错"],
      ["9","49675","单选题","电气设备发生故障时要切断电源解决","A"],
      ["10","49820","单选题","中间包第一炉开浇液面高度达到左右要求连续测温两次若温度符合开浇要求正常开浇","C"],
      ["11","49945","判断题","钢水脱氧合金化中细化脱氧产生的颗粒可以加快脱氧产物的排除速度","错"],
      ["12","49672","单选题","冷态铸坯定尺误差范围允许值","C"],
      ["13","49790","单选题","中间包内加碳化稻壳是为了","B"],
      ["14","49790","多选题","锆质定径水口炸裂的主在原因有以下几点","ABC"],
      ["15","49797","单选题","结晶器内钢液位允许波动范围手动控流时自动控流时","A"],
      ["16","49977","判断题","硫印样断面平整无毛刺无重割不得有切斜鼓肚但菱形变形重接等情况不影响使用","错"],
      ["17","49681","单选题","结晶器冷却水的值为","A"],
      ["18","49879","判断题","煤气中最易中毒的是高炉煤气","错"],
      ["19","49865","多选题","电磁搅拌的目的","BD"],
      ["20","49967","判断题","结晶器的铜板镀是为了提高铜板的导热性能","错"],
      ["21","49735","单选题","浇铸时结晶器密封圈破损的表现为","A"],
      ["22","49725","判断题","钢的正常组织中铁素体多于珠光体","对"],
      ["23","49676","单选题","目前我国的安全生产月是哪一月","A"],
      ["24","49885","判断题","皮下气孔和皮下裂纹属于表面缺陷","错"],
      ["25","49834","单选题","200200方铸坯硫印取样厚度","A"],
      ["26","49730","单选题","浇注能力是指连铸机浇注的钢液量","A"],
      ["27","49906","判断题","铸坯脱方是坯壳在二冷区内不均匀冷却引起的","错"],
      ["28","49842","多选题","中间包的作用有","ABD"],
      ["29","49991","判断题","浸入式水口的插入深度越深越易卷渣对表面质量越不利","错"],
      ["30","49889","单选题","随着碳含量增加钢的屈服强度抗张强度和疲劳强度均","B"],
      ["31","49967","判断题","方坯喷号内容包括钢种号炉号","错"],
      ["32","49681","单选题","比水量的概念是","C"],
      ["33","49835","多选题","火焰切割操作的好处有","ABD"],
      ["34","49695","单选题","当拉坯速度大于浇注速度时会造成","A"],
      ["35","49974","判断题","号牌每次使用结束应放入清水中防止涂料结块","对"],
      ["36","49881","判断题","目前连铸机可以浇注镇静钢和半镇静钢","错"],
      ["37","49686","单选题","采用的措施可以提高火焰切割速度","B"],
      ["38","49699","单选题","中间包烘烤每超小时连拉时间应减少","D"],
      ["39","49684","单选题","边角裂属于缺陷","B"],
      ["40","49922","判断题","二次冷却的冷却强度因钢种铸坯尺寸铸机型式不同而变化","对"],
      ["41","49671","单选题","一般情况下浸入水口插入结晶器钢水液面下较为适宜","C"],
      ["42","49804","单选题","码垛时铸坯端面喷号朝向","A"],
      ["43","49951","判断题","钢液凝固过程中过冷度越小晶核临界半径越大晶核就难以形成","对"],
      ["44","49972","判断题","通常拉速低时凹陷深拉速高时凹陷浅","对"],
      ["45","49731","单选题","浇注前给结晶器铜板涂菜子油的目的是","B"],
      ["46","49993","判断题","正常操作旋转时回转臂必须在低位","错"],
      ["47","49803","单选题","150150断面铸坯每次吊运不超过","C"],
      ["48","49665","单选题","在各类连铸机中为高度最低的连铸机","B"],
      ["49","49887","判断题","氢在钢水中的扩散速度比氮慢","错"],
      ["50","49904","判断题","铸坯三角区裂纹产生的主要原因是锥度不合适","错"],
      ["51","49787","单选题","在连铸过程中更换大包时中间包内液面应处在","A"],
      ["52","49850","多选题","连铸对钢水温度的要求是","ACD"],
      ["53","49726","单选题","150与200方坯结晶器使用炉数更换标准炉炉","D"],
      ["54","49728","单选题","减小铸坯振痕的方法是","A"],
      ["55","49855","多选题","碳是决定钢的的主要元素","CD"],
      ["56","49682","单选题","保护渣中23含量的增加将导致熔渣粘度的","B"],
      ["57","49721","判断题","钢中与炉渣中反应是一个吸热反应","对"],
      ["58","49695","单选题","235中的235指","B"],
      ["59","49671","判断题","不同钢种的铸坯禁止放在同一层","对"],
      ["60","49933","单选题","煤气使用过程中按原则进行操作","B"],
      ["61","49832","单选题","浸入式水口在使用前必须进行烘烤要求采用大火烘烤时间不小于","B"],
      ["62","49942","判断题","钢水保护浇注可防止钢水的二次氧化","对"],
      ["63","49933","单选题","结晶器从最高位置下降到最低位置或从最低位置上升到最高位置所移动的距离称为","B"],
      ["64","49722","单选题","回转台的主要作用是","A"],
      ["65","49820","单选题","钢液的二次氧化将使钢中有害气体氮氧增加使钢液粘度","B"],
      ["66","49970","判断题","结晶器可以控制铸坯的形状质量","对"],
      ["67","49851","多选题","连铸二次冷却水量分配原则是","ACD"],
      ["68","49850","判断题","类10较类25偏析重","对"],
      ["69","49712","判断题","每炉开浇时钢包长水口与钢包下水口之间必须使用密封垫","对"],
      ["70","49901","判断题","铸坯的液芯长度铸坯厚度2凝固系数2拉速","错"],
      ["71","49735","单选题","15的的转包温度","D"],
      ["72","49925","判断题","二冷强度过大会使铸坯的等轴晶扩大","错"],
      ["73","49834","判断题","2在结晶器保护渣中主要是起到调节碱度作用","错"],
      ["74","49850","单选题","结晶器的主要振动参数是","C"],
      ["75","49831","单选题","长水口下口浸入钢水液面不足","B"],
      ["76","49920","判断题","对于弧形铸机必须在切割前矫直","对"],
      ["77","49716","单选题","钢中加入适量的铝除了脱氧作用外对晶粒有作用","A"],
      ["78","49983","单选题","中间包测温时测温头应插入中包钢液面以下","B"],
      ["79","49808","单选题","连铸事故水系统试验一次","A"],
      ["80","49884","判断题","坯壳表面凹陷越深横裂纹出现的几率就越大","错"],
      ["81","49688","单选题","采用气洗水口的主要作用是","B"],
      ["82","49715","单选题","钢中元素会引起钢的","B"],
      ["83","49858","多选题","铸坯运行过程中受到的阻力包括","ABCD"],
      ["84","49783","单选题","结晶器材质之所以选铜是因为铜具有良好的","B"],
      ["85","49744","判断题","不同钢种的铸坯允许放在同一层","错"],
      ["86","49952","判断题","钢液凝固收缩由固相线温度降到室温的体积收缩一般为34","错"],
      ["87","49822","单选题","1方含铝钢中包称重低于吨停止浇铸","A"],
      ["88","49671","判断题","二冷水分布原则当拉速一定时沿铸机高度从上向下水量是逐渐递减的当拉速升高时二冷总喷水量是增高的","对"],
      ["89","49684","单选题","150150方坯生产12米定尺外卖235时铸坯喷号需要喷","B"],
      ["90","49725","判断题","二冷段夹辊的排布规律是前粗后细前疏后密","错"],
      ["91","49747","单选题","结晶器内液面波动时保护渣的加入应在液面过程中完成","B"],
      ["92","49735","单选题","取样器插入深度取样停留时间控制在45秒","C"],
      ["93","49724","单选题","火焰切割的基本原理与手工气割原理是的","A"],
      ["94","49721","单选题","浇注温度与拉坯速度密切相关温度越高则拉坯速度越","A"],
      ["95","49891","判断题","大包工挂液压缸时回转台必须锁定","对"],
      ["96","49692","单选题","带液芯矫直通常应用在连铸机中","A"],
      ["97","49929","判断题","方铸坯12米定尺要求每支喷号","对"],
      ["98","49747","判断题","钢水的浇铸温度值是由上钢温度决定的","对"],
      ["99","49812","单选题","结晶器的振动频率是随拉速的改变而改变的拉速越高振动频率","C"],
      ["100","49748","单选题","结晶器振动广泛采用的振动方式是","C"],
      ["101","49680","单选题","结晶器冷却水带走的热量约占结晶器总散热量的左右","D"],
      ["102","49724","单选题","回转台加盖装置的检查作业结束将包盖停在向左或向右极限位置时即在不能影响座包","A"],
      ["103","49926","判断题","二冷水采用的压力喷嘴与气水喷嘴相比具有冷却均匀冷却效率高的优点","错"],
      ["104","49981","判断题","钢水温度过高会加剧钢水的二次氧化","对"],
      ["105","49701","单选题","二次冷却段的冷却强度一般用表示","B"],
      ["106","49804","单选题","铜管下口磨损量面部大于更换","C"],
      ["107","49685","单选题","150150方坯铸坯收缩系数","A"],
      ["108","49986","判断题","铸坯码放高度150方坯定尺为6及以上的不超过24层","对"],
      ["109","49727","单选题","氮使低碳钢产生的脆性与磷的危害相似但比磷严重磷造成钢的冷脆性不产生时效性若钢中磷含量高会氮的危害","A"],
      ["110","49794","单选题","脱引锭装置的作用是","A"],
      ["111","49727","判断题","钢包钢水吹氩的作用是减少夹杂均匀成分均匀温度但增加了钢液中的气体含量","错"],
      ["112","49795","单选题","150150方坯结晶器水流量","A"],
      ["113","49967","判断题","结晶器的冷却水量过大铸坯会产生裂纹","对"],
      ["114","49851","判断题","对连铸钢水温度的要求是低温均匀稳定","错"],
      ["115","49926","单选题","定径水口材质一般为质","D"],
      ["116","49978","多选题","铸坯纵裂缺陷产生的原因有","ABCD"],
      ["117","49714","单选题","钢液凝固收缩由液体完全变成固体的体积收缩一般为","C"],
      ["118","49816","单选题","喷嘴标况下的流量偏差超过需要更换","C"],
      ["119","49924","判断题","通常以柱状晶的多少来评价铸坯低倍组织好坏","错"],
      ["120","49754","单选题","连铸结晶器冷却水的水质为","A"],
      ["121","49668","单选题","2在保护渣中主要起到调节的作用","B"],
      ["122","49684","判断题","200方铸坯6米定尺要求每支喷号","错"],
      ["123","49764","单选题","长水口在中包液面的插入深度较为合适","B"],
      ["124","49905","判断题","铸坯是靠水滴与铸坯表面进行的物质和热量交换将铸坯热量带走而起到冷却作用的","错"],
      ["125","49666","单选题","在结晶器内形成和产生","B"],
      ["126","49960","判断题","钢中的磷元素会引起钢的时效效应","错"],
      ["127","49834","判断题","连浇炉次钢包开浇时普通长水口不允许插入中包钢液面以下开浇后再将长水口插入中包液面以下","对"],
      ["128","49931","判断题","非正弦振动波形偏斜率对所有工艺参数的影响都是有益的且取值越大越有利但越大结晶器振动装置越不平稳对浇注不利","对"],
      ["129","49812","单选题","200200断面铸坯每次吊运不超过","D"],
      ["130","49815","单选题","北侧区域垛位定义为区","A"],
      ["131","49882","判断题","耐火材料根据其化学性质分为碱性和酸性两种","错"],
      ["132","49994","判断题","对涂料中间包要求耐热冲击性好当从室温快速加热到1700时不炸裂不剥落","错"],
      ["133","49682","判断题","钢包中心低吹气比偏心吹气更有利于钢包顶渣和钢水反应","对"],
      ["134","49988","判断题","用完的中间包如果包内剩钢超过12时必须待冷却4小时后方能吊运中间包","对"],
      ["135","49709","单选题","钢水温度会加剧对耐火材料的侵蚀造成钢中外来夹杂物的增加","A"],
      ["136","49807","单选题","不同品种和不同厂家的保护渣混放","A"],
      ["137","49697","单选题","当铸坯采用带液芯多点矫直时矫直点越多铸坯应变则","A"],
      ["138","49883","判断题","硼能增加钢的淬透性硼在结构钢中一般含量为0035005","错"],
      ["139","49814","单选题","连铸坯的弯曲度每米不得大于总弯曲度不得大于总长度的","A"],
      ["140","49956","单选题","铸坯码放时热态铸坯和冷态铸坯是否可以混放","B"],
      ["141","49701","单选题","1方含铝钢敞开浇铸大于停止浇铸","D"],
      ["142","49684","单选题","2方12米铸坯应下线应放在","C"],
      ["143","49673","单选题","按连铸机生产铸坯的外形分类有方坯异形坯连铸机等","A"],
      ["144","49717","单选题","高速浇注容易造成使操作不稳定同时也易增加铸坯的内外裂纹","B"],
      ["145","49785","判断题","结晶器的倒锥度过大易产生气隙降低冷却效果过小增大摩擦力加速铜板磨损","错"],
      ["146","49779","单选题","电磁搅拌安装在结晶器位置的是","A"],
      ["147","49907","判断题","铸坯星型裂纹缺陷与保护渣碱度有关当保护渣低时铸坯表面星型裂纹缺陷多","对"],
      ["148","49701","多选题","浇注钢水温度太高会","ABCD"],
      ["149","49728","判断题","钢液的二次氧化将使钢中有害气体氮氧增加使钢液粘度变粘","对"],
      ["150","49934","多选题","机械剪主要是用于连铸机上","CD"],
      ["151","49926","多选题","下列哪些是拉矫机的作用","ABC"],
      ["152","49908","判断题","铸坯在凝固及冷却过程中共受两种力的作用即热应力和机械应力","错"],
      ["153","49779","单选题","正常浇铸时液面控制在左右","C"],
      ["154","49686","多选题","皮下气泡产生的原因是","AD"],
      ["155","49825","单选题","中间包塞棒预留量要求","B"],
      ["156","49719","单选题","含碳量在02506的是","C"],
      ["157","49830","判断题","回转台旋转过程中严禁打反车","对"],
      ["158","49966","单选题","结晶器加保护渣的原则是","C"],
      ["159","49887","判断题","钢中的氢含量降低钢的强度塑性冲击韧性称为兰脆","错"],
      ["160","49684","单选题","主控记录要求每炉记录中包温度","B"],
      ["161","49798","单选题","浇铸中出现液面波动大于应随时将大的渣皮挑出并采取适当降速","B"],
      ["162","49861","多选题","连铸钢水浇注温度定义为","AC"],
      ["163","49727","单选题","50150方坯1区喷嘴型号","C"],
      ["164","49811","单选题","中间包工作层烘烤时间不得超过小时烘烤超时的中间包禁止使用","B"],
      ["165","49745","单选题","结晶器冷却水通常采用","B"],
      ["166","49857","单选题","在选用保护渣时首先要满足这两方面的重要作用","B"],
      ["167","49805","单选题","浇注平台中间包烘烤作业时中包烘烤超过2小时仍不能开浇必须烘烤","B"],
      ["168","49931","判断题","覆盖剂潮湿对铸坯质量不会产生影响","错"],
      ["169","49751","单选题","结晶器制作成具有倒锥度的目的为","A"],
      ["170","49725","判断题","钢玉高铝粘土质耐火材料的区别在于2成份的含量不同","错"],
      ["171","49826","单选题","塞棒要求垂直内啃头要求","A"],
      ["172","49890","判断题","冷却水喷咀的性能不会影响铸坯质量和拉坯速度","错"],
      ["173","49762","单选题","三角区裂纹属于缺陷","A"],
      ["174","49785","判断题","铸机高度和铸坯厚度之比25为低压头连铸机等于2540为正常压头连铸机","错"],
      ["175","49729","单选题","降低钢中气体主要是氢和的含量就可以减少气泡产生","C"],
      ["176","49944","判断题","结晶器从上到下振动时间叫振动周期","错"],
      ["177","49680","单选题","拉速增大后若二冷强度不变则液相深度增加中心疏松和偏析会","A"],
      ["178","49847","多选题","保护渣分几种类型","ABCD"],
      ["179","49907","多选题","结晶器保护渣主要理化性能有","ABCD"],
      ["180","49986","单选题","采用保护浇注浇16其水口的正确选择应为","B"],
      ["181","49865","判断题","偏析度小于0为负偏析","错"],
      ["182","49902","判断题","铸坯角部裂纹产生的原因是二冷区冷却过强","错"],
      ["183","49841","多选题","下列连铸坯缺陷中属于内部缺陷的有","ACD"],
      ["184","49731","单选题","采用气洗水口所吹气体一般是","D"],
      ["185","49848","判断题","大包工引流烧氧时一人烧氧一人开关阀门两人要配合好防止氧气回火伤人引流时不要烧坏滑动水口机构","对"],
      ["186","49920","判断题","在结晶器安装的目的是改善传热","错"],
      ["187","49896","判断题","中间包水口直径减小后注流形状会恶化","错"],
      ["188","49993","单选题","铸坯采用多点矫直而不采用单点矫直是为了减轻","B"],
      ["189","49721","判断题","连铸用焦炉煤气主要含有42气体","错"],
      ["190","49850","单选题","浇铸大断面的板坯一般选用连铸机","C"],
      ["191","49701","判断题","锥度值上口厚度下口厚度上口厚度100","错"],
      ["192","49732","单选题","当23含量增高时保护渣的也相应增加因为粘所以易粘接漏钢","C"],
      ["193","49807","判断题","钢中的酸溶铝导致钢水流动性变差","错"],
      ["194","49831","单选题","2类夹杂物属于系夹杂物","A"],
      ["195","49786","单选题","中包水口破而维持浇铸时可能产生废品","C"],
      ["196","49691","判断题","钢液中的氢含量主要来自于炉气中水蒸汽的分压并且已脱氧的钢液比未脱氧的钢液更易吸收氢","对"],
      ["197","49743","判断题","钢包连浇操作时无钢包下渣监测或钢包下渣故障时根据钢包称重可适当提升钢包观察下渣情况","对"],
      ["198","49840","多选题","水口堵塞物通常包含下列物质","ACD"],
      ["199","49768","判断题","凡能抑制结晶器热面温度的措施都能减少方坯脱方","对"],
      ["200","49858","判断题","铸坯要求不经过冷床直接下线","对"],
      ["201","49951","单选题","结晶出口处坯壳的是决定工作拉速的重要因素也是影响提高拉速的主要因素","B"],
      ["202","49914","判断题","随着保护渣中碳含量的增加保护渣的熔化速度加快","错"],
      ["203","49782","判断题","目前结晶器下部水环喷嘴一般采用汽水喷嘴","错"],
      ["204","49924","判断题","切头长度和切尾长度可任意","错"],
      ["205","49965","判断题","磷能提高钢的强度和耐蚀性能但使钢的脆性转变温度急剧升高即低温变脆","对"],
      ["206","49666","判断题","钢中的硫是气孔和夹杂的主要产生原因","错"],
      ["207","49833","单选题","结晶器进出水温差一般应小于","C"],
      ["208","49720","单选题","方坯整体水口对中垂直度要求","C"],
      ["209","49883","判断题","对于金属的常温力学性能来讲一般是晶粒越细小则强度和硬度越高同时塑性和韧性越好","对"],
      ["210","49684","单选题","以下钢种采用末端电搅的钢种是","A"],
      ["211","49947","判断题","铸坯表面缺陷主要指夹杂表面裂纹结疤皮下气孔等","错"],
      ["212","49676","单选题","对铸坯中心偏析影响最大的是","A"],
      ["213","49671","多选题","气泡的产生原因包括","ABC"],
      ["214","49790","单选题","结晶器角缝间隙应","C"],
      ["215","49915","判断题","是指结晶器电磁搅拌器","错"],
      ["216","49696","单选题","中间包测温位置","A"],
      ["217","49929","判断题","方坯喷号内容包括内部钢种号炉号","对"],
      ["218","49863","多选题","连铸机结晶器的作用有","AB"],
      ["219","49878","判断题","漏钢预报装置是将热电偶插入结晶器内测温","错"],
      ["220","49710","单选题","钢水由液相线温度冷却到固相线温度放出的热量称为","A"],
      ["221","49837","单选题","连铸坯的低倍组织是指","C"],
      ["222","49836","单选题","连铸开浇堵引锭头的主要目的是","C"],
      ["223","49851","判断题","钢中010017时钢对裂纹敏感性最强","错"],
      ["224","49924","单选题","结晶器冷却水采用的方式流动","A"],
      ["225","49921","单选题","200方坯铸坯收缩系数","B"],
      ["226","49950","判断题","钢液过冷度小形核速度大于长大速度","错"],
      ["227","49931","判断题","按正弦方式的结晶器其结晶器内铸坯平均拉速为结晶器振幅振动频率","错"],
      ["228","49939","单选题","1方含铝钢中包称重低于吨必须停浇","C"],
      ["229","49808","单选题","连铸浇铸区不应设","C"],
      ["230","49876","判断题","连铸圆坯的断面尺寸表示方法为铸坯半径","错"],
      ["231","49805","单选题","浇铸前给结晶器铜板涂菜籽油的目的是","B"],
      ["232","49742","单选题","结晶器负滑脱式振动指的是","C"],
      ["233","49903","单选题","为保证结晶器传热效果结晶器水缝中冷却水流速应保持在","B"],
      ["234","49681","单选题","续测温数据连续两次波动超过此时采用人工测温","B"],
      ["235","49985","判断题","挡墙要放不放均可","错"],
      ["236","49877","判断题","所有钢种开浇前必须进行中间包赶气","错"],
      ["237","49700","多选题","二冷水的冷却原则是","AB"],
      ["238","49676","判断题","钢的液相线温度是指钢水在结晶器内的温度","错"],
      ["239","49718","单选题","裹渣漏钢发现结晶器保护渣结有大块一般需要保护渣粘度值","C"],
      ["240","49922","判断题","吊运中包必须使用专用吊具","对"],
      ["241","49980","单选题","结晶器内热量传递路线为钢水凝固坯壳渣膜气隙铜壁冷却水其中传热最大的障碍是","B"],
      ["242","49667","判断题","保护渣添加应遵循少加勤加保持黑面的基本原则","对"],
      ["243","49784","判断题","钢水的浇铸温度就是液相线温度","错"],
      ["244","49982","判断题","在结晶器内钢水温度下降凝固时析出氧的与钢中碳反应易生成皮下针孔或气泡","对"],
      ["245","49962","判断题","钢包底吹氩透气砖放在底面正中比放在偏心处搅拌效果要好","错"],
      ["246","49845","多选题","铸坯横裂缺陷产生的原因有","ABCD"],
      ["247","49947","判断题","钢中的夹杂主要是由氧化物和硫化物组成","对"],
      ["248","49698","单选题","定径水口内表面材质一般为","D"],
      ["249","49798","多选题","中间包覆盖剂的作用有","ABC"],
      ["250","49819","单选题","钢水从浇注温度冷却到凝固温度释放的热量称为","B"],
      ["251","49968","多选题","提高二冷区冷却效率的主要措施有","ABCD"],
      ["252","49974","单选题","浇铸温度是","B"],
      ["253","49961","单选题","每次中包正常停浇时必须测量中包钢水液面高度中包钢水最终剩钢液面高度不小于","A"],
      ["254","49924","单选题","钢包加保护套管的目的是","D"],
      ["255","49784","单选题","连铸浇钢过程中二冷水压力突然降低流量同时增大原因是","A"],
      ["256","49848","多选题","影响铸坯质量有三方面因素","ABC"],
      ["257","49764","判断题","钢包偏心低吹气比中心吹气更有利于均匀钢水温度和成分","对"],
      ["258","49818","单选题","随着碳含量的增加和浇注速度的增加铸坯的中心疏松的程度也","A"],
      ["259","49775","判断题","方坯浇注碳含量在0205的钢最容易出现脱方","对"],
      ["260","49755","多选题","目前连铸不能浇注","AC"],
      ["261","49838","单选题","钢液凝固时会发生体积收缩因此结晶器设计时应考虑","C"],
      ["262","49761","多选题","目前在连铸生产中常用的保护浇注方法有","ABCD"],
      ["263","49791","判断题","钢包敞开浇铸影响保护渣的性能但对质量影响不大","错"],
      ["264","49778","多选题","结晶器保护渣的作用是","ABCD"],
      ["265","49824","单选题","结晶器液面波动大于需要甩坯","A"],
      ["266","49673","单选题","200200方坯铸坯收缩系数","D"],
      ["267","49919","判断题","对涂料中间包要求耐热冲击性好当快速加热到1700时不炸裂不剥落","错"],
      ["268","49969","判断题","结晶器的铜板加目的是为了提高铜板的再结晶温度","对"],
      ["269","49777","单选题","从业人员发现事故隐患或者其他不安全因素应当立即向现场安全生产管理人员或者本单位负责人报告这是从业人员的","D"],
      ["270","49702","判断题","45钢表示碳的质量分数约为045的钢","对"],
      ["271","49711","单选题","火焰切割操作的灵活性比机械剪","B"],
      ["272","49809","单选题","150150方坯1区喷嘴型号","C"],
      ["273","49743","单选题","结晶器振动的主要参数为","A"],
      ["274","49881","单选题","连铸坯的柱状晶越发达对钢材的机械性能越","A"],
      ["275","49875","单选题","二冷强度过大会使铸坯的扩大","B"],
      ["276","49881","单选题","非金属夹杂物对钢性能影响程度取决于夹杂物的颗粒大小形状及分布状态","B"],
      ["277","49949","判断题","钢液的凝固点主要决定化学成分","对"],
      ["278","49776","单选题","连续测温数据连续两次波动超过此时采用人工测温","B"],
      ["279","49711","判断题","二冷采用的气水喷嘴与水冷喷嘴相比具有冷却均匀冷却效率高的优点","对"],
      ["280","49732","单选题","回转台事故旋转系统检查必须检查一次","A"],
      ["281","49933","判断题","钢中的起到细化晶粒的作用","错"],
      ["282","49748","单选题","结晶器的振幅等于行程的","A"],
      ["283","49879","多选题","属于表面缺陷的是","ABCD"],
      ["284","49937","判断题","中间包容积为钢包容积的2030","错"],
      ["285","49907","判断题","对连铸钢水要求3为好","错"],
      ["286","49703","判断题","当发现自动脱引锭失败应立即通知该流中包工提高拉速并立即用事故割枪将坯头割断","错"],
      ["287","49976","判断题","中间包在开浇前一到两小时内快速烘烤得12001300度为好","错"],
      ["288","49841","判断题","钢中的含量高当0020017钢的高温强度和塑性明显降低易产生表面横裂","错"]
      ["289","50001","判断题","水口出口太小是造成水口结瘤的主要原因","错"]
  ];
  //遍历题目函数

  function performQuery(timi, leixing) {
      var searchData = timi;
      var resultColumn = "daan";
      var result = "空空如也";
      for (var i = 1; i < data.length; i++) {
        var row = data[i];
        if (row[3] === searchData && row[2] === leixing) {
          var resultIndex = data[0].indexOf(resultColumn);
          if (resultIndex !== -1) {
            result = row[resultIndex];
          }
          break;
        }
      }
      return result;
  }
    
  function clickA(x, y) {
      var min = 0;
      var max = 6;
      var random = Math.random() * (max - min) + min;
      var element = document.elementFromPoint(x + random, y - random);
      element.click();
  }
  
  function quti(){
      var headers1 = document.querySelector('.aui-list-header').textContent;
      var headers = headers1.split("、").join("");
      var filtered_sentence1 = headers.replace(/[^\u4e00-\u9fff0-9]/g, '');
      //console.log(filtered_sentence1)
      var filtered_sentence2 = filtered_sentence1.replace(/^\d+/, '');
      return filtered_sentence2;
  }

  function createButton() {
      var button = document.createElement('button');
      button.textContent = '解析答案';
      button.id = "jiexi";
  
      var resultLabel = document.createElement('label');
      resultLabel.id = "daan";
      
      var button1 = document.createElement('button');
      button1.textContent = '手动答题';
      button1.id = "zidong";
      
      var button2 = document.createElement('button');
      button2.textContent = '自动答题';
      button2.id = "zidong1";
  
      button.addEventListener('click', function() {
      var headers1 = document.querySelector('.aui-list-header').textContent;
      var leixing = document.querySelector('.aui-list-item-right').textContent.split("（")[0];
      var headers = headers1.split("、").join("");   
      var filtered_sentence2 = headers.replace(/[^\u4e00-\u9fff0-9]/g, '');
      var filtered_sentence = filtered_sentence2.replace(/^\d+/, '');
      //resultLabel.textContent = '';
      console.log(filtered_sentence)
  
      var result = performQuery(filtered_sentence, leixing);
      var resultText = result;
      resultLabel.textContent = resultText;
  });return { button, button1, resultLabel, button2 };}
  
  var { button, button1, resultLabel, button2 } = createButton();
  
  var jindanElement = document.querySelector('#dati');
  if (jindanElement) {
      jindanElement.insertAdjacentElement('beforeend', button1);
      jindanElement.insertAdjacentElement('beforeend', button);
      jindanElement.insertAdjacentElement('afterend', resultLabel);
      //jindanElement.insertAdjacentElement('beforeend', button2);
  } else {
      document.body.appendChild(button);
      document.body.appendChild(resultLabel);
      document.body.appendChild(button1);
      //document.body.appendChild(button2);
  }
  
  button1.addEventListener('click', function() {
      var danji = Array.from(document.querySelectorAll('.aui-list-item-inner'));
      if (danji.length > 0) {
          danji.pop();
          var jiexi1 = document.getElementById('jiexi').click();
          var daan = document.getElementById('daan').textContent;
  
          if (daan.includes("空")){
                var rect = danji[0].getBoundingClientRect();
                var centerX = rect.left + rect.width / 2;
                var centerY = rect.top + rect.height / 2;
                clickA(centerX, centerY);
            }
            if (daan.includes("对")){
                var rect = danji[0].getBoundingClientRect();
                var centerX = rect.left + rect.width / 2;
                var centerY = rect.top + rect.height / 2;
                clickA(centerX, centerY);
            }
            if (daan.includes("错")){
                var rect1 = danji[1].getBoundingClientRect();
                var centerX1 = rect1.left + rect1.width / 2;
                var centerY1 = rect1.top + rect1.height / 2;
                clickA(centerX1, centerY1);
            }
            if (daan.includes("A")){
                var rect2 = danji[0].getBoundingClientRect();
                var centerX2 = rect2.left + rect2.width / 2;
                var centerY2 = rect2.top + rect2.height / 2;
                clickA(centerX2, centerY2);
            }
            if (daan.includes("B")){
                var rect3 = danji[1].getBoundingClientRect();
                var centerX3 = rect3.left + rect3.width / 2;
                var centerY3 = rect3.top + rect3.height / 2;
                clickA(centerX3, centerY3);
            }
            if (daan.includes("C")){
                var rect4 = danji[2].getBoundingClientRect();
                var centerX4 = rect4.left + rect4.width / 2;
                var centerY4 = rect4.top + rect4.height / 2;
                clickA(centerX4, centerY4);
            }
            if (daan.includes("D")){
                var rect5 = danji[3].getBoundingClientRect();
                var centerX5 = rect5.left + rect5.width / 2;
                var centerY5 = rect5.top + rect5.height / 2;
                clickA(centerX5, centerY5);
            }
            if (daan.includes("E")){
                var rect6 = danji[4].getBoundingClientRect();
                var centerX6 = rect6.left + rect6.width / 2;
                var centerY6 = rect6.top + rect6.height / 2;
                clickA(centerX6, centerY6);
            }
            if (daan.includes("F")){
                var rect7 = danji[5].getBoundingClientRect();
                var centerX7 = rect7.left + rect7.width / 2;
                var centerY7 = rect7.top + rect7.height / 2;
                clickA(centerX7, centerY7);
            }
            
            var radioInputs = Array.from(document.querySelectorAll('input[name="answer"]'));
            //.checked 选中未选中
            if (radioInputs[0].checked || radioInputs[1].checked || radioInputs[2].checked || radioInputs[3].checked || radioInputs[4].checked  || radioInputs[5].checked ) {
                console.log("选中了元素");
                // 执行相应的操作 next_tisetTimeout(function() {
                setTimeout(function() {
                    document.getElementById("next_ti").click();
                },500);
            } else {
                // 标签未被选中
                console.log("未中了元素");
                setTimeout(function() {
                    clickA(100,100);
                },900);
                clickA(100,100);
          }
      }
  });
  
  var timu = 100;
  var numIterations = 100;
  var count = 0;
  
  function autoClick() {
      setTimeout(function() {
          button1.click();
          var headers = document.querySelector('.aui-list-header').textContent.split("、")[0];
          var hint = parseInt(headers);
          var mei = timu - hint;
          console.log(mei);
          // 1304  
          if (mei === 0) { 
              setTimeout(function() {   
                  window.location.href = "http://hangang.bjjxlc.com/mobile/cglb/dt?id=1304&matchid=0";
              },900);
          }
          if (count < numIterations) {
              autoClick();
          }
      }, 1400);
  }
  autoClick();
})();