const answer_gjaqjy = [{
	" *** 总书记提出总体国家安全观": [{
		"【单选题】2014年(), *** 总书记主持召开的中央国家安全委员会第一次会议,提出了一个重要的国家安全新理论——总体国家安全观。": ["2019-04-15"]
	}, {
		"【单选题】 *** 在中央国家安全委员会讲话指出,()是我们治党治国必须始终坚持的一个重要原则。": ["增强忧患意识,做到居安思危"]
	}, {
		"【单选题】 *** 强调,党的十八届三中全会决定成立(),是推进国家治理体系和治理能力现代化、实现国家长治久安的迫切切要求。": ["国家安全委员会"]
	}, {
		"【单选题】 *** 指出,当前我国国家安全内涵和外延比历史上任何时候都要丰富,时空领域比历史上任何时候都要宽广,内外因素比历史上任何时候都要复杂,必须坚持总体国家安全观,以()为宗旨。": ["人民安全"]
	}, {
		"【多选题】党的十八届三中全会决定成立的国家安全委员会,意义在于()。": ["是推进国家治理体系和治理能力现代化、实现国家长治久安的迫切要求", "是全面建成小康社会、实现中华民族伟大复兴中国梦的重要保障", "目的是更好适应我国国家安全面临的新形势新任务", "建立集中统一、高效权威的国家安全体制,加强对国家安全工作的指导"]
	}, {
		"【多选题】贯彻落实总体国家安全观,必须既重视外部安全,又重视内部安全,对内()。": ["求发展", "求变革", "求稳定", "建设平安中国"]
	}, {
		"【判断题】发展是安全的基础,安全是发展的条件。()": ["对"]
	}]
}, {
	"总体国家安全观提出的时代背景": [{
		"【多选题】2012年11月,以 *** 为总书记的新一届 *** 执政后,对国家安全做出了前所未有的总体战略布局,其中最主要的是()。": ["设立国家安全委员会", "提出总体国家安全观", "出台国家安全战略文本", "颁布系列国家安全法律", "强化国家安全宣传教育"]
	}, {
		"【判断题】新中国第一个30年的国家安全形势,可以用“安全压倒发展”“形势总体严峻”来概括。()": ["对"]
	}]
}, {
	"马克思主义 *** 思想的主导地位": [{
		"【判断题】总体国家安全观不仅体现了唯物史观,而且在多方面体现了唯物辩证法和系统思维。()": ["对"]
	}, {
		"【判断题】总体国家安全观不仅阐明了国家安全本身的全面性、整体性,而且明确了国家安全是一个开放系统。()": ["对"]
	}]
}, {
	"对中西优秀文化及安全思想的吸纳": [{
		"【单选题】“共同安全观”源自()1982年的一篇研究报告中。": ["瑞典"]
	}, {
		"【多选题】以下关于 *** 在总体国家安全观中的“既重视国土安全又重视国民安全”的说法,正确的是()。": ["“国土”并不仅仅指国土", "“国土”还指人之外的一切物", "“国民”并不仅仅指平民百姓", "“国民”还指一个国家中的所有人"]
	}, {
		"【多选题】总体国家安全观的重要思想来源有()。": ["共同安全观", "综合安全观", "合作安全观", "可持续安全观"]
	}, {
		"【判断题】文艺复兴时期的思想家在强调把人从基督神学中解放出来时,则形成了一种人神关系中的“以人为本”,即人本主义。()": ["对"]
	}]
}, {
	"中国国家安全学研究成果的学术支撑": [{
		"【单选题】()是国家安全核心和国家安全活动的根本目的。": ["国民安全"]
	}, {
		"【判断题】国民的安全和利益是一切国家安全工作的根本目的。()": ["对"]
	}]
}, {
	"中国特色国家安全道路中的人民安全": [{
		"【单选题】当前我们必须坚持总体国家安全观,以()为基础。": ["经济安全"]
	}, {
		"【单选题】()是总体国家安全观的第一要义。": ["人民安全"]
	}, {
		"【判断题】人民安全是国家安全至高无上的核心价值。()": ["对"]
	}]
}, {
	"中国特色国家安全道路中的其他安全要素": [{
		"【单选题】()是决定国家安全的其他构成要素以及整个国家是否安全的根本性要素。": ["政治安全"]
	}, {
		"【单选题】国家安全论域中的()是与政治相对脱离、相对独立的民间社会的安全,是民间社会的不受威胁和侵害的客观状态。": ["社会安全"]
	}, {
		"【多选题】根据当前经济领域的门类划分,国家经济安全大致分为()。": ["产业安全", "商业安全", "金融安全", "财政安全", "市场安全"]
	}, {
		"【判断题】军事是保障国家安全的武装力量,军事安全是保证国家武装力量能够充分有效发挥保障国家安全作用的基本前提。()": ["对"]
	}]
}, {
	"既重视外部安全又重视内部安全": [{
		"【多选题】2001年,在纪念中国 *** 成立80周年大会的讲话中, *** 对新安全观的表述更新为()。": ["互信", "互利", "平等", "协作"]
	}, {
		"【判断题】国家安全必须是内部安全与外部安全的统一。()": ["对"]
	}, {
		"【判断题】中国 *** 在世纪之交提出的“以互信、互利、平等、协作为核心的新安全观”,只是一种外交观,至多是一种“对外安全观”或“国际安全观”。()": ["对"]
	}]
}, {
	"既重视国土安全又重视国民安全": [{
		"【单选题】国域安全就是国家生存发展空间领域的安全,其构成要素不包括()。": ["国天安全"]
	}, {
		"【多选题】领土安全主要包括()四个组成部分。": ["领陆安全", "领水安全", "领空安全", "底土安全"]
	}, {
		"【多选题】国土安全主要包括()五个构成要素。": ["国陆安全", "国水安全", "国空安全", "国天安全", "国底安全"]
	}, {
		"【判断题】非 *** 的海洋毗连区不包括在“国海”的概念里。()": ["错"]
	}]
}, {
	"既重视传统安全又重视非传统安全": [{
		"【单选题】在信息内容安全的分类中,不包括()。": ["信息载体安全"]
	}, {
		"【多选题】科技安全通常包括科技成果安全、科技人员安全、()等六个构成要要素。": ["科技产品安全", "科技活动安全", "科技应用安全", "科技设施安全"]
	}, {
		"【判断题】国家科技安全是与国家安全和利益具有不同程度密切关系的科技成果、科技研究、科技发展的不受侵害与威胁的客观状态。()": ["对"]
	}]
}, {
	"既重视发展问题又重视安全问题": [{
		"【判断题】近代中国史是一部中华民族不安全的历史,也是一部中华民族求安全的历史。()": ["对"]
	}, {
		"【判断题】当前,需要在总体国家安全观的指导下,坚持安全与发展并重的新理念,努力构建安全与发展为一体的国家大战略。()": ["对"]
	}]
}, {
	"既重视本国安全又重视共同安全": [{
		"【判断题】在总体国家安全观,既重视自身安全,又重视共同安全,打造命运共同体,推动各方朝着互利互惠、共同安全的目标相向而行。()": ["对"]
	}]
}, {
	"综合安全、合作安全与可持续安全": [{
		"【单选题】合作安全观于1988年由()布鲁金斯学会明确提出。": ["英国"]
	}, {
		"【判断题】 *** 认为,合作安全就是要通过对话合作促进安全。()": ["对"]
	}]
}, {
	"传统国家安全观与非传统国家安全观": [{
		"【单选题】传统国家安全观的主要特征是以()作为安全目标。": ["一国安全"]
	}, {
		"【判断题】传统国家安全观是对冷战后期开始出现的各种不同以往的国家安全思想和理论的统称。()": ["错"]
	}]
}, {
	"总体国家安全是高级非传统国家安全观": [{
		"【判断题】全面的国家安全观是既重视传统安全问题又重视非传统安全问题的安全观。()": ["对"]
	}]
}, {
	"国家安全重点领域中的科技安全": [{
		"【多选题】我国科技安全面临（）几个方面的机遇和挑战。": ["世界新一轮科技革命对我国未来生存和发展带来挑战", "重点领域核心关键技术受制于人，威胁我国产业安全", "军民科技相互融合转化不畅,制约我国国防建设与经济社会的统筹发展", "科技安全管理薄弱,存在潜在危险"]
	}, {
		"【多选题】维护我国的科技安全，需要（）。": ["加强前瞻部署，确保战略领域发展主动权", "加强重点突破,实现关键核心技术安全可控", "加强科技安全基础设施和能力建设", "深化改革,建立完善国家科技安全体制机制"]
	}, {
		"【判断题】科技安全是指科技体系完整有效，国家重点领域核心技术安全可控，国家核心利益和安全不受外部科技优势危害，以及保障持续安全状态的能力。": ["对"]
	}]
}, {
	"国家安全重点领域中的生态安全": [{
		"【多选题】保障我国生态安全，可以通过（）几个方面进行。": ["牢固树立绿水青山就是金山银山的理念", "强化国土空间和资源开发管制，完善相关法律法规", "加大生态系统保护力度", "着力解决突出环境问题", "积极参与全球生态环境治理"]
	}, {
		"【判断题】生态是指自然界的一定空间内，生物与环境构成的统一整体。": ["对"]
	}, {
		"【判断题】生态安全是指一个国家具有支撑国家生存发展的较为完整、不受威胁的生态系统，以及应对内外重大生态问题的能力。": ["对"]
	}]
}, {
	"国家安全重点领域中的资源安全": [{
		"【多选题】资源安全面临的机遇与挑战主要体现在（）。": ["水资源供需矛盾突出", "土地资源形势严峻", "资源对外依存度过高", "资源开发利用水平不高"]
	}, {
		"【判断题】资源安全是一个国家或地区可以持续稳定，及时、足量和经济的获取所需自然资源的状态。": ["对"]
	}, {
		"【判断题】资源的掌控量是衡量国家实力的重要元素。": ["对"]
	}]
}, {
	"国家安全重点领域中的核安全": [{
		"【判断题】我国始终奉行不首先使用核武器的政策,坚持自卫防御的核战略,无条件不对无核武器国家和无核武器地区使用或威胁使用核武器。": ["对"]
	}, {
		"【判断题】核扩散主要是指有核武器国家增多。": ["对"]
	}, {
		"【判断题】核武器国家是指在1967年以前制造并爆炸了核武器或其他核装置的国家。": ["对"]
	}]
}, {
	"国家安全重点领域中的生物安全": [{
		"【判断题】病原微生物，是指可以侵犯人、动物引起感染甚至传染病的微生物，包括病毒、细菌、真菌、立克次体、寄生虫等。": ["对"]
	}, {
		"【判断题】生物恐怖，是指故意使用致病性微生物、生物毒素等实施袭击，损害人类或者动植物健康，引起社会恐慌，企图达到特定政治目的的行为。": ["对"]
	}, {
		"【判断题】中外历史上，大疫大灾往往导致社会失序，社会失序又使抗疫抗灾雪上加霜。": ["对"]
	}]
}, {
	"国家安全重点领域中的海外利益安全": [{
		"【判断题】海外利益安全主要包括海外能源资源安全、海上战略通道以及海外公民、法人的安全等。": ["对"]
	}, {
		"【判断题】共建“一带一路”涵盖基础设施互联互通、能源资源、经贸、产业投资、金融、生态环保、人文交流、海上合作等多个领域，有利于推动我国与沿线国家深入的合作交流。": ["对"]
	}, {
		"【判断题】《中华人民共和国国家安全法》第三十三条规定：国家依法采取必要措施，保护海外中国公民、组织和机构的安全和正当权益，保护国家的海外利益不受威胁和侵害。": ["对"]
	}]
}, {
	"国家安全重点领域中的新型安全": [{
		"【判断题】太空作为未来战争的战略高点，太空安全涉及到太空资源的合理开发和利用及太空科学考察与技术研究。": ["对"]
	}, {
		"【判断题】深海的油气资源、可燃冰、砂矿等等，储量极为丰富，深海安全涉及到深海资源的合理开发和利用及深海区域科学考察与技术研究。": ["对"]
	}, {
		"【判断题】极地安全涉及到极地资源的合理利用、极地区域航道的探索与治理、极地区域科学考察与技术研究。": ["对"]
	}]
}, {
	"总体国家安全观在国家安全体制机制完善中的贯彻落实": [{
		"【单选题】()年 *** 十八届三中全会时,提出了设立国家安全委员会的设想。": ["2013"]
	}, {
		"【判断题】国家安全部和地方国家安全厅局是总体性的国家安全机构。()": ["错"]
	}]
}, {
	"总体国家安全观在国家安全战略制定实施中的贯彻落实": [{
		"【判断题】2015年审议通过的«国家安全战略纲要»是中国的第一个国家安全战略文本。()": ["对"]
	}]
}, {
	"总体国家安全观在推进国家安全法治建设中的贯彻落实": [{
		"【单选题】()年中华人民共和国国家安全部成立。": ["1983"]
	}, {
		"【判断题】推进国家安全法治建设是国家安全委员会的主要职责之一。()": ["对"]
	}]
}, {
	"总体国家安全观在国家安全宣传教育工作中的贯彻落实": [{
		"【多选题】开设“国家安全教育”课程,是在总体国家安全指导下的全面国家安全教育,包括()。": ["全面的国家安全观念", "全面的国家安全战略", "全面的国家法治", "全面的国家安全形势"]
	}]
}, {
	"在总体国家安全观指导下全面认识国家安全": [{
		"【单选题】在国家安全保障体系中,不属于保障活动的硬手段的是()。": ["发展经济"]
	}, {
		"【多选题】影响国家安全的社会内部因素有()。": ["民族宗教", "国民素质", "大政方针", "国家体制"]
	}, {
		"【判断题】国家安全就是一个国家处于没有危险的客观状态,也就是国家既没有外部的威胁和侵害又没有内部的混乱和疾患的客观状态。()": ["对"]
	}]
}, {
	"战略与国家安全战略": [{
		"【判断题】国家安全战略具有更高的层次,更宽的视野和更多的手段,位于军事战略之上。()": ["对"]
	}, {
		"【判断题】在第二次世界大战后,战略的概念刚刚突破了传统的战争和军事领破。()": ["错"]
	}, {
		"【判断题】在第二次世界大战后,战略的概念刚刚突破了传统的战争和军事领域。()": ["错"]
	}]
}, {
	"中俄等国对国家安全战略的界定": [{
		"【单选题】法国将国防白皮书与国家安全战略文件合二为一,称之为()。": ["国防与国家安全白皮书"]
	}, {
		"【多选题】各个国家的国家安全战略文件大多包括()等要素。": ["战略环境评估", "安全威胁判断", "战略目标和任务", "战略方针和原则", "战略途径和举措"]
	}, {
		"【判断题】20世纪70年代末,“国家安全战略”一词开始出现在中文学术文献中。()": ["对"]
	}]
}, {
	"国家安全战略的基本涵义": [{
		"【多选题】普鲁士的克劳塞维茨将战略要素归纳为()。": ["精神要素", "物质要素", "数学要素", "地理要素", "统计要素"]
	}, {
		"【判断题】世界多数国家把国家安全委员会作为国家安全领导决策体制的核心和中枢,并把制定和组织实施国家安全战略作为其重要任务。()": ["对"]
	}, {
		"【判断题】国家安全战略既是有目的、有计划、有统筹、可实施的具体方案,又是一种思维艺术,是一种有规律可循的科学。()": ["对"]
	}]
}, {
	"中国古代安全战略思想的发展演变": [{
		"【多选题】中国古代国家安全战略思想的主要特征是()。": ["崇尚“大一统”", "主张修德安民", "重视整军经武", "重视边疆安全", "追求“夷夏一体”"]
	}, {
		"【判断题】中国是一个多民族的国家,民族关系直接影响着整个国家的安全状态。()": ["对"]
	}]
}, {
	"中国近代国家安全战略思想的主要内容": [{
		"【单选题】()时期,形成了以人民战争为核心的一系列国家安全战略思想,为现代中国国家安全战略思想奠定了重要基础。": ["抗日战争时期"]
	}]
}, {
	"中国现代国家安全战略思想的主要内容及其特点": [{
		"【单选题】改革开放以前,国家安全战略思想的核心是()。": ["求生存"]
	}]
}, {
	"美俄国家安全战略思想": [{
		"【单选题】()时期是美国国家安全战略形成和发展的第一个重要历史时期。": ["独立战争时期"]
	}, {
		"【判断题】大国安全战略的制定和调整是与国际国内安全形势紧密联系在一起的。()": ["对"]
	}]
}, {
	"其它相关国家国家安全战略思想": [{
		"【多选题】2011年,英国卡梅伦 *** 接连公布(),全面分析了英国的安全威胁、战略目标、战略任务和战略举措。": ["«国家安全战略»", "«战略防务和安全审议»"]
	}, {
		"【多选题】关于英国国家安全战略思想的说法,以下正确的是()。": ["战略制定由侧重长远转向侧重远近结合、灵活应变", "装备建设转向机动灵活、精干高效", "继续贯彻“联合防务”思想"]
	}, {
		"【判断题】从尼赫鲁去世到1991年拉奥 *** 上台,印度推行地区争霸战略,将目标定位在于争夺东亚地区主导权上。()": ["错"]
	}]
}, {
	"以总体国家安全观为指导思想": [{
		"【多选题】在制定和实施国家安全战略时,需要()。": ["需要对国家安全环境做出科学判断", "需要明确特定环境下的国家安全目标和任务", "需要选择实现国家安全目标和任务的基本道路及方式方法"]
	}, {
		"【多选题】我国国家大战略包括()两个重要方面。": ["国家发展战略", "国家安全战略"]
	}, {
		"【判断题】只有科学准确地分析判断国际和国家安全形势,才能保证国家安全战略实施的可持续性。()": ["对"]
	}]
}, {
	"中国国家安全战略的目标和宗旨": [{
		"【单选题】()是在国家宪法的基础上确定的国家最基本、最重要的利益,在任何情况下都不能放弃的最高利益。": ["国家利益"]
	}, {
		"【多选题】中国国家安全战略的核心利益包括国家 *** 、()六个方面。": ["国家安全", "领土完整", "国家统一", "中国宪法确立的国家政治制度和社会大局稳定", "经济社会可持续发展的基本保障"]
	}, {
		"【多选题】中国国家安全战略目标决定了我国国家安全战略的特点是()。": ["防御型", "内向型", "和平型"]
	}]
}, {
	"维护国家安全形势总体稳定向好的态势": [{
		"【单选题】以下不属于经济发展的表现的是()。": ["人均GDP逐年高涨"]
	}, {
		"【单选题】()年,我国已经成为世界第二经济体。": ["2010"]
	}, {
		"【单选题】社会稳定的表现不包括()。": ["就业率保持稳定,就业矛盾逐渐化解"]
	}, {
		"【判断题】中国 *** 的性质为政权稳定奠定了前提。()": ["对"]
	}]
}, {
	"化解中国国家安全面临的挑战": [{
		"【多选题】2013年中国国防白皮书强调() *** 威胁上升。": ["恐怖主义", "分裂主义", "极端主义"]
	}, {
		"【多选题】虽然我国国家安全形势总体稳定向好,但也面临着多元复杂的挑战,主要表现在()。": ["恐怖威胁继续存在", "反腐败斗争形势依然严峻", "威胁中国海洋安全强度持续增强", "传统安全威胁和非传统安全威胁相互交织等方面"]
	}, {
		"【多选题】以下属于威胁中国海洋安全和权益的事件是()。": ["中日 *** 危机", "中菲黄岩岛对峙", "中美南海对阵", "中国多方应对“南海仲裁”及相关挑衅"]
	}]
}, {
	"化解“中国 *** ”困局": [{
		"【判断题】“中国 *** ”的形成和蔓延,不但严重损害中国热爱和平和负责任的大国形象,也对我国国家安全环境造成了严重危害。()": ["对"]
	}]
}, {
	"从新疆暴恐案件看政治安 *** 能": [{
		"【判断题】政治安 *** 能在国家安全一般职能中居于核心地位。()": ["对"]
	}]
}, {
	"从美国介入南海问题看军事安 *** 能": [{
		"【判断题】军事安 *** 能在中国国家安 *** 能中居于核心地位。()": ["错"]
	}]
}, {
	"从2015年“股灾”看经济安 *** 能": [{
		"【单选题】()在国家安 *** 能中居于基础地位。": ["经济安 *** 能"]
	}, {
		"【多选题】国家安全组织履行经济安 *** 能的目的是要维护()。": ["国家资源安全", "金融安全", "财政安全", "产业安全"]
	}, {
		"【判断题】履行好经济安 *** 能是中国避免2015年“股灾”再次发生的有效途径。": ["对"]
	}]
}, {
	"从美国文化霸权看文化安 *** 能": [{
		"【单选题】20世纪70年代,美国国会的官方文件中把()定位为“推行对外政策的最宝贵的工具”。": ["广播"]
	}, {
		"【单选题】()是一个国家文化和文明的载体。": ["语言文字"]
	}]
}, {
	"从瓮安“6•28”事件看社会安 *** 能": [{
		"【判断题】社会安 *** 能是指国家安全管理组织及其工作人员依法对国家社会安全事务进行管理,实现整个社会系统良性运行和协调发展的安全状态和以及提高社会安全能力。": ["对"]
	}, {
		"【填空题】()是指国家安全管理组织及其工作人员依法对国家社会安全事务进行管理,实现整个社会系统良性运行和协调发展的安全状态和以及提高社会安全能力。": ["社", "会", "安", " ", "*", "*", "*", " ", "能"]
	}]
}, {
	"从潜伏在伊朗的致命“病毒”看 *** 与信息安 *** 能": [{
		"【单选题】2010年7月,美国和()以核设施为主要目标,向伊朗国内的 *** 植入一种名为“震网”的病毒。": ["以色列"]
	}, {
		"【判断题】“震网”病毒的代码量是“火焰”病毒的20倍。()": ["错"]
	}, {
		"【判断题】一旦信息基础设施面临安全问题,它对国家安全所造成的影响将是致命性的。()": ["对"]
	}]
}, {
	"国家安全领导机关": [{
		"【单选题】中央军事委员的职权不包括()。": ["制定和实施国家安全战略"]
	}, {
		"【多选题】国家安全领导机关的构成包括()。": ["中央国家安全委员会", "全国人民代表大会及其常委会", "中华人民共和国主席", "国务院", "中央军事委员会"]
	}, {
		"【多选题】在中菲黄岩岛对峙事件中,中方参与的主要部门有()。": ["外交部", "渔政局", "国防部", "国家海洋局", "国家质检总局"]
	}, {
		"【判断题】香港特别行政区、澳门特别行政区应当履行维护国家安全的责任。()": ["对"]
	}]
}, {
	"国家安 *** 能机关": [{
		"【多选题】我国安全部的主要安 *** 能包括()等几个方面。": ["依法搜集涉及国家安全的情报信息", "反间谍工作的主管机关", "依法做好反恐怖主义工作", "防范、制止和依法打击危害国家安全和利益的违法犯罪活动", "保卫国家安全,维护社会政治稳定,保障社会主义建设"]
	}, {
		"【判断题】国防部隶属于国务院,是国家 *** 机构中的军事部门,负责掌管国防建设事务。()": ["对"]
	}]
}, {
	"涉及国家安 *** 能的机关": [{
		"【判断题】1993年«国家安全法»时期,中央国家机关履行部分国家安 *** 能。()": ["错"]
	}]
}, {
	"世界主要国家安全机关": [{
		"【单选题】()是有权作出国家安全战略决策或决定的机关。": ["国家安全领导机关"]
	}, {
		"【单选题】目前在世界各国,()是最主要的对外安全事务机关。": ["国防部"]
	}, {
		"【多选题】美国目前有()等16个主要的情报机构。": ["中央情报局", "国防情报局", "国家安全局", "国家侦察局", "海军情报局"]
	}]
}, {
	"国家安全体制机制": [{
		"【单选题】国家安全体制机制的内涵不包括()。": ["安全战略建设"]
	}, {
		"【判断题】2013年11月,党的第十八届三中全会通过« *** 中央关于全面深化改革若干重大问题的决定»,标志着 *** 中央正式启动成立中央国家安全委员会的工作。()": ["对"]
	}]
}, {
	"国家安全管理职责": [{
		"【多选题】国家安全管理责任类型包括()。": ["政治责任", "工作责任", "法律责任", "道德责任"]
	}]
}, {
	"国外情报人员招募": [{
		"【多选题】国外情报机构的招募程序基本要经历()几个过程。": ["名单审查", "安全审查", "专业测试", "健康检查", "组织召见"]
	}, {
		"【多选题】从世界各国的情报机构招募实践来看,主要从()几个方面考察应聘者。": ["信仰", "忠诚", "学识和修养", "心理素质", "纪律"]
	}]
}, {
	"国外情报人员的培训": [{
		"【单选题】()不但可以使情报人员振奋精神,提高士气,培养团队精神,而且也为应对突发事件奠定了基础。": ["体能和军事训练"]
	}, {
		"【多选题】国外情报人员的培训内容包括()等。": ["洗脑", "陌生人接触", "体能和军事训练", "掩护身份", "交易术"]
	}]
}, {
	"国家安全领导": [{
		"【单选题】以事为中心的国家安全领导者的特征不包括()。": ["关心下属"]
	}, {
		"【单选题】以人为中心的国家安全领导者的特征不包括()。": ["事事加以干预"]
	}]
}, {
	"国家安全沟通": [{
		"【单选题】影响沟通编码的因素不包括()。": ["经济背景"]
	}, {
		"【判断题】由于国家安全沟通大多都涉及到国家利益和人民利益,为此要求发送者态度必须端正。()": ["对"]
	}]
}, {
	"国家安全激励": [{
		"【多选题】马斯洛把人的需求划分为()五个层次。": ["生理需求", "安全需求", "社交需求", "尊重需求", "自我实现的需求"]
	}]
}, {
	"总体国家安全观的法治保障": [{
		"【单选题】保障国家安全的行动依据体现在多个层面,不包括()。": ["国家安全战略制度"]
	}, {
		"【单选题】完善国家安全立法的必要性不包括()。": ["原有的国家安全法律体系体现新的治理理念"]
	}]
}, {
	"域外国家安全立法的发展": [{
		"【单选题】域外国家安全立法采取的模式不包括()。": ["统一立法模式"]
	}, {
		"【单选题】1991年,苏联列入国家安全机关活动的基本原则中不含有()。": ["注重国民安全"]
	}, {
		"【判断题】以法律保障国家安全与发展是世界各国的通行做法。()": ["对"]
	}, {
		"【判断题】美国是世界上最早对整体国家安全活动进行专门立法规范的国家。()": ["错"]
	}]
}, {
	"中国国家安全法律体系的构建": [{
		"【单选题】国家安全法律规范具备的特征不包括()。": ["涵盖内容单一集中"]
	}, {
		"【单选题】我国国家安全法制的发展阶段是在()。": ["1993-2014年"]
	}, {
		"【判断题】新«国家安全法»的公布施行,正式确立起了具有中国特色的国家安全法律体系框架。()": ["对"]
	}]
}, {
	"《中华人民共和国国家安全法》解读": [{
		"【单选题】«国家安全法»以()为宗旨。": ["人民安全"]
	}, {
		"【单选题】法律明确规定了我国国家安全工作的指导地位是()。": ["中国 ***"]
	}, {
		"【多选题】法律专门规定在国家安全工作领域要坚持的基本原则包括()。": ["法治原则", "尊重和保障人权原则", "统筹协调原则", "预防为主、标本兼治原则", "专群结合原则"]
	}, {
		"【判断题】国家安全工作的指导思想就是总体国家安全观,这是做好新形势下国家安全工作的根本遵循。()": ["对"]
	}]
}, {
	"《中华人民共和国反间谍法》解读": [{
		"【单选题】()是新中国建立后加强和规范隐蔽战线反间谍斗争的第一部法律。": ["反间谍法"]
	}, {
		"【判断题】«反间谍法»把我国多年以来在反间谍工作中坚持的基本原则和经验做法上升为法律规定。()": ["对"]
	}]
}, {
	"《中华人民共和国国家情报法》解读": [{
		"【单选题】()统一领导和组织军队情报工作。": ["中央军事委员会"]
	}, {
		"【判断题】«国家情报法»落实了总体国家安全观,为国家情报工作的有效实施提供了制度依据。()": ["对"]
	}]
}, {
	"《中华人民共和国反恐怖主义法》解读": [{
		"【判断题】«反恐法»规定了我国应坚持防范为主,在反恐怖主义斗争中保持主动。()": ["对"]
	}]
}, {
	"《中华人民共和国 *** 安全法》解读": [{
		"【判断题】 *** 违法犯罪对公共利益带来重大危害是我国 *** 安全面临的风险和挑战之一。()": ["对"]
	}]
}, {
	"国家安全法律体系中的其他法律规范简介": [{
		"【单选题】自2017年1月1日起施行的«中华人民共和国境外非 *** 组织境内活动管理法»共7章()条。": ["54"]
	}, {
		"【判断题】我国第一部针对境外非 *** 组织的立法,填补了行为规范缺失和秩序空白。()": ["对"]
	}]
}, {
	"国家安全法治的完善：加强执法、推动司法、倡导守法": [{
		"【单选题】国家安全威胁的特性不包含()。": ["单一性"]
	}, {
		"【单选题】1996年全国人大修订的(),规定“国家安全机关依照法律规定,办理危害国家安全的刑事案件,行使与公安机关相同的职权。”": ["«刑事诉讼法»"]
	}]
}];