// ==UserScript==
// @name         Перевод ивентов FC Online
// @namespace    https://vk.com/public34067337
// @version      0.1
// @description  Перевод на русский язык ивентов FC Online
// @author       Ваше имя или ник
// @match        https://*.fo4.garena.in.th/*
// @license      MIT
// @grant        GM_addStyle
// @downloadURL https://update.greasyfork.org/scripts/473683/%D0%9F%D0%B5%D1%80%D0%B5%D0%B2%D0%BE%D0%B4%20%D0%B8%D0%B2%D0%B5%D0%BD%D1%82%D0%BE%D0%B2%20FC%20Online.user.js
// @updateURL https://update.greasyfork.org/scripts/473683/%D0%9F%D0%B5%D1%80%D0%B5%D0%B2%D0%BE%D0%B4%20%D0%B8%D0%B2%D0%B5%D0%BD%D1%82%D0%BE%D0%B2%20FC%20Online.meta.js
// ==/UserScript==

(function() {
    'use strict';
      const customStyles = `
       html{
       font-size: 6px!important;
       }
       body,p,div,span,button,.quest__item--reward{
       font-family: sans-serif!important;
       font-size: 14px;
       }
       div *
       {
       line-height:2em;
       }
       .intro--content{
       width:100%
       }
       .quest__item--notcomplete{
       font-size: 12px;
       }
       .quest__headbox{
       margin-bottom:20px;
       }
       .quest__btnboxwrap span{
       display:block;padding-bottom:20px;

    `;
    
    GM_addStyle(customStyles);

    const translations = {
        '</head>':'<style>html{font-size: 1.6rem}</style></head>',
        'ใส่รายละเอียดคลับไม่ต้องยาวมาก เอาสั้นๆ บอกไว้แค่นี้ เดี๋ยวจะหาว่าไม่เตือน ไม่อยากพูดมากแล้วนะ':'Напишите текст о вашем клубе',
        'BUILD YOUR CLUB WITH FRIENDS':'СОЗДАЙ СВОЙ КЛУБ',
        'รายการเควสรายสัปดาห์ทั้งหมด':'Список возможных заданий',
        'รายการเควสรายเดือนทั้งหมด':'Список возможных заданий',
        'สมาชิก 1 คนสามารถทำได้ 1 ครั้งต่อวัน':'1 раз в день',
        'รางวัลอัพเลเวลคลับ':'Награды',
        'จำนวนแต้มคลับในการเลื่อนขั้น Level':'Кол-во опыта до получения уровня',
        'สร้างคลับด้วยตัวคุณเอง เสีย':'Стоимость создания клуба - ',
        'รับเข้าคลับ':'Принять',
        'ปฏิเสธ':'Отказать',
        'Action':'Действия',
        'สมัคร':'Заявка',
        'ค้นหา':'Поиск',
        'กติกา':'Правила',
        'คำขอ':'Заявки',
        'รีเฟรช':'Обновить',
        'ย้อนกลับ':'Назад',
        'ตำแหน่ง':'Группа',
        'ชื่อผู้จัดการทีม':'Ник',
        'เควสคลับรายวัน':'Каждый день',
        'จำนวน EXP':'Опыт',
        'จำนวนแมตซ์ N vs N': 'Матчи в клубе',
        'จำนวนแมตซ์': 'Матчи',
        'แต้มคลับ': 'Задания',
        'อุดมการณ์ของคลับ': 'Описание',
        'รางวัลอัพเกรดคลับ':'Награды',
        'รับรางวัลแล้ว':'Выполнено',
        'อัพเกรดคลับเลเวล':'Уровень клуба',
        'รายละเอียดคลับ': 'О клубе',
        'ผู้ก่อตั้งคลับ': 'Лидер',
        'เลเวลคลับ': 'Уровень клуба',
        'Club Level':'Уровень клуба',
        'สมาชิก': 'Участники',
        'EXP สะสม': 'Опыт',
        'รองหัวหน้าคลับ':'Заместители',
        'หัวหน้าคลับ':'Создатель',
        'ไล่ออกจากคลับ':'Исключить',
        'สร้างคลับของคุณกับเพื่อน ๆ ช่วยกันทำภารกิจ' :'Создай свой клуб, играй с друзьями,',
        'เก็บไอเทมฟรี แล้วสนุกกับเกมไปด้วยกัน':'выполняйте миссии и получайте награды',
        'Exp':'опыта',
        'ชนะใน Ranking Mode จำนวน 1 ครั้ง':'1 победа в рейтинговом матче',
        'เควสรายวัน':'Каждый день',
        'เควสรายสัปดาห์':'Раз в неделю',
        'เควสรายเดือน':'Раз в месяц',
        'รายการรางวัลในแต่ละ':'Награды и',
        'Level':'Уровень',
        'ของรางวัล':'Награды',
        'เควสจะทำการรีเซตใน':'До обновления заданий: ',
        'ชั่วโมง':'час',
        'วินาที':'сек',
        'นาที':'мин',
        'วัน':'дн',
        'ชนะในโหมด N V N 1 เกม':'Победить одноклубника',
        'เควสคลับรายบุคคล':'Персональные задания',
        'เล่น Ranking Mode จำนวน 5 เกม':'Сыграть 5 рейтинговых матчей',
        'เล่น N v N กับУчастникиในคลับ':'Сыграть с одноклубником',
        'ประวัติ':'Участники',
        'ไม่ผ่านเงื่อนไข':'Не выполнено',
        'เปลี่ยนเควส':'Сменить задание',
        'อัปเกรดนักเตะ 5 ครั้ง จำนวน 30 ครั้ง':'Заточить 5 игроков, 30 раз',
        'คน':'',
        'เกม':'',
        'เป็น':'',
        'เติม FC':'Пополнить FC',
        'เล่น Ranking 15 จำนวน 30 ครั้ง':'Сыграть 15 рейтинговых матчей, 30 раз',
        'รับรางวัล':'Выполнено',
        'คุณได้รับ':'Вы получили награду!',
        'สร้างคลับ':'Создать клуб',
        'ชื่อคลับของคุณ':'Введите название клуба',
        'ข้อมูลผู้ก่อตั้ง':'Данные основателя клуба',
        'เลือกภาพ':'Логотип клуба',
        'ยืนยัน':'Создать',
        'ใช้':'за',
        'ยกเลิก':'Отменить',
        'เกณฑ์การให้คะแนนใน':'Система начисления очков в ',
        'จำนวนแมตช์':'Количество',
        'ที่เล่น':'матчей',
        'จะสิ้นสุดเวลาจัดอันดับใน':'До подсчёта очков осталось:',
        'อันดับ':'Место',
        'ชื่อคลับ':'Клуб',
        'คะแนนรวมทั้งหมด':'Всего',
        'คลับ':' в клубе',
         'เลเวล':'Лвл',
        'เป็นเควสรายสัปดาห์':'Еженедельные задания',
        'ชนะโดยไม่เสียประตูใน  Ranking Mode 1  จำนวน 30 ครั้ง':'Победить 30 раз в рейтинговом матче не пропустив гола',
        'เล่น Ranking  15  จำนวน 30 ครั้ง':'Сыграть 15 рейтинговых матчей 30 раз',
        ' ชนะโดยไม่เสียประตูใน  Ranking Mode 1':'Победить без пропущенных голов',
        'เล่น Ranking 2vs2  1':'Сыграть рейтинговый матч в режиме 2 на 2',
        ' อัปเกรดนักเตะ 5 ครั้ง':'Улучшить 5 игроков',
        ' ทำประตู 2 ลูก ใน 1 นัด Ranking':'Забить 2 гола за один рейтинговый матч',
        'อัปเกรดนักเตะ 10 ครั้ง':'Улучшить 10 игроков',
        ' เล่น Ranking  15 ':'Сыграть 15 рейтинговых матчей',
        'เล่น Ranking 2vs2 จำนวน 3':'Сыграть 3 рейтинговых матча в режиме 2 на 2',
        'ทำประตู 3 ลูก ใน 1 นัด Ranking':'Забить 3 гола в одном рейтинговом матче',
        'ผ่านการทำเควสเมื่อ':'выполнил задание:',
        'การทำเควส':' выполнившие задание',
        'เข้าสู่ระบบ':'Вход в аккаунт',
        'ออกจากระบบ':'Выход из аккаунта',
    };
    function replaceText(node) {
        if (node && node.nodeType === Node.TEXT_NODE) {
            for (const key in translations) {
                const regex = new RegExp(key, 'g');
                if (node.textContent.match(regex)) {
                    node.textContent = node.textContent.replace(regex, translations[key]);
                }
            }
        }
    }

    function traverse(node) {
        replaceText(node);
        for (const child of node.childNodes) {
            traverse(child);
        }
    }

    const observer = new MutationObserver(mutationsList => {
        for (const mutation of mutationsList) {
            if (mutation.type === 'childList') {
                for (const node of mutation.addedNodes) {
                    traverse(node);
                }
            } else if (mutation.type === 'characterData') {
                replaceText(mutation.target);
            }
        }
    });

  
    observer.observe(document.body, {
        childList: true,
        subtree: true,
        characterData: true,
        characterDataOldValue: true
    });

  
    traverse(document.body);

})();