// ==UserScript==
// @name         Idle Poe封弊器
// @namespace    http://tampermonkey.net/
// @version      20.2
// @description  你是大捲逼
// @author       Ru
// @match        https://poe.faith.wang/*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=faith.wang
// @grant        none
// @grant        GM_info
// @run-at       document-start
// @license MIT
// @downloadURL https://update.greasyfork.org/scripts/477546/Idle%20Poe%E5%B0%81%E5%BC%8A%E5%99%A8.user.js
// @updateURL https://update.greasyfork.org/scripts/477546/Idle%20Poe%E5%B0%81%E5%BC%8A%E5%99%A8.meta.js
// ==/UserScript==


const all_mod_list = {
    "手套": {
        "$该装备的能量护盾提高 n%": 2,
        "$晕眩回复和格挡回复提高 n%": 3,
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$+n 命中值": 7,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$每击败一名敌人获得 n 点生命": 23,
        "$+n 最大能量护盾": 57,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$+ n 最大生命": 87,
        "$法术伤害压制率 +n%": 93,
        "$+n 最大魔力": 111,
        "$生命每秒再生 n": 123,
        "$该装备的护甲提高 n%": 175,
        "$护甲提高 n": 176,
        "$+n 点闪避值": 213,
        "$该装备的护甲与闪避提高 n%": 220,
        "$该装备的护甲与能量护盾提高 n%": 221,
        "$该装备的闪避与能量护盾提高 n%": 222,
        "$该装备的护甲、闪避和能量护盾提高 n%": 223,
        "$该装备的闪避率提高 n%": 256,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$物品稀有度提高 n%": 124,
        "$生命再生率提高 n%": 218,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "鞋子": {
        "$该装备的能量护盾提高 n%": 2,
        "$晕眩回复和格挡回复提高 n%": 3,
        "$属性需求降低 n%": 4,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$移动速度加快 n%": 54,
        "$+n 最大能量护盾": 57,
        "$+ n 最大生命": 87,
        "$法术伤害压制率 +n%": 93,
        "$+n 最大魔力": 111,
        "$生命每秒再生 n": 123,
        "$该装备的护甲提高 n%": 175,
        "$护甲提高 n": 176,
        "$+n 点闪避值": 213,
        "$该装备的护甲与闪避提高 n%": 220,
        "$该装备的护甲与能量护盾提高 n%": 221,
        "$该装备的闪避与能量护盾提高 n%": 222,
        "$该装备的护甲、闪避和能量护盾提高 n%": 223,
        "$该装备的闪避率提高 n%": 256,
        "$物品稀有度提高 n%": 124,
        "$生命再生率提高 n%": 218
    },
    "胸甲": {
        "$该装备的能量护盾提高 n%": 2,
        "$晕眩回复和格挡回复提高 n%": 3,
        "$属性需求降低 n%": 4,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$+n 最大能量护盾": 57,
        "$+ n 最大生命": 87,
        "$法术伤害压制率 +n%": 93,
        "$+n 最大魔力": 111,
        "$生命每秒再生 n": 123,
        "$该装备的护甲提高 n%": 175,
        "$护甲提高 n": 176,
        "$反射 n 伤害给近战攻击者": 191,
        "$+n 点闪避值": 213,
        "$该装备的护甲与闪避提高 n%": 220,
        "$该装备的护甲与能量护盾提高 n%": 221,
        "$该装备的闪避与能量护盾提高 n%": 222,
        "$该装备的护甲、闪避和能量护盾提高 n%": 223,
        "$该装备的闪避率提高 n%": 256,
        "$n% 额外物理伤害减免": 113
    },
    "头部": {
        "$该装备的能量护盾提高 n%": 2,
        "$晕眩回复和格挡回复提高 n%": 3,
        "$属性需求降低 n%": 4,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$命中值提高 n%": 27,
        "$+n 最大能量护盾": 57,
        "$+ n 最大生命": 87,
        "$法术伤害压制率 +n%": 93,
        "$+n 最大魔力": 111,
        "$生命每秒再生 n": 123,
        "$该装备的护甲提高 n%": 175,
        "$护甲提高 n": 176,
        "$反射 n 伤害给近战攻击者": 191,
        "$+n 点闪避值": 213,
        "$该装备的护甲与闪避提高 n%": 220,
        "$该装备的护甲与能量护盾提高 n%": 221,
        "$该装备的闪避与能量护盾提高 n%": 222,
        "$该装备的护甲、闪避和能量护盾提高 n%": 223,
        "$该装备的闪避率提高 n%": 256,
        "$物品稀有度提高 n%": 124,
        "$生命再生率提高 n%": 218
    },
    "盾": {
        "$该装备的能量护盾提高 n%": 2,
        "$晕眩回复和格挡回复提高 n%": 3,
        "$属性需求降低 n%": 4,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$+n 最大能量护盾": 57,
        "$+ n 最大生命": 87,
        "$+n% 所有元素抗性": 92,
        "$法术伤害压制率 +n%": 93,
        "$+n 最大魔力": 111,
        "$生命每秒再生 n": 123,
        "$该装备的护甲提高 n%": 175,
        "$护甲提高 n": 176,
        "$反射 n 伤害给近战攻击者": 191,
        "$火焰抗性上限提高 n%": 198,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$+n 点闪避值": 213,
        "$该装备的护甲与闪避提高 n%": 220,
        "$该装备的护甲与能量护盾提高 n%": 221,
        "$该装备的闪避与能量护盾提高 n%": 222,
        "$该装备的护甲、闪避和能量护盾提高 n%": 223,
        "$该装备 +n% 攻击格挡率": 224,
        "$生命回复你格挡时 n": 225,
        "$n% 几率避免元素异常状态": 226,
        "$受到的暴击伤害降低 n%": 227,
        "$冰霜抗性上限提高 n%": 228,
        "$闪电抗性上限提高 n%": 229,
        "$混沌抗性上限提高 n%": 230,
        "$全部抗性上限提高 n%": 231,
        "$法术伤害格挡几率 n%": 232,
        "$该装备的闪避率提高 n%": 256,
        "$n% 额外物理伤害减免": 113
    },
    "腰带": {
        "$晕眩回复和格挡回复提高 n%": 3,
        "$攻击技能的元素伤害提高 n%": 9,
        "$+n 力量": 12,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$+n 最大能量护盾": 57,
        "$+ n 最大生命": 87,
        "$+n 最大魔力": 111,
        "$生命每秒再生 n": 123,
        "$护甲提高 n": 176,
        "$反射 n 伤害给近战攻击者": 191
    },
    "爪": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$中毒伤害提高 n%": 30,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "匕首": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$中毒伤害提高 n%": 30,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "法杖": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$法术伤害提高 n%": 37,
        "$施法速度提高 n%": 207,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$所有法术主动技能石等级 +n": 203,
        "$给法术附加 x 到 n 点火焰伤害": 204,
        "$给法术附加 x 到 n 点闪电伤害": 205,
        "$给法术附加 x 到 n 点冰霜伤害": 206,
        "$法术暴击率提高 n%": 208,
        "$有 n% 的几率造成冻结状态": 209,
        "$闪电伤害击中时有 n% 的几率使敌人受到感电效果影响": 210,
        "$n% 的几率点燃敌人": 180,
        "$燃烧伤害提高 n%": 211,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$火焰伤害提高 n%": 133,
        "$冰霜伤害提高 n%": 134,
        "$闪电伤害提高 n%": 135,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "单手剑": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$击中时有 n% 的几率使目标流血": 29,
        "$中毒伤害提高 n%": 30,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "细剑": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$击中时有 n% 的几率使目标流血": 29,
        "$中毒伤害提高 n%": 30,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "单手斧": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标流血": 29,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "单手锤": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标流血": 29,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "弓": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$击中时有 n% 的几率使目标流血": 29,
        "$中毒伤害提高 n%": 30,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$弓类攻击发射 n 支额外箭矢": 212,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "长杖": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$法术伤害提高 n%": 37,
        "$施法速度提高 n%": 207,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$所有法术主动技能石等级 +n": 203,
        "$给法术附加 x 到 n 点火焰伤害": 204,
        "$给法术附加 x 到 n 点闪电伤害": 205,
        "$给法术附加 x 到 n 点冰霜伤害": 206,
        "$法术暴击率提高 n%": 208,
        "$有 n% 的几率造成冻结状态": 209,
        "$闪电伤害击中时有 n% 的几率使敌人受到感电效果影响": 210,
        "$n% 的几率点燃敌人": 180,
        "$燃烧伤害提高 n%": 211,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$火焰伤害提高 n%": 133,
        "$冰霜伤害提高 n%": 134,
        "$闪电伤害提高 n%": 135,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "双手剑": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$击中时有 n% 的几率使目标流血": 29,
        "$中毒伤害提高 n%": 30,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "双手斧": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标流血": 29,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "双手锤": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标流血": 29,
        "$流血伤害提高 n%": 31,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "短杖": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$法术伤害提高 n%": 37,
        "$施法速度提高 n%": 207,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$所有法术主动技能石等级 +n": 203,
        "$给法术附加 x 到 n 点火焰伤害": 204,
        "$给法术附加 x 到 n 点闪电伤害": 205,
        "$给法术附加 x 到 n 点冰霜伤害": 206,
        "$法术暴击率提高 n%": 208,
        "$有 n% 的几率造成冻结状态": 209,
        "$闪电伤害击中时有 n% 的几率使敌人受到感电效果影响": 210,
        "$n% 的几率点燃敌人": 180,
        "$燃烧伤害提高 n%": 211,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$火焰伤害提高 n%": 133,
        "$冰霜伤害提高 n%": 134,
        "$闪电伤害提高 n%": 135,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "符文匕首": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$击中时有 n% 的几率使目标中毒": 28,
        "$中毒伤害提高 n%": 30,
        "$法术伤害提高 n%": 37,
        "$施法速度提高 n%": 207,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$所有法术主动技能石等级 +n": 203,
        "$给法术附加 x 到 n 点火焰伤害": 204,
        "$给法术附加 x 到 n 点闪电伤害": 205,
        "$给法术附加 x 到 n 点冰霜伤害": 206,
        "$法术暴击率提高 n%": 208,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "战杖": {
        "$属性需求降低 n%": 4,
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$敌人晕眩门槛降低 n%": 16,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$该装备的攻击暴击率提高 n%": 25,
        "$+n% 全域暴击伤害加成": 26,
        "$命中值提高 n%": 27,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$该装备上的技能石等级 +n": 200,
        "$此物品上装备的【近战技能石】等级 +n": 201,
        "$有 n% 的几率造成冻结状态": 209,
        "$闪电伤害击中时有 n% 的几率使敌人受到感电效果影响": 210,
        "$n% 的几率点燃敌人": 180,
        "$燃烧伤害提高 n%": 211,
        "$该装备物理伤害提高 n%": 248,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$火焰伤害提高 n%": 133,
        "$冰霜伤害提高 n%": 134,
        "$闪电伤害提高 n%": 135,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "项链": {
        "$每击败一名敌人获得 n 点魔力": 5,
        "$+n 命中值": 7,
        "$+n 全属性": 8,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$每击败一名敌人获得 n 点生命": 23,
        "$+n% 全域暴击伤害加成": 26,
        "$全域暴击率提高 n%": 34,
        "$法术伤害提高 n%": 37,
        "$施法速度提高 n%": 207,
        "$+n 最大能量护盾": 57,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$+ n 最大生命": 87,
        "$+n% 所有元素抗性": 92,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$生命每秒再生 n": 123,
        "$护甲提高 n%": 187,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$能量护盾上限提高 n%": 280,
        "$火焰伤害提高 n%": 133,
        "$冰霜伤害提高 n%": 134,
        "$闪电伤害提高 n%": 135,
        "$物品稀有度提高 n%": 124,
        "$持续伤害加成 n%": 199,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "戒指": {
        "$每击败一名敌人获得 n 点魔力": 5,
        "$照亮范围扩大 n%": 6,
        "$+n 命中值": 7,
        "$+n 全属性": 8,
        "$攻击技能的元素伤害提高 n%": 9,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 力量": 12,
        "$+n 敏捷": 13,
        "$+n 智慧": 14,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$每击败一名敌人获得 n 点生命": 23,
        "$命中值提高 n%": 27,
        "$施法速度提高 n%": 207,
        "$+n 最大能量护盾": 57,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$+ n 最大生命": 87,
        "$+n% 所有元素抗性": 92,
        "$+n 最大魔力": 111,
        "$魔力再生率提高 n%": 122,
        "$生命每秒再生 n": 123,
        "$+n 点闪避值": 213,
        "$将所受伤害的 n% 吸纳为生命": 214,
        "$该装备附加 x - n 基础物理伤害": 257,
        "$火焰伤害提高 n%": 133,
        "$冰霜伤害提高 n%": 134,
        "$闪电伤害提高 n%": 135,
        "$物品稀有度提高 n%": 124,
        "$你的攻击击中每个敌人会回复 n 生命": 75
    },
    "箭袋": {
        "$每击败一名敌人获得 n 点魔力": 5,
        "$+n 命中值": 7,
        "$物理攻击伤害的 n% 会转化为生命偷取": 10,
        "$物理攻击伤害的 n% 会转化为魔力偷取": 11,
        "$+n 敏捷": 13,
        "$攻击速度提高 n%": 15,
        "$+n% 火焰抗性": 17,
        "$+n% 冰霜抗性": 18,
        "$+n% 闪电抗性": 19,
        "$+n% 混沌抗性": 20,
        "$敌人被晕眩时间延长 n%": 21,
        "$每击败一名敌人获得 n 点生命": 23,
        "$攻击附加 x - n 基础物理伤害": 78,
        "$攻击附加 x - n 基础火焰伤害": 79,
        "$攻击附加 x - n 基础冰霜伤害": 80,
        "$攻击附加 x - n 基础闪电伤害": 81,
        "$攻击附加 x - n 基础混沌伤害": 82,
        "$弓类攻击的暴击率提高 n%": 83,
        "$+ n 最大生命": 87,
        "$弓类攻击发射 n 支额外箭矢": 212,
        "$弓类技能伤害提高 n%": 215,
        "$弓类攻击 +n% 暴击伤害加成": 216,
        "$攻击技能的持续伤害加成 n%": 217,
        "$该装备附加 x - n 基础物理伤害": 257
    }
};

const cn_equip_to_id = {
    "单手剑": "1",
    "单手斧": "2",
    "法杖": "4",
    "爪": "8",
    "匕首": "16",
    "细剑": "32",
    "单手锤": "64",
    "短杖": "128",
    "符文匕首": "256",
    "弓": "512",
    "长杖": "1024",
    "双手剑": "2048",
    "双手斧": "4096",
    "双手锤": "8192",
    "战杖": "16384",
    "手套": "2064384",
    "鞋子": "132120576",
    "胸甲": "17045651456",
    "头部": "1082331758592",
    "盾牌": "69269232549888",
    "箭袋": "70368744177664",
    "腰带": "140737488355328",
    "项链": "281474976710656",
    "戒指": "562949953421312"
};

const id_to_cn_equip = Object.fromEntries(Object.entries(cn_equip_to_id).map(([a, b]) => [b, a]));
Object.defineProperty(id_to_cn_equip, "convert", {
    get: () => {
        return (type_id) => {
            const data_list = Object.entries(id_to_cn_equip);
            for (let [id, name] of data_list) {
                if (bitwise(+type_id, +id) || type_id == id) return name;
            }
        }
    }
});

const cn_equip_to_en_equip = {
    "单手剑": "One_Hand_Swords",
    "单手斧": "One_Hand_Axes",
    "法杖": "Wands",
    "爪": "Claws",
    "匕首": "Daggers",
    "细剑": "Thrusting_One_Hand_Swords",
    "单手锤": "One_Hand_Maces",
    "短杖": "Sceptres",
    "符文匕首": "Rune_Daggers",
    "弓": "Bows",
    "长杖": "Staves",
    "双手剑": "Two_Hand_Swords",
    "双手斧": "Two_Hand_Axes",
    "双手锤": "Two_Hand_Maces",
    "战杖": "Warstaves",
    "手套": "Gloves",
    "鞋子": "Boots",
    "胸甲": "Body_Armours",
    "头部": "Helmets",
    "盾牌": "Shields",
    "箭袋": "Quivers",
    "腰带": "Belts",
    "项链": "Amulets",
    "戒指": "Rings"
};

const common_color = "rgba(163, 139, 99, 0.85)";

const common_btn_style = {
    "font-weight": "600",
    "height": "30px",
    "border-radius": "10px",
    "outline": "0px",
    "border-color": "white",
    "margin": "10px 10px",
    "color": common_color,
    "background-color": "#1f1f1f",
    "cursor": "pointer"
};

const stone_id_to_cn = {
    1: "工匠石",
    2: "幻色石",
    3: "链接石",
    4: "蜕变石",
    5: "机会石",
    6: "点金石",
    7: "增幅石",
    8: "改造石",
    9: "崇高石",
    10: "混沌石",
    11: "富豪石",
    12: "重铸石",
    13: "神圣石",
    14: "瓦尔宝珠",
    15: "卡兰德的魔镜",
    16: "磨刀石",
    17: "护甲片"
};

const stone_id_to_en = {
    1: "jewellerOrb",
    2: "chromaticOrb",
    3: "orbOfFusing",
    4: "orbOfTransmutation",
    5: "orbOfChance",
    6: "orbOfAlchemy",
    7: "orbOfAugmentation",
    8: "orbOfAlteration",
    9: "exaltedOrb",
    10: "chaosOrb",
    11: "regalOrb",
    12: "orbOfScouring",
    13: "divineOrb",
    14: "vaalOrb",
    15: "mirrorOfKalandra",
    16: "whetstone",
    17: "armourersScrap"
};

const rarity_list = {
    0: 'player',
    1: 'normal',
    2: 'magic',
    3: 'rare',
    4: 'unique'
};

(() => {

    init_window_method();

    let lock = false;
    let socket_ready = false;
    let no_alt = false;
    let need_scouring = true;
    let flag = 0;


    let character_id = window.ls.character_id;


    setInterval(() => {
        init_window_method();
        init_setting_gui();
        init_auto_gui();
        init_transfer_gui();
        init_custom_tab();
        run_path_script();
    }, 33);


    const click_checker = async (expect_status = true) => {
        const checker = window.get("div.confirm-switch-container > button")[0];
        if (!checker) return;
        if (checker.ariaChecked != "false") checker.click();
        checker.stop = `${expect_status}`;
    }



    const click_stone = async (stone_name, no_check = false) => {
        if (lock && !no_check) return false;

        lock = true;
        await delay(window.roll(...(["max_delay", "min_delay"].map((k) => +get_setting_val("general", k)))));

        const action_btn_list = window.get("div.actions > button");
        if (!action_btn_list.length) return;

        const target_btn = action_btn_list.find((e) => e.innerText.includes(stone_name));
        if (!target_btn) return;

        target_btn.click();
    }

    function init_window_method() {
        if (window.inited == true) return;
        window.inited = true;

        /**
         * @param {string} selector
         * @param {HTMLElement} ref
         * @returns {HTMLElement[]}
         */
        window.get = (selector, ref = document) => {
            return Array.from(ref.querySelectorAll(selector)).map((e) => {
                e.get = (selector) => window.get(selector, e);
                return e;
            });
        }


        /**
         * @param {string} tagname
         * @param {object} properties
         * @returns {HTMLElement}
         */
        window.new_node = (tagname, properties = {}) => {
            let property_modifier = (obj, properties) => {
                for (let key of Object.keys(properties)) {
                    (
                        (typeof (obj[key]) === 'object') ?
                            (property_modifier(obj[key], properties[key]))
                            :
                            (obj[key] = properties[key])
                    );
                }

                return obj;
            };
            return property_modifier(document.createElement(tagname), properties);
        }


        /**
         * @param {string} text
         * @param {boolean} auto_del
         * @returns {HTMLElement}
         */
        window.add_msg = (text, auto_del = true, background = "#a8f7bf", size = [50, 0]) => {
            let len = window.get(".dfdf4862899fb8d9f79aaba8e9c99898_msg").length;
            let msg = window.new_node("div", {
                className: "dfdf4862899fb8d9f79aaba8e9c99898_msg",
                style: {
                    textAlign: "center",
                    verticalAlign: "middle",
                    background,
                    borderRadius: "10px",
                    height: `${size[0]}px`,
                    left: "30%",
                    opacity: 0.85,
                    pointerEvents: "none",
                    position: "fixed",
                    top: `${(len + 1) * 70 - 50}px`,
                    transformOrigin: "center",
                    transition: "top .5s",
                    zIndex: len + 1000
                },
                del() {
                    msg.style.top = "-100px";
                    setTimeout(() => {
                        msg.remove();
                        window.get(".dfdf4862899fb8d9f79aaba8e9c99898_msg").forEach((e, i) => {
                            e.style.top = `${(i + 1) * 70 - 50}px`;
                        });
                    }, 500);
                }
            });

            if (size[1]) msg.style.width = `${size[1]}px`;

            msg.appendChild(window.new_node("div", {
                innerText: text,
                style: {
                    padding: "0px 5px",
                    fontSize: "16px",
                    lineHeight: "20px",
                    color: "#ad589e",
                    marginTop: "16px",
                    textAlign: "center",
                    verticalAlign: "middle",
                    display: "inline-block"
                }
            }));

            window.get("body")[0].appendChild(msg);


            if (auto_del) setTimeout(msg.del, 2000);
            else {
                msg.style.pointerEvents = "auto";
                msg.addEventListener("click", msg.del);
            }

            return msg;
        }


        /**
         * @param {number} max
         * @param {number} min
         * @param {boolean} float
         * @returns {number}
         */
        window.roll = (max = 0, min = 0, float = false) => {
            if (max < min) max = [min, min = max][0];

            let point = Math.random() * (max - min + 1) + min;

            return float ? point : Math.floor(point);
        }

        window.ls = ls_proxy(localStorage);

        window.ls.auto_poe_logs = [`當前版本:${GM_info.script.version}`];

        window.modify_checker = async (url = "", opt, obj, first_check = 0) => {

            if (first_check) flag = first_check;

            if (url.includes("modify")) {

                const stone_type = JSON.parse(opt.body ?? "{}")?.type;

                if (obj.success == false) {
                    const action = {
                        8: async () => {
                            no_alt = true;
                            click_checker();
                        }
                    };

                    await (action[stone_type] ?? click_checker)();

                    console.log(`使用 ${stone_id_to_cn[stone_type]} 失敗，${obj.message}`);
                    lock = false;

                }
                else {
                    flag = stone_type;
                }
            }

            let data = obj.data ?? {};
            if (data?.equipment) data = data.equipment;

            if (data?.equipmentType) {
                window.ls.equipment_temp = { data: { equipment: data } };

                if (flag) {
                    const action = {
                        1: check_socket,
                        2: check_color,
                        3: check_link,
                        5: check_legend,
                        7: check_mod,
                        8: check_mod,
                        10: check_mod,
                        11: check_mod,
                    };

                    await action[flag]?.();

                    lock = false;
                    flag = 0;
                }

            }


            async function check_mod() {
                const magic_arr = Object.keys(data.magics ?? {});

                if (!magic_arr.length) {
                    window.add_msg("不是可以改造或增幅的裝備");
                    click_checker();
                    return;
                }

                const equip_name = id_to_cn_equip.convert(data?.equipmentType);
                if (!equip_name) return;


                const raw_list = window.ls.auto_setting?.auto_alt?.[equip_name];
                if (!raw_list) {
                    window.add_msg("未設定該類型裝備");
                    click_checker();
                    return;
                }
                const require_list = raw_list.map(([k, v]) => [all_mod_list[equip_name][`$${k}`], +v]);

                const mod_id_to_name = Object.fromEntries(Object.entries(all_mod_list[equip_name]).map(([a, b]) => [b, a]));
                const mod_msg = magic_arr.map((mod_id) => {
                    let mod_name = mod_id_to_name[mod_id];
                    if (!mod_name) {
                        mod_name = window.magics[mod_id].toString().split("<")[1].split(">")[1];
                        console.log(`未在${equip_name}上找到${mod_id}號詞綴，名稱為${mod_name}`);
                    }

                    [
                        ["${i}", "n"],
                        ["${i[0]}", "x"],
                        ["${i[1]}", "n"],
                        ["${m(i)} ${c(i)}", "提高 n"],

                    ].forEach(([a, b]) => {
                        mod_name = mod_name.replaceAll(a, b);
                    });
                    return mod_name.replace("n", +(Array.from(data.magics[mod_id]).pop()))
                }).join("\n");

                console.log(`${first_check ? `確認 ${equip_name} 詞綴` : `在 ${equip_name} 上使用 ${stone_id_to_cn[flag]}`}\n${mod_msg}`);

                const qualified_list = magic_arr.filter((mod_id) => {
                    return require_list.find(([k, v]) => {
                        const mod_val = +(Array.from(data.magics[mod_id]).pop());
                        return (mod_id == k) && (mod_val >= v);
                    });
                });

                const equip_mod_exceed = magic_arr.length > require_list.length;

                const check_no_trash = qualified_list.length == (equip_mod_exceed ? require_list : magic_arr).length;

                if (check_no_trash) {
                    click_checker();
                    need_scouring = false;
                }
            }

            async function check_socket() {
                const socket_list = {
                    "1": 3,
                    "2": 3,
                    "4": 3,
                    "8": 3,
                    "16": 3,
                    "32": 3,
                    "64": 3,
                    "128": 3,
                    "256": 3,
                    "512": 6,
                    "1024": 6,
                    "2048": 6,
                    "4096": 6,
                    "8192": 6,
                    "16384": 6,
                    "2064384": 4,
                    "132120576": 4,
                    "17045651456": 6,
                    "1082331758592": 4,
                    "69269232549888": 3,
                    "70368744177664": 0,
                    "140737488355328": 0,
                    "281474976710656": 0,
                    "562949953421312": 0,
                    get convert() {
                        return (type_id) => {
                            const data_list = Object.entries(this);
                            for (let [id, limit] of data_list) {
                                if (bitwise(+type_id, +id) || type_id == id) return limit;
                            }
                        }
                    }
                };


                const socket_count = (data.sockets ?? []).flat(Infinity).length;
                const socket_limit = socket_list.convert(data.equipmentType);

                const equip_name = id_to_cn_equip.convert(data?.equipmentType);
                console.log(`${first_check ? `確認 ${equip_name} 洞數` : `在 ${equip_name} 上使用 ${stone_id_to_cn[flag]}`}\n${socket_count}/${socket_limit}`);

                if (socket_count == socket_limit) {
                    click_checker();
                }
            }

            async function check_link() {
                const link_group = data.sockets?.length;

                const equip_name = id_to_cn_equip.convert(data?.equipmentType);
                console.log(`${first_check ? `確認 ${equip_name} 洞分組數` : `在 ${equip_name} 上使用 ${stone_id_to_cn[flag]}`}\n${link_group}/${1}`);

                if (link_group == 1) {
                    click_checker();
                }
            }

            async function check_color() {
                const colors = data.sockets?.flat(Infinity).map(({ type }) => type);
                const color_count = new Array(3).fill(0);
                colors.forEach((color_id) => color_count[color_id - 1]++);

                const color_setting = ["red", "green", "blue"].map((color_name) => +get_setting_val("general", `socket_${color_name}`));
                const color_msg = "紅綠藍".split("").map((color_name, i) => `${color_name}:${color_count[i]}/${color_setting[i]}`).join("\n");

                const equip_name = id_to_cn_equip.convert(data?.equipmentType);
                console.log(`${first_check ? `確認 ${equip_name} 洞色` : `在 ${equip_name} 上使用 ${stone_id_to_cn[flag]}`}\n${color_msg}`);

                if (color_count.every((equip_color_count, i) => equip_color_count >= color_setting[i])) {
                    click_checker();
                }
            }

            async function check_legend() {
                const equip_name = id_to_cn_equip.convert(data?.equipmentType);
                if (!equip_name) return;

                console.log(`${first_check ? `確認 ${equip_name} 稀有度` : `在 ${equip_name} 上使用 ${stone_id_to_cn[flag]}`}\n${rarity_list[data.rarity]}`);

                if (data.rarity == 4) {
                    need_scouring = false;
                    click_checker();
                }
                else if (data.rarity != 1 && get_setting_val("general", "check_chance")) {
                    await check_mod();
                    click_checker();
                }


            }
        };


        window.general_checker = async (url = "", opt, obj) => {
            const path_list = {
                "/shop": () => {
                    const shop_list = obj.data ?? [];
                    if (shop_list.length) window.ls.shop_list = shop_list;
                },
                "/character": () => {
                    const id_now = obj.data?.id;
                    if (id_now) character_id = id_now;
                },
                "/character/currency": () => {
                    const currency = obj.data;
                    if (!window.ls.currency) window.ls.currency = {};
                    if (currency) window.ls.currency[character_id] = currency;
                },
                "/character/list": () => {
                    const list = obj.data;
                    if (!list.length) return;

                    const new_list = window.ls.character_list.concat(list.map(({ id, name }) => ({ id, name })));
                    const id_list = [];
                    window.ls.character_list = new_list.filter((char) => {
                        if (id_list.includes(char.id)) return false;
                        else {
                            id_list.push(char.id);
                            return true;
                        }
                    });

                },
            };


            path_list[url.split("api").pop()]?.();


        }

        const _fetch = window.fetch;
        window.fetch = (url, opt) => {

            return new Promise((resolve, reject) => {

                _fetch.apply(this, [url, opt]).then((res) => {
                    res.clone().json().then((obj) => {
                        window.modify_checker(url, opt, obj);
                        window.general_checker(url, opt, obj);
                    });
                    resolve(res);
                }).catch(reject);
            });
        }


        const _log = console.log.bind(console);
        console.log = function () {

            let str_result = Object.values(arguments)
                .map((e) => {
                    if (Array.isArray(e)) {
                        return `[${e}]`;
                    }
                    else if (typeof (e) === "object") {
                        let r = e;
                        try {
                            r = JSON.stringify(e);
                        }
                        catch { }
                        return r;
                    }
                    else {
                        return e;
                    }
                })
                .join();

            if (!window.ls.auto_poe_logs) window.ls.auto_poe_logs = [`當前版本:${GM_info.script.version}`];
            window.ls.auto_poe_logs.push(str_result);

            _log.apply(this, arguments);
            return str_result;
        };
    }

    function init_setting_gui() {

        if (window.get("#setting_btn")[0]) return;

        load_setting();

        const setting_btn = window.new_node("div", {
            id: "setting_btn",
            style: {
                "background-image": "url(https://i.imgur.com/Oqs8IAn.gif)",
                "background-size": "50px 50px",
                "border-radius": "30px",
                "position": "absolute",
                "width": "50px",
                "height": "50px",
                "left": "15px",
                "bottom": "15px",
                "cursor": "pointer"
            }

        });

        setting_btn.addEventListener("click", open_panel);

        document.body.appendChild(setting_btn);


        function open_panel() {

            const setting_wrap = window.new_node("div", {
                style: {
                    "height": "100vh",
                    "width": "100%",
                    "overflow": "auto",
                    "position": "absolute",
                    "background-color": "rgba(15, 19, 26, 0.8)",
                    "z-index": "999",
                    "left": "0px",
                    "top": "0px",
                    "display": "flex",
                    "align-items": "center",
                    "justify-content": "center"
                }
            });

            const setting_panel = window.new_node("div", {
                id: "setting_panel",
                style: {
                    "display": "flex",
                    "flex-direction": "column",
                    "border-radius": "30px",
                    "height": "50%",
                    "width": "100%",
                    "overflow": "auto",
                    "background-color": "#33373d",
                    "z-index": "1000",
                }
            });

            const desc = window.new_node("span", {
                innerText: "數值請填描述中的n，當滿足「裝備上所有詞綴」都可以「在設定中找到」，且數值「大於等於」對應的設定時，停止改造。\n當「設置的詞綴數量」小於「裝備上的詞綴數量」時，只要「所有的詞綴設定滿足」就會停止。",
                style: {
                    "line-height": "30px",
                    "color": "white",
                    "margin": "0px 0px 30px 8%"
                }
            });


            const close_setting_btn = window.new_node("div", {
                innerText: "❌",
                style: {
                    "margin": "1% 0px 0px 95%",
                    "cursor": "pointer",
                    "font-size": "30px"
                }
            });

            const close_setting = () => setting_wrap.remove();


            [close_setting_btn, setting_wrap].forEach((element) => {
                element.addEventListener("click", (event) => {
                    if (event.target == element) close_setting();
                });
            });


            setting_panel.appendChild(close_setting_btn);
            setting_panel.appendChild(desc);

            load_setting(setting_panel);


            const report_btn = window.new_node("button", {
                innerText: `回報問題請按我下載紀錄`,
                style: {
                    "width": "300px",
                    "margin": "50px 0px 20px 20px",
                    "cursor": "pointer",
                    "font-size": "24px",
                    "font-weight": "333",
                    "color": "white",
                    "background-color": "#33373d",
                    "border-radius": "10px",
                }

            });
            report_btn.addEventListener("click", () => {

                console.log(window.ls.auto_setting);
                console.log(window.ls.equipment_temp);
                const log_downloader = window.new_node("a", {
                    href: URL.createObjectURL(new Blob([Array.from(window.ls.auto_poe_logs).join("\n\n")], { type: "text/plain" })),
                    download: `auto_poe_logs_${new Date().toISOString().replace(/[:.]/g, "-")}.txt`,
                });
                document.body.appendChild(log_downloader);
                log_downloader.click();
                log_downloader.remove();
            });
            setting_panel.appendChild(report_btn);




            const reset_btn = window.new_node("button", {
                innerText: `重置所有設定(沒事不要亂按)`,
                style: {
                    "width": "225px",
                    "margin": "50px 0px 20px 20px",
                    "cursor": "pointer",
                    "font-size": "16px",
                    "font-weight": "333",
                    "color": "#ef5d5d",
                    "background-color": "#33373d",
                    "border-radius": "10px",
                }

            });
            reset_btn.addEventListener("click", () => {
                [
                    "auto_setting",
                    "auto_poe_logs",
                    "equipment_temp",
                    "total_time",
                    "total_count",
                    "win",
                    "lose",
                    "boss_win",
                    "boss_lose"
                ].forEach((key) => {
                    delete window.ls[key];
                });
                window.location.reload();
            });
            setting_panel.appendChild(reset_btn);


            setting_wrap.appendChild(setting_panel);
            document.body.appendChild(setting_wrap);

        }

        function create_mod_block(title = "default", list = Object.keys(cn_equip_to_id)) {
            const block_wrap = window.new_node("div", {
                id: title,
                style: {
                    "border-bottom": "5px gray dotted",
                    "margin-bottom": "20px",
                    "position": "relative",
                    "width": "100%",
                    "display": "flex",
                    "flex-direction": "column"
                }
            });

            const block_header = window.new_node("div", {
                style: {
                    "margin-bottom": "10px",
                    "display": "flex"
                }
            });
            const block_title = create_menu("item_type", list);
            block_title.value = title;

            if (title != "default") {
                block_title.addEventListener("change", (e) => {

                    const get_other = window.get(`.item_type`).filter((e) => e != block_title);
                    if (get_other.map((e) => e.value).includes(block_title.value)) {
                        window.add_msg("請勿選擇重複裝備類型");
                        block_title.value = block_wrap.id;
                        return;
                    }

                    const previous_id = block_wrap.id;
                    block_wrap.id = e.target.value;

                    const mod_val_save = [];
                    window.get(`#${block_wrap.id}`)[0].get("select.mod_list").forEach((mod_list) => {
                        const mod_val = mod_list.nextSibling;

                        const mods = Object.keys(all_mod_list[e.target.value]).map((e) => e.slice(1));
                        const menu = create_menu("mod_list", mods);
                        Object.assign(menu.style, {
                            "width": "50%",
                            "margin": "10px 10px 10px 30px",
                            "padding": "4px 7px",
                            "font-size": "16px"
                        });
                        menu.value = mod_list.value;

                        mod_val_save.push([menu.value, mod_val.value]);

                        mod_list.replaceWith(menu);
                    });



                    let eng_name = cn_equip_to_en_equip[e.target.value];
                    if (["Gloves", "Boots", "Body_Armours", "Helmets", "Shields"].includes(eng_name)) {
                        eng_name = `${eng_name}_str`;
                    }
                    window.get("a", block_header)[0].href = `https://poedb.tw/tw/${eng_name}#ModifiersCalc`;


                    [
                        [e.target.value, mod_val_save],
                        [previous_id, undefined]
                    ].forEach(([key, val]) => {
                        save_setting(["auto_setting", "auto_alt", key], val);
                    });

                });
            }

            const block_action = window.new_node("div", {
                innerText: title == "default" ? "＋" : "Ｘ",
                style: {
                    "color": "#9146ff",
                    "cursor": "pointer",
                    "font-size": "40px"
                }
            });

            if (title == "default") {
                block_action.addEventListener("click", () => {
                    if (!list.includes(block_title.value)) {
                        window.add_msg("請選擇裝備類型");
                        return;
                    }

                    const get_other = window.get(`.item_type`).filter((e) => e != block_title);
                    if (get_other.map((e) => e.value).includes(block_title.value)) {
                        window.add_msg("請勿添加重複裝備類型");
                        return;
                    }

                    const block = create_mod_block(block_title.value);

                    const mod = create_mod_row(block_title.value, true);
                    block.appendChild(mod);

                    window.get("#setting_panel")[0].insertBefore(block, block_wrap);

                    save_setting(["auto_setting", "auto_alt", block_title.value], []);
                });
            }
            else {
                block_action.addEventListener("click", () => {
                    save_setting(["auto_setting", "auto_alt", block_title.value], undefined);
                    block_wrap.remove();
                });
            }

            let eng_name = cn_equip_to_en_equip[title];
            if (["Gloves", "Boots", "Body_Armours", "Helmets", "Shields"].includes(eng_name)) {
                eng_name = `${eng_name}_str`;
            }
            const block_link = window.new_node("a", {
                target: "_blank",
                href: `https://poedb.tw/tw/${eng_name}#ModifiersCalc`,
                innerText: "POEDB連結",
                style: {
                    "color": "white",
                    "margin": "12px"
                }
            });

            block_header.appendChild(block_title);
            block_header.appendChild(block_action);
            if (title != "default") block_header.appendChild(block_link);

            block_wrap.appendChild(block_header);
            return block_wrap;
        }

        function create_mod_row(equipment_type, is_default = false) {
            const mod_wrap = window.new_node("div", {
                style: {
                    display: "flex"
                }
            });

            const mods = Object.keys(all_mod_list[equipment_type] ?? {}).map((e) => e.slice(1));
            const menu = create_menu("mod_list", mods);
            Object.assign(menu.style, {
                "width": "50%",
                "margin": "10px 10px 10px 40px",
                "padding": "4px 7px",
                "font-size": "16px"
            });



            const value_input = window.new_node("input", {
                type: "number",
                style: {
                    "width": "70px",
                    "padding": "0px 0px 0px 14px",
                    "margin": "10px 0px",
                    "color": "white",
                    "background-color": "#1a1d24",
                    "font-size": "16px",
                    "border-radius": "20px"
                }
            });

            if (!is_default) {
                menu.addEventListener("change", () => {

                    const root_node = mod_wrap.parentNode;

                    const get_other = window.get(`.mod_list`, root_node).filter((e) => e != menu);
                    if (get_other.map((e) => e.value).includes(menu.value)) {
                        window.add_msg("請勿選擇重複詞綴");
                        menu.value = menu.last_value;
                        return;
                    }

                    const raw_data = window.ls.auto_setting.auto_alt[root_node.id];
                    const new_data = raw_data.filter((e) => e[0] != menu.last_value).concat([[menu.value, value_input.value]]);

                    menu.last_value = menu.value;

                    save_setting(["auto_setting", "auto_alt", root_node.id], new_data);

                });

                value_input.addEventListener("change", () => {

                    const raw_data = window.ls.auto_setting.auto_alt[mod_wrap.parentNode.id];
                    const new_data = raw_data.map(([k, v]) => [k, k == menu.value ? value_input.value : v])

                    save_setting(["auto_setting", "auto_alt", mod_wrap.parentNode.id], new_data);

                });
            }

            const mod_action = window.new_node("div", {
                innerText: is_default ? "＋" : "Ｘ",
                style: {
                    "padding": "8px 0px 0px 8px",
                    "color": "#9146ff",
                    "cursor": "pointer",
                    "font-size": "32px"
                }
            });

            if (is_default) {
                mod_action.addEventListener("click", () => {
                    const root_node = mod_wrap.parentNode;

                    if (!mods.includes(menu.value)) {
                        window.add_msg("請選擇詞綴");
                        return;
                    }

                    if (!value_input.value) {
                        window.add_msg("請填入最低要求數值");
                        return;
                    }
                    const get_other = window.get(`.mod_list`, root_node).filter((e) => e != menu);
                    if (get_other.map((e) => e.value).includes(menu.value)) {
                        window.add_msg("請勿添加重複詞綴");
                        return;
                    }


                    const mod = create_mod_row(root_node.id);
                    window.get("select", mod)[0].value = menu.value;
                    window.get("select", mod)[0].last_value = menu.value;

                    window.get("input", mod)[0].value = value_input.value;

                    root_node.insertBefore(mod, mod_wrap);

                    const raw_data = window.ls.auto_setting.auto_alt[root_node.id];
                    save_setting(["auto_setting", "auto_alt", root_node.id], raw_data.concat([[menu.value, value_input.value]]));
                });
            }
            else {
                mod_action.addEventListener("click", () => {
                    const root_node = mod_wrap.parentNode;
                    const raw_data = window.ls.auto_setting.auto_alt[root_node.id];
                    save_setting(["auto_setting", "auto_alt", root_node.id], raw_data.filter((e) => e[0] != menu.value));
                    mod_wrap.remove();
                });
            }

            mod_wrap.appendChild(menu);
            mod_wrap.appendChild(value_input);
            mod_wrap.appendChild(mod_action);

            return mod_wrap;
        }

        function create_common_row(data) {
            const { id, label, type, value } = data;

            const row_wrap = window.new_node("div", {
                id,
                style: {
                    "margin": "20px 0px",
                    "display": "flex"
                }
            });

            const row_label = window.new_node("label", {
                innerText: label,
                style: {
                    "margin": "0px 20px",
                    "color": "white"
                }
            });

            const row_input = window.new_node("input", {
                type,
                style: {
                    "width": "100px",
                    "padding": "0px 0px 0px 14px",
                    "color": "white",
                    "background-color": "#1a1d24",
                    "font-size": "16px",
                    "border-radius": "20px"
                }
            });
            const val_key = ({ checkbox: "checked", number: "value", text: "value" })[type];

            row_input[val_key] = value;
            row_input.addEventListener("change", () => {
                save_setting(["auto_setting", "general", id, "value"], row_input[val_key]);
            });

            row_wrap.appendChild(row_label);
            row_wrap.appendChild(row_input);

            return row_wrap;
        }

        function load_setting(panel = window.new_node("div")) {
            if (!window.ls.auto_setting) window.ls.auto_setting = {};
            [
                [
                    "auto_alt",
                    {},
                    (setting) => {
                        Object.keys(setting).forEach((equipment_type) => {
                            const block = create_mod_block(equipment_type);

                            setting[equipment_type].forEach((pair) => {
                                const mod = create_mod_row(equipment_type);

                                window.get("select", mod)[0].value = pair[0];
                                window.get("select", mod)[0].last_value = pair[0];

                                window.get("input", mod)[0].value = pair[1];

                                block.appendChild(mod);
                            });

                            const mod = create_mod_row(equipment_type, true);
                            block.appendChild(mod);

                            panel.appendChild(block);
                        });

                        const block = create_mod_block();
                        panel.appendChild(block);
                    }],
                [
                    "general",
                    {
                        max_delay: { label: "最大點擊延遲(ms)", type: "number", value: 487 },
                        min_delay: { label: "最小點擊延遲(ms)", type: "number", value: 63 },
                        auto_augment: { label: "自動使用增幅石(物品詞綴未滿時)", type: "checkbox", value: true },
                        auto_regel: { label: "自動使用富豪石(滿足設定條件時)", type: "checkbox", value: false },
                        use_chaos: { label: "自動使用混沌石(改造稀有裝備時)", type: "checkbox", value: false },
                        check_chance: { label: "使用機會石時檢查詞綴", type: "checkbox", value: true },
                        socket_red: { label: "幻色石需求顏色(紅)", type: "number", value: 0 },
                        socket_green: { label: "幻色石需求顏色(綠)", type: "number", value: 0 },
                        socket_blue: { label: "幻色石需求顏色(藍)", type: "number", value: 0 }
                    },
                    (setting) => {
                        Object.keys(setting).forEach((opt_id) => {
                            const opt_row = create_common_row({ id: opt_id, ...setting[opt_id] });
                            panel.appendChild(opt_row);
                        });
                    }]
            ].forEach(([key, default_val, callback]) => {
                if (!window.ls.auto_setting[key]) window.ls.auto_setting[key] = default_val;

                const default_key_list = Object.keys(default_val);
                const ls_key_list = Object.keys(window.ls.auto_setting[key]);

                if (typeof (default_val) === 'object') {
                    const ref = window.ls.auto_setting[key];
                    default_key_list.forEach((next_key) => {
                        if (ref[next_key]?.label != default_val[next_key].label) {
                            const original_val = ref[next_key]?.value;
                            ref[next_key] = default_val[next_key];

                            if (original_val) ref[next_key].value = original_val;
                        }
                    });
                }

                if (default_key_list.some((default_key, i) => default_key != ls_key_list[i])) {
                    window.ls.auto_setting[key] = Object.fromEntries(
                        Object.entries(window.ls.auto_setting[key]).sort((a, b) => {
                            [a, b] = [a[0], b[0]].map((ls_key) => default_key_list.findIndex((default_key) => ls_key == default_key));
                            return a - b;
                        })
                    );
                }

                callback(window.ls.auto_setting[key]);
            });

        }

        function save_setting(keys = [], val) {
            const last_key = keys.pop();
            let ref = window.ls;
            for (let k of keys) {
                ref = ref[k];
            }
            ref[last_key] = val;
        }
    }

    function init_auto_gui() {

        const gui_title = window.get(".ant-modal-confirm-title")[0];
        const checker = window.get("div.confirm-switch-container > button")[0];
        const btn_list = [];

        if (!checker || gui_title.inited) return;
        gui_title.inited = true;

        click_checker(false);

        const common_auto_btn = async (btn, stone_num = 0, done_checker = async () => { }, stone_action = async () => { }, initer = () => { }) => {

            btn.addEventListener("click", async (e) => {

                const get_checker = () => window.get("div.confirm-switch-container > button")[0];

                lock = false;
                socket_ready = false;
                no_alt = false;
                need_scouring = true;
                flag = 0;

                window.modify_checker("", {}, get_equip_temp(), stone_num);
                initer();

                get_checker().stop = "false";
                btn_disabled(true);

                let interval_lock = false;
                let id = setInterval(async () => {
                    if (interval_lock) return;
                    interval_lock = true;


                    if (!get_checker()) {
                        btn_disabled(false);
                        clearInterval(id);
                        return;
                    }

                    if (get_checker().stop == "true") {

                        click_checker(false);

                        if (await done_checker()) {
                            btn_disabled(false);
                            clearInterval(id);
                            return;
                        }

                    }
                    else if (!lock) await stone_action();

                    interval_lock = false;
                }, 487);

            });

            btn_list.push(btn);
        }



        const auto_alt = window.new_node("button", {
            "innerText": "洗詞綴",
            "style": common_btn_style
        });
        common_auto_btn(
            auto_alt,
            7,
            async () => {
                const equip_temp = get_equip_temp().data.equipment;
                if (get_setting_val("general", "auto_augment") && equip_temp.rarity == 2 && equip_temp.affixes.length < 2) {
                    await click_stone("增幅石", true);
                    return false;
                }
                else if (get_setting_val("general", "auto_regel") && equip_temp.rarity == 2 && !no_alt && !need_scouring) {
                    await click_stone("富豪石", true);
                    return true;
                }
                else return true;
            },
            async () => {

                const equip_temp = get_equip_temp().data.equipment;
                if (get_setting_val("general", "use_chaos") && equip_temp.rarity == 3) {
                    await click_stone("混沌石");
                }
                else {
                    await click_stone("改造石");
                }

                no_alt = false;

            }
        );


        const auto_color = window.new_node("button", {
            "innerText": "洗洞色",
            "style": common_btn_style
        });
        common_auto_btn(
            auto_color,
            2,
            async () => true,
            async () => {
                await click_stone("幻色石");
            }
        );



        const auto_link = window.new_node("button", {
            "innerText": "滿洞滿連",
            "style": common_btn_style
        });
        common_auto_btn(
            auto_link,
            1,
            async () => {
                if (!socket_ready) {
                    window.modify_checker("", {}, get_equip_temp(), 3);
                    socket_ready = true;
                    return false;
                }
                else return true;
            },
            async () => {
                if (!socket_ready) await click_stone("工匠石");
                else await click_stone("链接石");
            }
        );


        const auto_chance = window.new_node("button", {
            "innerText": "自動機會石",
            "style": common_btn_style
        });
        common_auto_btn(
            auto_chance,
            5,
            async () => {
                if (need_scouring) {
                    await click_stone("重铸石");
                    return false;
                }
                else return true;
            },
            async () => {
                await click_stone("机会石");
            }
        );

        restyle_gui_title(gui_title);

        btn_list.forEach((btn) => {
            gui_title.appendChild(btn);
        });


        function btn_disabled(disabled) {

            window.get("button", gui_title).forEach((btn) => {
                btn.disabled = disabled;
                Object.assign(btn.style, {
                    "background-color": disabled ? "#7b8794" : "#1f1f1f",
                    "cursor": disabled ? "not-allowed" : "pointer"
                });
            });
        }
    }

    function init_transfer_gui() {
        if (!window.location.pathname.match("market")) return;

        const gui_title = window.get(".ant-modal-confirm-title")[0];

        if (gui_title?.innerText != "上架" || gui_title?.inited) return;
        gui_title.inited = true;


        const char_list = create_menu("char_list", window.ls.character_list.map((char) => char.name));
        Object.assign(char_list.style, {
            "margin": "12px 0px"
        });

        const transfer_currency = window.new_node("button", {
            "innerText": "以上方角色通貨為價格上架",
            "style": common_btn_style
        });
        Object.assign(transfer_currency.style, {
            "margin": "12px 0px"
        });
        transfer_currency.addEventListener("click", () => {
            const char_id = window.ls.character_list.find((char) => char.name == char_list.value)?.id;
            if (!char_id) return;

            const price_payload = window.ls.currency[char_id];

            const price = {};
            Object.keys(stone_id_to_en).forEach((id) => {
                const quantity = price_payload[stone_id_to_en[id]];
                if (+quantity) {
                    price[id] = quantity;
                }
            });

            general_fetch("market/sell", "market", "POST", JSON.stringify({
                itemId: window.ls.equipment_temp.data.equipment.id,
                type: 2,
                price
            }));

            window.get("button[aria-label=Close]")[0].click();
        });

        restyle_gui_title(gui_title);

        gui_title.appendChild(char_list);
        gui_title.appendChild(transfer_currency);

    }

    function init_custom_tab() {
        const property_panel = window.get(".information .ant-tabs-tabpane-active").find((e) => e.id.match(/rc-tabs-[0-9]+-panel-3/));

        if (!property_panel) return;
        if (property_panel.inited) return;
        property_panel.inited = true;

        const property_list = property_panel.get(".properties")[0];

        const EPM = property_list.firstChild;

        const avg_battle_time = EPM.cloneNode(true);
        const battle_count = EPM.cloneNode(true);

        [
            // {
            //     node: avg_battle_time,
            //     id: "avg_battle_time",
            //     label: "平均戰鬥時間",
            //     update_value: (node) => {
            //         const [
            //             total_time,
            //             total_count
            //         ] = [
            //             "total_time",
            //             "total_count"
            //         ].map((key) => window.ls[key]?.[character_id] ?? 0);

            //         const avg_time = total_time / total_count;
            //         access_value(node).innerText = `${(avg_time ? avg_time : Infinity).toFixed(3)}秒/場`;
            //     },
            //     reset_value: (node) => {
            //         [
            //             "total_time",
            //             "total_count"
            //         ].forEach((key) => (window.ls[key] ?? {})[character_id] = 0);

            //         node.update_value();
            //     }
            // },
            {
                node: battle_count,
                id: "battle_count",
                label: "勝／敗(括號BOSS場)",
                update_value: (node) => {
                    const [
                        win,
                        lose,
                        boss_win,
                        boss_lose
                    ] = [
                        "win",
                        "lose",
                        "boss_win",
                        "boss_lose"
                    ].map((key) => window.ls[key]?.[character_id] ?? 0);

                    access_value(node).innerText = `${win + boss_win}(${boss_win})／${lose + boss_lose}(${boss_lose})`;
                },
                reset_value: (node) => {
                    [
                        "win",
                        "lose",
                        "boss_win",
                        "boss_lose"
                    ].forEach((key) => (window.ls[key] ?? {})[character_id] = 0);

                    node.update_value();
                }
            },
            // {
            //     node: battle_count,
            //     id: "battle_count",
            //     label: "總場次(括號BOSS場)",
            //     update_value: (node) => {
            //         const [
            //             win,
            //             lose,
            //             boss_win,
            //             boss_lose
            //         ] = [
            //             "win",
            //             "lose",
            //             "boss_win",
            //             "boss_lose"
            //         ].map((key) => window.ls[key]?.[character_id] ?? 0);

            //         access_value(node).innerText = `${win + lose}(${boss_win + boss_lose})`;
            //     },
            //     reset_value: (node) => {
            //         [
            //             "win",
            //             "lose",
            //             "boss_win",
            //             "boss_lose"
            //         ].forEach((key) => (window.ls[key] ?? {})[character_id] = 0);

            //         node.update_value();
            //     }
            // }
        ].forEach(({ node, id, label, update_value, reset_value }) => {
            node.id = id;
            node.update_value = () => update_value(node);

            access_label(node).innerText = label;
            node.update_value();
            window.get("button", node)[0].addEventListener("click", () => reset_value(node));

            property_list.insertBefore(node, EPM.nextSibling);
        });



        function access_label(node) {
            return node.firstChild.firstChild;
        }

        function access_value(node) {
            return node.lastChild;
        }
    }

    function run_path_script() {

        const path_list = {
            "/": () => {
                //restrict_style();
                update_battle_statistic();
            },
            "/battle": run_battle,
            "/shop": exchange_limit
        };

        path_list[window.location.pathname]?.();



        function restrict_style() {

            const gui = window.get(".ant-modal-confirm-info")[0];
            if (!gui) return;

            gui.style.width = window.outerWidth < 700 ? "80%" : "700px";

            gui.get(".container")[0].style.alignItems = "center";

            gui.get(".equipment")[0].style.height = "auto";

            gui.get(".actions")[0].style.gridTemplateColumns = "1fr 1fr 1fr 1fr";
        }

        function update_battle_statistic() {
            const property_panel = window.get(".information .ant-tabs-tabpane-active").find((e) => e.id.match(/rc-tabs-[0-9]+-panel-3/));

            if (!property_panel) return;
            [
                "avg_battle_time",
                "battle_count"
            ].forEach((id) => {
                const node = property_panel.get(`#${id}`)[0];
                if (!node) return;
                node.update_value();
            });
        }

        function run_battle() {
            [
                "total_time",
                "total_count",
                "win",
                "lose",
                "boss_win",
                "boss_lose"
            ].forEach((key) => {
                if (typeof (window.ls[key]) !== 'object' || !window.ls[key]) window.ls[key] = {};
                if (!window.ls[key][character_id]) window.ls[key][character_id] = 0;
            });

            window.get(".trophy").forEach((trophy) => {

                if (!trophy) return;
                if (trophy.inited) return;
                trophy.inited = true;

                let last_battle_action = trophy.parentNode.nextSibling;
                if (!last_battle_action) last_battle_action = trophy;

                for (let limit = 0; limit <= 100; limit++) {
                    if (!last_battle_action.innerText) {
                        last_battle_action = last_battle_action.nextSibling;
                    }
                    else {
                        break;
                    }
                }

                const key_prefix = window.get(".r-unique", last_battle_action)[0] ? "boss_" : "";
                const key_suffix = trophy.get(".win")[0] ? "win" : "lose";

                const time_span = trophy.get(".time")[0];

                const sec = parseFloat(time_span.innerHTML.match(/[0-9.]+/)[0]);
                window.ls.total_time[character_id] += sec;
                window.ls.total_count[character_id]++;

                window.ls[`${key_prefix}${key_suffix}`][character_id]++;

                if (key_prefix.match("boss")) {
                    const boss_data = window.get(".battle .r-unique")[0].parentNode.innerText.split("\n").join(" ");
                    const end_action = last_battle_action.innerText.split("\n").join(" ");
                    console.log(`$BOSS：${boss_data}，END_TURN：${end_action}`);
                }
            });
        }

        function exchange_limit() {
            if (!window.ls.shop_list) return;

            const currency_trade = () => window.ls.shop_list.filter((trade) => trade.type == 2);

            const shop_inputs = window.get(".ant-input-number-input");

            shop_inputs.forEach((input, i) => {

                if (input.inited) return;

                const input_checker = (target_input, i) => {
                    const character_currency = () => window.ls.currency?.[character_id];
                    if (!character_currency) return;

                    const [[cost_id, quantity]] = Object.entries(currency_trade()[i].price);

                    const buy_limit = character_currency()[stone_id_to_en[cost_id]] / quantity;

                    if (parseInt(target_input.value) > buy_limit) {
                        target_input.value = Math.floor(buy_limit);
                    }

                    const cost_display = window.get(".ant-tabs-tabpane")[1]?.get(".item-price .currency span:nth-child(2)")?.[i];
                    if (cost_display) cost_display.innerText = target_input.value * quantity;
                };

                const new_input = replace_node(input, (new_input) => {
                    new_input.addEventListener("input", () => input_checker(new_input, i));
                });

                Array.from(new_input.parentNode.previousSibling.children).forEach((span, i) => {
                    replace_node(span, (new_span) => {
                        new_span.addEventListener("click", () => {
                            if (i) new_input.value--;
                            else new_input.value++;
                            input_checker(new_input, i);
                        });

                        new_span.classList.remove("ant-input-number-handler-down-disabled");
                    });
                });

                const exchange_btn = new_input.parentNode.parentNode.nextSibling;
                replace_node(exchange_btn, (new_exchange_btn) => {
                    new_exchange_btn.addEventListener("click", () => {
                        open_confirm();
                    });
                });

                function open_confirm() {
                    const confirm_wrap = window.new_node("div", {
                        style: {
                            "height": "100vh",
                            "width": "100%",
                            "overflow": "auto",
                            "position": "absolute",
                            "background-color": "rgba(15, 19, 26, 0.8)",
                            "z-index": "999",
                            "left": "0px",
                            "top": "0px",
                            "display": "flex",
                            "align-items": "center",
                            "justify-content": "center"
                        }
                    });

                    const confirm_panel = window.new_node("div", {
                        id: "confirm_panel",
                        style: {
                            "top": "100px",
                            "position": "fixed",
                            "align-items": "center",
                            "display": "flex",
                            "flex-direction": "column",
                            "border-radius": "30px",
                            "height": "100px",
                            "width": "175px",
                            "overflow": "auto",
                            "background-color": "#33373d",
                            "z-index": "1000",
                        }
                    });

                    const btn = window.new_node("button", {
                        innerText: "確認兌換",
                        style: common_btn_style
                    });
                    btn.addEventListener("click", () => {
                        general_fetch("shop/buy", "shop", "POST", JSON.stringify({
                            itemId: currency_trade()[i].itemId.toString(),
                            quantity: parseInt(new_input.value)
                        }));
                        close_setting();

                        setTimeout(() => general_fetch("character/currency"), window.roll(187));
                    });


                    const close_confirm_btn = window.new_node("div", {
                        innerText: "❌",
                        style: {
                            "margin": "3% 0px 0px 75%",
                            "cursor": "pointer",
                            "font-size": "20px"
                        }
                    });

                    const close_setting = () => confirm_wrap.remove();


                    [close_confirm_btn, confirm_wrap].forEach((element) => {
                        element.addEventListener("click", (event) => {
                            if (event.target == element) close_setting();
                        });
                    });


                    confirm_panel.appendChild(close_confirm_btn);
                    confirm_panel.appendChild(btn);


                    confirm_wrap.appendChild(confirm_panel);
                    document.body.appendChild(confirm_wrap);

                }

                function replace_node(node, modify_node) {
                    const new_node = node.cloneNode(true);
                    new_node.inited = true;

                    modify_node(new_node);

                    node.parentNode.appendChild(new_node);
                    node.remove();

                    return new_node;
                }


            });


        }
    }



    function create_menu(className, list) {
        const menu = window.new_node("select", {
            className,
            style: {
                "padding": "9px 12px",
                "margin": "0px 20px",
                "color": "white",
                "background-color": "#1a1d24",
                "font-size": "20px",
                "border-radius": "20px"
            }
        });

        list.forEach((item) => {
            const opt = window.new_node("option", { innerText: item });
            menu.options.add(opt);
        });

        return menu;
    }

    function restyle_gui_title(gui_title) {

        Object.assign(gui_title.style, {
            "display": "flex",
            "flex-wrap": "wrap"
        });

        const desc = window.new_node("div", {
            innerText: gui_title.innerText,
            style: {
                "width": "100%"
            }
        });
        gui_title.innerText = "";
        gui_title.appendChild(desc);

    }
})();

function ls_proxy(obj, keys = []) {

    return new Proxy(obj, { get, set });

    function get(obj, p, is_proxy = true) {

        if (p === Symbol.iterator) {
            return obj[Symbol.iterator].bind(obj);
        }

        if (!p.toString()) return obj;

        let result = obj;
        for (let k of p.toString().split(',')) {
            if (k in result) result = result[k];
            else break;
        }
        if (result === obj) return undefined;

        try {
            if (typeof (result) === 'string') result = JSON.parse(result);
        }
        catch { }

        if (is_proxy && typeof (result) === 'object' && result != undefined) {
            result = ls_proxy(result, keys.concat(p));
        }

        return result;
    }

    function set(obj, p, val) {

        if (keys.length !== 0) {
            let original_key = keys[0];
            let pre_obj = get(localStorage, original_key, false);

            get(pre_obj, keys.slice(1), false)[p] = val;

            localStorage[original_key] = JSON.stringify(pre_obj);
        }

        obj[p] = JSON.stringify(val);

        return true;
    }

}

function get_setting_val(category, key) {
    const ref = window.ls.auto_setting;
    const result = ref[category][key];
    return category == "general" ? result.value : result;
}

function get_equip_temp() {
    return window.ls.equipment_temp ?? {};
}

function bitwise(a, b) {
    [a, b] = [a, b].map((n) => n.toString(2));
    const min_len = Math.min(a.length, b.length);
    [a, b] = [a, b].map((n) => n.slice(n.length - min_len, n.length));

    for (let i = 0; i < min_len; i++) {
        if (a[i] & b[i]) return true;
    }

    return false;
}

function general_fetch(api_path, refer = "", method = "GET", body = null) {
    return window.fetch(`https://poe.faith.wang/api/${api_path}`, {
        "headers": {
            "accept": "*/*",
            "accept-language": "zh-TW,zh;q=0.9,en-US;q=0.8,en;q=0.7,ja;q=0.6,zh-CN;q=0.5,hi;q=0.4",
            "authorization": `Bearer ${window.ls.token}`,
            "characterid": window.ls.character_id,
            "content-type": "application/json",
            "sec-ch-ua": "\"Chromium\";v=\"118\", \"Google Chrome\";v=\"118\", \"Not=A?Brand\";v=\"99\"",
            "sec-ch-ua-mobile": "?0",
            "sec-ch-ua-platform": "\"Windows\"",
            "sec-fetch-dest": "empty",
            "sec-fetch-mode": "cors",
            "sec-fetch-site": "same-origin",
            "Referer": `https://poe.faith.wang/${refer}`,
            "Referrer-Policy": "strict-origin-when-cross-origin"
        },
        body,
        method
    });
}

async function delay(ms, float = 187) {
    return await new Promise((resolve) => setTimeout(resolve, ms + window.roll(float)));
}

