// ==UserScript==
// @name Для Кураторов Форума | CHERRY (09) by Senka_Legenda ♡
// @namespace https://forum.blackrussia.online
// @version 1.2.3
// @description kye
// @author Senka_Legenda
// @match https://forum.blackrussia.online/threads/*
// @include https://forum.blackrussia.online/threads/
// @grant none
// @license MIT
// @collaborator !
// @icon https://icons.iconarchive.com/icons/papirus-team/papirus-apps/48/emerald-theme-manager-icon-icon.png
// @downloadURL https://update.greasyfork.org/scripts/480208/%D0%94%D0%BB%D1%8F%20%D0%9A%D1%83%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BE%D0%B2%20%D0%A4%D0%BE%D1%80%D1%83%D0%BC%D0%B0%20%7C%20CHERRY%20%2809%29%20by%20Senka_Legenda%20%E2%99%A1.user.js
// @updateURL https://update.greasyfork.org/scripts/480208/%D0%94%D0%BB%D1%8F%20%D0%9A%D1%83%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BE%D0%B2%20%D0%A4%D0%BE%D1%80%D1%83%D0%BC%D0%B0%20%7C%20CHERRY%20%2809%29%20by%20Senka_Legenda%20%E2%99%A1.meta.js
// ==/UserScript==
 
(function () {
'use strict';
const UNACCEPT_PREFIX = 4; // Prefix that will be set when thread closes
const ACCEPT_PREFIX = 8; // Prefix that will be set when thread accepted
const RESHENO_PREFIX = 6; // Prefix that will be set when solving the problem
const PIN_PREFIX = 2; // Prefix that will be set when thread pins
const GA_PREFIX = 12; // Prefix that will be set when thread send to ga
const COMMAND_PREFIX = 10; // Prefix that will be set when thread send to project team
const WATCHED_PREFIX = 9;
const CLOSE_PREFIX = 7;
const SA_PREFIX = 11;
const TEXU_PREFIX = 13;
const buttons = [
{
title: '♡ СВОЙ ОТВЕТ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"Твой текст <br><br>"+
 "Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/FONT][/CENTER][/B][/SIZE]",
},
{
title: '♡ На рассмотрение ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша жалоба взята [Color=rgb(255, 255, 0)]на Рассмотрение[/Color]. Просьба не создавать подобных тем, иначе ваш Форумный аккаунт может быть [Color=rgb(255, 0, 0)][U]заблокирован.[/U][/Color][/CENTER]<br><br>"+
'[CENTER]Ожидайте ответа от [Color=rgb(0, 255, 255)]Администрации...[/Color][/CENTER][/B][/SIZE]',
prefix: PIN_PREFIX,
status: true,
},
{
title: '♡ Тех.Спецу ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Ваша Жалоба будет передана [Color=rgb(255, 255, 0)]на Рассмотрение[/Color] [COLOR=rgb(0, 0, 255)]Техническому Специалисту[/COLOR] нашего сервера - @Arsen_Myxadov <br><br>"+
'[CENTER]Ожидайте ответа...[/CENTER][/B][/SIZE]',
prefix: TEXU_PREFIX,
status: true,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 ЖАЛОБЫ НА ИГРОКОВ 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '|-(--(--(->------- Причины ОТКАЗОВ -------<-)--)--)-|'
},
{
title: '♡ Нет условия Сделки ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]На ваших Доказательствах отсутствуют [Color=rgb(255, 255, 0)]Условия Сделки.[/color]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Нет - /time ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]На ваших Доказательствах отсутствует - [Color=rgb(255, 255, 0)]/time[/color]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Заголовок НЕ по форме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Заголовок вашей Жалобы составлен НЕ по Форме. Пожалуйста, ознакомьтесь с - [URL='https://forum.blackrussia.online/index.php?threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1-%D0%BD%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%BE%D0%B2.3429394/'][COLOR=rgb(255,0,0)]«Правилами подачи Жалоб на Игроков».[/color][/URL][/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ ЖБ НЕ по Форме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша Жалоба составлена НЕ по Форме. Пожалуйста, ознакомьтесь с - [URL='https://forum.blackrussia.online/index.php?threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1-%D0%BD%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%BE%D0%B2.3429394/'][COLOR=rgb(255,0,0)]«правилами подачи жалоб на игроков».[/color][/URL][/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Жалоба от 3-его лица ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Ваша Жалоба [Color=rgb(255, 0, 0)]НЕ[/color] подлежит [Color=rgb(255, 255, 0)]Рассмотрению,[/color] поскольку она Составлена от [Color=rgb(255, 0, 0)]3-го[/color] Лица. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Прошло 72 часа ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] С момента Нарушения со стороны Игрока, прошло более [Color=rgb(255, 0, 0)]72-х[/color] часов. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ TIME-CODE ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что она получает Статус - [Color=rgb(255, 0, 0)]Отказано.[/color] <br>"+
"[CENTER]Если Видео-Доказательство длится больше [Color=rgb(255, 0, 0)]3-ех минут[/color] - Вы должны указать [COLOR=rgb(255, 255, 0)]Тайм-Коды[/color] нарушений.<br><br>"+
"[CENTER][SPOILER=♡ Что такое Тайм-Коды?! ♡][COLOR=rgb(255, 255, 0)]Тайм-Код[/COLOR] — это время начала определённого эпизода видеоролика. С помощью Тайм-Кода зритель сможет быстро найти нужный момент видео или перемотать к искомой части ролика.[/SPOILER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ники НЕ совпадают ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Игровой ник Автора Жалобы, Ник игрока, на которого подается Жалоба, должны быть указаны в соответствии с [Color=rgb(255, 0, 0)]Правилами подачи Жалоб,[/color] даже если эта информация присутствует на Доказательствах или в тексте Жалобы. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Жалоба на 2+ Игроков ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что она получает Статус - [Color=rgb(255, 0, 0)]Отказано.[/color] <br>"+
"[CENTER]Запрещено писать Жалобу на двух и Более игроков. Если вы Нашли нарушение со Стороны нескольких игроков Одновременно, создайте отдельные Жалобы на каждого из них.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Док-ва Отредактированы ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Жалоба [Color=rgb(255, 0, 0)]НЕ[/color] подлежит [Color=rgb(255, 255, 0)]Рассмотрению,[/Color] поскольку Ваши доказательства Отредактированы.<br> · [Color=rgb(255, 0, 0)]Примечание:[/color] Доказательства должны быть в первоначальном виде. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ В ЖБ на сотрудников орг ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Если вы Заметили нарушение со стороны Сотрудника какой-либо Организации, подайте свою Жалобу в раздел - [Color=rgb(255, 0, 0)]Жалоб на Сотрудников[/color], нужной вам Организации. Откройте Раздел нашего Сервера, далее перейдите в <Гос.Орг> и выберите нужную вам Организацию.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ В ЖБ на Администрацию ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Вы Ошиблись разделом. Обратитесь в - [URL='https://forum.blackrussia.online/forums/Жалобы-на-администрацию.433/'][COLOR=rgb(0, 255, 255)]«Жалобы на Администрацию»[/COLOR][/URL][/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ В ЖБ на лидеров ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Вы ошиблись Разделом. Обратитесь в - [URL='https://forum.blackrussia.online/forums/Жалобы-на-лидеров.434/'][COLOR=rgb(0, 255, 255)]«Жалобы на Лидеров»[/COLOR][/URL][/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ В ОБЖ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Вы ошиблись Разделом. Обратитесь в - [URL='https://forum.blackrussia.online/forums/Обжалование-наказаний.436/'][COLOR=rgb(0, 255, 255)]«Обжалование Наказаний»[/COLOR][/URL][/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ошиблись Сервером ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Вы Ошиблись сервером. Данный Раздел -Жалоб на Игроков- принадлежит [COLOR=rgb(165, 42, 42)]CHERRY[/color] Серверу.<br>"+
"[CENTER]Подайте повторную Жалобу в нужный вам Раздел.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Нет нарушений ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Нарушений со стороны данного Игрока [U]не найдено.[/U]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Отсутствуют Док-ва ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что она получает Статус - [Color=rgb(255, 0, 0)]Отказано,[/color]<br>"+
"[CENTER]Отсутствуют Доказательства, - следовательно Рассмотрению [Color=rgb(255, 0, 0)]НЕ[/color] подлежит. Загрузите доказательства на Фото-Видео хостинги (YouTube, Imgur, Yapx, Яндекс Диск и т.д)<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Нужен Фрапс ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] В данном случае нужен - [Color=rgb(255, 255, 0)]Фрапс[/color]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Дублирование ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Дублирование темы. Если вы дальше будете заниматься данной Деятельностью (дублированием тем), то ваш Форумный Аккаунт будет [U][Color=rgb(255, 0, 0)]заблокирован[/color][/U] на 3 дня и более.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Док-ва из Соц-Сетей ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что она получает Статус - [Color=rgb(255, 0, 0)]Отказано.[/color] <br>"+
"[CENTER]Доказательства из Социальных Сетей (VK, TG и тд) - [Color=rgb(255, 0, 0)]НЕ принимаются.[/color] Загрузите их на Видео-Фото хостинги. (YouTube, Imgur, Yapix, Яндекс Диск и тд)<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Нужен фрапс+промотка чата ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] В Данном случае нужен Фрапс и Промотка Игрового чата.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Слив склада (ИНФО) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] В Данном случае нужен Фрапс, где будет видно, что именно ВЫ являетесь Лидером семьи; информация о том сколько можно брать патронов, логирование количества взятия патронов/материалов игрока и конечно же - [Color=rgb(255, 255, 0)]/time[/Color]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Слив склада (ЗАМ) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]На Данное нарушение, подавать Жалобу должен сам Лидер семьи.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ История Операций БАНК (ДОЛГ) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Подайте новую Жалобу, прикрепив в Добавок к данному Фрапсу, еще один, на котором будет Запечатлена - История Операций вашего Банк.Счета.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Долг через БАНК ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Согласно пункту [Color=rgb(255, 0, 0)]2.57[/color] в Регламенте общих правил Проекта, денежные средства в качестве Долга могут быть выданы только через - Банковский Счёт, и возвращены также на указанный в Условиях сделки - Банковский счёт.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Не полный фрапс/Обрывается ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] Ваш Фрапс имеет Прерывания. (Не полный/Обрывается). Рекомендую загрузить его на - [Color=rgb(255, 0, 0)]YouTube[/color]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Док-ва НЕ Работают ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Доказательства, которые вы Предоставили - НЕ Работают. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Недостаточно Док-в ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Доказательств на нарушение от Данного игрока - недостаточно.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Док-ва не Суммируются ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Доказательства [Color=rgb(255, 0, 0)]НЕ[/color] суммируются. В данном случае Требуется один [Color=rgb(255, 255, 0)]Единый Фрапс,[/color] на котором полностью будет зафиксировано Нарушение от начала и до Конца. Советую Загружать видео-доказательства на - [Color=rgb(255, 0, 0)]YouTube[/color]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Подлинность Док-в ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER] После проверки Системы Логирования, было принято Решение, что Ваши Доказательства [Color=rgb(255, 0, 0)]НЕ[/color] соответствуют Действительности. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Постороннее ПО на Док-вах ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша Жалоба [Color=rgb(255, 0, 0)]НЕ[/color] подлежит Рассмотрению, поскольку вы используете [U][Color=rgb(255, 0, 0)]НЕ[/color] Оригинальные файлы Игры[/U]. (Сборка/Постороннее ПО) <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Рассинхрон (НЕ ЧИТ) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Постороннего ПО - НЕ обнаружил. На данный момент, в игре присутствует такой Баг, как - [Color=rgb(255, 0, 0)]Рассинхрон,[/color] - то есть игровые данные и действия игроков на разных устройствах НЕ Синхронизированы. Если углубиться в Экран данного Игрока, то вы так-же, как и он, странно себя ведете. Баг известен и в ближайшее время будет Исправлен. <br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Не по Теме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Убедительная просьба, Ознакомиться с назначение данного раздела, в котором Вы создали данную Тему. Ваше Сообщение никоим образом [Color=rgb(255, 0, 0)]НЕ[/color] относится к данному Разделу.​<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Неадекватное Содержание ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша Жалоба [Color=rgb(255, 0, 0)]НЕ[/color] подлежит Рассмотрению, т.к в ней Присутствуют - Оскорбления/Оскорбительные Фразы (Смайлики).<br>"+
"[CENTER]Переподайте Жалобу, исправив свою Ошибку.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ На Другой Хостинг ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Пожалуйста, Загрузите свои доказательства о нарушении со стороны Игрока, на другой Фото-Видео Хостинг.<br>"+
"[CENTER](Imgur, YouTube, Yapix, Яндекс Диск и тд.)<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Откзаано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Нет доступа к док-вам (Гугл) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Доступ к вашим Доказательствам закрыт - <br> [url=https://postimages.org/][img]https://i.postimg.cc/BvxnD9yw/image.png[/img][/url][/CENTER]<br>"+
"[CENTER]Создайте новую жалобу и загрузите Доказательства на Фото-Видео Хостинги (YouTube, Япикс, imgur и тд).[/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Нет доступа к док-вам (Ютуб) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Доступ к Доказательствам закрыт - <br> [url=https://postimages.org/][img]https://i.postimg.cc/131G5gqy/image.png[/img][/url][/CENTER]<br>"+
"[CENTER]Создайте новую жалобу и загрузите Доказательства на Фото-Видео Хостинги (YouTube, Япикс, imgur итд).[/CENTER]<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Плохое Качество Док-в ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваши Доказательства в плохом Качестве. Загрузите их на [Color=rgb(255, 0, 0)]YouTube[/color] и подождите некоторое Время перед подачей Жалобы, дабы Видеоролик - обработался.<br><br>"+
"[CENTER][Color=rgb(255, 0, 0)]Отказано, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 Правила RolePlay процесса 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ NonRP Поведение ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.01.[/color] Запрещено поведение, нарушающее нормы процессов [Color=rgb(255, 255, 0)]RolePlay режима[/Color] Игры [Color=rgb(255, 0, 0)]| Jail 30 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Долг ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.57.[/Color] Запрещается брать в долг игровые ценности и не возвращать их. [Color=rgb(255, 0, 0)]| Ban 30 дней / Permban[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Помеха RP Процессу ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.04.[/Color] Запрещены любые действия способные привести к помехам в [Color=rgb(255, 255, 0)]Игровом Процессе,[/Color] а также выполнению работ, если они этого не предусматривают и если эти действия выходят за рамки Игрового Процесса данной работы. [Color=rgb(255, 0, 0)]| Ban 10 дней / Обнуление Аккаунта (при повторном нарушении)[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Уход от RP процесса ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.02.[/Color] Запрещено целенаправленно уходить от [Color=rgb(255, 255, 0)]RolePlay Процесса[/Color] всеразличными способами. [Color=rgb(255, 0, 0)]| Jail 30 минут / Warn[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP Drive ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.03.[/Color] Запрещен [Color=rgb(255, 0, 0)]NonRP Drive[/Color] — вождение любого транспортного средства в невозможных для него условиях, а также вождение в неправдоподобной манере. [Color=rgb(255, 0, 0)]| Jail 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP обман ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.05.[/Color] Запрещены любые [COLOR=rgb(0, 255, 255)]OOC Обманы и их Попытки,[/Color] а также любые [COLOR=rgb(0, 255, 255)]IC Обманы[/Color] с Нарушением RolePlay Правил и Логики [Color=rgb(255, 0, 0)]| PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ AFK no ESC ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.07.[/Color] Запрещено нахождение в AFK без включенного ESC, создавая помеху другим игрокам [Color=rgb(255, 0, 0)]| Kick[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Аморальные Действия ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [Color=rgb(255, 0, 0)]2.08.[/Color] Запрещена любая форма [U]Аморальных действий[/U] сексуального характера в сторону игроков [Color=rgb(255, 0, 0)]| Jail 30 минут / Warn[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Слив склада ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.09.[/Color] Запрещено сливать склад Фракции / Семьи путем взятия большого кол-ва ресурсов, или же брать больше, чем разрешили на самом деле [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Обман в /do ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.10.[/color] Запрещено в любой форме обманывать в /do, даже если это в Дальнейшем негативно скажется на Вашем игровом персонаже [COLOR=rgb(255, 0, 0)]| Jail 30 минут / Warn[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Фракц тс в л/ц ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.11.[/Color] Запрещено использование рабочего или Фракционного транспорта в Личных целях [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Помеха Блогерам ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.12.[/Color] Запрещена помеха в работе блогеров, стримеров (медиа лиц), которые находятся на официальном сотрудничестве с проектом [COLOR=rgb(255, 0, 0)]| Ban 7 дней[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ DB ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(0, 255, 0)]2.13.[/color] Запрещен [Color=rgb(255, 0, 0)]DB (DriveBy)[/Color] — намеренное убийство / нанесение урона без веской IC причины на любом виде транспорта [COLOR=rgb(0, 255, 0)]| Jail 60 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ TK ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.15.[/Color] Запрещен [Color=rgb(255, 0, 0)]TK (Team Kill)[/Color] — убийство члена своей или союзной фракции, организации без наличия какой-либо IC причины [COLOR=rgb(0, 255, 0)]| Jail 60 минут / Warn[/Color] (за два и более убийства)<br><br>"+
"[CENTER][COLOR=rgb(255, 0, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ SK ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.16.[/Color] Запрещен [Color=rgb(255, 0, 0)]SK (Spawn Kill)[/Color] — убийство или нанесение урона на титульной территории любой фракции / организации, на месте появления игрока, а также на выходе из закрытых интерьеров и около них [COLOR=rgb(255, 0, 0)]| Jail 60 минут / Warn (за два и более убийства)[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ MG ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.18.[/Color] Запрещен [Color=rgb(255, 0, 0)]MG (MetaGaming)[/Color] — использование ООС информации, которую Ваш персонаж никак не мог получить в IC процессе [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ DM ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.19.[/Color] Запрещен [Color=rgb(255, 0, 0)]DM (DeathMatch)[/Color] — убийство или нанесение урона без веской IC причины [COLOR=rgb(255, 0, 0)]| Jail 60 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP Акс ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.52.[/Color] Запрещено располагать Аксессуары на теле персонажа, нарушая нормы морали и этики, увеличивать Аксессуары до слишком большого размера. [COLOR=rgb(255, 0, 0)]| При первом нарушении - обнуление аксессуаров, при повторном нарушении - обнуление аксессуаров + JAIL 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Mass DM ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.20.[/Color] Запрещен [Color=rgb(255, 0, 0)]Mass DM (Mass DeathMatch)[/Color] — убийство или нанесение урона без веской IC причины трем игрокам и более [COLOR=rgb(255, 0, 0)]| Warn / Ban 3 - 7 дней[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Обход системы ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.21.[/Color] Запрещено пытаться обходить Игровую Систему или использовать любые Баги сервера [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Постороннее ПО ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.22.[/Color] Запрещено хранить / использовать / распространять Стороннее Программное Обеспечение или любые другие средства, позволяющие получить преимущество над другими Игроками [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Сокрытие багов от администрации ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.23.[/Color] Запрещено скрывать от администрации ошибки Игровых Систем, а также распространять их Игрокам [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Сокрытие нарушителей ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.24.[/Color] Запрещено скрывать от Администрации нарушителей или Злоумышленников [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan + ЧС проекта[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Репутация проекта ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.25.[/Color] Запрещены попытки или действия, которые могут навредить Репутации Проекта [COLOR=rgb(255, 0, 0)]| PermBan + ЧС проекта[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Вред ресурсам ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.26.[/Color] Запрещено намеренно наносить вред Ресурсам Проекта (игровые серверы, форум, официальные Discord-серверы и тд) [COLOR=rgb(255, 0, 0)]| PermBan + ЧС проекта[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Распространение информации ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.27.[/Color] Запрещено распространение информации и материалов, которые имеют непосредственное отношение к работе администрации проекта [COLOR=rgb(255, 0, 0)]| PermBan + ЧС проекта[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Покупка/Продажа ИВ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.28.[/Color] Запрещена покупка/продажа Внутриигровой Валюты в любых ее проявлениях за [U]реальные Деньги[/U] [COLOR=rgb(255, 0, 0)]| PermBan с обнулением Аккаунта + ЧС проекта[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ущерб Экономике ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.30.[/Color] Запрещено пытаться нанести Ущерб Экономике сервера [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Реклама Сайтов/Серверов/ДС ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.31.[/Color] Запрещено рекламировать на серверах любые Проекты, Серверы, Сайты, Сторонние Discord-серверы, YouTube каналы и тому подобное [COLOR=rgb(255, 0, 0)]| Ban 7 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ввод в Забл/Обман АДМ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.32.[/color] Запрещено введение в Заблуждение, Обман Администрации на всех ресурсах проекта [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 дней[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ввод в заблуждение (ИГРОКИ) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.11.[/color] Запрещено введение Игроков проекта в Заблуждение путем злоупотребления Командами [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Уязвимость правил ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.33.[/Color] Запрещено пользоваться уязвимостью правил [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ IC и OOC конфликты Нац/Религ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.35.[/Color] На игровых серверах запрещено устраивать IC и OOC конфликты на почве разногласия о национальности и / или религии совершенно в любом Формате [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 7 дней[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ OOC угрозы ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.37.[/Color] Запрещены OOC-угрозы, в том числе и завуалированные, а также угрозы наказанием со стороны Администрации [COLOR=rgb(255, 0, 0)]|  Mute 120 минут / Ban 7 - 15 дней[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Распространение лич.информации ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.38.[/Color] Запрещено распространять личную информацию игроков и их родственников [COLOR=rgb(255, 0, 0)]|  Ban 15 - 30 дней / PermBan + ЧС проекта[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Злоуп.Нарушениями ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.39.[/color] Злоупотребление нарушениями правил сервера [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 дней[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Продажа имущества за Реальные деньги ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.42.[/color] Попытка продажи любого игрового имущества или игрового аккаунта за реальные деньги [COLOR=rgb(255, 0, 0)]| PermBan[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Обмен/Продажа Пром/Бонус-кода ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.43.[/color] Запрещена продажа / обмен / покупка поощрительной составляющей от лица проекта, будь то бонус-код, либо промокод, который выдается безвозмездно игрокам в целях промоакций [COLOR=rgb(255, 0, 0)]| Mute 120 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ ЕПП на любом виде транспорта ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.46.[/Color] Запрещено ездить по Полям на любом Транспорте [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ ЕПП инко / фура ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.47.[/Color] Запрещено ездить по Полям на Грузовом Транспорте, Инкассаторских машинах (работа дальнобойщика, инкассатора) [COLOR=rgb(255, 0, 0)]| Jail 60 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Покупка репутации/Сокрытие нарушителей (СЕМЬЯ)  ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.48.[/Color] Запрещена продажа, передача, трансфер или покупка репутации семьи любыми способами, скрытие нарушителей, читеров лидером семьи. [COLOR=rgb(255, 0, 0)]| Обнуление рейтинга семьи / Обнуление игрового аккаунта лидера семьи[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Аресты в Инте ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.50.[/Color] Запрещены Задержания, Аресты, а также любые действия со стороны Игроков, состоящих во Фракциях в интерьере Аукциона, Казино, а также во время Системных Мероприятий [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 дней + Увольнение из Организации[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Багоюз Анимаций ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.55.[/color] Запрещается багоюз Связанный с анимацией в любых проявлениях. [COLOR=rgb(255, 0, 0)]| Jail 60 / 120 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪  ИГРОВЫЕ ЧАТЫ  𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ CAPSLOCK ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.02.[/Color] Запрещено использование верхнего регистра (CapsLock) при написании любого текста в любом Чате [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Оск в ООС (Любой) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.03.[/color] Любые формы Оскорблений, издевательств, расизма, дискриминации, религиозной враждебности, сексизма в OOC чате [U]Запрещены[/U] [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Упом/Оск родни ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.04.[/color] Запрещено Оскорбление или косвенное Упоминание родных вне зависимости от чата (IC или OOC) [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 7 - 15 дней[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Флуд ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.05.[/color] Запрещен флуд — 3 и более повторяющихся сообщений от одного и того же Игрока [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Злоуп.знаков ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.06.[/Color] Запрещено Злоупотребление знаков препинания и прочих символов [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Слив ГЧ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.08.[/color] Запрещены любые формы «СЛИВА» посредством использования Глобальных Чатов [COLOR=rgb(255, 0, 0)]| PermBan[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Оск/Неув К адм ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.54.[/Color] Запрещено Неуважительное обращение, оскорбление, неадекватное поведение, угрозы в любом их проявлении по отношению к Администрации [COLOR=rgb(255, 0, 0)]| Mute 180 минут[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Оск Проекта ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]2.40.[/Color] Запрещены совершенно любые деструктивные действия по отношению к Проекту: неконструктивная критика, призывы покинуть проект, попытки нарушить развитие проекта или любые другие действия, способные привести к помехам в Игровом Процессе [COLOR=rgb(255, 0, 0)]| Mute 300 минут / Ban 30 дней (Ban выдается по согласованию с главным администратором)[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Мат в VIP ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.23.[/Color] Запрещено использование нецензурных слов, в том числе завуалированных и литературных в VIP чате [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Выдача за Адм ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.10.[/Color] Запрещена выдача себя за Администратора, если таковым НЕ являетесь [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 + ЧС администрации[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ввод в Заблуждение (КОМАНДЫ) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.11.[/Color] Запрещено введение игроков проекта в заблуждение путем Злоупотребления Командами [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Любое нарушение в РЕПОРТ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.12.[/Color] Запрещено подавать репорт написанный транслитом, с сообщением не по теме (Offtop), с включенным Caps Lock и повторять обращение (если ответ был уже дан ранее) [COLOR=rgb(255, 0, 0)]| Report Mute 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Музыка в войс ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.14.[/color] Запрещено включать Музыку в Voice Chat [COLOR=rgb(255, 0, 0)]| Mute 60 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Шумы в войс ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.16.[/color] Запрещено создавать посторонние Шумы или Звуки [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Политика/Призыв к Флуду ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.18.[/Color] Запрещено политическое и религиозное пропагандирование, а также провокация Игроков к конфликтам, коллективному Флуду или беспорядкам в любом из Чатов [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 10 дней[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Мод для Voice ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.19.[/Color] Запрещено использование любого софта для изменения Голоса [COLOR=rgb(255, 0, 0)]| Mute 60 минут[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Транслит ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.20.[/color] Запрещено использование Транслита в любом из Чатов [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Реклама промо ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.21.[/Color] Запрещается реклама Промокодов в игре, а также их упоминание в любом виде во всех Чатах [COLOR=rgb(255, 0, 0)]| Ban 30 дней[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Торговля в помещении ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]3.22.[/Color] Запрещено публиковать любые объявления в помещениях государственных организаций вне зависимости от Чата (IC или OOC) [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ НИК (Мат)♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]4.09.[/Color] Запрещено использовать Никнейм, содержащий в себе матерные слова или оскорбления (в том числе, завуалированные) [COLOR=rgb(255, 0, 0)]| Устное замечание + смена игрового никнейма / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ НИК (Fake)♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]4.10.[/Color] Запрещено создавать Никнейм, повторяющий или похожий на существующие никнеймы Игроков или Администраторов по их написанию [COLOR=rgb(255, 0, 0)]| Устное замечание + смена игрового никнейма / PermBan[/Color]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 ГОССНИКИ 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ Работа в Госс.Форме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]1.07.[/Color] Всем сотрудникам Государственных организаций запрещено выполнять Работы где-либо в форме, принадлежащей своей Фракции [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Госс.Форма в Казино/БУ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]1.13.[/COLOR] Запрещено находиться в Форме внутри казино, участвовать в битве за контейнеры, участвовать в захвате семейного контейнера, находится на Б/У рынке с целью покупки / продажи авто, а также устраиваться на сторонние Работы в форме Фракции [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/COLOR] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP /edit ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]4.01.[/Color] Запрещено редактирование Объявлений, не соответствующих ПРО (Правилам Редактирования Объявлений) [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP Эфир ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]4.02.[/Color] Запрещено проведение Эфиров, не соответствующих RolePlay правилам и Логике [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Редакция в Л/Ц ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]4.04.[/Color] Запрещено редактировать поданные объявления в Личных Целях, заменяя текст объявления на НЕсоответствующий отправленному Игроком [COLOR=rgb(255, 0, 0)]| Ban 7 дней + ЧС организации[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Розыск без РП ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]6.02.[/Color] Запрещено выдавать розыск без RolePlay Причины [COLOR=rgb(255, 0, 0)]| Warn[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP Поведение ГОСС ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]6.03.[/color] Запрещено nRP поведение [COLOR=rgb(255, 0, 0)]| Warn[/color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ NonRP Штраф ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]7.02.[/color] Запрещено выдавать розыск, штраф без RolePlay Причины [COLOR=rgb(255, 0, 0)]| Warn[/color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Вод.Права NRP (Во время ПОГОНИ) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]7.04.[/Color] Запрещено отбирать водительские права во время погони за нарушителем [COLOR=rgb(255, 0, 0)]| Warn[/Color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 ОПГШНИКИ 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ NonRP ВЧ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет - За нарушение Правил нападения на Воинсковую Часть (ВЧ) [COLOR=rgb(255, 0, 0)]| Jail 30 минут (NonRP нападение) / Warn (Для сотрудников ОПГ)[/color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Похищение в ЗЗ ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]1.01.[/color] Запрещено проводить похищения/ограбления в Зеленых Зонах или многолюдных Местах [COLOR=rgb(255, 0, 0)]| Warn[/color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ В 2 раза Больше ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу Жалобу, было принято Решение, что Нарушитель будет наказан по Данному пункту Правил: [COLOR=rgb(255, 0, 0)]1.03.[/color] Количество грабителей/похитителей должно быть в [U]два раза больше[/U], чем жертв [COLOR=rgb(255, 0, 0)]| Warn[/color] <br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 ROLEPLAY Биографии 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ Одобрено ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает статус - [COLOR=rgb(0, 255, 0)]Одобрено.[/COLOR]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/color]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: ACCEPT_PREFIX,
status: false,
},
{
title: '♡ Ошибки (Шаблон) ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]В Вашей [COLOR=rgb(255, 255, 0)]RolePlay Биографии[/Color] присутствует несколько Ошибок, а Именно:<br><br>"+
"[CENTER][COLOR=rgb(0, 0, 0)]1.[/Color]<br>"+
"[CENTER][COLOR=rgb(0, 0, 0)]2.[/Color]<br>"+
"[CENTER][COLOR=rgb(0, 0, 0)]3.[/Color] В Вашей RolePlay Биографии присутствует множество Грамматических ошибок. Исправьте их, а так-же не забывайте про Знаки препинания. (Запятые, Точки, Двоеточия и тд)<br><br>"+
"[CENTER]На исправление выше Сказанного, вам дается - [U][COLOR=rgb(255,0,0)]24ч[/COLOR][/U].<br><br>"+
'[CENTER][COLOR=rgb(255, 255, 0)]На Рассмотрении...[/COLOR][/CENTER][/B][/FONT][/SIZE]',
},
{
title: '♡ 3-лицо ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает статус - [COLOR=rgb(255,0,0)]Отказано.[/COLOR]<br><br>"+
"[CENTER]Причиной послужил Следующий пункт Правил: [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] должна быть написана от Первого Лица персонажа.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ 2-ая Био для Аккаунта ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает статус - [COLOR=rgb(255,0,0)]Отказано.[/COLOR]<br><br>"+
"[CENTER]Причиной послужил Следующий пункт Правил: Запрещено создавать более чем одной Биографии для одного Игрового Аккаунта.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Мало Информации ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Рассмотрев вашу [COLOR=rgb(255, 255, 0)]RolePlay Биографию[/COLOR], было приятно решение, что она получает Статус - [COLOR=rgb(255, 0, 0)]Отказано[/COLOR].<br>"+
"[CENTER]Причиной послужило Малое кол-во [U]Информации[/U].<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Что-же такое RolePlay Биография?[/COLOR] Прежде чем дать ответ на данный вопрос, давайте обратимся к определению:<br>"+
"[CENTER]Биография - это описание жизни человека, сделанное другими людьми или им самим (АвтоБиография). <br><br>"+
"[CENTER]А теперь давайте ответим на вопрос, что-же такое [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR].<br>"+
"[CENTER][COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] - это автобиография персонажа, которую составляет игрок, который им управляет. Важно запомнить, что недопустимо в RP-Биографии выбирать себе роль мульт-героев, наделять своего персонажа сверхъестественными способностями. Основная задача при создании RP - Сама RolePlay биография и её содержание и замысел зависит только от Вас, и от того, какую роль Вы играете на сервере, но увы, вы этим не воспользовались.<br>"+
"[CENTER][U][COLOR=rgb(255, 0, 0)]Рекомендую[/COLOR][/U] задуматься над созданием новой историей вашего игрового персонажа.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Копипаст ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает Статус - [COLOR=rgb(255, 0, 0)]Отказано.[/COLOR]<br>"+
"[CENTER]Причиной послужил Копипаст - Скопирована/Украдена.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Уже на Рассмотрении ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]У вас уже есть [COLOR=rgb(255, 255, 0)]Биография[/COLOR], которая находиться на [COLOR=rgb(0, 255, 0)]Рассмотрении.[/color] <br>"+
"[CENTER]Работайте там. Исправить ошибки можно, нажав на Кнопку «Изменить» под самой Биографией.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Супер способности ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает Статус - [COLOR=rgb(255, 0, 0)]Отказано.[/COLOR]<br>"+
"[CENTER]Причиной послужил Следующий пункт Правил: Запрещено приписывание своему Персонажу Супер-Способностей.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Не по форме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает Статус - [COLOR=rgb(255, 0, 0)]Отказано,[/COLOR]<br>"+
"[CENTER]Т.к она составлена НЕ по Форме. Рекомендую ознакомиться с - [URL='https://forum.blackrussia.online/threads/Правила-создания-roleplay-биографии.8598625/'][COLOR=rgb(0, 255, 255)]«Правила создания RolePlay Биографии»[/color][/URL][/CENTER]<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ 18 лет ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Биография[/COLOR] получает Статус - [COLOR=rgb(255, 0, 0)]Отказано.[/COLOR]<br>"+
"[CENTER]Причиной послужил Следующий пункт Правил: Минимальный возраст для составления Биографии: 18 лет.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Не исправили ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Я вынужден [COLOR=rgb(255,0,0)]Отказать[/COLOR] вашу [COLOR=rgb(255, 255, 0)]RolePlay Биографию[/COLOR], поскольку вы ее НЕ дополнили.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 ROLEPLAY Ситуации 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ Одобрено ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Ситуация[/COLOR] получает Статус - [COLOR=rgb(0, 255, 0)][ICODE]Одобрено[/ICODE][/COLOR]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Не по Форме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Я вынужден [COLOR=rgb(255, 0, 0)]Отказать[/COLOR] вашу [COLOR=rgb(255, 255, 0)]RolePlay Ситуацию[/COLOR], поскольку она составлена НЕ по Форме.<br>"+
"[CENTER]Рекомендую ознакомиться с - [URL='https://forum.blackrussia.online/threads/Общие-правила-roleplay-ситуаций.8598612/'][COLOR=rgb(255,0,0)]«Правилами создания RP Ситуации».[/color][/URL][/CENTER]<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Небрежное Оформление ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]RolePlay Ситуация[/COLOR] получает Статус - [COLOR=rgb(255, 0, 0)][ICODE]Отказано[/ICODE][/COLOR]<br>"+
"[CENTER]Причиной послужило - Небрежное или неправильное Оформление. (Грамматические/Пунктуационные ошибки и тд). [U]Рекомендую[/u] ознакомиться с - [URL='https://forum.blackrussia.online/threads/Общие-правила-roleplay-ситуаций.8598612/'][COLOR=rgb(255,0,0)]«Правилами создания RP Ситуации».[/color][/URL][/CENTER]<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 Неофициальные RP Организации 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪 𓆩♡𓆪'
},
{
title: '♡ Одобрено ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]Неофициальная RolePlay Организация[/Color] получает Статус - [COLOR=rgb(0, 255, 0)][ICODE]Одобрено[/ICODE][/COLOR]<br><br>"+
"[CENTER][COLOR=rgb(0, 255, 0)]Одобрено, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Мало Информации ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]Неофициальная RolePlay Организация[/COLOR] получает Статус - [COLOR=rgb(255, 0, 0)][ICODE]Отказано[/ICODE][/COLOR]<br>"+
"[CENTER]Причиной послужило Малое количество Информации, а также - Оформление темы должно быть опрятным, история появления организации, её дальнейшие занятия должны быть [U]полностью[/U] расписаны. [COLOR=rgb(0, 255, 255)](Полная История)[/color]<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ НЕ по Форме ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Я вынужден [COLOR=rgb(255,0,0)]Отказать[/COLOR] вашу [COLOR=rgb(255, 255, 0)]Неофициальную RolePlay Организацию[/COLOR], поскольку она составлена НЕ по Форме.<br>"+
"[CENTER]Рекомендую ознакомиться с - [URL='https://forum.blackrussia.online/threads/Правила-создания-Неофициальной-rp-Организации-cherry.8627417/'][COLOR=rgb(255,0,0)]«Правилами создания Неофициальной RP Организации».[/color][/URL][/CENTER]<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ На Доработку ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]Неофициальная RolePlay Организация[/COLOR] взята на Доработку.<br>"+
"[CENTER]У Вас есть [COLOR=rgb(255,0,0)][U]24ч[/U][/COLOR] на ее Дополнение/Исправление.<br><br>"+
"[CENTER][COLOR=rgb(255, 255, 0)]На Рассмотрении...[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: PIN_PREFIX,
status: true,
},
{
title: '♡ НЕ доработали ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]К сожалению, Время на Доработку закончилось. Вы Дополнили свою [COLOR=rgb(255, 255, 0)]Неофициальную RP Организацию[/Color] - НЕудовлетворительно.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Отказано, Закрыто.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: UNACCEPT_PREFIX,
status: false,
},
{
title: '♡ Запрос Активности ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Ваша [COLOR=rgb(255, 255, 0)]Неофициальная RolePlay организация[/Color] может быть [COLOR=rgb(255,0,0)][U]закрыта[/U][/Color] по пункту правил: Неактив в топике организации более недели, она закрывается. Прикрепите фото-видео Отчёт о активности вашей организации. У вас есть [COLOR=rgb(255,0,0)][U]24ч[/u][/Color] на предоставление Отчета. Если его НЕ будет или он будет НЕкорректный - Организация будет [COLOR=rgb(255,0,0)]закрыта.[/Color]<br><br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
},
{
title: '♡ Предоставили Активность ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Активность была предоставлена.<br>"+
"[CENTER]Продолжайте в том же Духе и не забывайте про Еженедельный отчет.<br><br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
},
{
title: '♡ Нет Актива - закрыть ♡',
content:
'[SIZE=4][FONT=Times New Roman][CENTER][Color=rgb(255, 0, 255)][B]{{ greeting }},[/Color] уважаемый {{ user.mention }}!<br><br>'+
"[CENTER]Я вынужден Закрыть вашу [COLOR=rgb(255, 255, 0)]Неофициальную RolePlay Организацию,[/Color] поскольку Активность [COLOR=rgb(255,0,0)]НЕ[/COLOR] была предоставлена.<br><br>"+
"[CENTER][COLOR=rgb(255,0,0)]Организация - Закрыта.[/COLOR]<br>"+
'[CENTER]Приятной игры и Времяпровождения на сервере [COLOR=rgb(144,0,32)]CHERRY[/COLOR].[/CENTER][/B][/SIZE]',
prefix: CLOSE_PREFIX,
status: false,
},
]
 
 
$(document).ready(() => {
// Загрузка скрипта для обработки шаблонов
$('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');
 
// Добавление кнопок при загрузке страницы
 
 
addButton('⚡️ На Рассмотрение ⚡️', 'pin');
addButton('👻 Одобрено 👻', 'accepted');
addButton('🐵 Отказано 🐵', 'unaccept');
addButton('😸 Закрыто 😸', 'Zakrito');
addButton('😍 Ответы 😍', 'selectAnswer');

// Поиск информации о теме
const threadData = getThreadData();
 
$('button#pin').click(() => editThreadData(PIN_PREFIX, true));
$('button#accepted').click(() => editThreadData(ACCEPT_PREFIX, false));
$('button#teamProject').click(() => editThreadData(COMMAND_PREFIX, true));
$('button#unaccept').click(() => editThreadData(UNACCEPT_PREFIX, false));
$('button#Zakrito').click(() => editThreadData(CLOSE_PREFIX, false));
$('button#Ga').click(() => editThreadData(GA_PREFIX, true));
$(`button#selectAnswer`).click(() => {
XF.alert(buttonsMarkup(buttons), null, 'Выберите ответ:');
buttons.forEach((btn, id) => {
if(id > 0) {
$(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
} else {
$(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
}
});
});
});
 
function addButton(name, id) {
$('.button--icon--reply').before(
`<button type="button" class="button rippleButton" id="${id}" style="margin: 3px;">${name}</button>`,
);
}
 
function buttonsMarkup(buttons) {
return `<div class="select_answer">${buttons
.map(
(btn, i) =>
`<button id="answers-${i}" class="button--primary button ` +
`rippleButton" style="margin:5px"><span class="button-text">${btn.title}</span></button>`,
)
.join('')}</div>`;
}
 
function pasteContent(id, data = {}, send = false) {
const template = Handlebars.compile(buttons[id].content);
if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();
 
$('span.fr-placeholder').empty();
$('div.fr-element.fr-view p').append(template(data));
$('a.overlay-titleCloser').trigger('click');
 
if(send == true){
editThreadData(buttons[id].prefix, buttons[id].status);
$('.button--icon.button--icon--reply.rippleButton').trigger('click');
}
}
 
function getThreadData() {
const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
const authorName = $('a.username').html();
const hours = new Date().getHours();
return {
user: {
id: authorID,
name: authorName,
mention: `[USER=${authorID}]${authorName}[/USER]`,
},
greeting: () =>
12 < hours && hours <= 18
? 'Доброго времени Суток'
: 18 < hours && hours <= 21
? 'Доброго времени Суток'
: 21 < hours && hours <= 4
? 'Доброго времени Суток'
: 'Доброго времени Суток',
};
}
 
function editThreadData(prefix, pin = false) {
// Получаем заголовок темы, так как он необходим при запросе
const threadTitle = $('.p-title-value')[0].lastChild.textContent;
 
if(pin == false){
fetch(`${document.URL}edit`, {
method: 'POST',
body: getFormData({
prefix_id: prefix,
title: threadTitle,
_xfToken: XF.config.csrf,
_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
_xfWithData: 1,
_xfResponseType: 'json',
}),
}).then(() => location.reload());
}
if(pin == true){
fetch(`${document.URL}edit`, {
method: 'POST',
body: getFormData({
prefix_id: prefix,
title: threadTitle,
sticky: 1,
_xfToken: XF.config.csrf,
}),
}).then(() => location.reload());
}
if(pin == true){
fetch(`${document.URL}edit`, {
method: 'POST',
body: getFormData({
prefix_id: prefix,
title: threadTitle,
sticky: 1,
_xfToken: XF.config.csrf,
_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
_xfWithData: 1,
_xfResponseType: 'json',
}),
}).then(() => location.reload());
}
}
 
function getFormData(data) {
const formData = new FormData();
Object.entries(data).forEach(i => formData.append(i[0], i[1]));
return formData;
}
})();