// ==UserScript==
// @name Для руководства тех. специалистов (1-5 сервер)
// @namespace https://forum.blackrussia.online
// @version 3.5/last version
// @description No Name
// @author Lawrence Kalashnikov
// @match https://forum.blackrussia.online/*/*
// @include https://forum.blackrussia.online/*/*
// @grant none
// @license MIT
// @collaborator
// @icon https://cdn.jsdelivr.net/joypixels/assets/7.0/png/unicode/64/1f47d.png
// @downloadURL https://update.greasyfork.org/scripts/482136/%D0%94%D0%BB%D1%8F%20%D1%80%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%B0%20%D1%82%D0%B5%D1%85%20%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82%D0%BE%D0%B2%20%281-5%20%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%29.user.js
// @updateURL https://update.greasyfork.org/scripts/482136/%D0%94%D0%BB%D1%8F%20%D1%80%D1%83%D0%BA%D0%BE%D0%B2%D0%BE%D0%B4%D1%81%D1%82%D0%B2%D0%B0%20%D1%82%D0%B5%D1%85%20%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D1%81%D1%82%D0%BE%D0%B2%20%281-5%20%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%29.meta.js
// ==/UserScript==
 
(function () {
  'use strict';
  const UNACCEPT_PREFIX = 4; // префикс отказано
  const PIN_PREFIX = 2; //  префикс закрепить
  const COMMAND_PREFIX = 10; // команде проекта
  const CLOSE_PREFIX = 7; // префикс закрыто
  const DECIDED_PREFIX = 6; // префикс решено
  const TECHADM_PREFIX = 13 // теху администратору
  const WATCHED_PREFIX = 9; // рассмотрено
  const WAIT_PREFIX = 14; // ожидание (для переноса в баг-трекер)
  const NO_PREFIX = 0;
  const buttons = [
      {
      title: 'Выдано верно, Покупка ИВ/Банк',
      content:
      '[CENTER][SIZE=3][FONT=georgia][I]Доброго времени суток, уважаемый[B] игрок[/B] <br><br>' +
    "Вам на банковский счёт переводились денежные средства от продавцов игровой валюты.<br>"+
    "Ошибки в переводе быть не может, после перевода деньги благополучно снимались. <br>"+
      "Об ошибочном переводе вы никому не сообщали. <br>"+
      "Исходя из вышеперечисленного делаю вывод, что вы знали от кого и с какой целью вам переводяться денежные средства.<br>"+
      "Соответственно вы предполагали тот вариант, что ваш игровой аккаунт может быть заблокированным, но почему-то сослались на некомпетентность технического специалиста или же, что данное действие Вам сойдёт с рук.<br>"+
      "Мы понимаем, что блокировка аккаунта приносит вам не самые лучшие эмоции, но хочу вам напомнить, что ваш аккаунт был заблокирован из-за ваших отрицательных действий, которые в дальнейшем могли испортить экономику сервера.<br>"+
      "Вы все сами прекрасно знаете, ведь игровую валюту просто так никому не переводят.<br>"+
      "Пытаться обмануть техническую администрацию аналогично нету смысла, с данными игроками вы никогда не взаимодействовали и взаимодействовать не могли.<br>"+
      "Ваши действия противоречат основным принципам нашей игры, созданной для увлекательного и справедливого игрового опыта всех пользователей, которые присоединяются к нашему проекту чтобы получить незабываемые впечатления от игры.<br>"+
      "Технический специалист предоставил доказательства вашего нарушения.<br><br>"+
      'Наказание выдано верно. <br> Закрыто.[/I][/FONT][/SIZE][/CENTER]',
      prefix: CLOSE_PREFIX,
      status: false,
  },
 
  {title: 'Выдано верно, Покупка ИВ/Трейд',
  content:
  '[CENTER][I][FONT=georgia]Здравствуйте, уважаемый игрок<br><br>'+
  "Вы совершили трейд, в ходе которой вам была передана игровая валюта. Выше прикреплены доказательства в письменном виде от тех специалиста. Исходя из вышеперечисленного делаю вывод, что вы знали от кого и с какой целью вы совершили трейд с игроком. Соответственно вы предполагали тот вариант, что ваш игровой аккаунт может быть заблокированным, но почему-то сослались на некомпетентность технического специалиста или же, что данное действие Вам сойдёт с рук. Мы понимаем, что блокировка аккаунта приносит вам не самые лучшие эмоции, но хочу вам напомнить, что ваш аккаунт был заблокирован из-за ваших отрицательных действий, которые в дальнейшем могли испортить экономику сервера.<br>"+
  "Вы все сами прекрасно знаете, ведь игровую валюту просто так никому не дают. Пытаться обмануть техническую администрацию аналогично нету смысла, с данными игроками вы никогда не взаимодействовали и взаимодействовать не могли. Ваши действия противоречат основным принципам нашей игры, созданной для увлекательного и справедливого игрового опыта всех пользователей, которые присоединяются к нашему проекту чтобы получить незабываемые впечатления от игры.<br><br>"+
  "На основании имеющейся информации, решение технического специалиста признано корректным. Нарушений с его стороны нету. Доказательства на каждое слово и действие имеются."+
  "С учетом этого, решение технического специалиста выглядит обоснованным и справедливым, ссылаясь на правила проекта и попутно отвечая на Ваши вопросы.<br><br>"+
  "Наказание выдано верно <br>"+
  '[I][FONT=georgia]Закрыто[/FONT][/I][/CENTER]',
   prefix: CLOSE_PREFIX,
   status: false,
  },
 
  {title: 'Проблема с елками',
content:
'[CENTER][I][FONT=georgia]Доброго времени суток, уважаемый игрок<br><br>'+
"Если Вы столкнулись с проблемой, как не получение приза за 48 и 49 уровень елки (аксессуар 'Новогодний поезд' за 48 уровень и скин 'Снегурочки' за 49 уровень.<br> Приз будет начислен в ближайшее время в /reward'<br><br> Благодарим за ожидание<br> Желаем приятного времяпрепровождения на нашем проекте"+
'[CENTER][I]Решено[/I].[/CENTER][/FONT]',
    prefix: DECIDED_PREFIX,
    status: false,
},
  {
      title: 'Аккаунт будет разблокирован',
      content:
      '[CENTER][I][FONT=georgia]Доброго времени суток, уважаемый игрок<br><br>'+
      "Ваш аккаунт будет разблокирован, приносим свои извинения за доставленные неудобства. <br> С техническим специалистом будет проведена профилактическая работа и беседа.<br><br>"+
      '[I][FONT=georgia]Рассмотрено.[/FONT][/I][/CENTER]',
      prefix: WATCHED_PREFIX,
      status: false,
  },
 
  {title: 'IP адрес заблокирован',
  content:
  '[CENTER][I][FONT=georgia]'+
   "[FONT=georgia][I]Здравствуйте, уважаемый игрок.<br><br>"+
   "Вы попали на заблокированный айпи адрес. <br> Ваш аккаунт не находится в блокировке. Переживать не стоит.<br> Причиной попадания в данную ситуацию могло быть разное, например, смена мобильного интернета, переезд и тому подобное. Чтобы избежать данную ситуацию, вам необходимо перезагрузить телефон или воспользоваться услугами VPN. <br>Приносим свои извинения за доставленные неудобства."+ 
   "Желаем приятного времяпровождения на нашем проекте.<br><br>"+
  '[/I][/FONT]'+
  '[I][FONT=georgia]Рассмотрено[/FONT][/I][/CENTER]',
  prefix: WATCHED_PREFIX,
  status: false,
 
 
  },
  {
      title: 'Будете обжалованы',
      content:
      '[CENTER][SIZE=3][FONT=georgia][I]Доброго времени суток, уважаемый[B] игрок[/B][/I][/FONT][/SIZE][/CENTER]<br><br>'+
      '[SIZE=3][FONT=georgia][I]  [/I][/FONT][/SIZE]'+
      "[CENTER][SIZE=3][FONT=georgia][I]Ваш аккаунт будет разблокирован. Впредь попросим больше не нарушать правила проекта, иначе — второго шанса дано не будет.<br> Искренне надеемся, что Вы сделали правильные выводы.<br>"+
      "Настоятельно рекомендую ознакомиться с правилами проекта! 🙂<br>"+
      "Надеюсь, что данная ситуация станет для вас уроком, и в будущем, вы больше не будете нарушать правила проекта.<br><br>"+
      'Рассмотрено.[/I][/FONT][/SIZE][/CENTER]',
      prefix: WATCHED_PREFIX,
      status: false,
  },
 
   {
    title: 'В обжаловании отказано',
    content:
    '[CENTER][I][FONT=georgia]Здравствуйте, уважаемый игрок[/FONT][/I]<br><br>'+
    "[FONT=georgia][I]В обжаловании вашего наказания отказано.[/I][/FONT][/CENTER]<br>"+
    '[SPOILER="К ознакомлению"][FONT=georgia][I] 1.7. Оформленная заявка на обжалование не означает гарантированного одобрения со стороны руководства сервера, она может быть отклонена без объяснения причин.[/I][/FONT][/SPOILER]<br><br>'+
'[CENTER]'+
"[I][FONT=georgia]Отказано.[/FONT][/I][/CENTER]",
    prefix: UNACCEPT_PREFIX,
    status: false,
  },
 
  {title: 'Истекли сроки',
  content:
  '[CENTER][FONT=georgia][I]Здравствуйте, уважаемый игрок.<br><br> Благодарим за ваше обращение.<br>'+
  "Мы тщательно рассмотрели его. Проверили всевозможные варианты, которые могли привести к блокировке. После детальной проверки было вынесен следующий вердикт: "+
  "По истечению времени разблокировка аккаунта невозможна. "+
  "Аккаунт разблокировке не подлежит<br><br>"+
  'Рассмотрено.[/I][/FONT][/CENTER]',
  prefix: UNACCEPT_PREFIX,
  status: false,
 
  },
  
  {
      title: 'Рассмотрение',
      content:
      '[CENTER][SIZE=3][I][FONT=georgia]Доброго времени суток, уважаемый игрок[/FONT][/I][/SIZE] <br>'+
     "[FONT=georgia][SIZE=3][I]Благодарим вас за обратную связь. "+
     "Ваше обращение было принято к рассмотрению, и мы рады сообщить, что мы стараемся оперативно отвечать на все обращения. "+ 
     "Пожалуйста, ожидайте ответа, как только он будет доступен. "+
     "Мы внимательно следим за всеми обращениями и благодарим вас за терпение и понимание."+
     "Если у вас возникнут дополнительные вопросы или потребуется дополнительная информация, не стесняйтесь обращаться к нам. "+
     "Мы всегда готовы помочь! <br><br>"+
     'На рассмотрении[/I][/SIZE][/FONT][/CENTER]',
      prefix: PIN_PREFIX,
      status: true,
  },
  {
      title: 'Ожидайте вердикта Руководства',
      content:
      '[CENTER][FONT=georgia][SIZE=3][I]'+
     "Доброго времени суток, уважаемый игрок <br>"+
     "Ваша тема закреплена и ожидает вердикта моего руководства.[/I][/SIZE][/FONT]"+
     '[SIZE=3][FONT=georgia][I]  Создавать подобные темы не нужно, пожалуйста, ожидайте ответа.[/I][/FONT][/SIZE][/CENTER]',
      prefix: PIN_PREFIX,
      status: true,
  },
  {
      title: 'Дублирование',
      content:
      '[CENTER][FONT=georgia][SIZE=3][I]Доброго времени суток, уважаемый игрок <br><br>'+
      "Данная тема является дубликатом вашей предыдущей темы. Пожалуйста, прекратите создавать идентичные или похожие темы - иначе Ваш форумный аккаунт может быть заблокирован. На первый раз предупреждение будет устное, при повторном дублировании на ваш аккаунт будет выдвинуты санкции в виде штрафных баллов. При последующих нарушениях ваш формный аккаунт будет заблокирован.[/I][/SIZE][/FONT] <br><br>"+
      '[I][FONT=georgia][SIZE=3]Отказано.[/SIZE][/FONT][/I][/CENTER]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
 
  {
    title: 'Форма подачи "ЖБ НА ТЕХ"',
    content:
    '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок <br><br>' +
    "Если у вас возникла необходимость подать жалобу на технического специалиста, пожалуйста, ознакомьтесь с правилами, регулирующими процесс подачи жалоб на специалистов по следующей ссылке: [URL='https://forum.blackrussia.online/threads/Правила-подачи-жалобы-на-технических-специалистов.168934']https://forum.blackrussia.online/threads/Правила-подачи-жалобы-на-технических-специалистов.168934[/URL] <br><br>Прошу учесть, что вам предстоит вести диалог с соответствующим специалистом в рамках вашей темы. Чтобы следить за ходом рассмотрения, периодически проверяйте раздел: [URL='https://forum.blackrussia.online/account/alerts']https://forum.blackrussia.online/account/alerts[/URL] и рекомендуется включить уведомления, нажав кнопку «Отслеживать» в вашей теме." +
    '[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
  
  {
      title: 'Обжалование не подлежит вообще',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок' +
      "[CENTER]Ваше наказание обжалованию не подлежит.<br>Вы получили блокировку за серьезное нарушение, которое невозможно обжаловать/обнулить.<br><br>" +
      '[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  {
      title: 'Наказание будет снижено',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      "[CENTER]Проверив вашу историю наказаний, было принято решение о снижении наказания.<br>Будьте аккуратнее в следующие разы, ведь на встречу пойти мы врятли сможем.<br><br>" +
      '[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  {
      title: 'Восст.доступа к аккаунту/Привязки',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      "[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к странице во ВКонтакте[/U], то сбросить пароль или пин-код Вы всегда сможете обратившись в официальное сообщество проекта - https://vk.com/blackrussia.online.<br> Либо в телеграмм бот - https://t.me/br_helper_bot.<br> Напишите «Начать» в личные сообщения группы/бота, затем выберите нужные Вам функции.<br><br>" +
      "[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к почте[/U], то сбросить пароль или пин-код Вы всегда сможете при вводе пароля на сервере. После подключения к серверу нажмите на кнопку «Войти в аккаунт», затем выберите кнопку «Восстановить пароль», после чего на Вашу почту будет отправлено письмо с одноразовым кодом восстановления.<br><br>" +
      "[CENTER]Если Вы [U]не обезопасили свой аккаунт - его невозможно вернуть[/U]. Игрок самостоятельно несет отвественность за безопаность своего аккаунта.<br><br>" +
      '[CENTER]К сожалению, иногда решение подобных вопросов требует много времени. Надеемся, что Вы сможете восстановить доступ к аккаунту!<br>  [I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
      prefix: WATCHED_PREFIX,
      status: false,
  },
 
  {
      title: 'Правила восстановления',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      "[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений: https://clck.ru/NeHEQ. Вы создали тему, которая не относится к технической проблеме. Имущество не будет восстановлено.[/CENTER]<br><br>" +
      '[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  {
      title: 'Донат',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок[/CENTER]<br><br>' +
      '[CENTER]Система построена таким образом, что деньги не спишутся, пока наша платформа не уведомит платежную систему о зачислении BLACK COINS. Для проверки зачисления BLACK COINS необходимо ввести в игре команду: /donat.<br>' +
      '[CENTER]В остальных же случаях, если не были зачислены BLACK COINS — вероятнее всего, была допущена ошибка при вводе реквизитов. К нашему сожалению, из-за большого количества попыток обмана, мы перестали рассматривать подобные жалобы. Вам необходимо быть внимательными при осуществлении покупок.<br>' +
      '[CENTER]Если Вы считаете, что ошибки быть не может и с момента оплаты не прошло более 14 дней, то в обязательном порядке обратитесь в данное сообщество для дальнейшего решения: https://vk.com/br_tech.<br>' +
      '[CENTER][I]Решено[/I].[/CENTER][/FONT][/SIZE]',
    prefix: DECIDED_PREFIX,
    status: false,
  },
  {
      title: 'Сервер не отвечает',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок[/CENTER]<br><br>' +
      "[CENTER]Если у Вас встречаются такие проблемы, как «Сервер не отвечает», не отображаются сервера в лаунчере, не удаётся выполнить вход на сайт/форум, попробуйте совершить следующие действия: <br><br>" +
      "[LEFT]• Сменить IP-адрес любыми средствами; <br>" +
      "[LEFT]• Переключиться на Wi-Fi/мобильный интернет или на любую доступную сеть; <br>"+
      "[LEFT]• Использование VPN; <br>"+
      "[LEFT]• Перезагрузка роутера.<br><br>" +
 
      "[CENTER]Если методы выше не помогли, то переходим к следующим шагам: <br><br>" +
 
      '[LEFT]1. Устанавливаем приложение «1.1.1.1: Faster & Safer Internet» Ссылка: https://clck.ru/ZP6Av и переходим в него.<br>'+
      '[LEFT]2. Соглашаемся со всей политикой приложения.<br>'+
      '[LEFT]3. Нажимаем на ползунок и ждем, когда текст изменится на «Подключено».<br>'+
      '[LEFT]4. Проверяем: Отображаются ли серверы? Удается ли выполнить вход в игру? Работают ли другие источники (сайт, форум)? <br>' +
 
      "[CENTER]📹 Включение продемонстрировано на видео: https://youtu.be/Wft0j69b9dk[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
  },
  {
      title: 'Жалобы',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок[/CENTER]<br><br>' +
      "[LEFT]Обратитесь в раздел «Жалобы на игроков» Вашего сервера:<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.54/'][B]Сервер №1 | Red[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.98/'][B]Сервер №2 | Green[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.138/'][B]Сервер №3 | Blue[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.174/'][B]Сервер №4 | Yellow[/B] → нажмите сюда[/URL]<br>[URL='https://forum.blackrussia.online/index.php?categories/Жалобы.251/'][B]Сервер №5 | Orange[/B] → нажмите сюда[/URL]<br><br><br>"+
      '[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  {
      title: 'Выдача компенсации',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      "[CENTER]Ваше игровое имущество/денежные средства будут восстановлены в ближайшее время. <br>Убедительная просьба, не менять никнейм до момента восстановления.<br>" +
      '[CENTER]Для активации восстановления используйте команду: /recovery.[/CENTER]<br>' +
      '[CENTER]Решено.[/CENTER][/FONT][/SIZE]',
      status: false,
      prefix: DECIDED_PREFIX,
  },
  
  {
      title: 'Актуально?',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок[/CENTER]<br><br>' +
      "[CENTER]Ваше обращение актуально? В случае отсутсвия ответа ваша тема будет закрыта.[/CENTER][/FONT][/SIZE]",
      prefix: NO_PREFIX,
      status: true,
  },
  
  {
      title: 'Отсувствуие ответа'
  ,content: 
  '[CENTER][I][FONT=georgia]Здравствуйте, уважаемый игрок[/FONT][/I] <br><br>' +
  "[FONT=georgia][I]Если ваша проблема актуальна - пожалуйста, пересоздайте тему."+
  "[SPOILER=Почему ваша тема могла быть закрыта?][/SPOILER][/I][SPOILER=Почему ваша тема могла быть закрыта][/spoiler][/FONT][SPOILER=Почему ваша тема могла быть закрыта][/spoiler]"+
  "[SPOILER=Почему ваша тема могла быть закрыта?"+
  '[FONT=georgia][I]1. Ваша тема могла быть закрыта из-за отсутствия активности в обращении с вашей стороны;'+
  '2. Ваша тема могла быть закрыта из-за наличия у команды технических специалистов актуальной, достоверной информации; [/I][/SPOILER]'+
  '[I][FONT=georgia]Рассмотрено[/FONT][/I][/CENTER]',
   
  prefix: WATCHED_PREFIX,
  status: true,
  
 
},
 
  {
      title: 'Не относится',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      '[CENTER]Ваше обращение не относится к жалобам на технических специалистов. Пожалуйста, ознакомьтесь с правилами подачи жалобы на техничесикх специалистов: https://forum.blackrussia.online/threads/Правила-подачи-жалобы-на-технических-специалистов.168934/<br>' +
      '[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  
  {
      title: 'ФОРМА',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок[/CENTER]<br><br>' +
      "[CENTER]Пожалуйста, заполните форму, создав новую тему: <br>[CODE]01. Ваш игровой никнейм:<br>02. Сервер, на котором Вы играете:<br>03. Суть Вашей возникшей проблемы (описать максимально подробно и раскрыто): <br>04. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>05. Дата и времени произошедшей технической проблемы (постарайтесь указать максимально точно):[/CODE]<br><br>" +
      '[CENTER][I]Отказано[/I].[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
 
  
  
  {
      title: 'Тестерам',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]Ваша тема передана на тестирование.[/CENTER][/FONT][/SIZE]",
        prefix: WAIT_PREFIX,
        status: false,
  },
 
  
  {
      title: 'Если не работают ссылки',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]По техническим причинам данное действие невозможно, пожалуйста воспользуйтесь копированием ссылки от сюда:<br>[img]https://i.ibb.co/SX77Fgw/photo-2022-08-20-16-31-57.jpg[/img]<br>Если данный способ не помогает, то используйте сервис сокращения ссылок [URL='http://gg.gg']<B>клик.</B>[/URL][/CENTER]<br><br>"+
      '[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
      prefix: CLOSE_PREFIX,
      status: false,
  },
  
  {
    title: 'Жб на адм',
    content:
    '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "Если вы считаете, что вынесенное вам наказание было неправомерным или несправедливым, мы рекомендуем обратиться в раздел «Жалобы на администрацию» на вашем сервере.<br><br>Прежде чем подавать жалобу, ознакомьтесь, пожалуйста, с инструкцией ниже, и не забудьте соблюдать правила подачи жалоб на администрацию.<br><br>Пример заполненной жалобы доступен по следующей ссылке: [URL]https://forum.blackrussia.online/threads/aurelien_allard-capslock.6894414/[/URL]<br><br>1. Выберите свой игровой сервер, в нашем случае это [B]Сервер №5 | ORANGE. <br>[/B][IMG]https://i.yapx.ru/W3wGM.png[/IMG]<br>2. Нажмите на название сервера и перейдите в раздел «Жалобы».<br>[IMG]https://i.yapx.ru/W3wGO.png[/IMG]<br>3. Перейдя в раздел «Жалоб» выберите раздел «Жалобы на администрацию».<br> [IMG]https://i.yapx.ru/W3wGR.png[/IMG]<br>4. Нажмите на «[B]СОЗДАТЬ ТЕМУ[/B]». <br>[IMG]https://i.yapx.ru/W3wGS.png[/IMG]<br>5. Начните заполнять тему, как в данном примере.<br> [IMG]https://i.yapx.ru/W3wGJ.png[/IMG]" +
    '[CENTER] Решено, закрыто.[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
  {
      title: 'Жб на лидеров',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER] Ваше обращение не относиться к техническому разделу, обратитесь в раздел 'Жалобы на Лидеров'вашего сервера.<br>" +
      '[CENTER] Решено, закрыто.[/CENTER][/FONT][/SIZE]',
    prefix: DECIDED_PREFIX,
    status: false,
  },
  {
    title: 'Жб на игроков',
    content:
    '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
    "Если вы столкнулись с нарушением со стороны другого игрока, рекомендуем вам обратиться в раздел «Жалобы на игроков». Просим вас внимательно ознакомиться с правилами подачи жалоб на нарушения, чтобы обеспечить корректное и эффективное рассмотрение вашего обращения.<br><br>Перед тем как подавать жалобу, также стоит изучить общие правила серверов: [URL]https://forum.blackrussia.online/forums/Общие-правила-серверов.51/[/URL] <br><br>Приведенный ниже пример поможет вам понять, как правильно составить жалобу: [URL]https://forum.blackrussia.online/threads/aurelien_allard-deathmatch.6895114/[/URL]" +
    '[CENTER]Решено, закрыто.[/CENTER][/FONT][/SIZE]',
  prefix: DECIDED_PREFIX,
  status: false,
},
  {
      title: 'Обжалования',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "Для обжалования наказания, воспользуйтесь форумным разделом [B]«Обжалование наказаний»[/B] на вашем сервере. Процедура подачи обжалования включает выбор соответствующего сервера, переход в раздел [B]«Жалобы» -> «Обжалование наказаний»[/B]. Пожалуйста, предварительно ознакомьтесь с правилами, регламентирующими процесс подачи обжалований, по следующей ссылке: [URL='https://forum.blackrussia.online/threads/Правила-подачи-заявки-на-обжалование-наказания.3429398/'][COLOR=rgb(255, 36, 0)]forum.blackrussia.online/threads/Правила-подачи-заявки-на-обжалование-наказания.3429398/[/COLOR][/URL] <br><br>Хотелось бы напомнить, что подача обжалования [I][B]не гарантирует[/B][/I] полного снятия или уменьшения наложенного наказания. Надеемся, что ваш вердикт будет положительным." +
      '[CENTER]Решено, закрыто.[/CENTER][/FONT][/SIZE]',
    prefix: DECIDED_PREFIX,
    status: false,
  },
  
  {
      title: 'Слетел аккаунт',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]Аккаунт не может пропасть или аннулироваться просто так. Даже если Вы меняете ник, используете кнопки «починить игру» или «сброс настроек» - Ваш аккаунт не удаляется. Система работает иначе.<br><br>" +
      "[CENTER]Проверьте ввод своих данных: пароль, никнейм и сервер. Зачастую игроки просто забывают ввести актуальные данные и считают, что их аккаунт был удален. Будьте внимательны!" +
      '[CENTER]Как ввести никнейм (на случай, если сменили в игре, но не поменяли в клиенте): https://youtu.be/c8rhVwkoFaU [/CENTER] <br><br>' +
      '[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
    prefix: WATCHED_PREFIX,
    status: false,
  },
  
  {
      title: 'Если нет скринов/видео',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]Без доказательств (в частности скриншоты или видео) – решить проблему не получится. Если доказательства найдутся - создайте новую тему, приложив доказательства с фото-хостинга [URL='https://yapx.ru/']yapx.ru[/URL], [URL='https://imgur.com/']imgur.com[/URL], [URL='https://www.youtube.com/']youtube.com[/URL],[URL='https://imgbb.com']ImgBB.com[/URL](все кликабельно).<br>" +
      '[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
      prefix: CLOSE_PREFIX,
      status: false,
  },
  
  
  
  {
      title: 'КРАШ/ВЫЛЕТ',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]В том случае, если Вы вылетели из игры во времени игрового процесса (произошел краш), в обязательном порядке необходимо обратиться в данную тему в любом техническом разделе [img]https://i.ibb.co/sPhBGjx/NVIDIA-Share-1-Tde-EHim0u.png[/img][/CENTER]<br>" +
      "Данные овылетах/отсоединениях/закрытиях игры перредается разработчикам в автоматическом режиме.",
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  
  {
      title: 'Команде проекта',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]Ваша тема закреплена и находится на рассмотрении у команды проекта. Пожалуйста, ожидайте выноса вердикта разработчиков."+
      "[CENTER] Создавать новые темы с данной проблемой — не нужно, ожидайте ответа в данной теме. Если проблема решится - Вы всегда можете оставить своё сообщение в этой теме.<br>",
      prefix: COMMAND_PREFIX,
      status: true,
  },
  {
      title: 'Известно КП',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
      "[CENTER]Команде проекта уже известно о данной проблеме, она обязательно будет рассмотрена и исправлена. Спасибо за Ваше обращение!<br><br>" +
      '[CENTER][I]Закрыто[/I].[/CENTER][/FONT][/SIZE]',
      prefix: CLOSE_PREFIX,
      status: false,
  },
  
  
  ];
 
  
$(document).ready(() => {
// Загрузка скрипта для обработки шаблонов
$('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');
 
// Добавление кнопок при загрузке страницы
addButton('На рассмотрении', 'pin', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(255, 140, 0, 0.5);');
addButton('Команде проекта', 'teamProject', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(255, 215, 0, 0.5); ');
  addButton('Техническому специалисту', 'techspec', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(0, 0, 255, 0.5);');
addButton('Рассмотрено', 'watched', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(0, 128, 0, 0.5); ');
addButton('Решено', 'decided', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(0, 128, 0, 0.5);');
  addButton('Отказано', 'unaccept', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(255, 0, 0, 0.5); ');
addButton('Закрыто', 'closed', 'border-radius: 15px; margin-right: 5px; border: 1px solid; border-color: rgb(255, 0, 0, 0.5);');
addAnswers();
 
// Поиск информации о теме
const threadData = getThreadData();
 
$(`button#ff`).click(() => pasteContent(8, threadData, true));
$(`button#prr`).click(() => pasteContent(2, threadData, true));
$(`button#zhb`).click(() => pasteContent(21, threadData, true));
$('button#unaccept').click(() => editThreadData(UNACCEPT_PREFIX, false));
$('button#pin').click(() => editThreadData(PIN_PREFIX, true));
$('button#teamProject').click(() => editThreadData(COMMAND_PREFIX, true));
$('button#watched').click(() => editThreadData(WATCHED_PREFIX, false));
$('button#decided').click(() => editThreadData(DECIDED_PREFIX, false));
$('button#closed').click(() => editThreadData(CLOSE_PREFIX, false));
$('button#closed_complaint').click(() => editThreadData(CLOSE_PREFIX, false, false));
$('button#techspec').click(() => editThreadData(TECHADM_PREFIX, true));
 
$(`button#selectAnswer`).click(() => {
XF.alert(buttonsMarkup(buttons), null, 'ВЫБЕРИТЕ ОТВЕТ');
buttons.forEach((btn, id) => {
if (id > 1) {
$(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
}
else {
$(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
}
});
});
});
 
  function addButton(name, id, style) {
       $('.button--icon--reply').before(
`<button type="button" class="button--primary button rippleButton" id="${id}" style="${style}">${name}</button>`,
);
}
function addAnswers() {
  $('.button--icon--reply').after(`<button type="button" class="button--cta uix_quickReply--button button button--icon button--icon--write rippleButton" id="selectAnswer" style="oswald: 3px; margin-left: 5px; margin-top: 10px; border-radius: 13px;">ОТВЕТЫ</button>`,
);
}
 
function buttonsMarkup(buttons) {
return `<div class="select_answer">${buttons
.map(
(btn, i) =>
`<button id="answers-${i}" class="button--primary button ` +
`rippleButton" style="margin:4px; ${btn.dpstyle}"><span class="button-text">${btn.title}</span></button>`,
)
.join('')}</div>`;
}
 
function pasteContent(id, data = {}, send = false) {
const template = Handlebars.compile(buttons[id].content);
if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();
 
$('span.fr-placeholder').empty();
$('div.fr-element.fr-view p').append(template(data));
$('a.overlay-titleCloser').trigger('click');
 
if (send == true) {
editThreadData(buttons[id].prefix, buttons[id].status);
$('.button--icon.button--icon--reply.rippleButton').trigger('click');
}
}
 
function getThreadData() {
const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
const authorName = $('a.username').html();
const hours = new Date().getHours();
return {
user: {
id: authorID,
name: authorName,
mention: `[USER=${authorID}]${authorName}[/USER]`,
},
greeting: () =>
4 < hours && hours <= 11 ?
'Доброе утро' :
11 < hours && hours <= 15 ?
'Добрый день' :
15 < hours && hours <= 21 ?
'Добрый вечер' :
'Доброй ночи',
};
}
 
function editThreadData(prefix, pin = false, may_lens = true) {
// Получаем заголовок темы, так как он необходим при запросе
  const threadTitle = $('.p-title-value')[0].lastChild.textContent;
 
  if(pin == false){
    fetch(`${document.URL}edit`, {
      method: 'POST',
      body: getFormData({
      prefix_id: prefix,
      title: threadTitle,
      _xfToken: XF.config.csrf,
      _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
      _xfWithData: 1,
      _xfResponseType: 'json',
      }),
    }).then(() => location.reload());
  }
  if(pin == true){
    fetch(`${document.URL}edit`, {
      method: 'POST',
      body: getFormData({
      prefix_id: prefix,
      title: threadTitle,
      discussion_open: 1,
      sticky: 1,
      _xfToken: XF.config.csrf,
      _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
      _xfWithData: 1,
      _xfResponseType: 'json',
      }),
    }).then(() => location.reload());
  }
  if(may_lens === true) {
    if(prefix == UNACCEPT_PREFIX || prefix == WATCHED_PREFIX || prefix == CLOSE_PREFIX || prefix == DECIDED_PREFIX) {
      moveThread(prefix, 230); }
 
    if(prefix == WAIT_PREFIX) {
      moveThread(prefix, 917);
    }
  }
}
 
function moveThread(prefix, type) {
// Перемещение темы
const threadTitle = $('.p-title-value')[0].lastChild.textContent;
 
fetch(`${document.URL}move`, {
  method: 'POST',
  body: getFormData({
  prefix_id: prefix,
  title: threadTitle,
  target_node_id: type,
  redirect_type: 'none',
  notify_watchers: 1,
  starter_alert: 1,
  starter_alert_reason: "",
  _xfToken: XF.config.csrf,
  _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
  _xfWithData: 1,
  _xfResponseType: 'json',
  }),
}).then(() => location.reload());
}
 
function getFormData(data) {
  const formData = new FormData();
  Object.entries(data).forEach(i => formData.append(i[0], i[1]));
  return formData;
  }
})();