const judgeQuestionBank = [
  {
    question:
      "检查安装好的保温墙板板缝不得渗漏,可采用现场淋水试验的方法,对墙体板缝部位连续淋水1h不渗漏为合格",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "屋面工程找坡层宜采用轻骨料混凝土,找坡材料应分层铺设和适当压实,表面应平整()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一般抹灰按照等级分类,则有普通抹灰、中级抹灰和高级抹灰之分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "屋面工程中,保温材料的导热系数、表观密度或干密度、抗压强度或压缩强度、燃烧性能必须符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "屋面工程中,防水层施工前,基层应坚实、平整、干净、干燥()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当多个建筑物,特别是群集的高层建筑,相互间距较近时,作用在建筑上的风荷载计算时,宜考虑风力相互干扰的群体效应()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "屋面的保温层和防水层严禁在雨大、雪天和五级及其以上时施工施工时环境气温一般不做要求()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑结构荷载计算时,对于横风向风振作用效应明显的高层建筑以及细长圆形截面构筑物,宜考虑横风向风振的影响()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "屋面工程中,卷材防水层的铺贴方向应正确,卷材搭接宽度的允许偏差为-20mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于扭转风振作用效应明显的高层建筑及高耸结构,宜考虑扭转风振的影响()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "屋面工程中,细部构造各分项工程每个检验批应全数进行检验()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新建、扩建、改建及大型维修的建筑工程,必须接受建设行政主管部门及其委托的建设工程质量监督机构的质量监督管理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "屋面工程中,女儿墙和山墙的卷材应满粘,卷材收头应用金属压条钉压牢固,并应用密封材料封严()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分部(子分部)工程应由施工单位项目技术质量负责人进行验收()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑幕墙的防雷装置必须与主体结构的防雷装置可靠连接",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "高层建筑的外窗,每个检验批应至少抽查5%,并不得少于6樘",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "红黄牌警示指公司在日常质量监管活动中,对质量管理问题突出、存在较大质量风险的单位实施公开警示并重点督促整改的管理措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在工程施工过程中,发生重大工程质量事故,建设单位必须在24h内,一般工程质量事故在48h内向当地建设行政主管部门和质监站上报",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "质量管理体系主要由质量管理决策体系、质量保证体系、质量监督体系等组成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地下防水工程的混凝土结构构件无明显裂缝,裂缝宽度不大于030mm,且不渗水",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "喷射混凝土应采用坚硬耐久的卵石或碎石,其粒径不宜大于15mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对HRB335级、HRB400级钢筋,当设计要求钢筋末端需做135°弯钓时,其弯弧内直径不应小于钢筋直径的25倍,弯钓的弯后平直部分长度应符合设计要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "施工中当采用水泥砂浆代替水泥混合砂浆时,应重新确定砂浆强度等级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "检验批验收时,当混凝土试块强度小于设计强度标准值时,可判混凝土强度不合格",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "除焊接封闭环式箍筋外,箍筋的末端应作弯钩,对一般结构,弯折角度不小于90°；对有抗震等要求的结构,应为135°",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当日平均气温低于5℃时,不得浇水养护混凝土",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当需要采取工程质量约谈是,原则上采取逐级约谈",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对于预拌混凝土,生产厂必须留置混凝土试块,并作为工程验收的依据",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土结构实体检验采用的同条件养护试件应在达到28天养护龄期时进行强度试验",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "卷材防水当坡度大于30%时,应采取固定措施,固定点应密封严密",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为防治混凝土结构构件出现所谓的冷缝规范要求混凝土运输、浇筑及间歇的全部时间不应超过混凝土的终凝时间",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地下防水工程细部构造一旦出现渗漏难以修补不能以检查的面分布来确定地下防水工程的整体质量因此施工质量检验时应全数检查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地下防水工程细部构造一旦出现渗漏难以修补，不能以检查的面分布来确定地下防水工程的整体质量．因此施工质量检验时应全数检查。（ ）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "屋面工程中,女儿墙和山墙的卷材应满粘,卷材收头应用金属压条钉压牢固,并应用密封材料封严()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在结构实体钢筋保护层厚度检验时,当全部钢筋保护层厚度检验的合格点率为90%及以上时,检验结果应判为合格",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "屋面工程中,水落口周围直径1000mm范围内坡度不应小于5%,水落口周围的附加层铺设应符合设计要求()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在任何情况下受拉钢筋搭接长度不得小于300mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "平屋顶是指排水坡度小于5%的屋顶,常用坡度为2%～3%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防水混凝土水平构件表面宜覆盖塑料薄膜或双层草袋浇水养护,竖向构件宜采用喷涂养护液进行养护,养护时间不应少于7d",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "曲面屋顶多属于空间结构体系,常用于大跨度的公共建筑()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《混凝土结构工程施工质量验收规范》适用于建筑工程混凝土结构施工质量的验收,不适用于特种混凝土结构施工质量的验收",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "坡屋顶是指坡度一般大于5%的屋顶()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对一、二级抗震等级的框架结构,当设计无具体要求时,其纵向受力钢筋的屈服强度实测值与强度标准值的比值不应大于125",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "涂膜防水屋面的防水涂料可按合成高分子防水涂料、聚合物水泥防水涂料和高聚物改性沥青防水涂料选用,其外观质量和品种、型号应符合国家现行有关材料标准的规定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "设备基础表面应光滑、平整,并应设有坡向四周的坡度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涂膜防水屋面施工前应做好材料、施工机具、安全防护等物资准备和技术准备,检查基层(找平层)质量是否符合要求,并加以清扫()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "卷材防水层完工并经验收合格后应及时做保护层",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为满足屋面防水工程的需要,防水涂料及其形成的涂膜防水层应对环境污染少()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌体结构的标高、轴线,应引自建筑一米线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "涂膜防水层膜施工完成后,养护不得少于5d,经验收合格后,应做好成品保护()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在建筑工程中主要使用中碳钢和高碳钢()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "伸缩缝、沉降缝、防震缝中的模板应拆除干净,不得夹有砂浆、块体及碎渣等杂物",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑接缝密封胶及埋入的定型密封材料一般寿命较长,可以一劳永逸()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在钢的冶炼过程中,会出现清除不掉的有害元素钛(Ti)和硫(S),它们的含量多了会使钢的塑性降低,易于脆断,并影响焊接质量()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "砌筑基底标高不同时,应从低处砌起,并应由低处向高处搭砌",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "含有锰、硅、钛和钒的合金元素的钢,叫作合金钢()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "可以在宽度为15m的窗间墙设置脚手眼",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当钢结构工程质量经有资质的检测单位检测鉴定达不到设计要求但经原设计单位核定认可能够满足结构安全和施工功能的检验批,可予以验收()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "脚手眼补砌时,应清除脚手眼内掉落的砂浆、灰尘；脚手眼处砖及填塞用砖应湿润,并应填实砂浆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "永久性普通螺栓应牢固、可靠,外露丝扣不应少于2扣()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "砌筑完基础或每一楼层后,应校核砌体的轴线和标高在允许偏差范围内,轴线偏差可在基础顶面或楼面上校正,标高偏差宜通过调整上部砌体灰缝厚度校正",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工单位对其首次采用的钢材、焊接材料、焊接方法、焊后热处理等,应进行焊接工艺评定,并应根据评定报告确定焊接工艺()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "雨天不宜在露天砌筑墙体,对下雨当日砌筑的墙体应进行遮盖继续施工时,应复核墙体的垂直度,如果垂直度超过允许偏差,应拆除重新砌筑",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "通风与空调工程隐检的主要内容有敷设于竖井内、不进入吊顶内的风道,有绝热、防腐要求的风管、空调水管及设备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "正常施工条件下,砖砌体、小砌块砌体每日砌筑高度宜控制在15m或一步脚手架高度内",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单排脚手架搭设高度不应超过50m；双排脚手架搭设高度不宜超过24m,高度超过24m的双排脚手架,应采用分段搭设等措施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "外墙涂料的主要功能是美化建筑和保护建筑物的外墙面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "配制砌筑砂浆时,各组分材料应采用质量计量,水泥及各种外加剂配料的允许偏差为±2%；砂、粉煤灰、石灰膏等配料的允许偏差为±5%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "幻彩涂料是一种经一次喷涂即可获得,具有多种色彩的立体涂膜的涂料",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "现场拌制的砂浆应随拌随用,拌制的砂浆应3h内使用完毕；当施工期间最高气温超过30℃时,应在25h内使用完毕预拌砂浆及蒸压加气混凝土砌块专用砌筑砂浆的使用时间应按照厂方提供的说明书确定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "溶剂型内墙涂料溶剂型内墙涂料主要品种有环氧树脂厚质墙面涂料、氯化橡胶墙面涂料、丙烯酸酯墙面涂料、聚氨酯系墙面涂料等",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "砌体水平灰缝和竖向灰缝的砂浆饱满度,按净面积计算不得低于90％",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "盾构隧道的防水设计,应符合一级防水标准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "冬期施工砂浆试块的留置,除应按常温规定要求外,尚应增加3组与砌体同条件养护的试块,用于检验转入常温28d的强度如有特殊需要,可另外增加相应龄期的同条件养护试块",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "仿形刀安装在刀盘的边缘上,通过一个液压油缸来控制仿形刀的伸出量,从而控制超挖范围()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用外加剂法配制的砌筑砂浆,当设计无要求,且最低气温等于或低于-15℃时,砂浆强度等级应较常温施工提高一级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "盾构贯通前后,应通过提高推进速度、降低刀盘转速、调整刀盘转动方向等方法使刀盘尽量靠近或到达贯通岩面()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砌体结构工程检验批验收时,其主控项目应全部符合本规范的规定；一般项目应有80％及以上的抽检处符合本规范的规定；有允许偏差的项目,最大超差值为允许偏差值的15倍",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "理论上,泡沫注入量在不变的情况下,泡沫原液随着地层压力的升高而泡沫原液用量升高()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砌体结构分项工程中检验批抽检时,各抽检项目的样本最小容量除有特殊要求外,按不小于3确定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "管片安装完成后,应将管片安装机的抓取头向下放置,并将盾构机切换到掘进模式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌体结构应按承载能力极限状态设计,并满足正常使用极限状态的要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防水、保温材料进场验收应根据设计要求对材料的质量证明文件进行检查,并应经监理工程师或建设单位代表确认,纳入工程技术档案()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "设计应明确建筑结构的用途,在设计使用年限内未经技术鉴定或设计许可,只可改变使用环境,不可改变结构用途和构件布置",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "屋面工程施工时,每道工序施工完成后,应经施工单位或建设单位检查验收,并应在合格后进行下道工序的施工()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "刚性和刚弹性方案房屋的横墙,应符合横墙中有开洞时,洞口的水平截面面积不应超过横墙截面面积的50%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基础施工前,应在建筑物的主要轴线部位设置标志板标志板上应标明基础、墙身和轴线的位置及标高()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程资料应为原件；当为复印件时,提供单位应在复印件上加盖单位印章,并应有经办人签字及日期提供单位应对资料的真实性负责()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "设计使用年限为50年时,砌体灰缝中钢筋外露砂浆保护层的厚度不应小于12mm",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: ",基础的杯芯模板应刨光直拼,并钻有排气孔,增加浮力",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑工程资料管理规程(JGJ/T185-2009)适用于新建、改建、扩建建筑工程的资料管理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "外叶墙的砖及混凝土砌块的强度等级,不应低于MU10",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "组卷是指按照一定的原则和方法,将有保存价值的工程资料分类整理成案卷的过程,亦称立卷()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "检验批验收合格时,其主控项目经抽样检验应全部合格()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "砖砌体接槎时必须将接槎处的表面清理干净,浇水湿润,填实砂浆并保持灰缝平直()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土施工质量验收的要求规定混凝土强度达到12N/mm2前,不得在其上踩踏或安装模板及支架",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砖砌体竖向灰缝宜采用三一砌砖法,使其砂浆饱满,严禁用水冲浆灌缝()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预拼装时,高强度螺栓和普通螺栓连接的多层板叠,应采用试孔器进行检查当采用比螺栓公称直径大03mm的试孔器检查时,每组孔的通过率应为85%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "进场的钢筋均应有标牌(标明生产厂、生产日期、钢号、炉罐号、钢筋级别、直径等标记),应按炉罐号、批次及直径分批验收,分别堆放整齐,严防混料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砖砌体灰缝如果采用铺浆法砌筑,铺浆长度不得超过800mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砖砌体灰缝中,水平灰缝的砂浆饱满度不得低于80%；竖向灰缝不得出现透明缝、瞎缝和假缝()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "5钢结构焊缝表面不得有裂纹、焊瘤等缺陷三级焊缝不得有表面气孔、夹渣、弧坑裂纹、电弧擦伤等缺陷",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砖砌体灰缝为保持清水墙面立缝垂直一致,当砌至一步架子高时,水平间距每隔1m,在丁砖竖缝位置弹两道垂直立线,控制游丁走缝()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地面涂料的主要功能是装饰与保护室内地面,使地面清洁美观,与室内墙面及其他装饰相适应",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌体的伸缩缝、沉降缝、防震缝中,不得夹有砂浆、碎砖和杂物等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "氟碳涂料氟碳涂料由氟碳树脂、优质颜料、高级助剂等组成A、B双组分涂料,具有超常的耐候性、卓越的防水和抗污性、优异的耐化学和阻燃性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "砖砌体预留孔洞和预埋件中,在墙上留置临时施工洞口,其侧边离高楼处墙面不应小于500mm,洞口净宽度不应超过2m,洞顶部应设置过梁()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "多彩内墙涂料一般用于室内墙面装饰,不宜使用于厨房、卫生间、浴室等潮湿墙面",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为满足公路桥涵混凝土耐久性的需要,在配合比设计时应从最大水灰比和最小水泥用量两个方面加以限制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "质量验收时,砌体水平灰缝的砂浆饱满度,每检验批抽查不应少于5处()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "外墙无机建筑涂料适用于办公楼、商店、学校、宾馆、住宅等的外墙装饰,也可用于内墙和顶棚等的装饰",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "抗冻要求的桥涵混凝土工程,不得掺入引气剂,以免增加砼中含气量",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砖砌体的转角处和交接处应同时砌筑,严禁无可靠措施的内外墙分砌施工质量验收时,每检验批抽20%接槎,且不应少于3处()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "土方开挖的顺序、方法必须与设计工况相一致,并遵循开槽支撑,先撑后挖,分层开挖,严禁超挖的原则()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土外加剂是在砼拌制过程中掺入用以改善砼性质的物质,除特殊情况外,掺量不大于水泥质量的5%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土小型砌体工程中,砌筑小砌块时,应清除表面污物和芯柱用小砌块孔洞底部的毛边,剔除外观质量不合格的小砌块()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程桩应进行承载力检验对于地基基础设计等级为甲级或地质条件复杂,成桩质量可靠性低的灌注桩应采用静荷载试验的方法进行检验,检验桩数不应少于总桩数1%,且不应少于3根,当总桩数少于50根时,不应小于3根()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "罩面石灰膏可以抹在水泥砂浆层上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "用回弹仪测定水泥混凝土强度时,混凝土碳化使混凝土表面回弹值变小()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "普通小砌块砌筑,当天气干燥炎热时,可提前洒水湿润()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在实际混凝土工程结构中,由于制作、安装的偏差使得作用于构件截面上的轴向压力总是具有一定的偏心距()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在正常使用条件下,应在墙体中设置伸缩缝伸缩缝应设在因温度和收缩变形引起应力集中、砌体产生裂缝可能性最大处()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "小砌块砌筑墙体时应对孔B缝搭砌,当不能对孔砌筑时,搭接长度不得小于50mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "构造柱与墙体的连接处应砌成马牙槎,马牙槎应先退后进,预留的拉结钢筋应位置正确,施工中不得任意弯折()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "小砌块砌筑墙体时竖向通缝(搭接长度小于90mm)不得超过两皮()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "同一工程、同一配合比、采用同一批次水泥和外加剂的混凝土的凝结时间应至少检验2次()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "小砌块砌体铺灰长度不宜超过两块主规格块体的长度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对于竖向混凝土结构,养护时间宜适当缩短()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土小型砌体工程中,筑砂浆强度大于1MPa时,才能浇灌芯柱混凝土()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于混凝土浇筑面,尤其是平面结构,宜边浇筑成型边采用塑料薄膜覆盖保湿()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为防止产生裂缝,小砌块房屋顶层墙体可加强顶层芯柱或构造柱与墙体的拉结拉结钢筋网片伸入墙体长度不宜小于1000mm()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当冬期施工时,混凝土拌合物人模温度不应低于10摄氏度,并应有保温措施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为防止小砌体房屋底层墙体裂缝,底层窗台采用现浇钢筋混凝土窗台板,窗台板伸入窗间墙内不小于600mm()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "不发火(防爆的)面层采用石料和硬化后的试件,应在金刚砂轮上做摩擦试验()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "凝土中砂浆密度两次测值的相对误差不应大于08％()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土小型空心砌块主规格尺寸中,最小肋厚度不小于20mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "配筋砖砌体水平灰缝中钢筋的锚固长度不宜小于50d,且其水平或垂直弯折段长度不宜小于20d和150mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "常见的整体地面有水泥砂浆地面、水泥石屑地面、水磨石地面等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土拌合物在运输和浇筑成型过程中严禁加水()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对用于非承重或内墙用的混凝土小型空心砌块,要求其干燥收缩率应小于06mm/m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "板块面层铺设包括砖面层、大理石面层和花岗石面层、预制板块面层、料石面层、塑料板面层、活动地板面层和水磨石面层等面层铺设()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土拌合物应在满足施工要求的前提下,尽可能采用较小的坍落度；泵送混凝土拌合物坍落度设计值不宜大于190mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "配筋砖砌体与构造柱、芯柱的连接处应设2A6拉结筋或A4钢筋网片,间距沿墙高不应超过600mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司大型航站楼技改综合施工技术研究成果达到国内先进水平【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业践行愿景是成为中建领先、行业知名、客户首选、员工幸福的建设集团()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中密度(强化)复合地板面层的材料以及面层下的板或衬垫等材质应符合设计要求,并采用具有商品检验合格证的产品,其技术等级及质量要求均应符合国家现行标准的规定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "宜单独采用特细砂作为细骨料配制混凝土()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "配筋砌块芯柱在楼盖处应贯通,并不得削弱芯柱截面尺寸()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京国际博览中心三期工程荣获中国钢结构金奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工满意度保持90分以上是企业管理总目标之一()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "竹地板面层的铺设应按竹面层铺设特殊的规定执行()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于有预防混凝土碱骨料反应设计要求的高强混凝土工程,不宜采用碱含量低于06%的水泥()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "配筋砖砌体工程中,墙体与构造柱连接处应砌成马牙槎,从每层柱脚起,先进后退,马牙槎的高度不应大于300mm；并应先砌墙后浇混凝土构造柱()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "扬子江国际会议中心金属屋面系统工程荣获金禹奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "主要应对风险为政策风险、市场开发风险、合作伙伴风险()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑工程的厕浴问、厨房及有防水、防潮要求的建筑地面与木、竹地面应有建筑标高差,其标高差必须符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《高强混凝土应用技术规程》JGJT281-2012,水泥中氯离子含量不应大于003%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "配筋砖砌体工程构造柱、芯柱中箍筋时,当纵向钢筋的配筋率大于025%,且柱承受的轴向力大于受压承载力设计值的25%时,柱可以不设箍筋()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "锁脚锚杆注浆的作用是：使上部拱体拱脚沉降可控,改善拱脚处扰动土体,使下部开挖时拱脚部位土体不至于塌落()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "平安幸福中心获得中国钢结构金奖、扬子杯【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "木、竹面层的面层构造层、架空构造层、通风等设计与施工是组成建筑木、竹地面的三大要素,其设计与施工质量结果直接影响建筑木、竹地面的正常使用功能、耐久程度及环境保护效果()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对掺用矿物掺合料的混凝土,由于其强度增长较慢,故验收龄期可适当延长()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "配筋砖砌体工程构造柱、芯柱中箍筋时,箍筋的间距不应大于16倍的纵向钢筋直径、48倍箍筋直径及柱截面短边尺寸中较小者()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "常用的锚喷支护试题类型有：喷射混凝土支护、钢筋网喷射混凝土支护、锚杆喷混凝土支护、锚杆钢筋网喷混凝土联合支护、锚喷加设钢拱架式设置仰拱()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司装配式混凝土剪力墙结构技术创新研究与工程应用获中国建筑集团有限公司科学技术奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业是中国特色社会主义的重要物质基础和政治基础,关系公有制主体地位的巩固,关系我们党的执政地位和执政能力,关系我国社会主义制度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "木地板以其不起灰、不返潮、易清洁、弹性和保温性好,常用于高级住宅、宾馆、体育馆、健身房、剧院舞台等建筑中()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "配置高强混凝土时,砂的含泥量和泥块含量应分别不大于20%和05%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "填充墙砌体工程中,空心砖、蒸压加气混凝土砌块、轻骨料混凝土小型空心砌块等进场后应按品种、规格分别堆放整齐,堆置高度不宜超过2m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "有降水或者排水条件的工程,治理前宜先采取降水或排水措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "1994年4月4日,三公司中南公司成立【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "腐败是危害党的生命力和战斗力的最大毒瘤,反腐败是最彻底的自我革命只要存在腐败问题产生的土壤和条件,反腐败斗争就一刻不能停,必须永远吹冲锋号",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "用灌砂法测定路基压实度,当试洞成上部大、下部小圆锥形时,会使实测密度偏小()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "木搁栅和木板背面满涂氟化钠防腐剂；木板与四周墙体留5～10mm间隙()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "高强混凝土不宜采用再生细骨料()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌筑砂浆中水泥混合砂浆中水泥和掺加料总量宜为300～350kg/m3",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土灌注桩人工挖孔施工要点中,全部结束后应办理预检手续,合格后才能开挖第一节桩孔()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2009年4月1日,南京南站站房工程开工,工程于2011年6月30日竣工【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "厉行节约、勤俭办企专项行动是集团落实全面节约战略的重要举措",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "沥路面施工时,若混合料的加热温度过高或过低时,易造成沥青路面的泛油()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "粘贴式木地面是用粘接剂或XY401胶粘剂直接将木地板粘贴在找平层上如果为底层地面,则应在找平层上做防潮层,或直接用沥青砂浆找平()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "现浇结构模板安装时,预留管、预留孔中心线的位置允许偏差为5mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "具有冻融循环次数要求的砌筑砂浆,经冻融试验后,质量损失率不得大于25%,抗压强度损失率不得大于5%()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "砖基础施工中砌筑时,灰缝砂浆要饱满,严禁用冲浆法灌缝()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的安徽亳州民用机场项目是皖北第二个民用机场项目【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当前我国疫情防控总体策略：外防输入、内防反弹,健全及时发现、快速处置、精准管控、有效救治的常态化防控机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沥青混合料中粗集料是指粒径大于236的碎石、破碎砾石等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "现浇结构模板安装时,相邻两板表面高低差允许偏差为3mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在浇筑混凝土前,木模板应浇水湿润,但模板内不应有积水()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "条形基础应根据高度分段分层连续浇筑,一般需留施工缝()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局三公司六个项目首次获得ISA国际安全大奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建排头、行业领先的内涵：六个排头是指在中建系统做到经济指标、业务板块、体系管理、发展能力、团队建设、党建工作排头,六个领先是指在建筑行业实现战略引领、市场竞争、创新发展、精益管控、品牌打造、文化建设领先",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "SMA沥青用量较高,为防止施工时混合料中沥青偏离,应向混合料中夹入纤维等稳定剂()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "悬臂构件混凝土结构底模拆除时,混凝土强度应达到100%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "模板工程中,浇筑混凝土高度应控制在允许范围内,浇筑时应均匀、对称下料,以免局部侧压力过大导致胀模()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "地下工程的防水等级,可按围护结构的允许渗漏水量划分为五级()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司南京市大厂污水处理厂新建工程(一期)获全国市政工程最高质量水平评价【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司的企业品格是令行禁止,使命必达",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为防止裂缝,小砌体房屋山墙可采取设置水平钢筋网片或在山墙中增设钢筋混凝土芯柱或构造柱,在山墙内设置水平钢筋网片时,其间距不宜大于500mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "马歇尔稳定度试验时的温度越高,则稳定度愈大,流值愈小()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "HPB235级钢筋末端应做180°弯钩,其弯弧内直径不应小于钢筋直径的3倍()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "高层建筑的梁、板模板,完成一层结构,其底模及其支架的拆除时间控制,应对所用混凝土的强度发展情况,分层进行核算,保证下层梁及楼板混凝土能承受上层全部荷载()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地下连续墙应根据工程要求和施工条件增加槽段数量；地下连续墙槽段接缝应避开拐角部位()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "医智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "道路水泥、砌筑水泥、耐酸水泥、耐碱水泥都属于专用水泥()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "箍筋弯钩的弯折角度：对于一般结构不应小于90°,对于有抗震要求的结构,应为135°()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在现浇钢筋混凝土结构中,应以300个同牌号钢筋接头作为一批；在房屋结构中,应在不超过二楼层中300个同牌号钢筋接头作为一批；当不足300个接头时,仍应作为一批每批随机切取1个接头做拉伸试验()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砼智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "高速公路路面混凝土用水泥的铝酸三钙含量不宜大于7%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑工程中,当采用冷拉法对钢筋进行调直时,HPB235、HPB300光圆钢筋的冷拉率不宜大于4%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钢筋调直宜采用机械方法,也可采用热拉方法()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工缝渗漏时宜先止水,再设置刚性防水层设置刚性防水层时,宜沿施工缝走向在两侧各200mm范围内的基层表面先涂布水泥基渗透结晶型防水材料,再宜单层抹压聚合物水泥防水砂浆()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2005年,公司承建的温州博物馆荣获扬子杯【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "路面和桥面混凝土中不得使用硅灰或磨细矿渣粉",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋加工时,箍筋内净尺寸的允许偏差为±10mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "热处理钢筋是用普通碳素钢(含碳量＜025%)和普通低合金钢热轧制成()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2021年5月,公司智能装配造桥机10在盐洛高速项目成功运行【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土抗压强度试件以边长150㎜的正立方体为标准试件,其集料最大粒径为40㎜()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用螺栓紧固的扣接连接件为扣件；仅包括直角扣件、对接扣件()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当设计无具体要求时,对于柱类构件,纵向受力钢筋的接头面价百分率不宜大于50%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "HRB335级钢筋主要用作中小型钢筋混凝土构件中的受力主筋以及钢筋混凝土和预应力混凝土结构中的箍筋和构造钢筋()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "地下工程的防水等级,按围护结构的允许渗漏水量划分为五级()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2022年11月,公司智能装配造桥机20在绿都大道项目成功运行【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "根据公司现有管理要求,各业务部门报销费用时,一律不得使用现金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土抗压试件在试压前如有蜂窝等缺陷,应原状试验,不得用水泥浆修补()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "主节点处必须设置一根横向水平杆,用直角扣件扣接可以拆除()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋安装时,受力钢筋的品种、级别、规格和数量必须符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在外观上HPB235为光面圆钢筋,其余钢筋的表面均有肋纹(月牙纹),表面有肋纹的钢筋统称为普通低合金钢钢筋()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司自研的自行走测量机器人在盘城2号保障房项目实现应用【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公路桥涵砌体使用水泥砂浆的施工配合比可以用重量比,也可用体积比()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单排、双排与满堂脚手架立杆接长除顶层顶步外,其余各层各步接头必须采用对接扣件连接()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "先张法预应力筋张拉后与设计位置的偏差不得大于5mm,且不得大于构件截面短边边长的4%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "热处理钢筋是一种较理想的预应力钢筋()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司申报的江苏省数字城市智慧建造与运维工程研究中心获江苏省发改委批复认定,这也是公司获得的首个省级工程研究中心【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "用洛杉矶法对粗集料进行磨耗试验,可以检验其坚固性()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "找平层应采用水泥砂浆或混凝土铺设,其他材料不可用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "开口型脚手架的两端必须设置连墙件,连墙件的垂直间距不应大于建筑物的层高,并且不应大于6m()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《混凝土结构工程施工质量验收规范》GB50204-2015中规定,现浇结构柱轴线位置的允许偏差为10mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "按照我国现行标准,建筑工程上常用的钢筋直径(mm)有6、8、10、12、14、16、18、20、22、24、28、32、36、40()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2021年两岸企业家峰会于2021年12月7日在公司承建的扬子江国际会议中心举办【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在道路工程中,最常用的沥青材料是石油沥青和煤沥青,其次是天然沥青",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "连墙件中的连墙杆应呈水平设置,当不能水平设置时,应向脚手架一端上斜连接()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预应力工程中,灌浆工作应在水泥浆初凝后完成()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的乔司至南苑连接线工程荣获良渚杯、市优西湖杯、国家优质工程奖等一系列荣誉,也是余杭区第一个市政类国家级奖项【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沥青路面弯沉验收应在施工结束后立即检测()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对有防静电要求的整体地面的基层,应清除残留物,将露出基层的金属物涂绝缘漆两遍晾干()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "开口型双排脚手架的两端均不需设置横向斜撑()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的溧水区市民中心工程荣获鲁班奖和国优奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程准备阶段文件可分为决策立项文件、建设用地文件、勘察设计文件、招投标及合同文件、开工文件、商务文件6类()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "挡土墙台身强度达到设计强度的75%以上时,方可进行台背填土()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "楼层结构必须采用现浇混凝土或整块预制混凝土板,混凝土强度等级不应小于C20()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "运料斜道宽度不应小于15m,坡度不应大于1:6；人行斜道宽度不应小于2m,坡度不应大于1:3()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "爆破工程应编制专项施工方案,方案应依据有关规定进行安全评估,并报经所在地公安部门批准后,在进行爆破作业()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的上海华泰金融大厦工程荣获国家优质工程奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新建、改建、扩建的建筑工程均应编制竣工图；竣工图应真实反映竣工工程的实际情况()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "小桥、涵洞工程都属于路基单位工程中的主要分部工程()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "防水隔离层严禁渗漏,排水的坡向应正确、排水通畅()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "斜道的拐弯处应设置平台,其宽度应小于斜道宽度()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的苏州工业园区体育中心工程荣获全球最佳体育场第二名,荣获鲁班奖和国优奖双奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收到接待任务时,要根据领导要求,及时与对方联系,了解宾客信息：到访时间、目的、活动范围、人员情况(单位全称、职务、级别、性别、人数),往返情况(始发地、班次、车次、出发时间、预计到达及离开时间)；拟定初版的通知事项向分管领导汇报",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当施工图没有变更时,可直接在施工图上加盖竣工图章形成竣工()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "半刚性基层的反射裂缝可不计作施工缺陷,但应及时进行灌缝处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "砂石应选用天然级配材料铺设时不应有粗细颗粒分离现象,压(夯)至不松动为止()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "斜道两侧及平台外围均应设置栏杆及挡脚板栏杆高度应为12m,挡脚板高度不应小于200mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的财盛大厦是海南建省后的第一幢高层,被称誉为海南速度【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "接待工作中,如来宾中有女宾,尽量确保至少2名女性接待人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程资料编写时,同一厂家、同一品种、同一批次的施工物资用在两个分部、子分部工程中时,资料编号中的分部、子分部工程代号可按主要使用部位填写",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "路基除压实度指标需分层检测外,其他检查项目均在路基完成后对路基顶面进行检查测()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "强度和品种不同的预制板块可以混杂使用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "满堂脚手架应设爬梯,爬梯踏步间距不得大于300mm()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2000年7月,公司承建的江心洲污水处理厂扩建工程开工【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "接待工作中,与对方沟通确定后,即可形成基本的日程安排",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程资料组卷应遵循自然形成规律,保持卷内文件、资料内在联系工程资料可根据数量多少组成一卷或多卷()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分层铺筑的高速公路沥青面层,应分别检查沥青面层总厚度和上面层厚度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "灰土垫层应分层夯实后,直接可进行下一道工序施工()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司的前身最早可以追溯到新四军皖东游击队【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据日程安排拟定接待方案,内容包括迎送陪同、视察参观、会议座谈、宴请配餐、住宿、车辆、着装要求等,接待方案中备注接待细节及注意事项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般产品共有的质量特性包括性能、寿命、可靠性、安全性、经济性以及与环境的协调性",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "压实度评定时,高速公路、一级公路的保证率比二级公路的小()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "垫层铺设前,当为水泥类基层时,其下一层表面应湿润()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司的前身部队曾改编为华东野战军建制部队,参加了涟水、孟良崮、淮海等解放山东、安徽和苏北的大小数十次战役和战斗【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接待工作中,准备接机(接站)牌,要用白纸黑字写明",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑工程质量的适用性即功能,是指工程满足使用目的的各种性能()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "梁(板)在吊移出预制底座时,混凝土的强度不得低于设计所要求的吊装强度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1954年1月,水利工程一师师部和两个团改编组成建筑工程第四师后进驻上海市,增补了施工技术力量,A原部队官兵进行了技术培训【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接待迎客时,引导者或主人要走在客人的右侧方",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑工程质量形成过程中,质量保修是关键()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "通常沥青混凝土面层三个标准密度值中试验段密度最大、试验室标准密度其次、最大理论密度最小()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司前身曾先后承建了西北光学仪器厂、东方机械厂、远东机械制造公司等10项重大工程【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "上楼梯时,客人走在前,引导者或主人走在后；下楼梯时,引导者或者主人走在前,客人走在后",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "机械设备是保证建筑工程质量的基础和必要的物质条件,是现代企业的象征()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "螺旋输送机前端闸门可使盾构机内唯一的排土通道关闭,在盾构机断电的紧急情况下,也可以由蓄能器储存的能量自动关闭",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1966年8月至1973年7月,211大队先后隶属基建工程兵整编办公室和基建工程兵西安指挥所,承担了陕西地区的三线建设重任【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "接名片时应以双手承接,若与领导一并接待或拜访客户时,则应在领导与客户交换名片后再视需要与客户交换名片",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "质量管理的八项原则是质量管理的最基本最通用的一般规律,适用于所有类型的产品和组织,是质量管理的理论基础()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "尾部密封是为了防止周围地层的土砂、地下水及背后的填充浆液、掘削面上的泥水、泥土从盾尾间隙流向盾构掘削舱而设置的密封措施",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1973年8月至1978年6月,211大队随基建工程兵22指挥部调驻辽宁省辽阳市,参加国家特大型重点工程辽阳石油化学纤维总厂的建设【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "陪同领导坐车,领导之间若是在谈工作,除非问到你,或希望你介入,否则尽量不插话；对车内领导谈论的话题注意保密",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "质量记录是阐明所取得的结果或提供说完成活动的证据文件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当盾尾油脂密封在手动位时,不能按下每个位置的注脂按钮来进行手动注脂",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在建设辽化过程中,以参建总人数11%的施工力量完成了施工总面积23%的工作量任务,展现了铁军雄风【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程质量控制按其实施主体的不同,分为自控主体和监控主体其中,自控主体是指A他人质量能力和效果的监控者()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "衬背压浆只能有效地控制地表沉降,对隧道的防水性和受力状态得不到改善",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1977年4月后,211大队分批挥师南下,在南京地区及其周边地区建设了南京炼油厂扩建工程、南京烷基苯厂等一批重点工程【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "勘察设计单位属于自控主体()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "导向系统是用来监视盾构精确姿态,提供盾构相对于隧道设计轴线的详细偏差信息,便于用户及时纠正盾构的姿态",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1977年—1982年,建设南京烷基苯厂,年产烷基苯72万吨,合成洗衣粉25万吨,为当时我国最大的烷基苯生产基地【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工项目的质量管理是从工序质量到分项工程质量、分部工程质量、单位工程质量的系统控制过程,也是一个从投入原材料的质量控制开始,直到完成工程质量检验为止的全过程的系统过程()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "沉降观测点的布设应能全面反映建筑及地基变形特征,并顾及地质情况及建筑结构特点对于宽度大于等于15m或小于15m而地质复杂以及膨胀土地区的建筑,应在承重内隔墙中部设内墙点,并在室内地面中心及四周设地面点()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司的四大核心精神是开拓、进取、无私、当担【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "全场性施工准备是以一个建筑物或构筑物为对象而进行的施工准备",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑物沉降观测应测定建筑物及地基的沉降量、沉降差及沉降速度,并根据需要计算基础倾斜、局部倾斜、相对弯曲及构件倾斜()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的徐州移动大楼2003年竣工,是公司在徐州市公建领域的第一个国优奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "事中质量控制的策略是：全面控制施工过程,重点控制工序质量()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "隧道总体实测项目有隧道宽度隧道净高隧道偏位线路中心线与隧道中心线的衔接以及边坡仰坡()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2013年,公司再次进入中建号码公司十强之列【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分层法是用来分析两个质量特性之间是否存在相关关系()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "隧道现场监控量测,包括隧道施工阶段与营运阶段控制测量和监控测量()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2022年,公司荣获江苏省建筑百强企业第五名【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "排列图左侧的纵坐标表示累计频率,右侧纵坐标表示频数()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京地铁九号线项目,是中建八局2020年承建的合同额、体量最大的新基建项目【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "正常直方图呈正态分布,其形状特征是中间高、两边低、成对称()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2021年,公司建设的江苏大剧院、国际青年文化中心、南京市公共卫生医疗中心、溧水区市民中心、侵华日军南京大屠杀遇难同胞纪念馆(三期)五大工程入选南京市十三五十大优秀公共建筑工程【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑工程的耐久性也就是工程竣工后的合理使用寿命周期()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京奥林匹克体育中心主体育场工程,荣获2005年全国十大建设科技成就奖【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般项目是建筑工程中的对安全、卫生、环境保护和公众利益起决定性作用的检验项目()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "基础是位于建筑物最下部的承重构件,起承重作用,承受建筑物的全部荷载()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "民用建筑中,墙体具有承重、围护和水平分隔的作用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分部(子分部)工程应由施工单位项目技术、质量负责人进行验收()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "参加质量验收的各方对工程质量验收意见不一致时,可采取协商、调解、仲裁和诉讼四种方式解决()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分公司施工管理部应在竣工后60天内,在公司项目管理信息系统中填报竣工工程信息,并上传四方验收证明及备案表()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "对于甲指分包单位的工程技术资料,可以不纳入项目总承包管理范畴()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "省部级(含以下)质量奖工程的创优策划书,按BC类方案由分公司网上审批,国家级质量奖创优策划书按A类方案由公司审批()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "交接检验是指由施工的施工方与监理方经双方检查并对可否继续施工做出确认的活动()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "砖墙水平灰缝的砂浆饱满度至少达到90%以上()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑工程实行总承包的,工程质量由工程总承包单位负责,总承包单位将建筑工程分包给其他单位的,应当对分包工程的质量与分包单位承担连带责任分包单位应当接受总承包单位的质量管理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砖墙水平灰缝的砂浆饱满度至少达到80%以上()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "从事建设工程活动,工期紧时,可边勘察、边设计、边施工()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "设置在砌体水平灰缝中钢筋的锚固长度不宜小于50d,钢筋的搭接长度不应小于55d()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "GB/T19000中术语顾客满意是指顾客对其要求已被满足程度的感受顾客抱怨是一种满意程度低的最常见的表达方式,但没有抱怨就不一定表明顾客很满意()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌体工程中构造柱与墙体的连接处应砌成马牙槎,马牙槎应先退后进()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程施工现场消防安全技术规范》,施工现场周边道路满足消防车通行及灭火救援要求时,施工现场内可不设置临时消防车道()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土浇筑完毕后,应在12小时以内对混凝土加以覆盖并保湿养护()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "年功津贴月标准为中建系统内认可工龄：0-5年,10元/年；6-15年,15元/年；16-30年,20元/年；31年及以上,25元/年",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "组织模式一般可分为：职能型模式、直线型模式、曲线-职能模式和矩阵型模式4种模式()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土搅拌合物入模温度不应低于0℃,且不应高于35℃()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "收入证明开具应注明用途,开具的金额应为税前收入,可以超额开具()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑工程质量事故,是指建筑工程质量不符合规定的质量标准或设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在楼梯平台处净空高度应大于2m,梯段范围净空高度应大于22m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "新提任岗位工资标准均执行该岗位档级中的最低档()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单位(子单位)工程质量竣工验收记录表由建设单位填写,验收结论由施工单位填写()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢筋安装时,受力钢筋的品种、级别、规格和数量必须符合设计要求,其检查方法是观察、钢尺检查()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一级建造师应配合取得安全生产考核合格证(B类证)后,方可发放执业资格补贴,未取得的一律不得发放()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑工程质量事故常有发生,因此,必须采取有效的措施,对常见的质量问题和事故先加以预防,并对已经出现的质量事故及时进行分析和处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "焊接质量检验中的实物检查,包括外观检查和内部缺陷检查()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "技术(职称)津贴标准：高级300元/月()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "隐蔽工程在隐蔽前要检查合格后验收,涉及结构安全的试块、试件以及有关资料,应按规定进行见证取样检测,涉及结构安全和使用功能的重要分部工程要进行抽样检测",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在施工现场,应按国家现行标准《钢筋机械连接通用技术规程》、《钢筋焊接及验收规程》的规定抽取钢筋机械连接接头、焊接接头试件作力学性能检验()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "女员工已参加生育保险的,产假期间的待遇按参保地生育保险有关政策由本人或委托他人申请领取()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "民用建筑节能工程质量的过程控制,应按现行国家标准《建筑工程施工质量验收统一标准》GB50300及配套的验收规范执行,竣工时应进行节能工程专项验收()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "砌筑墙体设置拉结筋,埋入长度从留槎处算起每边均不应小于500mm,对抗震设防烈度6度、7度的地区,不小于1000mm()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "门窗节能工程适用于建筑外门窗节能工程的质量验收,包括金属门窗、塑料门窗、木质门窗、各种复合门窗、特种天窗、天窗以及门窗玻璃安装等节能工程()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对跨度不小于4米的现浇钢筋混凝土梁、板,其模板应按设计要求起拱；当设计无具体要求时,起拱高度宜为跨度的3/1000--5/1000()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "室内环境质量验收不合格的民用建筑工程,严禁投入使用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌体进场后应按品种、规格堆放整齐,堆置高度不宜超过2m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设工程质量检测是工程质量检测机构接受委托,依据国家有关法律、法规和工程建设强制性标准,对涉及结构安全项目的抽样检测和对进入施工现场的建筑材料、构配件的见证取样检测()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "检验批应由专业监理工程师组织施工单位项目专业质量检查人员、专业工长等进行验收()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑结构荷载进行基本组合,当永久荷载效应对结构有利时,永久荷载分项系数不应大于10()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "聚氨酯涂膜防水材料的技术性能应符合设计要求或标准规定,并应附有质量证明文件和现场取样进行检验的试验报告以及其他有关质量的证明文件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "箍筋弯钩的弯折角度：对一般结构,不宜小于90度,对有抗震要求的结构,应为135度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑结构荷载规范中规定,除多层住宅外其他楼梯楼面均布活荷载标准值为20KN/㎡()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑变形测量的平面坐标系统和高程系统宜采用国家平面坐标系统和高程系统或所在地方使用的平面坐标系统和高程系统,也可采用独立系统当采用独立系统时,必须在技术设计书和技术报告书中明确说明()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "卫生间楼地面氯丁胶乳沥青防水涂料施工的基层处理施工要求与聚氨酯涂膜相同()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当需要进行钢筋代换时,应办理技术核定单()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "房屋建筑的屋面,其水平投影面上的不上人屋面均布活荷载的标准值不应小于20KN/㎡()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一个周期的观测应在短的时间内完成不同周期观测时,宜采用不同的观测网形、观测路线和观测方法,使用同一测量仪器和设备()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "卫生间防水施工结束后,应做12小时蓄水试验()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "未经处理的海水严禁用于混凝土结构和预应力混凝构件中混凝土的拌制和养护()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "不上人屋面均布活荷载,可不与雪荷载和风荷载同时组合()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沉降或位移观测的精度级别应不低于变形控制测量的精度级别()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "运输过程中,坍落度损失或离析严重,经补充外加剂或快速搅拌已无法恢复混凝土拌和物的工艺性能时,不得浇筑入模()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "屋面板和檩条进行结构设计时,雪荷载按积雪不均匀分布的最不利情况采用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑沉降观测可根据需要,分别或组合测定建筑场地沉降、基坑回弹、地基土分层沉降以及基础和上部结构沉降对于深基础建筑或高层、超高层建筑,沉降观测应从基础施工时开始()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "试验工程师应加强对养护室温度和湿度的动态控制,每天至少进行两次养护室温湿度测量,并做好记录()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "计算垂直于建筑物主要受力结构和围护结构表面上的风荷载标准值采用相同的计算公式()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑场地沉降观测只需测定建筑相邻影响范围之内的相邻地基沉降()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在厨房、卫生间、浴室等处采用蒸压加气混凝土砌块砌筑墙体时,墙底部宜现浇混凝土坎台,其高度宜为150mm()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基坑开挖前的回弹观测,宜采用水准测量配以铅垂钢尺读数的钢尺法较浅基坑的观测,可采用水准测量配辅助杆垫高水准尺读数的辅助杆法观测结束后,应在观测孔底充填厚度约为lm的白灰()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "模板支架应按混凝土浇筑前和混凝土浇筑时两种工况进行抗倾覆验算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分层沉降观测应从基础施工时开始,直至建筑竣工后沉降稳定时为止首次观测至少应在标志埋好5d后进行()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "垫层混凝土应该在验槽后立即浇筑()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "现场预先制作的混凝土构件属预制混凝土构件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "裂缝观测不用考虑裂缝的长度()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "板、次梁、与主梁交叉处,板的钢筋在上,次梁的钢筋居中,主梁的钢筋在下()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "装配式混凝土构件堆放时,预埋吊件应外露()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "烧结多孔砖的质量等级分为优等品、一等品、二等品、合格品四个质量等级()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "全预制装配结构体系主要是采用预制钢筋混凝土柱、梁、板、墙、楼梯、阳台等,通过预埋件、预留插孔灌浆、钢筋混凝土后浇部分等将梁、板、柱及节点连成整体的结构体系()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "卷材防水层应采用高聚物改性沥青防水卷材、合成高分子防水卷材或沥青防水卷材()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "非框架梁的编号是L()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "清理卷材面撒布物并将表面清理好的卷材反卷备用,以免防止溅水弄脏()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "装配式混凝土构件施工时,预制构件与现浇混凝土之间的结合面应做成粗糙面,可采用拉毛或表面露石处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沥青防水卷材物不允许有孔洞、硌伤()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "柱编号由类型代号和序号组成()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "自粘法铺贴卷材,接缝口应用密封材料封严,宽度不应小于5mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预制构件脱模后,构件外装饰材料破损不严重可不进行修补()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "卷材端部处理中,天沟、檐沟、檐口、泛水和立面卷材收头的端部应裁齐,塞入预留凸槽内,用金属压条钉压固定,最大钉距不应大于1000mm,并用密封材料嵌填封严()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在多层建筑物施工过程中,各层墙体的轴线只能用吊垂球方法测设()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2020、2021年度考核等级存在不合格的人员,不予申报2022年度职称评审()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水乳型涂料可盛于金属或塑料容器中,贮运和保管的环境温度需低于0℃()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在雨季进行土方工程施工时,应逐段逐片开挖()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防水涂膜严禁五级风以上时施工,不得在雨天、雪天施工；如果突然遇雨时应采取遮盖保护措施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "墙体节能工程的保温材料在施工过程中应采取防潮、防水等保护措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防水涂料配比计量要准确,搅拌要充分、均匀在进行双组分涂料操作时,不同组分的容器、搅拌棒,取料勺等可以混用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土构件有不影响使用功能的外形缺陷属一般外形缺陷()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涂膜防水层在天沟、檐沟、檐口、水落口、泛水、变形缝和伸出屋面管道的防水构造,必须符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "恢复定位点和轴线位置方法有设置轴线控制桩和龙门板两种方法()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理须持有一级造价师证书()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "涂膜防水层与基层应粘接牢固,表面平整,涂刷均匀,无流淌、皱褶、鼓泡、露胎体和翘边等缺陷,其检验方法是针测法或取样量测()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "圈梁可以抵抗基础不均匀沉降引起墙体内产生的拉应力,同时可以增加房屋结构的整体性,防止因振动产生的不利影响()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "提任项目副经理岗位,须具备不少于1年的技术类岗位经历()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "氯丁胶乳沥青防水涂料是由氯丁橡胶乳液与无机铝盐防水剂混合加工而成,它具有橡胶和石油沥青材料的双重优点()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《通用硅酸盐水泥》GB175-007规定,采用胶砂法可测定水泥的3d和28d的抗压强度和抗折强度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "门窗安装前应对门窗洞口尺寸进行检验",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防水混凝土结构的变形缝、施工缝、后浇带、穿墙管、埋设件等设置和构造必须符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "人工挖孔桩的桩位偏差不是其主控项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "金属门窗和塑料门窗安装应采用预留洞口的方法施工,可以采用边安装边砌口或先安装后砌口的方法施工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "阳台、外廊、室内回廊、内天井、上人屋面及室外楼梯等临空处应设置防护栏杆,栏杆应以坚固、耐久的材料制作,并能承受荷载规范规定的垂直荷载()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "三级建筑桩基可不配构造钢筋",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑外门窗的安装必须牢固在砌体上安装门窗严禁用射钉固定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "后张法一般适用于生产定型的中小型预应力混凝土构件,如空心板、槽形板、T形板、薄板、吊车梁、檩条()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中建八局第三建设有限公司集团价值观：品质保障、价值创造",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "木门窗的防火、防腐、防虫处理应符合设计要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局第三建设有限公司集团使命：拓展幸福空间",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "木门窗的结合处和安装配件处可以有木节或已填补的木节",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中建八局第三建设有限公司工作作风：令行禁止、使命必达",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "门窗框和厚度大于50mm的门窗扇应用单榫连接",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局三公司员工守则规定,员工在本单位工作满一年的,与配偶或父母不同城居住,可以享受探亲假待遇",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "门、窗是建筑物中除具有保温、隔声、防风、挡雨的主要功能外,还要求其坚固、耐久、灵活、美观、易清洁",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "排水沟和集水井应设置在基础范围以外,一般排水沟的横断面不小于05m×05m,纵向坡度不小于3‰",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "开挖洞口土石方,应按设计要求进行边坡、仰坡放线,可掏底开挖或上下重叠开挖()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "木门、窗的木材品种、材质等级、规格、尺寸、框扇的线型及人造木板的乙醛含量应符合设计要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《建筑地基基础工程施工质量验收规范》GB50202-2018中,土方开挖的顺序、方法必须与设计工况相一致,并遵循开槽支撑,先撑后挖,分层开挖,严禁超挖的原则",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "隧道洞口工程包括石方开挖、洞口防护与排水工程、洞门建筑的制作、安装、明洞工程()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "金属门、窗的品种、类型、规格、尺寸、性能、开启方向,安装位置、连接方式及铝合金门窗的型材壁厚应符合设计要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "锚固型钢的主体结构混凝土强度等级不得低于C30()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "隧道洞身开挖时,拱脚、墙脚以上1m允许个别欠挖()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "门、窗所用材料的产品合格证、三性检测报告、进场验收记录等都是对门、窗工程进行验收时需检查的文件资料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "抗震设防烈度为6度及以上地区的建筑,必须进行抗震设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钻爆作业是根据现场情况随机进行钻眼、装药、接线和引爆()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "门(窗)框与墙的位置关系有内平、居中和外平三种",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "结构构件应符合下列抗震要求,混凝土结构构件应控制截面尺寸和受力钢筋、箍筋的设置,防止剪切破坏先于弯曲破坏、混凝土的压溃先于钢筋的屈服、钢筋的锚固粘结破坏先于钢筋破坏()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "确定桩基承载力的检测方法有两种,一种是静载试验,另一种是动载试验()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "隧道工程施工可分为洞口工程、洞身工程、防水排水工程、附属设施工程()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "铝合金和塑钢门、窗采用塞口安装,有直接固定法和间接固定法两种固定方法",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在施工中,当需要以强度等级较高的钢筋替代原设计中的纵向受力钢筋时,应按照钢筋受拉承载力设计值相等的原则换算,并应满足最小配筋率要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "有降水或排水条件的工程,治理前宜先采取降水或排水措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司的企业使命是品质保障、价值创造()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "隧道衬砌施工时,其中线、标高、断面尺寸和净空大小均需符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "吊顶工程是室内装饰中的一项重要的组成部分,它是采用各类装饰材料对房间内的墙壁进行装饰性的施工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "现浇钢筋混凝土梁、板,当跨度大于8m时,模板应起拱；当设计无具体要求时,起拱高度宜为全跨长度的1/1000～3/1000()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "聚合物水泥防水涂层的厚度不宜小于15mm,并应设置水泥砂浆保护层()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "骨架墙表面应平整光滑、色泽一致、洁净,裂缝要小,接缝处应均匀、顺直",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "砂轻混凝土和全轻混凝土宜采用松散体积法进行配合比计算,砂轻混凝土也可采用绝对体积法配合比计算中粗细骨料用量均应以干燥状态为基准()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "注浆止水施工时基层温度不宜低于5℃,浆液温度不宜低于15℃()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "螺旋输送机前端闸门可使盾构机内唯一的排土通道关闭,在盾构机断电的紧急情况下,也可以由蓄能器储存的能量自动关闭()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "轻质隔墙主要指非承重轻质内隔墙板,按其材料的不同可分为板材隔墙、骨架隔墙、活动力隔墙和玻璃隔墙",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "计算出的轻骨料混凝土配合比即为最终配合比()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "水泥基渗透结晶型防水涂料施工时配置好的涂料从加水开始应在15min内用完()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "尾部密封是为了防止周围地层的土砂、地下水及背后的填充浆液、掘削面上的泥水、泥土从盾尾间隙流向盾构掘削舱而设置的密封措施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "骨架隔墙所用龙骨、配件、墙面板、填充材料及嵌缝材料的品种、规格、性能和木材的含水率应符合设计要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "计算出的轻骨料混凝土配合比必须通过试配予以调整轻骨料混凝土配合比调整时,以计算的混凝土配合比为基础,再选取与之相差±10％的相邻两个水泥用量,用水量不变,砂率相应适当增减,分别按三个配合比拌制混凝土拌和物测定拌和物的稠度,调整用水量,以达到要求的稠度为止()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "聚合物水泥防水砂浆拌和后应在规定时间内用完,施工中可适量加水()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "轻质隔墙工程验收时应检查各种材料的产品合格证书、性能检测报告、进场验收记录和复验报告",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用搅拌运输车运送混凝土,当坍落度损失较大不能满足施工要求时,可在运输车罐内加入适量的水后,混凝土罐车应快速旋转搅拌均匀,并应达到要求的工作性能后再泵送或浇筑()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工缝渗漏时宜先止水,再设置刚性防水层,设置刚性防水层时,宜沿施工缝走向在两侧各200mm范围内的基层表面先涂布水泥基渗透结晶型防水材料,再宜单层抹压聚合物水泥防水砂浆()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "导向系统是用来监视盾构精确姿态,提供盾构相对于隧道设计轴线的详细偏差信息,便于用户及时纠正盾构的姿态()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "夹层玻璃既是具有较高的热反射能力、又能保持良好的透光性能的平板玻璃,又称镀膜玻璃",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土结构构件表面以内40mm～80mm位置处的温度与混凝土结构构件内部的温度差值不宜大于25℃,且与混凝土结构构件表面温度的差值不宜大于25℃()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "冬季闪光对焊宜在室内进行,环境气温不宜低于0℃()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大面积渗漏且有明水时,宜先在基层表面设置刚性防水层,再采取钻孔注浆或快速封堵止水()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "暗挖隧道下穿管线一般处理方法是：加大开挖断面,加大进尺,加密小导管,加强注浆,快速通过()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "饰面工程就是利用饰面板、饰面砖等建筑装饰材料对建筑物的立面进行粘贴的工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "模板拆除时,可采取先支的先拆、后支的后拆,先拆非承重模板、后拆承重模板的顺序,并应该从上而下进行拆除()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "当混凝土原材料和施工工艺等发生变化时,必须重新选定配合比()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地下防水工程中,涂料的用量或防水层平均厚度应符合设计要求,最小厚度不得小于设计厚度的80%()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二次衬砌混凝土厚度检查验收时可允许个别地方厚度小于设计值()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "饰面板安装工程适用于外墙饰面板安装工程及相应高度不大于24m、抗震设防烈度不大于7度的外墙饰面板安装工程的质量验收",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "基坑降压井应在底板施工完成后立即封闭()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋弯曲成型时,可以根据实际情况反复弯折()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "隧道遇到溶洞处理措施,分别以引、堵、越、绕等措施进行处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "饰面工程质量验收文件包括检查施工记录",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当要求抹灰层具有防水、防潮功能时,应采用防水砂浆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土结构保护层是指受力钢筋外缘至混凝土表面的距离()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "隧道衬砌模板放样时,允许将设计的砌轮廓线扩大10cm,确保衬砌不侵入隧道建筑限界()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "花岗岩板材按加工方法分为剁斧板、机刨板、粗磨板和磨光板等",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水泥砂浆抹灰层应在干燥条件下养护",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预拌砂浆生产时会加入改善砂浆可操作性的石灰类物质()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于重要的工序或工程质量有重大影响的工序,实行三检制,三检制包括自检、互捡、抽样检查()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "石灰岩属高档建筑结构材料和装饰材料,多用于室外地面、基座、台阶、纪念碑、墓碑、铭牌、踏步、檐口等处",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "外墙和顶棚的抹灰层与基层之间及各抹灰层之间必须粘结牢固",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砂浆现场拌制时,各组分材料应采用体积计量()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在现代大城市建筑中,镜面花岗岩板多用于室内外墙面、地面、柱面、踏步等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "抹灰工程是用不同类型的灰浆材料涂抹在建筑物的墙面、地面、顶棚表面上的一种施工技术",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "消石灰粉不得直接用于砌筑砂浆中()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对现浇混凝土构件中,已经出现的严重缺陷,应由施工单位提出技术处理方案,并经监理(建设)认可后进行处理对经处理后的部位,应重新检查验收()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "石材行业通常将具有与大理岩相似性能的各种碳酸岩或镁质碳酸盐,以及有关的变质岩统称为大理石",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "抹灰工程用的砂,一般为中砂或中、粗砂单混合使用要求颗粒坚硬、洁净、含泥量不得大于5%使用前应过筛,不得含有杂物",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "水泥砂浆及预拌砌筑砂浆的强度等级可分为M5、M75、M10、M15、M20、M25、M30；水泥混合砂浆的强度等级可分为M5、M75、M10、M15()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "陶瓷制品是指以黏土、长石、石英等为基本原料,经配料、制坯、干燥、焙烧而制得的成品",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般抹灰工程分为普通抹灰和高级抹灰,当设计无要求时,按普通抹灰验收",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌筑砂浆试配时应采用人工搅拌()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "不同品种、规格的高聚物改性沥青防水卷材产品应分别堆放,贮存在温暖通风的室内,以免日晒雨淋、要远离火源()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "墙地砖的技术指标主要包括规格尺寸、外观质量、吸水率、急冷急热性、抗弯强度、白度和色差等",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中级抹灰一般适用于地下室、仓库、车库、锅炉房和临时建筑物等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "自动焊接或半自动焊接采用的焊丝和焊剂,应与主体金属强度相适应()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "陶瓷锦砖适用于工业建筑的洁净车间、化验室以及民用建筑的餐厅、厨房、浴室的地面铺装等,也作为高级建筑物的外墙饰面材料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "普通抹面砂浆有内用和外用两种,它可以保护建筑物免遭各种自然因素(如雨、雪、霜等)的侵蚀,提高建筑物的耐久性,并使制品表面平整美观",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对超过一定规模的危险性较大的分部分项工程施工单位应当根据论证报告修改完善专项方案,并经项目技术负责人、项目总监理工程师、建设单位项目负责人签字后,方可组织实施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对危险性较大的模板工程及高大模板支撑体系专项施工方案应按照相关规定组织专家论证()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "釉面砖由于砖块小,不易被踩碎,主要用于室内地面铺贴",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "锁脚锚杆注浆的作用是：使上部拱体拱脚沉降可控,改善拱脚处扰动土体,使下部开挖时拱脚部位土体不至于塌落()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "幕墙工程分为玻璃幕墙工程、金属幕墙工程和石材幕墙工程等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "暗挖隧道下穿管线一般处理方法是：加大开挖断面,加大进尺,加密小导管,加强注浆,快速通过()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "玻璃幕墙是应用玻璃饰面材料,覆盖建筑的表面,减轻了建筑物的自重,使建筑物变得美观,因此它是高层建筑最为理想的一种外墙结构形式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "模板在安装过程中,必须设置有效防倾覆的临时固定设施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "金属幕墙工程适用于建筑高度不大于200m的金属幕墙工程的质量验收",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢筋进场时,应按照国家现行相关标准的规定抽取试件作屈服强度、抗拉强度、伸长率、弯曲性能,检验结果必须符合有关标准的规定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "金属幕墙的密封胶缝应横平竖直、深浅一致、宽窄均匀、光滑顺直",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当室外日平均气温连续5天稳定低于0℃即进入冬期施工()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "石板常用天然石材有大理石和石灰岩,与玻璃等饰面板组合应用,可以产生虚虚实实的装饰效果",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "WSS注浆的含义无收缩后退式注浆,钻孔和注浆一次完成()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "幕墙的框架材料可分两大类,一类是构成骨架的各种型材,另一种是各种用于连接与固定型材的连接件和紧固件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "下述工程属于超过一定规模的危险性较大的分部分项工程范围——混凝土模板支撑工程：搭设高度8m及以上；搭设跨度18m及以上,施工总荷载15kN/m2及以上；集中线荷载20kN/m2及以上()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "高强度大六角头螺栓连接副终拧完成1h后、24h内应进行终拧扭矩检查()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "铝合金型材框架体系是以型钢为幕墙的骨架,将铝合金框与骨架固定,然后再将玻璃镶嵌在铝合金框内",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "当日平均气温达到30℃及以上时,应按高温施工要求采取措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涂料是当今建筑物离不开的建筑装饰材料,但是,如果涂料涂饰施工时达不到有效的控制,就可能产生色差大、脱色、起皮、脱落等质量问题,影响装饰效果",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "柱、墙模板内的混凝土浇筑不得发生离析,倾落高度应符合规定,浇筑倾落度高度限值为4米()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "涂饰工程包括水性涂料涂饰工程、溶剂型涂料涂饰工程、美术涂饰工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用碗扣式、盘扣式或盘销式钢管架作模板支架时,立杆上的上、下层水平杆间距不应大于2m()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "验收涂料工程时应检查材料的产品合格证明书、性能检验报告和进场验收报告,而不需要检查施工记录",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "满堂脚手架支撑架的可调底座、可调托撑螺杆伸出长度不宜超过300mm,插入立杆内的长度不得小于150mm()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "灌注水下混凝土必须连续施工,每根桩的灌注时间应按初盘混凝土的初凝时间控制()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "模板拆除时,可采取先支的先拆、后支的后拆,先拆非承重模板、后拆承重模板的顺序,并应从上而下进行拆除()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "后张预应力混凝土结构的侧模宜在施加预应力前拆除,底模应在施加预应力后拆除当设计有规定时,应按规定执行()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地基压实加固时性质不同的填料应分层压实,同一水平层可采用不同材料混合填筑()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "未按国家和地方明文规定需采取建筑节能措施或节能措施未达到规定要求的不得评为优质工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预应力工程,锚固后的外露部分宜采用机械方法切割,外露长度不宜小于预应力筋直径的15倍,且不小于20mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "无粘接预应力筋护套轻微破损者应外包防水塑料胶带修补,严重破损者不得使用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基坑土方开挖的时空效应指的是基坑土方开挖后,上部土方被挖掉,地层、墙体原有的平衡被打破而产生变形,并且此变形受施工周期、基坑暴露时间、开挖土体的空间尺度和深度等因素的影响,这种现象称为时空效应()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "封闭环式箍筋闪光对焊接头,以600个同牌号、同规格的接头作为一批,只做拉伸试验()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预应力筋可以放在构件的混凝土里面,不可以放在构件的预留孔内()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "开挖深度超过3m(含3m)或虽未超过3m但地质条件和周边环境复杂的基坑(槽)支护、降水工程需组织专家论证()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土应以最少的转运次数和最短的时间,从搅拌地点运至浇筑地点,并在初凝之前浇筑完毕()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "填土应分层压(夯)实,填土质量应符合现行国家标准《建筑地基基础工程施工质量验收规范》(GB50202―2002)的有关规定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土垂直运输,多用塔式起重机加料斗、混凝土泵、快速提升斗和井架()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重要工程或大面积的地面填土前,应取土样,按击实试验确定最优含水量与相应的最小干密度()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土泵是一种有效的混凝土运输和浇筑工具,只可以一次完成水平运输,将混凝土直接输送到浇筑地点()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "基层铺设,灰土垫层应采用熟化石灰与黏土(或粉质黏土、粉土)的拌合料铺设,其厚度不应小于150mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土结构质量问题中的蜂窝是指混凝土表面无水泥浆,露出石子深度大于4mm,但小于保护层厚度的缺陷()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "基层铺设中砂垫层厚度不应小于60mm,砂石垫层厚度不应小于100mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砌体墙面抹灰宜采用中砂,并且砂子的含泥量不得大于3%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土的强度包括抗压强度、抗拉强度、抗弯强度(或抗折强度)、抗剪强度和与钢筋的粘结强度等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基层铺设时,砂石垫层中砂石应选用天然级配材料,铺设时不应有粗细颗粒分离现象,压(夯)至不松动为止()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钢筋混凝土由钢筋和混凝土两种物理力学性能完全不同的材料组成()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "基层铺设中,碎石垫层和碎砖垫层厚度不应小于50mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "三合土垫层采用石灰、砂(可掺入少量黏土)与碎砖的拌和料铺设,其厚度不应小于50mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土的强度等级是按混凝土立方体抗压强度标准值来划分的()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防油渗混凝土的强度等级和抗渗性能必须符合设计要求,且强度等级不应小于C30；防油渗涂料抗拉粘接强度不应小于02mPa()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "地下工程的防水等级,按围护结构的允许渗漏水量划分为五级()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预应力混凝土连续梁悬臂浇筑施工前,应采用临时支座将墩顶梁段与桥墩临时固结牢固()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "浇(砌)筑拱上结构时,拱架已拆除时拱圈混凝土(砂浆)应达到设计强度75％()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "合龙梁段混凝土应在一天中气温最低时间快速、连续浇筑()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "清水砌体勾缝所用水泥的凝结时间和和易性复验应合格",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "清水砌体勾缝应横平竖直,交接处应平顺,宽度和深度应均匀,表面应压实抹平",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "同一幕墙玻璃单元不应跨越两个防火分区",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "吊顶灯具可以固定不可以固定在石膏板上,但可以固定在主龙骨上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "石膏板吊顶属于板块面层吊顶",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水性涂料施工的环境温度应在5~35℃之间,并注意通风换气和防尘",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对投标文件理解有争议的,应当作出不利于提交该投标文件的投标人的解释",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "计价软件中,分部分项+措施项目+其他项目+管理费+利润+规费+税金之和大于总造价是软件出现了错误",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "同一招标工程的项目编码不能重复",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目特征主要涉及项目的自身特征、工艺特征及对项目施工方法可能产生影响的特征",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《建筑安装工程费用项目组成》(建标[2003]206号文),规费包括医疗保险费、养老保险费、职工福利费、劳动保护费、财产保险费",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "计日工应按照招标工程量清单列出的项目和数量自主确定各项综合单价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国有资金投资的建设工程招标,必须编制最高投标限价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分部分项工程费=〉分部分项工程量×分部分项工程综合单价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "天然花岗石板材常用于室外工程的最主要原因是耐酸",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程工程量清单计价规范》(GB50500-2008),垂直运输机械费应列在措施项目清单与计价表中",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),采用有限数量制的,招标人应当制定具体的有限数量制资格预审办法,并在招标公告和资格预审文件中明确不可以选取注册资本部分因素进行评价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),招标人可以对招标文件或资格预审文件进行必要的澄清或者修改对付款方式进行修改,可以不重新发布招标公告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),资格审查可选条件中,企业或项目负责人承担过类似工程,类似工程的时间范围不得少于2年",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程量清单计价模式下,分部分项工程量的确定方法是按施工方案计算工程总量",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),类似工程期限一般不得低于3年,以竣工验收时间为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),设置同类工程业绩应当符合下列规定:(1)一般只能设置不超过3个量化指标其中面积、造价量化规模指标,大型及以下工程、技术复杂的特大型工程可以设置不超过招标工程相应指标的80%,特大型工程不超过60%其他指标的设置不得超过招标工程相应指标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),中型工程不可以设置企业或者项目负责人承担过类似工程作为合格条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),资格预审项目因招标人设置企业或者项目负责人承担过类似工程业绩,导致资格预审合格的申请人不足9家,招标人应当降低企业承担过类似工程业绩条件(量化指标不超过60%)或者取消项目负责人承担过类似工程业绩条件,改为资格后审重新发布招标公告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),采用经评审的最低投标价法的施工招标项目,招标公告或者招标文件中应当明确中标人向招标人提供保函形式的差额履约担保,担保金额为招标控制价和中标价的差值,但不超过中标价的15%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程工程量清单计价规范》,十二位分部分项工程量清单项目编码中,由工程量清单编制人设置的是第五~六位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),有限数量制是指通过初步审查和详细审查的资格预审申请人进行量化打分,按得分顺序通过资格预审的申请人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),类似工程证明材料包含招标公告或者邀请书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "根据现行规范规定,瓷质卫生陶瓷的吸水率最大值是06%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),资格预审项目招标人未设置企业或者项目负责人承担过类似工程条件,通过资格条件审查的申请人不足9家(少于3家除外)的,招标人应邀请所有通过资格预审的申请人参加投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),中型工程是指单项合同估算价在500-2000万元的装饰装修、安装、钢结构、幕墙工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),建筑设计方案招标项目、采用工程总承包的招标项目、政府集中建设的大型及以上或技术复杂项目(不含社会代建项目),可采用评定分离制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司大型航站楼技改综合施工技术研究成果达到国内先进水平",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司承建的南京国际博览中心三期工程荣获中国钢结构金奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "扬子江国际会议中心金属屋面系统工程荣获金禹奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司装配式混凝土剪力墙结构技术创新研究与工程应用获中国建筑集团有限公司科学技术奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "1994年4月4日,三公司中南公司成立",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2009年4月1日,南京南站站房工程开工,工程于2011年8月20日竣工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司承建的安徽亳州民用机场项目是皖北第二个民用机场项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局三公司六个项目首次获得ISA国际安全大奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司南京市大厂污水处理厂新建工程(一期)获全国市政工程最高质量水平评价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "医智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砼智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2021年5月,公司智能装配造桥机10在盐洛高速项目成功运行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司自研的自行走测量机器人在盘城2号保障房项目实现应用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司申报的江苏省数字城市智慧建造与运维工程研究中心获江苏省发改委批复认定,这也是公司获得的首个省级工程研究中心",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2021年两岸企业家峰会于2021年12月7日在公司承建的扬子江国际会议中心举办",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的乔司至南苑连接线工程荣获良渚杯、市优西湖杯、国家优质工程奖等一系列荣誉,也是余杭区第一个市政类国家级奖项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司承建的上海华泰金融大厦工程荣获国家优质工程奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的苏州工业园区体育中心工程荣获全球最佳体育场第二名,荣获鲁班奖和国优奖双奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司承建的财盛大厦是海南建省后的第一幢高层,被称誉为海南速度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司的前身最早可以追溯到新四军皖东游击队",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司的前身部队曾改编为华东野战军建制部队,参加了涟水、孟良崮、淮海等解放山东、安徽和苏北的大小数十次战役和战斗",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1954年1月,水利工程一师师部和两个团改编组成建筑工程第四师后进驻上海市,增补了施工技术力量,对原部队官兵进行了技术培训",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司前身曾先后承建了西北光学仪器厂、东方机械厂、远东机械制造公司等10项重大工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1966年8月至1973年7月,211大队先后隶属基建工程兵整编办公室和基建工程兵西安指挥所,承担了陕西地区的三线建设重任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1973年8月至1978年6月,211大队随基建工程兵22指挥部调驻辽宁省辽阳市,参加国家特大型重点工程辽阳石油化学纤维总厂的建设",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在建设辽化过程中,以参建总人数11%的施工力量完成了施工总面积23%的工作量任务,展现了铁军雄风",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1977年4月后,211大队分批挥师南下,在南京地区及其周边地区建设了南京炼油厂扩建工程、南京烷基苯厂等一批重点工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1977年—1982年,建设南京烷基苯厂,年产烷基苯72万吨,合成洗衣粉25万吨,为当时我国最大的烷基苯生产基地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司企业精神的四大主要精神是奋勇开拓,敢于拼搏的开拓精神；是不畏艰险,勇于牺牲的奉献精神；是追求卓越、勇争第一的争先精神；是不断创新,自我革命的创新精神",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的徐州移动大楼2003年竣工,是公司在徐州市公建领域的第一个国优奖",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2013年,公司再次进入中建号码公司十强之列",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2022年,公司荣获江苏省建筑百强企业总承包类第五名",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京地铁九号线项目,是中建八局2020年承建的合同额、体量最大的新基建项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2021年,公司建设的江苏大剧院、国际青年文化中心、南京市公共卫生医疗中心、溧水区市民中心、侵华日军南京大屠杀遇难同胞纪念馆(三期)五大工程入选南京市十三五十大优秀公共建筑工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京奥林匹克体育中心主体育场工程,荣获2005年全国十大建设科技成就奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1992年7月公司被评为1991年中国500家最大建筑企业,位列第332位；公司被评为1991年中国500家最佳效益建筑企业,位列第149位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1992年12月公司被南京市委、市政府评为1990年-1991年度南京市文明单位三公司东海开发建设总公司被评为1992年度海南省先进驻琼企业西北三公司承建的金昌市青少年娱乐中心五彩城被评为甘肃省省优工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1993年9月公司被江苏省统计局、省建委、省建工局评为1993年度江苏省建安企业综合经济实力50强",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1985年5月4日公司职工胡新民被团中央授予全国重点工程建设新长征突击手称号5月18日共青团江苏省委表彰了公司胡新民青年突击队和谌新华汽修青年突击队为重点建设新长征突击队罗宝利,胡新民、于显德、杨修成、赵焕毅被命名为重点建设新长征突击手",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1985年10月12-13日交通部、江苏省和南京市对南京新生圩港工程组织验收公司承建的一期工程40个单位工程,25个工程质量评定为优良,15个合格,顺利通过正式验收该工程比合同工期提前三个月竣工,确保新生圩港工程按期交工投产",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1985年12月20日公司党委发出通报,表彰胡祖明灭火抢救国家财产的先进事迹机施处工人胡祖明同志在12月12日晚烷基苯厂特大火灾中,奋不顾身,投入灭火战斗,抢救国家财产,南京电视台和南京日报报道了他的事迹公司党委决定给胡祖明记功一次,晋升一级工资",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1986年6月21日共青团中央办公厅表彰了公司施工的南京港新生圩深水泊位码头201仓库和311仓库这两项工程为国家重点建设青年突击工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1986年7月公司装饰大队青年职工苏昭荣在全国建筑青年技术大比武活动中,位列24名,获全国建筑青年技术能手称号,受到晋升一级工资的奖励",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1992年4月16日南京日报报道,1990年3月12日,公司机修厂工程师李祥苟研制的AN型系列冲床安全机械手通过技术鉴定,获得国家发明专利,被评定为90年度国家级新产品同年底,荣获中建八局科技进步一等奖,中建总公司科技成果三等奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1993年2月上海木工机械厂多功能食堂、上海东方航空公司业务办公楼被评为上海市优质工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1993年4月东海三公司承建的海口市体育馆举行竣工典礼,海南省省长阮崇武,副省长毛志君、江啸风,海口市市长曾浩荣等领导出席",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年3月31日建设部原部长萧桐在湖北省武汉市建委领导的陪同下,视察神龙汽车总装车间工程,对总装车间的建设速度和工程质量表示满意5月29日国务院副总理李岚清视察公司承建的武汉神龙汽车有限公司工地,对施工速度和质量表示满意7月7日法国工业部长视察公司承建的武汉神龙汽车有限公司工地,称赞中国工人好样的9月28日中建总公司副总经理孟广水等视察公司承建的武汉神龙汽车有限公司总装车间,对参加施工的职工给予表扬10月18日上午10时,中共中央总书记、国家主席江泽民视察公司承建的武汉神龙汽车有限公司总装车间,对工程建设表示满意",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年6月27日无锡市陈林荣副市长视察无锡商贸中心工地(无锡八佰伴)称赞这个工地现场管理好,进度快7月公司承建的金川公司多功能厅、造矿厂尾矿车间浓密池被评为甘肃省优质样板工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年8月18日公司承建的中国水泥厂2000吨/熟料生产线技改工程开工典礼举行,江苏省副省长王荣、南京市委书记顾浩出席,并为工程奠基",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年12月公司被江苏省委、省政府授予1993～1994年文明单位称号；公司被江苏省建筑协会评为江苏省建筑业最佳企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年4月26日公司施工的南京禄口新机场航站楼地下室提前2天完工,工期共计79天,创造了用最短的工期完成华东地区最大地下室的奇迹新机场建设指挥部向南京公司颁发奖金20万元",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年11月3日－13日公司对质量体系实施情况进行内部审核12月中旬,北京ISO9000认证中心专家对公司进行模拟审核,顺利通过了北京ISO9000质量认证中心的质量体系认证；成为建筑行业首批获取9000认证的企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年12月17日中建总公司总经理马挺贵到公司视察工作,并为公司题词：创辉煌业绩,争同行第一；广招人才,发展科技,再铸辉煌,争创第一",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年12月公司被评为江苏省建筑业最佳企业；江苏省建设系统1994～1995年文明建设先进单位；南京市1994～1995年文明单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2002年4月撤销南京公司,南京及其周边地区项目归公司直接管辖,实现公司扁平化管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2002年7月30日中建总公司总经理孙文杰一行,在中建八局局长梁新向等的陪同下,来到公司施工的山西太原卫星发射中心厂房建设工地进行慰问,孙文杰勉励大家：八局是由基建工程兵改编的企业,在巴丹吉林沙漠优质高速建成的火箭垂直总装测试厂房,为神舟飞船的胜利腾飞做出了贡献今天,又在为中华建造射天之箭,其创造之功,彪炳千秋希望你们发扬大漠精神和解放军的光荣传统,把这个工程建成名留青史的精品工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2002年11月中央政治局委员、军委副主席、国务委员、国防部长曹刚川视察山西太原卫星发射中心厂房建设工地,并接见了公司参建员工,给予了良好评价和鼓励",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2003年7月公司荣获中华全国总工会、国家安全生产管理局共同颁发的全国安康杯竞赛优胜企业称号,这是公司开展安康杯竞赛活动以来获得的最高荣誉",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2009年4月14日江苏省副省长史和平、南京市政协副主席刘建在江苏省援建总指挥梁学忠等的陪同下,视察南京市对口援建项目四川省绵竹市景观立交安置房工程,对工程的工期、质量表示非常满意并指示再接再厉,让灾区群众早日住上新房",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2012年3月30日公司荣获2011年江苏省安全文化建设示范企业荣誉称号,在获此殊荣的江苏省39企业中,三公司是全省唯一的一家建筑施工企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2014年4月28日历任国务院总理李克强同志视察公司承建的重庆轨道六号线大剧院车站,看望建筑工人,向每位劳动者致以节日的问候",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "使命是指一个企业区别于类似企业的持久性目的它反映了一个组织之所以存在的理由或价值使命通常描述的是：我们要做的是什么世界因为我们的存在会有什么不同我们为什么而存在使命是一家企业的志向,它会引领企业的发展,决定企业的愿景；只有强大的使命驱动的力量才会让每一个普通人愿意跨出舒适区,全力以赴去改变自己,成为更好的自己中建集团要求集团上下统一的使命是拓展幸福空间",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,如投标人为联合体投标,除联合体协议书外,投标函部分的格式中要求投标人加盖单位法人章的,均由联合体牵头人使用CA数字证书加盖其单位电子印章,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标函中的安全文明施工费必须按照招标人给出的暂定金额填报,否则视为对招标文件不作实质性响应,其投标文件由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,只能有一个有效报价在招标文件没有规定的情况下,不得提交选择性报价,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,招标人在工程量清单中所列出的价格(包括暂列金额、暂估价等),投标人不得修改,否则其报价作0分处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人的每项清单综合单价报价不得超过每项清单综合单价最高限价,否则其报价作0分处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用暗标评审的,若项目经理答辩过程中透露与投标人企业有关的任何信息的,其投标将被否决",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,投标时投标人的委托代理人须随身携带招标文件要求的所有原件及原件清单,在递交投标文件时一次性递交,不得补交,原件袋必须密封",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,评标委员会审查时必须对有关证明和证件的原件核查,若经审查复印件与原件不一致,或未提交原件的,则投标文件由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,为确保对所有投标人的公开、公平、公正,投标人如果提供网上打印的养老保险证明材料含有电子印章且提供了该地区政府或人社局发布的相关推行参保人员社保证明电子化的佐证材料(可不要求为原件,但必须网上能查询文件属实),可视为原件,不需加盖社保部门公章,投标有效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,投标人递交的纸质投标保函原件应与投标文件中提供的纸质投标保函扫描件一致,否则由评标委员会作否决投标处理,其投标保证金将不予退还",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,以纸质投标保函形式交纳投标保证金的投标人,须在投标文件投标保函部分提供银行开具的投标保函正本复印件,投标保函正本原件随其他要求提供的原件一并放入原件袋中,在递交投标文件时一次性递交退还原件袋时,投标保函正本原件不退还,由招标人保管",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,若投标人为联合体,则由联合体牵头人提供投标保证金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,投标文件应用不褪色的材料书写或打印,应尽量避免涂改、行间插字或删除如果出现上述情况,交由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用纸质投标文件的,《技术方案》面页使用A4厚型白纸面页,用初号仿宋字体居中标明技术方案；在页面右下角加盖投标单位章后沿密封线折叠成腰约10cm左右的等腰直角三角形密封；面页除了技术方案四字和右下角密封处印章外不得有其他印记",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "政府投资5000万元以上的基础设施项目和1000万元以上的公益性项目,其项目建议书、可行性研究报告及总投资概算由市发展改革主管部门组织咨询评估未经咨询评估的,不得批准或转报",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财政性资金,是指财政预算内和预算外资金、土地储备整治收益、政府举债资金及政府接受捐赠的资金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "市财政部门依法对政府投资项目实施财务监督财务监督可根据项目实际情况委派会计或财务总监进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "政府投资项目未经法定程序批准,任何单位和个人不得提高建设标准、扩大建设规模和增加建设内容",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目的勘察、设计、施工、监理、设备材料采购,可以不订立立书面合同",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "可行性研究报告经批准后,项目法人未确定的,应按有关规定确定项目法人；重大公益性项目和项目单位不具备项目建设管理资质的,应按有关规定委托建设管理代理机构,代行项目单位职责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "立项申请经批准后,项目单位方可依次进行可行性研究和初步设计等前期准备工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级政府投资项目中,政府投资未超过项目资本金20%且绝对额未超过1000万元的立项审批不适用于重庆市政府投资项目管理办法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程招标投标活动依法应由招标人负责,招标人自主决定发起招标,自主选择工程建设项目招标代理机构、资格审查方式、招标人代表和评标方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级住房和城乡建设主管部门要结合实际健全完善评标专家动态监管和抽取监督的管理制度,严格履行对评标专家的监管职责建立评标专家考核和退出机制,对存在违法违规行为的评标专家,应取消其评标专家资格,依法依规严肃查处",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标人要求中标人提供履约担保的,招标人应当同时向中标人提供工程款支付担保",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公示期内无异议和投诉的,建设单位应于公示结束后2个工作日内向承包商发出中标通知书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合同的价款、质量、履行期限等主要条款可以与发包公告的内容不一致",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "提交投标文件的投标人少于3个的,招标人应当依法重新招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "两个以上施工企业可以组成一个联合体,签订共同投标协议,以一个投标人的身份共同投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标人不得强制投标人组成联合体共同投标,不得限制投标人之间的竞争",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标文件未按照招标文件的要求予以密封的不影响投标文件的有效性",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标文件中的投标函未加盖投标人的企业及企业法定代表人印章的,或者企业法定代表人委托代理人没有合法、有效的委托书(原件)及委托代理人印章的应当视为无效投标文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依法必须进行施工招标的工程,其评标委员会由招标人的代表和有关技术、经济等方面的专家组成,成员人数为5人以上单数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标委员会的专家成员,应当由招标人从建设行政主管部门及其他有关政府部门确定的专家名册或者工程招标代理机构的专家库内相关专业的专家名单中确定确定专家成员一般应当采取随机抽取的方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "与投标人有利害关系的人不得进入相关工程的评标委员会",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "被取消评标专家资格的人员,可以再参加金额较小的评标活动",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工招标投标的基本情况,包括施工招标范围、施工招标方式、资格审查、开评标过程和确定中标人的方式及理由等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标人未向建设行政主管部门提交施工招标投标情况书面报告的,市级以上地方人民政府建设行政主管部门应当责令改正",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "涉及国家安全、国家秘密、抢险救灾或者属于利用扶贫资金实行以工代赈、需要使用农民工等特殊情况,不适宜进行施工招标的工程,按照国家有关规定可以不进行施工招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依法必须进行招标的项目,实行委托招标的,招标人有权自行选择招标代理机构,任何单位和个人不得以指定、抽取或者其他方式为招标人确定招标代理机构",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《报价评审办法》第十六条中的造价人员是对一级造价工程师、二级造价工程师和原具有全国建设工程造价员资格的造价人员的统称",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "详细评审中的单价遗漏的处理、不平衡报价项目的确定、不平衡报价的处理需设置的偏差幅度值,可以不按《报价评审办法》的规定在招标文件的评标办法中设定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人在编制招标文件时,应当明确要求投标人在编制投标报价时按照招标文件中公布的安全文明施工费及规费金额填报安全文明施工费及规费",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在符合国家相关规定的前提下,由招标人自主决定是否明确投标人在编制投标文件时采用的计税方法当招标文件有明确要求时,投标人应按照招标文件要求执行；当招标文件无明确要求时,由投标人根据国家相关规定自主确定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "由于投标报价可能采用两种不同的计税方法,在投标报价评审时要区分不同的计税方法分别评审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在招标人设置单价遗漏评审、不平衡报价评审的偏差幅度时,应在《报价评审办法》规定的偏差幅度范围内,适当取定较低的偏差幅度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在四川省行政区域内实行工程量清单招标的全部使用国有资金投资或者以国有资金投资为主的房屋建筑和市政工程项目投标报价的评审,适用《四川省房屋建筑和市政工程工程量清单招标投标报价评审办法》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标委员会成员中应具有一级造价工程师执业资格或具有高级职称(造价专业)的造价专业人员标底或招标控制价在1000万元以上的招标项目招标人组建的评标委员会中具有一级造价工程师执业资格或具有高级职称(造价专业)的造价专业人员原则上人数不少于4人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标报价评审按照以下四个步骤进行：①评审准备；②初步评审；③低于成本评审；④详细评审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标报价初步评审包括是否高于招标控制价、造价人员签字盖章专用章、报价唯一、投标报价表格的完整性、已标价工程量清单和算术修正六个方面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《重庆市房屋建筑和市政基础设施工程施工标准招标文件》,采用最低投标价法评标的,可以不要求编制《技术方案》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《重庆市房屋建筑和市政基础设施工程施工标准招标文件》,采用综合评标法,技术方案评分为40分(满分100分)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《四川省房屋建筑和市政工程标准施工招标文件(2021年版)》,采用综合评标法,施工组织设计中出现中建八局的名称,评标人将施工组织设计评为0分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《重庆市房屋建筑和市政基础设施工程施工标准招标文件》,技术方案的内容中出现了下划线,评标人将技术方案评分0分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "初步评审包括形式评审和资格评审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "特别复杂的绿化园林工程,招标人可以要求投标人具有施工总承包二级及以上资质",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "已进行资格预审的项目,投标人应是收到招标人发出投标邀请书的单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标文件应当对招标文件有关工期、投标有效期、质量要求、技术标准和要求、招标范围等实质性内容作出响应",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在2021版四川招标文件评标办法中,基准价＝招标控制价相应价格×k1+各有效投标的评审价的算术平均值×K2×k3",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "评标委员会在评标过程中,如要求投标人澄清或说明的,投标人未在规定时间内作出澄清或说明的,可以作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标文件中的大写金额与小写金额不一致时,以小写金额为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "超越资质等级取得的业绩,可以作为有效业绩认定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在投标活动中,投标人串通投标、弄虚作假的,投标保证金可不予退还",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标文件所有要求盖章的地方,可以正常使用专用印章(如经济合同章、投标专用章等)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "不按评标委员会要求澄清、说明或补正的,可视情况其投标不作否决投标处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "评标基准价计算方法中,k2是指招标控制价相应价格在基准价中所占权重",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "可以对招标文件规定的投标文件格式的内容进行改变原意或影响投标实质性的删减或修改",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在投标活动中,投标人串通投标、弄虚作假的或中标人在收到中标通知书后,无正当理由拒签合同协议书的,投标保证金也不予退还",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标文件可以对招标文件提出的所有实质性要求和条件作出实质性响应,并且实质性响应的内容不得互相矛盾",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "投标文件所附证明材料应清晰可辨",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在线递交的数据电文形式投标文件,可以经投标人数字证书加密",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "无论是采用综合评估法还是经评审的最低投标价法,不保证报价最低的投标人中标,也不解释原因",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涉及到工程量清单、招标控制价和评标办法修改的,应将修改后的招标文件作为附件上传,对招标文件的所有修改内容应在修改文件正文中全部列出,新上传的招标文件中修改内容与修改文件正文不一致的,以修改文件正文为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "转账的投标保证金应在投标截止时间前到达系统指定账户",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "数据电文形式投标文件中有的要求签字的地方可以不使用电子签章",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标人在规定的投标有效期内撤销或修改其投标文件,不影响投标保证金的退还",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "所有进入评标环节的投标人中信用综合评价得分的权重折算分最高的得满分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标报价若为招标控制价的8549％时,则不视为低于成本报价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "成都市关于施工总承包的招标方式采用不见面开标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "信用入库包括智慧工地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "信用入库不包括信用评价体系",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "信用入库包括农民工实名制、工资支付体系",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,需上传不加密的电子投标文件至重庆市电子招投标系统投标人如需递交加密的电子投标文件,应用投标文件袋单独封装",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,解密方式分为：开标现场解密和远程解密",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,因投标人原因未完成解密工作的,视为撤销其投标文件,其投标保证金不予退还",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市规定依法必须招标的施工类项目,应当采用经评审的最低投标价法其中,技术特别复杂或者招标人对其技术、性能有特殊要求,需要采用综合评估法的,招标人应当取得行业主管部门认定后报同级招标投标行政监管部门同意",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "因投标人原因未完成解密工作的,不影响投标文件的退还",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市公共资源管理局发布2020年版招标文件范本规定,国有资金投资的建设工程招标,招标人必须编制最高限价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,投标人被列入《重庆市工程建设领域招标投标信用管理暂行办法》规定的重点关注名单且记分达到12分且在记分有效期内的,将被否决投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人无需在投标文件中放项目其他主要管理人员相关证件,只需按招标文件要求作出承诺即可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "委托代理人可以为非投标人本单位人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人应认真填写工程量清单中所列的本合同各工程子目的单价或总价投标人没有填入单价或总价的工程子目,招标人将认为该子目的价款未计入在工程量清单其他子目的单价和总价中",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人必须按招标工程量清单填报价格项目编码、项目名称、项目特征、计量单位、工程量必须与招标工程量清单一致否则交由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标函中的总报价必须与已标价工程量清单总报价一致,且工程量清单总报价与依据单价、工程数量、分部分项工程合价计算出的结果应一致,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人如发现工程量清单中的数量与图纸中数量不一致,投标人可自行予以更正",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,招标人在工程量清单中所列出的价格(包括暂列金额、暂估价等),投标人不得修改,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人的投标总报价不得超过投标总报价最高限价,否则由评标委员会作否决投标处理,并扣除其投标保证金",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据重庆市公共资源交易中心《关于开展公共资源交易市场主体信息登记工作的公告》的要求,投标人在开标前需在重庆市公共资源交易网(wwwcqggzycom)办理市场主体信息登记手续",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的投标文件应使用专用的新点投标文件制作软件(重庆版)编制而成第八章投标文件格式要求法定代表人或其委托代理人签字(或盖章)的须齐全,要求加盖单位法人章的,应使用CA数字证书加盖投标人的单位电子印章",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的电子投标文件由投标人使用专用的新点投标文件制作软件(重庆版)制作生成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的电子投标文件制作完成后,将生成一份加密的电子投标文件(后缀名为CQTF)和一份不加密的电子投标文件(后缀名为nCQTF),投标人需同时递交加密电子投标文件和不加密电子投标文件,否则其投标将被否决",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,投标人如需递交不加密电子投标文件的,应将不加密的电子投标文件复制到一张光盘中,光盘表面粘贴标签贴加盖单位法人章,并按招标文件要求将招标项目名称、投标人名称等信息填写在标签贴上",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人违反技术部分暗标编制要求,采用经评审的最低投标价法的其投标文件《技术方案》符合性评审不合格,由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人违反技术部分暗标编制要求,采用综合评估法的其投标文件《技术方案》符合性评审不合格,由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,未按要求加密的电子投标文件,将无法上传至重庆市电子招投标系统,逾期未完成上传投标文件的,视为撤回投标文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,投标人如需递交不加密电子投标文件,应用投标文件袋单独封装,并在封口处加盖投标人单位法人章,同时投标文件袋应按招标文件要求写明相应内容投标文件袋未按要求密封的,招标人或代理机构应该拒收并按否决投标处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用经评审的最低投标价法的,中标价低于最高限价的85%时提供低价风险担保,如不按时足额提供,视为中标人放弃中标,招标人有权不退还其投标保证金,并报招标投标行政监督部门按照信用管理办法的规定处理,对中标人的不良行为直接记12分,纳入重点关注名单",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,对资格预审文件或者招标文件的评标标准和方法,以及资格审查和否决投标条款理解有争议的,应当作出有利于招标人的解释,但违背国家利益、社会公共利益的除外",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,对投标文件理解有争议的,应当作出不利于提交该投标文件的投标人的解释",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用经评审的最低投标价法的,投标总报价低于最高限价85%的,投标人应在编制投标文件时,在投标函部分中无需递交低价风险担保缴纳承诺书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用经评审的最低投标价法的,符合性审查合格的投标人中,报价最低的成为第一中标候选人,报价次低的成为第二中标候选人,依次类推",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标文件中投标报价的大写金额与小写金额不一致的,以大写金额为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,在评标过程中,评标委员会可以书面形式要求投标人对所提交投标文件中不明确的内容进行书面澄清或说明,或者对细微偏差进行补正投标人也可主动以书面形式向评标委员会提出澄清、说明或补正",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,编制投标文件时不得对第八章投标文件格式的相应要素作实质性修改,否则视为重大偏差,由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,第八章投标文件格式(不含投标函部分)要求法定代表人或其委托代理人签字(或盖章)的须齐全,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,第八章投标文件格式(不含投标函部分)要求加盖单位法人章的,应使用CA数字证书加盖投标人的单位电子印章,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人名称可以不与营业执照、资质证书、安全生产许可证一致,依法变更名称的提交相应证明材料即可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,联合体参与投标的应提交联合体协议书,并明确联合体牵头人在联合体协议中须明确由联合体牵头人或联合体成员单位委派委托代理人,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,投标人法定代表人的委托代理人有法定代表人签署的授权委托书和投标人或投标人全资子公司为其缴纳的养老保险证明材料否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程结算时限超过6个月,不属于中建股份项目承接底线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重庆市行政区域内依法必须招标的项目,依照2020年版招标文件范本规定,采用全流程电子招投标的,投标函部分的格式要求法定代表人或其委托代理人签字(或盖章)的须齐全,要求加盖单位法人章的,应使用CA数字证书加盖投标人的单位电子印章,否则由评标委员会作否决投标处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：PPP在中国被称为政府和社会资本合作模式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：根据局投资管理要求,对于我方与外部单位合作开展且我方股权比例较小的PPP项目,原则上我方不得作为牵头方,不得承担项目融资责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：PPP项目公司设立后,由项目公司负责项目全生命周期管理,包括投资、建设、运营等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：A类基础设施业务具体包含市政道路、公路工程、城市轨交、铁路工程、水利水电、港口与码头、地下综合管廊(盾构法施工)、河道治理新拓展的线型基础设施业务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：融投资带动总承包项目指为获取项目施工总承包权,而对项目进行大额度融资或投资、并按约定收回我方投入的本金及利息的项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：根据局投资管理要求,对于投融资带动总承包项目,项目公司不应纳入我方合并会计报表范围",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：根据局《A类基础设施项目投资业务指引》,基础设施类投资项目上报跟踪,局二级单位经内部评审后,报送至分局/办事处审批(若项目所在地无分局/办事处,则直接报至基础设施事业部),通过后由二级单位报局基础设施事业部进行评估、评审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：根据局《投资管理手册》对立项管理的规定,房地产投资项目由东孚公司主张；基础部负责基础设施投资项目的跟踪、立项、可研、投标；投资公司以高端公建业务、创新创投业务和城镇综合建设为主要拓展领域",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：股份公司批复实施前提条件未落实,原则上不得设立项目公司、签订PPP投资合同、实质性出资或开工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：根据中建股份投资管理要求,项目投资预算经局董事会审批通过后需上报股份公司",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：PPP类投资项目经局董事会审批通过后方可参与投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：地方政府本级一般公共预算收入统计口径包含地方本级收入、上级政府对本级政府的税收返还和一般性转移支付、下级政府对本级政府的上解收入、上年结余收入、调入预算稳定调节基金、调入资金、债务收入及其他收入等",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：根据局投资管理规定,在签订PPP合同前,若政府未能完成项目PPP模式合法合规手续,则必须在PPP合同中约定,政府应在PPP合同签订之日起3个月内完成PPP模式合法合规手续,并将项目纳入财政部政府和社会资本合作(PPP)综合信息平台项目管理库(执行阶段)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：根据局投资管理规定,在PPP项目执行阶段中,为保障项目的施工进度,我方可以适当垫资",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：根据局《投资管理手册》规定,若PPP项目合作期限超过15年,应在协议中明确我方享有在运营期内通过引入外部投资者或资产证券化等方式提前收回投资的权利",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：己通过立项审批,并取得授权委托书的单位,如相当长时间内营销工作无实质性进展或新的重大突破,局总部可视情况取消其营销授权",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：协同公司不需配置专职A类基础设施营销、投资人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：局协同项目指有两家或超过两家的局属二级单位自愿或通过局协调后,联合、共同参与同一项目的营销或生产工作的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：项目中标后,根据项目性质组织相关人员进行的设计专项策划；对于EPC、PPP模式等处于设计阶段的项目,主要以与设计单位协调后入图为主",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：报名阶段项目名称发生改变的,不需先向局基础设施事业部提出名称变更申请",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：对于招标文件评审,所有投标工程均先由三级单位组织评审,各部门根据《CSCEC8B-CL-2019合约法务管理手册》重大风险管理规定及评审表要求组织评审,并根据工程分类和风险规定逐级上报审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：投标拟派项目经理为局控项目经理的,当属于本单位自有项目经理,不需向局基础设施事业部核准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：各级提请的各类评审信息必须真实有效,营销过程中相关信息发生重大变化应及时向局基础设施事业部/二级单位总部做出说明",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：局控项目经理主要指近5年有获得过全国优秀项目经理(全国优秀建造师)、国家级优质工程奖(主要包括鲁班奖、国优、詹天佑、钢结构金奖)或局重大工程的持证项目经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：5亿元以下基础设施类项目不需进行投标总结",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "考试：F+EPC属于投资类项目,在办事处、分局审批范围",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：设计负责人能作为EPC项目的项目经理,设计负责人的业绩可以作为EPC项目经理业绩",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：初步设计结束后进行EPC招标的评标办法中,施工图设计部分需要进行评分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：EPC项目招标中以银行保函形式递交投标保证金的,只接受投标人基本账户开户银行出具的保函形式的投标担保",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：在EPC项目招标中,设计文件得分不得带入第二阶段评审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "考试：工程总承包项目招标可以采用评定分离的程序和方法进行评标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：工程总承包资格预审文件中资格审查合格条件设置类似工程业绩条件时,总承包项目经理业绩和投标人类似工程业绩为可选条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "考试：城市公园园林绿化工程不可采用工程总承包模式发包",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：工程总承包项目招标,投标人类似工程业绩评分因素中,以联合体方式投标的,参加本次投标联合体的设计单位和施工单位承担过的工程总承包业绩均可加分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：不是工程总承包项目全过程工程咨询服务单位的勘察设计文件编制单位可以参加工程总承包项目的投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：工程总承包项目的合同价格形式一般为固定总价合同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：工程总承包项目招标评标办法中,可在项目管理组织方案部分设置项目经理陈述和答辩",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：工程总承包项目招标中,设置企业应当具有的类似工程业绩时,量化指标设置要求需要遵守苏建规字〔2017〕1号文",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考试：工程总承包招标人在方案设计或者初步设计完成后招标的,提供初步勘察报告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考试：可行性研究或者方案设计、初步设计应当履行审批手续的,经批准后方可进行下一阶段的工程总承包招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考试：苏州建筑业企业信用分奖励得分中,省内获得的鲁班奖都可以加分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对资格预审申请文件中不明确的内容或者缺乏证明材料的,资格审查委员会可以要求申请人进行澄清澄清应当采用口头形式,并不得改变资格预审申请文件的实质性内容",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标人存在串通投标、以他人名义投标、弄虚作假等违法违规行为,或者无正当理由放弃投标、中标资格,造成项目招标失败的,不得参加该项目重新招标的投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资格预审项目招标人未设置企业或者项目负责人承担过类似工程条件,通过资格条件审查的申请人不足9家(少于3家除外)的,招标人应邀请所有通过资格预审的申请人参加投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "类似工程期限一般不得低于3年,以竣工验收时间为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "类似工程期限一般不得低于3年,以中标通知书发出时间为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "类似工程期限一般不低于3年,以合同签订时间为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "评定分离方法包括：票决法、抽签法、集体议事法或招标文件规定的其他定标方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业或者项目负责人承担过类似工程属于资格审查必要条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用评定分离方法招标的,招标人可以在评标委员会推荐的定标候选人名单中自主决定排序",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用工程总承包的招标项目、政府集中建设的大型及以上或技术复杂项目(包含社会代建项目),可采用评定分离制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合格制资格预审的,招标人必须邀请所有资格预审合格的申请人参加投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用合格制资格预审的,招标人可以邀请部分资格预审合格的申请人参加投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合理低价法、合理价随机确定中标人法以及经评审的最低投标价评标法,招标人要求投标人编制施工组织设计的,应在招标文件中明确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合理低价法、合理价随机确定中标人法招标的工程可以要求编制施工组织设计",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采用合理低价法不得要求编制施工组织设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用合理低价法和经评审的最低投标价法,一般以投标报价作为评审因素",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人的,自招标文件开始发出之日起至递交投标文件截止之日止不少于10日",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人法的,招标人对已发出的招标文件进行必要的澄清或者修改,澄清或者修改的内容可能影响投标文件编制的,应当在递交投标文件截止时间至少3日前",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人法的,招标人应在招标文件中载明招标控制价及其组成、发包价及其组成或者计算方法、资格审查条件、投标承诺格式等内容",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人法的,自招标文件开始发出之日起至递交投标文件截止之日止不少于7个工作日",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人法的工程项目可以设置企业或者项目负责人承担过类似工程作为合格条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用经评审的最低投标价法和合理低价法的,一般在评标入围评审后,确定评标入围的投标人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用经评审的最低投标价法招标人不可以增加投标人市场信用评价作为评审因素",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用两阶段评标法,根据投标人数量,技术标评分得分取投标人为9-11个的,取前7名可进入第二阶段开、评标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用有限数量制,通过资格条件审查的申请人多于9个的,招标人应当按照资格审查评审办法选择不少于9个通过资格预审的申请人参加投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用有限数量制的,招标人应当制定具体的有限数量制资格预审办法,并在招标公告和资格预审文件中明确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用有限数量制资格预审的,应公布中标候选人的资格审查得分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用有限数量制资格预审的,招标人应当按得分由高到低顺序选择不少于7家单位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用资格预审的项目,对于异议或投诉反映的内容需要重新评审的,由原评标委员会或者原资格审查委员会(在招标文件中明确)重新评审,但不因此重新确定投标人入围资格和评标基准价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用资格预审的项目,投标人或者其他利害关系人对中标候选人的资格审查结果有异议或投诉的,应当在中标候选人公示期后提出",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用资格后审的工程项目,均需设置企业或者项目负责人承担过类似工程作为合格条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采用资格后审的评标报告中不包括对投标人进行资格审查的情况",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用资格预审的项目,还应当公示中标候选人资格预审的相关信息,包括企业或项目负责人奖项、业绩等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用资格预审的项目,投标人或者其他利害关系人对中标候选人的资格审查结果有异议或投诉的,应当在中标候选人公示期间提出",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用综合评估法的,投标报价评审因素不得少于80分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采用综合评估法的工程,提倡实行两阶段评标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用综合评估法评标项目,施工组织设计中除缺少相应内容的评审要点不得分外,其它各项评审要点得分不应低于评审要点满分的70%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用综合评估法且技术复杂的项目施工招标,必须采用远程异地评标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "除不可抗力外,资格预审合格的投标人无故不获取招标文件或者获取招标文件后放弃投标,或者投标人在投标截止后无故撤销投标文件等,公示3个月",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "除不可抗力外,资格预审合格的投标人存在无故不获取招标文件的失信行为,公示2个月",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "除综合评估法外,采用经评审的最低投标价法、合理低价法、合理价随机确定中标人法的,招标人也可以增加投标人市场信用评价作为评审因素,所占权重一般为2-6%,具体评审方法应当在招标文件中明确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人法的,自招标文件开始发出之日起至递交投标文件截止之日止不少于10日",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合格制是指对通过初步审查和详细审查的资格预审申请人进行量化打分,按得分高低顺序确定通过资格预审的申请人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合格制是指凡符合资格预审公告或者资格预审文件规定资格审查标准的申请人均通过资格审查",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合理价随机确定中标人法招标的不得要求编制施工组织设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "技术标评审打分制一般适用于综合评估法、和合理低价法",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "技术复杂的特大型工程设置面积、造价量化规模指标时,不应超过招标工程响应指标的60%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "经评审的最低投标价法、合理低价法、合理价随机确定中标人法,适用于具有通用技术标准或者招标人对其技术、性能没有特殊要求的工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "具有通用技术标准的工程项目一般应当采用合格制资格预审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "联合体参加投标的,联合体成员当中其中一个单位具备项目相适应的施工资质即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "市场开发风险主要包括市场容量风险、价格竞争风险、经营行为风险和市场壁垒风险其中,市场容量风险是当前国内建筑市场主要风险,务必防范不良经营行为导致的资质降级、停牌等处罚,确保企业安全、平稳运营",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "市场开发风险主要包括市场容量风险、价格竞争风险、经营行为风险和市场壁垒风险其中,市场容量风险是当前国内建筑市场主要风险,务必防范不良经营行为导致的资质降级、停牌等处罚,确保企业安全、平稳运营",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "市场开发风险主要包括市场容量风险、价格竞争风险、经营行为风险和市场壁垒风险其中,市场容量风险是当前国内建筑市场主要风险,务必防范不良经营行为导致的资质降级、停牌等处罚,确保企业安全、平稳运营【市场部《市场营销管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),采用有限数量制的,招标人应当制定具体的有限数量制资格预审办法,并在招标公告和资格预审文件中明确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),采用有限数量制资格预审的,应公布中标候选人的资格审查得分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),采用有限数量制资格预审的,招标人应当按得分由高到低顺序选择不少于7家单位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),采用资格预审的项目,对于异议或投诉反映的内容需要重新评审的,由原评标委员会或者原资格审查委员会(在招标文件中明确)重新评审,但不因此重新确定投标人入围资格和评标基准价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),凡招标文件未集中单列的无效标条款,评标委员会不得作为否决投标、判定无效标的依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),公开招标项目采用合理价随机确定中标候选人法的,自招标文件开始发出之日起至递交投标文件截止之日止不少于20日",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),国有资金投资的大型房屋建筑和市政工程项目施工招标、技术复杂或者技术要求特别高的,在评标方法上宜实行两阶段评标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),国有资金占控股或者主导地位的房屋建筑和市政基础设施项目的施工、货物、服务,以单项合同估算价是否超过依法必须招标的规模标准确定是否必须招标发包",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),国有资金占控股或者主导地位的依法必须进行招标的项目,若采用公开招标方式的费用占项目合同金额的比例过大,可以邀请招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),国有资金占控股或主导地位的工程建设项目,发包人自主决定采用招标发包或直接发包,以及是否进入公共资源交易平台进行交易",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),国有资金占主导地位的建设工程项目以项目总投资额是否达到依法必须招标的规模标准确定是否必须招标发包",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),合格制是指对通过初步审查和详细审查的资格预审申请人进行量化打分,按得分高低顺序确定通过资格预审的申请人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),合格制是指凡符合资格预审公告或者资格预审文件规定资格审查标准的申请人均通过资格审查",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),技术标评审打分制一般适用于综合评估法、和合理低价法",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),甲公司与乙公司组成联合体投标,甲公司与乙公司必须是同一专业",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),类似工程期限一般不低于3年,以竣工验收时间为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),企业的资质类别、等级和项目负责人注册专业、资格等级符合国家有关规定是资格审查的必备条件之一",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),类似工程是指项目在高度、面积、造价、层次、跨度、结构形式、施工工艺、特殊施工技术等量化指标与招标工程相类似",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),设置同类工程业绩一般只能设置不超过2个量化指标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),施工招标需要对施工组织设计进行评分的,评标委员会成员数量为不少于7人的单数其中,评审技术标的评委不少于5人的单数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),施工组织设计的评审分为合格制和打分制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),提交投标文件的投标人少于三个的,招标人应当依法重新招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),投标报价低于工程成本或者高于招标文件设定的招标控制价或者招标人设置的投标限价的,其投标有效",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),投标文件确定的项目负责人与资格预审结果不一致的,采用有限数量制资格预审的,应当在投标文件截止时间前征得招标人书面同意(项目负责人进行答辩的不得更换),并由原来资格审查委员会审查确定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),投标文件未按招标文件要求提供投标保证金的的,属于重大偏差,视为未能对招标文件作出实质性响应,应当作为无效投标予以否决",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),投标文件中投标人资质条件不符合国家有关规定,或者不满足招标文件规定的资格条件的情况属于无效标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),投标文件中已标价工程量清单与招标文件规定的暂估价、暂列金额及甲供材料价格不一致的,评定为无效标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),投标有效期从递交投标文件截止日起计算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),项目负责人不得同时在两个或者两个以上单位受聘或者执业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),信息发布时间不应当包含连续3日及以上的节假日时间,开始时间应为工作日,结束时间也应是工作日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),因招投标当事人异议、投诉改变拟中标人的,应当重新公示拟中标人,公示期不得少于3日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),用经评审的最低投标价评标法,招标人可以要求投标人编制施工组织设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),用综合评估法的,可在初步评审结束后进入评标入围环节,确定评标入围的投标人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),在不同媒介发布的招标公告、招标文件内容应当一致,否则应当重新发布招标公告",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),在建工程是指处于中标结果公告(直接发包的项目以网上合同备案为准)到合同约定的工程全部完成竣工验收合格期间的工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),单位负责人为同一人或者存在股权关系的不同单位,不能作为资格预审申请人或者投标人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),法定代表人有行贿犯罪记录且自记录之日起未超过3年的,不能作为资格预审申请人或者投标人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《省住房和城乡建设厅关于改革和完善房屋建筑和市政基础设施工程招标投标制度的实施意见》(苏建规字(2017)1号文),企业或者项目负责人承担过类似工程,类似工程业绩企业或者项目负责人仅可分别选1个",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "所有的质数都是奇数()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "不相交的两条直线叫做平行线()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "互质的两个数一定是互质数()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2015年,公司再次进入中建号码公司十强之列",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程建设范围、建设规模、建设标准、功能需求、投资限额、工程质量、工程进度等前期条件不明确、不充分的项目不宜采用工程总承包方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程总承包招标可以采用合格制资格预审或者资格后审,不得采用有限数量制资格预审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "资格预审分为合格制和有限数量制两种方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资格审查的方式选用应当符合下列规定：对于特大型且技术复杂的工程项目,应该选用有限数量制资格预审,对有限数量制的使用应当严格控制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标代理机构的人员可以担任其所代理项目的评标委员会成员或者资格审查委员会成员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "我司可以使用八局三公司名义签约海外项目总包合同",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "境外项目投标风险清单中,不包含货币的汇率风险",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "境外项目拟投标金额大于5亿美元,被视为风险识别项之一",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "我司可以申请使用中建八局名义,参与经援项目的招投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "境外项目建设方有融资需求时,可以寻求银团提供贷款,中信保为银团的贷款提供保险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "境外项目如需施工企业垫资,中信保也可提供保险对冲风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合作伙伴风险中,结合客户属性,政府客户重点考虑其财政收支平衡,开发商主要考虑其销售、回款情况",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国家实行建设工程招投标的目的是为了加强国家对建设工程的管理力度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "联合体投标,其资质由组成联合体中资质最高的单位资质所确定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《招投标法》的规定,招标人修改招标文件,必须在规定的投标文件提交的截止时间前15天进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "作为招标方式的一种,邀请招标是最公开、公正、公平的方式、它是一种无限制的竞争方式,在世界上被广泛地采用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标是承包单位以提报标价的形式争取承包建设工程项目的经济活动,是目前承包商取得工程项目的一种最常见的行之有效的活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "货物的到岸价,等于货价加上在途运费",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在考虑投标报价时应遵循既能够中标,又有利可图的原则",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "凡不满足招标条件的施工招标只需委托代理机构招标即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "施工合同履行充满了风险,而投标行为则无风险可言",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程索赔中的工期索赔和费用索赔互为因果关系",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标人响应招标人的要求参加投标竞争,也就是投标人在同意招标文件中所提的条件和要求的前提下,对招标项目估算自己的报价,在规定的日期内填写标书并递交给招标人,参加竞争并争取中标,这个过程成为投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建设工程物资采购合同是双务、有偿、诺成要式的合同",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标过程分为三个阶段：准备阶段、招标投标阶段、评标定标阶段",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中标通知书发出30天内,中标单位应与建设单位依据招标文件、投标书等签订工程承包合同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标文件中的大小写金额不一致的,以小写金额为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建设工程施工合同范本由≤协议书≥、≤通用条款≥、≤专用条款≥三部分组成,并附有三个附件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "供货方到现场的交货日期,以采购方接收货物时在货单上签收的日期为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "FIDIC施工合同条件中规定的合同有效期,是指从工程师按合同约定办发布的开工令中指明的应开工之日起,至工程接收证书注明的竣工日止的日历天数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程师收到承包人递交的索赔报告和有关资料后,应在28内给予答复,否则视为对方赔偿要求已经认可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "FIDIC合同条件中规定,业主的索赔主要限于施工质量缺陷和拖延工期等违约行为导致的业主损失",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "承包商按照合同规定时间提出索赔意向和索赔报告,则失去对该事件请求的索赔权利",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在承包商提出的费用索赔中,以实际损失为依据,因此其索赔金额均不应包括利润",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "FIDIC合同条件,监理工程师有权批准工程分包",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "FIDIC合同条件规定,诉讼是解决合同争议的最终方式",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程招标必须采用公开招标方式",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "≤工程建设监理委托合同≥是由标准条件和专用条件俩部分组成的通用文本",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "某建筑工程公司下属第四分公司领有营业执照,依法可以承包工程,因此,分公司是一个独立的企业法人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "经济合同当事人之间发生纠纷时,双方可以约定：请求仲裁或向法院起诉,二者只能选其一",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我国≤民法通则≥规定,向人民法院请求保护民事权利的普通诉讼事项时效为2年",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "要约是希望他人向自己发出要约的意思表示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "违约责任的表现形式包括不履行和不适当履行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标过程划分为三个阶段：准备阶段、招标投标阶段、评标定标阶段",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程师可以以口头方式通知承包人推迟开工日期",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "FIDIC施工合同规定以投标截止日期前第28天定义为基准日作为业主与承包商划分合同风险的时间点",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当工程是确定的索赔额超过其权限范围时,必须报请发包人批准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "索赔是事件发生后,承包人应在索赔事件发生后的28天内向工程师递交索赔意向通知,生命将对此事件提出索赔",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标文件中有投标保证金要求的,保证金不得超过投标总价的百分之二",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "申请人在规定的提交截止时间前,不可以对已经提交的资格预审申请文件进行替换或者撤回",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人采用资格预审方式对申请人进行资格审查的,应当组建资格审查委员会",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "应当回避担任资格审查委员会成员的人参与评审的按照相关规定重新组建资格审查委员会进行评审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标文件确定的项目负责人与资格预审结果不一致的,采用有限数量制资格预审的,应当在投标文件截止时间前征得招标人书面同意(项目负责人进行答辩的不得更换),并由原资格审查委员会审查确定；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标文件确定的项目负责人与资格预审结果不一致的,采用合格制资格预审的项目,应当在投标文件截止时间前征得招标人书面同意,在评标时,由评标委员会按照资格预审文件规定的标准和方法审查确认",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "经评审的最低投标价法、合理低价法、合理价随机确定中标人法,适用于技术复杂工程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "类似工程证明材料一般为合同、竣工验收证明及招标工程的中标通知书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "综合评估法一般适用于技术复杂工程或者特大型工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用装配式等新型技术建设的房屋建筑的住宅小区属于技术复杂工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "15万吨/日以上污水泵站或雨水泵站属于技术复杂工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "博物馆属于技术复杂工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工组织设计文件不符合篇幅要求属于递交无竞争力的投标文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标报价畸高属于递交无竞争力的投标文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在江苏省建设工程主要管理人员配备标准中土木、线路管道、设备安装、市政基础设施工程造价为16000,施工员、安全员、质量员不少于4人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在江苏省建设工程主要管理人员配备标准中建筑面积在50000㎡以上的房屋建筑、装修工程面积为100000㎡,施工员、安全员、质量员各不少于4人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑面积5万平或工程合同价1亿元以下的工程项目,项目技术负责人应具有与工程项目相适应专业的中级及以上技术职称,并具有5年以上工程施工现场管理工作经验",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑面积5万平或工程合同价2亿元以上的工程项目,项目技术负责人应具有与工程项目相适应专业的高级及以上技术职称,并具有8年以上工程施工现场管理工作经验",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对于具有通用技术标准的工程项目,一般应当采用资格预审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "对于大型且技术复杂的工程项目,可以采用合格制资格预审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于特大型且技术复杂的工程项目,可以选用有限数量制资格预审,对有限数量制的使用应当严格控制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用资格后审的工程项目,设置企业或者项目负责人承担过类似工程作为合格条件,仅限于技术复杂或者大型及以上工程项目、采用合理价随机确定中标人法的工程项目和无资质要求的专业工程项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资格审查可选条件：企业或者项目负责人承担过类似工程(类似工程业绩企业或者项目负责人仅可选1个,时间范围不得少于3年)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "钢结构部分不超过总承包50%的施工总承包项目,招标人在招标文件里要求投标人同时具备总承包资质承接范围内的专业承包资质的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢结构部分超过总承包50%的施工总承包项目,招标人在招标文件里要求投标人同时具备总承包资质承接范围内的专业承包资质的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单一的房屋建筑或市政工程总承包招标时,一个招标项目(标段)要求投标人同时具备两个及以上类别的总承包资质的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "专业工程发包,招标人要求投标人同时具备两个及以上的专业承包资质的,不允许联合体参加投标的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目负责人是非变更后无在建工程,或项目负责人是变更后无在建工程(必须原合同工期已满且变更备案之日已满6个月),或因非承包方原因致使工程项目停工或因故不能按期开工、且已办理了项目负责人解锁手续,或项目负责人有在建工程,但该在建工程与本次招标的工程属于同一工程项目、同一项目批文、同一施工地点分段发包或分期施工的情况且总的工程规模在项目负责人执业范围之内在资格审查必要条件中,项目负责人必须满足此条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业的资质类别、等级和项目负责人注册专业、资格等级符合国家有关规定是资格审查的必要条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业的资质类别、等级和项目负责人注册专业、资格等级符合国家有关规定是资格审查的可选条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业和拟派项目负责人近2年内没有因串通投标、弄虚作假、以他人名义投标、骗取中标、转包、违法分包等违法行为受到建设等有关部门行政处罚的是资格审查的必要条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业近1年内没有无正当理由放弃中标资格(不含项目负责人多投多中后放弃)、不与招标人订立合同、拒不提供履约担保情形是资格审查的必要条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业近三个月内没有因拖欠工人工资被招标项目所在地省、市、县(市、区)建设行政主管部门通报批评是资格审查的必要条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标人或者拟派项目负责人近五年内在招标人之前的工程中没有履约评价不合格的(履约评价不合格的名单应当在资格预审公告与招标公告中予以明示)是资格审查的必要条件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用有限数量制资格预审的,通过资格条件审查的申请人多于9家的,招标人应当按得分由高到低顺序选择不少于9家通过资格预审的申请人参加投标,其通过资格预审不少于9家合格投标人的数量应当在招标公告中明确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资格预审项目招标人未设置企业或者项目负责人承担过类似工程条件,通过资格条件审查的申请人不足9家(少于3家除外)的,招标人可以不邀请所有通过资格预审的申请人参加投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2013年,公司再次进入中建号码公司十强之列",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1、从管控维度看,主要分为局控工程和公司管控工程,局控工程一般指局责任状项目,其他均为公司管控工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2、从资质维度看,主要分为局资质项目和子公司资质项目,分别指使用局资质和子公司资质承接的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "3、分公司市场客户部是区域市场协调的第一责任单位,对辖区内的市场准入、工程协调负责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "4、各二级单位可以随意跨各自经营区域承揽业务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "5、投标专业小组通常包括外联组、商务组、方案组和综合组",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "6、各二级单位应以所在中心城市及本单位传统优势市场为营销重点区域,未得到公司的批准,不得超出现有市场区域开展营销活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "7、在投标阶段,可以适当放松与客户之间的交流沟通",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "8、客户全面履约内容主要包括沟通互动、过程履约、满意度调查和投诉处理四个方面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "9、申请人在规定的资格审查申请文件提交截止时间后,可以对已经提交的资格预审申请文件进行替换或者撤回",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "10、不同投标人的电子投标文件出自同一台电脑的,属于投标人相互串通投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目中无国有资金可以进行邀请招标；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "11、根据《招标投标法》的规定,中标人的投标应当符合能够最大限度地满足招标文件中规定的各项综合评价标准并且经评审的投标价格最低",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "主要工艺、技术需要采用特定专利或者专有技术的项目经过行审批,可以不进行招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "12、备选方案招标人可以采用也可以不采用,所以投标人可以直接提交备选方案的投标文件来响应招标文件的要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标代理机构与行政机关和其他国家机关可以存在隶属关系或者其他利益关系",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "13、根据《中华人民共和国招标投标法》规定,依法必须进行招标的项目,其招标投标活动可以在省级行政区域内作限制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标文件或者资格预审文件出售时间不得少于五个工作日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "14、招标人不得以不合理的条件限制或者排斥潜在投标人,对潜在投标人实行歧视待遇,强制要求投标人组成联合体共同投标,或者限制投标人之间的竞争",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "需要编制施工组织设计的招标文件,自招标文件开始发出之日起至提交投标文件截止之日止,最短不得少于二十日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "15、如果投标人在投标有效期内补充、修改、撤回投标文件,招标人无权没收其投标保证金并要求其赔偿损失",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "无需编制施工组织设计、服务大纲或设备安装调试方案等技术标评审内容的,自招标文件开始发出之日起至递交投标文件截止之日止不少于10日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "16、工程总承包企业具有与工程规模相适应的工程设计资质或施工资质即具备投标资格,不得要求具备与工程相适应的设计资质和施工资质",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用合理价随机确定中标人法的,自招标文件开始发出之日起至递交投标文件截止之日止不少于7日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "17、投标人发生合并、分立、破产等重大变化的,应当及时书面告知招标人投标人不再具备资格预审文件、招标文件规定的资格条件或者其投标影响招标公正性的,其投标无效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "经评审的最低投标价法、合理低价法、合理价随机确定中标人法,适用于具有通用技术标准或者招标人对其技术、性能没有特殊要求的工程中、小型工程提倡采用合理价随机确定中标人法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "18、资格预审结束后,招标人应当及时向资格预审申请人发出资格预审结果通知书未通过资格预审的申请人不具有投标资格通过资格预审的申请人少于5个的,应当重新招标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中、小型工程提倡采用合理价随机确定中标人法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "19、招标人采用资格后审办法对投标人进行资格审查的,应当在开标后由招标人按照招标文件规定的标准和方法对投标人的资格进行审查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "投标人之间存在隶属关系的,不得参加同一标段的投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "20、招标人对招标项目划分标段的,应当遵守招标投标法的有关规定,不得利用划分标段限制或者排斥潜在投标人依法必须进行招标的项目的招标人不得利用划分标段规避招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标人之间存在隶属关系的,可以参加同一标段的投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "21PPP在中国被称为政府和社会资本合作模式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标委员会专家成员应当具备从事相关领域工作满八年并具有高级职称或者具有同等专业水平",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "22根据局投资管理要求,对于我方与外部单位合作开展且我方股权比例较小的PPP项目,原则上我方不得作为牵头方,不得承担项目融资责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目行政主管部门或者行政监督部门的人员可以担任评标委员会成员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "23PPP项目公司设立后,由项目公司负责项目全生命周期管理,包括投资、建设、运营等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用经评审的最低投标价评标法,招标人要求投标人编制施工组织设计的,应在招标文件中明确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "24A类基础设施业务具体包含市政道路、公路工程、城市轨交、铁路工程、水利水电、港口与码头、地下综合管廊(盾构法施工)、河道治理新拓展的线型基础设施业务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用综合评估法的,评标委员会应当按照招标文件规定的各项因素进行综合评审招标文件中要求投标项目负责人陈述及答辩的,该项评分分值不得超过4分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "25融投资带动总承包项目指为获取项目施工总承包权,而对项目进行大额度融资或投资、并按约定收回我方投入的本金及利息的项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标文件中明确投标人无需编制施工组织设计、服务大纲或设备安装调试方案等技术标评审内容的,招标人对已发出的招标文件进行必要的澄清或者修改,澄清或者修改的内容可能影响投标文件编制的,应当在递交投标文件截止时间至少5日前(采用合理价随机确定中标人法的,应当在递交投标文件截止时间至少1日前),以答疑形式告知所有已获取招标文件的潜在投标人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标文件中明确投标人无需编制施工组织设计、服务大纲或设备安装调试方案等技术标评审内容的,自招标文件开始发出之日起至递交投标文件截止之日止不少于10日",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "来自同一单位的评标专家不得超过2人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "按五星及以上标准设计的宾馆属于技术复杂工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "除技术特别复杂的工程外,施工组织设计总篇幅一般不超过70页",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "拟派项目负责人进行答辩,无论是书面答辩还是口头答辩,必须暗标法进行评审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "装配式建筑项目的设计和施工招标,混凝土装配式居住建筑预制装配率达到60%的、公共建筑预制装配率达到55%的,装配式钢结构住宅、装配式木结构建筑预制装配率达到80%的,可以采用邀请招标方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "类似工程通过工程面积、造价、层次、跨度、高度、结构形式、施工工艺、特殊施工技术等量化指标体现,一般只能设置不超过2个量化指标其中面积、造价量化规模指标,大型及以下工程、技术复杂的特大型工程可以设置不超过招标工程相应指标的80%,特大型工程不超过60%其他指标的设置不得超过招标工程相应指标量化指标各试点市、县(市、区)可作适当调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1、项目立项时,除EPC项目外、设计单位都可以不填写；如是EPC项目,设计单位知道的就填写,目前暂不清楚的填写/",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标文件中不得要求投标报价文件必须加盖造价从业人员执业章",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2、项目立项时,注册资本金金额、单位、币种需填写准确；需要与上传启信宝附件内容完全一样",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标文件中要求投标报价文件必须加盖造价从业人员执业章",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "3、项目立项时,工程类别：一定核实好项目类别；新基建和城市更新项目一定要在项目类别中勾选是,EPC项目选择工程总承包",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标人不得要求投标人法定代表人参加开标活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "4、投资类项目,不在办事处、分局审批范围也不需要在营销系统内立项",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标人要求投标人法定代表人必须参加开标活动",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "5、5G基站建设、特高压、新能源汽车充电桩、大数据中心、人工智能、工业互联网七大领域都是新基建工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工项目经理部主要管理人员,除项目经理外,其余管理人员在投标阶段不作无再建工程要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "6、项目立项时,工程规模中投资金额、建安造价、本次投标金额,逻辑关系如下：投资金额＞本次投标金额≥建安造价)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工项目经理部主要管理人员,项目经理、其余管理人员在投标阶段需无再建工程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "7、营销系统立项中,工程规模中的总长度与本次投标金额对应,若跟踪项目分多个标段,只需要立一个大标段即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "房屋建筑和市政基础设施工程招标中,只能把质量标准作为招标文件的实质性要求和条件,不得把质量目标(如确保市优、争创扬子杯等)作为实质性要求和条件；但招标人可在招标文件的合同条款中设置质量目标及相应的奖罚措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "8、项目立项时,计价方式必须认真填写并核实；主要商务条款中可以简写人材机",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "房屋建筑和市政基础设施工程招标中,可以把质量目标定为确保市优、争创扬子杯",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "9、营销系统立项中,项目进展情况最多勾选到招标准备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "执行电子招投标不得要求投标人提供资质证书、业绩、奖项等书面材料和原件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "10、项目本身条件突破底线,但符合特殊要求的项目,可以直接在营销系统发起立项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "执行电子招投标同时可以要求投标人提供资质证书、业绩、奖项等书面材料和原件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "房屋建筑和市政基础设施工程项目达到大型及以上或者技术复杂的,可以采用合格制资格预审,达到大型及以上且技术复杂的,可以采用有限数量制资格预审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "评标专家的评审费用由招标人支付",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "评标专家的评审费用由投标人支付",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工、服务和货物除因技术等原因不能采用电子招标的以外,应当实行电子招投标采用综合评估法且对技术标进行量化评审的施工、合同估算价100万元以上的监理招标项目,必须实行远程异地评标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "特大型工程是指施工单项合同估算价在5000万元以上的装饰装修、安装、钢结构、幕墙工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "特大型工程是指施工单项合同估算价在10000万元以上的装饰装修、安装、钢结构、幕墙工程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "大型工程是指施工单项合同估算价在2000万元以上的装饰装修、安装、钢结构、幕墙工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大型工程是指施工单项合同估算价在5000万元以上的装饰装修、安装、钢结构、幕墙工程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "特大型工程是指施工单项合同估算价在2000万元以上的智能化、土石方、桩基、基坑支护、园林绿化等专业工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对于具有通用技术标准的工程项目,一般应当采用资格后审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "近年来,简单的最低价法评标存在的诸多弊端日益凸显招标人对技术标的重视程度日益提升,在评标办法中的权重分也越来越高()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对招标文件、图纸以及现场情况有一定了解之后,提出疑问待招标人答复,如水电接驳信息、临时用地、工期要求等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "技术标建议采用WPS软件编制,不建议用word()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "若招标人未特别要求,规范皆需注明版本编号()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据招标人对人员、岗位的配置要求绘制组织机构图,注意岗位名称与招标人要求保持一致,建议使用VISIO软件,完成后以图元形式插入word文档()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用斑马梦龙软件绘制网络图,应尽量详细,完成后调整并导出插入于技术标方案中()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "针对方案中山所涉及到的具体流程,若为简单的线性流程,文字表述即可,若流程复杂,宜用VISIO绘制后插入()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于保证措施,仔细研究招标人要求,有明确要求的内容,务必以标题的形式体现在目录中,如：成品保护、样板引路、安全预案等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "平面布置图建议使用清晰可辨、色彩突出、对比度强烈的线条,图纸排版需合理,出A4图,尽量显示清楚()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当招标文件规定投标技术方案(南京市政类)页数限制80页时,某单位的技术方案编制了82页,评标委员会作为废标处理,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标文件中对项目工期、质量、安全、文明施工均有明确要求,技术标中仅对工期作出了明确响应,其余均未响应,评标委员会对该技术方案作废标处理,是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标文件要求技术方案为暗标,规定工期360天,某企业在技术方案中为体现企业优势,将工期缩短为350天评标委员会将其视为违反暗标要求,判定为废标,是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "江苏省公路工程技术方案编制中,某单位在专项方案中对支座钢板描述为现场加工工艺评标委员会对该方案进行了扣分处理,其做法是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "技术组负责人、主要内容编写人员应参与现场踏勘",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工程特点是对项目客观描述,用数据、事实说话,不加主观判断",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程难点侧重施工技术方面,突出投标人技术实力可从不良地质、周边重要建(构)筑物、工程特殊结构、重大安全风险源等方面提炼总结",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总体部署的原则是以招标人要求的进度为目标,按照各工序间的先后次序合理划分施工阶段,并根据各工序的时间安排合理配置资源",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "若招标文件无要求,项目的主体、关键性工作可以分包",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "电子招标投标交易平台是以数据电文形式完成招标投标交易活动的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国务院发展改革部门负责指导协调本行政区域内电子招标投标活动",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "电子招标投标交易平台接口应当保持技术中立",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "电子招标投标交易平台服务器可以设在中华人民共和国境外",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "电子招标投标交易平台运营机构应当是依法成立的法人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "电子招标投标某些环节需要使用纸质文件的,应当在招标文件中明确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "电子招标投标交易平台运营机构可要求潜在投标人购买指定的工具软件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "电子招标投标数据电文形式的招标文件应当符合有关有关部门颁发的标准文本的要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《电子招标投标办法》评标委员会完成评标后,应当向招标人提交书面评标报告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《电子招标投标办法》当纸质文件与数据电文不一致时以纸质文件为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《电子招标投标办法》与平台运营机构有控股关系的,不得在该交易平台进行的招标项目中投标和代理投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "电子招标投标交易平台应当允许投标人离线编制投标文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标人未按规定加密的投标文件,电子招标投标交易平台应当拒收并提示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《电子招标投标办法》在投标截止时间前,投标人可以补充、修改或者撤回投标文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《电子招标投标办法》在投标截止时间前,投标人不可以补充、修改或者撤回投标文件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《评定分离操作导则》价格竞争定标法的优点是程序复杂、竞价功能",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《评定分离操作导则》集体议事法的缺点是招标人法定代表人个人廉政压力小",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《招标公告和公示信息发布管理办法》拟发布的招标公告采用数据电文形式的,应当按规定进行电子签名",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《招标公告和公示信息发布管理办法》发布媒介可以收费提供依法必须招标项目的招标公告发布服务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水利水电类工程招标,只允许水利类资质单位参与投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "由市财政出资的水务类项目,允许采用南京市水务水利平台招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "由水务集团自筹资金的水务类项目,不允许采用南京市市政平台招标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "生态环境类工程招标不允许采用EPC模式招标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "设置水务项目招标条款得分项时,可适当调高企业业绩、企业奖项得分以增加我单位竞争力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "输、供水工程(含管道及附属设备)属于A类基础设施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水处理工程(含管道及附属设备)不属于A类基础设施",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "环境整治类工程招标可以按照市政类常规办法采用EPC+两阶段方式招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《招标公告和公示信息发布管理办法》认为发布媒介在招标公告发布活动中存在违法违规行为的,可以依法向招投标行政监督部门举报",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标人不按招标文件要求提交投标保证金的,该投标文件将被拒绝,作无效标处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局第三建设有限公司注册资本金为10亿元人民币()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对承包单位来说,如果项目规模大、工期长,则项目的风险也大,这类项目不宜采用的合同是总价合同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于大型及以上工程或技术复杂工程,综合评估法中原评审因素施工组织设计分值可最高增加8分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "A项目在中标后转履约需收取200万现金保证金,为突破营销底线项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "五不接立项底线内容为进度付款低于70%(基础设施项目低于65%),形象节点付款低于75%(基础设施项目低于70%)或节点时间超过3个月",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司六大产品线为市政工程、城市轨交、生态环保、公路工程、城市更新、铁路工程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "港口与码头、机场跑道、综合管廊、河道治理为A类基础设施项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目投标工作组长负责整个项目主标文件的全面审核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "BIM模型质量控制措施有：模型与工程项目的符合性检查;不同模型元素之间的相互关系检查;模型与相应标准规定的符合性检查;模型信息的准确性和完整性检查",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工BIM模型包括深化设计模型、施工过程模型和竣工验收模型",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "模型元素信息包括的内容有：尺寸、定位、空间拓扑关系等几何信息;名称、规格型号、材料和材质、生产厂商、功能与性能技术参数,以及系统类型、施工段、施工方式、工程逻辑关系等几何信息",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "EPC模式是指公司受业主委托,按照合同约定对工程建设项目的设计、采购、施工、试运行等实行全过程或若干阶段的承包模式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "某项目总建筑面积65万㎡,造价8000万元,按照江苏省建设工程施工项目经理部主要管理人员配备标准,应设置施工员、质量员、安全员各不少于2人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "按《招标投标法》规定,招标文件自发放之日起,至投标截止时间的期限,最短不得少于20天",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标人可单独或者分别组织任何一个投标人进行现场踏勘",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "评标委员会由招标人或其委托的招标代理机构熟悉相关业务的代表,以及有关技术、经济等方面的专家组成,成员人数为五人以上单数,其中技术、经济等方面的专家不得少于成员总数的三分之二",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采用评定分离评标的,定标候选人不得少于3家,不宜超过5家",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标文件应按投标文件格式进行编写,如有必要,可以增加附页,作为投标文件的组成部分其中,投标函附录在满足招标文件实质性要求的基础上,可以提出比招标文件要求更能吸引招标的承诺",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业使命为成为最具国际竞争影响力的投资建设集团",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司以南京为中心,做大做强江苏本埠市场,做大做优京津冀及浙沪市场",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于投标文件构成的编制,联合体投标的,投标文件应包括每个联合体成员提供的投标函",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "由同一专业的单位组成的联合体,按照资质等级最高的单位确定资质级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程投标中社会保障费属于人工费",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建设工程安全文明施工措施费为不参与竞争费用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据我国法律规定,施工总承包单位和分包单位就分包工程对建设单位承担连带责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "类似工程是指项目在高度、面积、造价、层次、跨度、结构形式、施工工艺、特殊施工技术等量化指标与招标工程相类似一般只能设置不超过2个量化指标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "平安幸福中心获得中国钢结构金奖、扬子杯",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2009年4月1日,南京南站站房工程开工,工程于2011年6月30日竣工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2005年,公司承建的温州博物馆荣获扬子杯",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2022年11月,公司智能装配造桥机20在绿都大道项目成功运行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司承建的溧水区市民中心工程荣获鲁班奖和国优奖",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2000年7月,公司承建的江心洲污水处理厂扩建工程开工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依法必须进行招标的项目违反本法规定,中标无效的,应当依照本法规定的中标条件从其余投标人中重新确定中标人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "《招标投标法》规定的行政处罚,由国务院规定的有关行政监督部门决定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在形成和订立招标投标合同时,如《合同法》与《招标投标法》对同一事项的规定不一致,应执行后者的规定,这体现了法律的横向效力层级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依法必须招标的通信工程建设招标项目,招标人可以在招标文件中约定对中标人的中标份额进行调整规则",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司的四大核心精神是开拓、进取、无私、当担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "涉及公共安全的项目,定标委员会定标后可立即发出招标通知书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据投标报价策略,一个建设项目总报价确定后,内部调整时地基基础部分可适当提高报价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据三公司《市场营销管理手册》,各二级单位应按照要求,每半年以营销简报形式报公司市场部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2022年,公司荣获江苏省建筑百强企业第五名",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据三公司《市场营销管理手册》,各二级单位不准跨各自经营区域承揽业务,除特殊情况经公司审批同意后方可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据八局《市场与客户管理手册》,凡拟派项目经理为局控项目经理的,如果属于本单位自有项目经理,使用单位可不向局市场部门核准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "县级地方人民政府有关部门按照规定的职责分工,对招标投标活动实施监督,依法查处招标投标活动中的违法行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标人有权决定是否要求中标人提交履约保证金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "评标由招标人依法组建的评标专家负责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "需要采用不可替代的专利的项目可以不进行招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "特许经营项目投资人能够自行建设、生产或提供的项目可以不进行招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中标人确定后,招标人应当向中标人发出中标通知书,并同时将中标结果通知中标的投标人,但不用通知未中标的投标人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标人应当在招标文件要求提交投标文件的截一时间前,将投标文件送达投标地点投标人少于三个的,招标人可以改为竞争性谈判继续进行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标人设有标底的,标底可以在开标前公开",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标项目需要划分标段,确定工期的,招标人应当合理划分标段,确定工期,并在招标文件中载明",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标人有权自行选择招标代理机构,委托其办理招标事宜省级政府主管部门监督机构有权为招标人指定招标代理机构",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "任何情况下,公司都不可以超出1+S+C范围承接项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "原则上公司,不禁止承接小、远、散项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "信用维护工作包含市场、质量、安全、实名制等管理工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "保证金发起的项目名称、保证金两表项目名称、财务一体化项目名称必须完全一致",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财务一体化保证金发起时八局名义的项目汇款用途栏开头填非投资类+基础设施类、非投资类+非基础设施类、投资类+基础设施类、投资类+非基础设施类当中一个",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目在中标后转履约需收取200万现金保证金,为突破营销底线项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "子公司资质承接项目不需要遵守局立项原则",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "已通过立项审批,并取得授权委托书的单位,如相当长时间内营销工作无实质性进展或新的重大突破,局总部可视情况取消其营销授权",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "非现金收款不突破营销底线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "蚌埠市体育中心项目获得过国家优质工程奖",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公开招标是指招标人以招标公告的方式邀请不特定的法人或其他组织投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "邀请招标是指招标人以投标邀请书的方式邀请特定的法人或其他组织投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局关于印发《加强华中区域经营实施方案》的通知20221127,成立华中分局,总部设在湖北省武汉市,管辖区域为湖北、江西、安徽、湖南四省",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据《招标投标法》规定,联合体的资质等级采取就低不就高的原则",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "联合体中标的,联合体各方应当共同与招标人签订合同,就中标项目向招标人承担连带责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "套取定额中人材机含量可以大幅度调整",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "开标时,由投标人或者其推选的代表检查投标文件的密封情况,也可以由招标人委托的公证机构检查并公证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合肥市现行评标办法主要用合理最低评标办法,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《招标投标法》的相关规定,一般情况下,确定中标人的权利归属于招标人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标委员会经评审,认为所有投标都不符合招标文件要求的,可以否决所有投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标委员会成员可以私下接触投标人,但不得收受投标人的财物或者其他好处",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中标通知书属于承诺",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大型基础设施、公用事业等关系社会公共利益、公众安全的项目必须进行招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标代理机构泄露应当保密的与招标投标活动有关的情况和资料的,或招标人向中他人透露已获取招标文件的潜在投标人的名称、数量等情况,影响中标结果的,中标无效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《蚌埠市人民政府办公室关于推进建筑业高质量发展实施意见的通知》,蚌埠市政府性投资项目全面推行评定分离制度,优选AAA级信用企业承建优化信用评价结果在招标投标环节运用,支持信用良好、综合实力强的企业采取联合体方式参与重点项目建设,信用分取联合体成员中的信用较高分值计算,联合体协议中约定本市企业承担工程量不得少于工程造价的50%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "最新的文件规定主材价格一律不给调整,除了不可抗力以外,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《蚌埠市人民政府办公室关于推进建筑业高质量发展实施意见的通知》,蚌埠市对新引进且注册地迁移到我市的建筑业企业,其在原注册地行政区域内业绩、奖项在信用评价中予以认可鼓励房地产企业与本市建筑施工企业建立战略合作关系,优选AAA信用施工总承包企业的房地产项目,预售资金每个节点释放额度上限上浮5%,但不超重点监管资金总额的95%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "主材主要以甲供材料为主,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《蚌埠市人民政府办公室关于推进建筑业高质量发展实施意见的通知》,蚌埠市政府投资项目不得由施工企业垫资建设合同中应明确主要材料价差在5%以内(含5%)的,由施工单位承担,超过5%以上部分的价差,由建设单位承担",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "商务标里措施费用在投标报价里不得作为可竞争费,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "关于印发《湖北省房屋建筑和市政基础设施工程招标投标评定分离定标工作指南(试行)》的通知,第五条评标委员会推荐的中标候选人数量原则上不少于3家,不超过5家投标人的数量少于或等于10家时,评标委员会推荐的中标候选人数量不超过3家具体数量在招标文件中明确,中标候选人不标明排序",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标代理费、控制价编制费按控制价为基数收取是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "清单综合单价的价格低于主材的价格,将否决其投标,是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "商务标投标封面不需要盖造价师职业印章,只需要有投标单位公章及法人代表印章即可,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "安徽目前所有工程投标人的下浮率均要减去暂估价、暂列金、甲供材之后再计算下浮率,是否正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标项目里所有综合单价都应在成本测算的基础上考虑选择组价,优化空间争取做到最大化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《合肥市工程建设项目招标投标管理办法》要求,政府投资的工程建设项目,不得要求中标的施工企业垫资建设",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《合肥市工程建设项目招标投标管理办法》要求,招标人可以委托招标代理机构组织开展招投标活动,也可以自行组织招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标人应确定合理的招标时间,确保投标人有足够时间研究招标文件、编制工程总承包方案及深化设计方案、评估项目风险、测算项目成本等不得设置不合理工期,不得任意压缩合理工期",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "【2020】1073号文实施导则,技术特别复杂工程指房屋建筑中,采用装配式等新型技术建设的房屋建筑,老旧小区综合改造提升工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "从事装配式建筑构件吊装、套筒灌浆、预埋件等关键岗位作业人员需按规定培训考核,合格后持证上岗",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "区域总部及分局是局区域市场协调的第一责任单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "装配式建筑项目必须采用评定分离方式确定中标人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "标前标准成本测定在开标前四天完成；依据招标文件、技术方案、成本管理要求等相关资料,完成标前标准成本测算由二级单位商务法务部和市场部共同确认标前标准成本二级单位总经济师审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合肥市要求在建项目必须采用商品砼、预拌砂浆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "三公司水利水电工程资质为施工总承包二级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "投标人应当合理测算投标成本,不得以低于成本的报价竞标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《建筑工程施工质量验收统一标准》GB50300-2013规定地基与基础分部工程包括地基、基础、基坑支护、地下水控制、土方、边坡、地下防水子部分工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合肥市建筑行业建设工程质量的最高荣誉奖是琥珀杯",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当立杆采用搭接接长时,搭接长度不应小于1m",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "安徽省建筑行业建设工程质量的最高荣誉奖是黄山杯",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《关于加强房屋建筑和市政基础设施工程建设领域工程款支付担保管理工作的通知》,建设单位应在招标文件中承诺提供工程款支付担保,载明担保额度、提供期限及其他事项建设单位和施工企业应依据招标文件,在工程项目施工合同中对工程款支付担保予以明确约定建设单位未依法提供工程款支付担保,导致拖欠农民工工资的,依法依规处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中国建筑行业建设工程质量的最高荣誉奖是鲁班奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投资管理体系根据投资业务定位,结合投资发展需要,构建1+2+5+X的投资管理体系1是投资管理部2是基础设施事业部和城市更新中心5是投资公司、东孚公司、城发公司、华南投资公司、文旅博览公司五个投资平台X是具备区域经营优势的主业单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局166战略举措：一个提高,是指进一步提高政治站位；六个致力,是指致力实现高质量发展、致力创新驱动发展、致力服务国家战略、致力深化国企改革、致力加快转型升级、致力党的领导融入公司治理；六个专项,是指深化巡视整改、加强科技创新、清理低效无效资产、提升基础管理、推动信息化建设、狠抓安全生产专项行动；是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建集团一创五强战略目标(即以创建具有全球竞争力的世界一流企业为牵引,致力成为价值创造力强、创新引领力强、品牌影响力强、国际竞争力强、文化软实力强的世界一流企业集团)；是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "三公司核心价值观：品质保障价值创造",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "普通螺栓分为ABC三级其中A级、B级为精制螺栓",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "三公司企业使命：拓展幸福空间",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目建议书是建设单位向国家有关主管部门提出要求建设某一项目的建设性文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "三公司企业作风：令行禁止使命必达",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程设计是工程建设的重要环节,它是从技术和经济上对拟建工程进行全面规划的工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "三公司目前注册资本金为1675亿；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工程承发包方式,是指发包人与承包人双方之间的经济关系形式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "跨区域项目不得突破底线",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "跨区域项目必须为高端优势领域项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "跨区域项目需要审批至分局层面",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "投标专业小组通常包括外联组、商务组、方案组和综合组",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《招标投标法》的规定,中标人的投标应当符合能够最大限度地满足招标文件中规定的各项综合评价标准并且经评审的投标价格最低",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "备选方案招标人可以采用也可以不采用,所以投标人可以直接提交备选方案的投标文件来响应招标文件的要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程总承包企业具有与工程规模相适应的工程设计资质或施工资质即具备投标资格,不得要求具备与工程相适应的设计资质和施工资质",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "A类基础设施业务具体包含市政道路、公路工程、城市轨交、铁路工程、水利水电、港口与码头、地下综合管廊(盾构法施工)、河道治理新拓展的线型基础设施业务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "营销人员必备的七大能力是信息收集和分析能力、关系对接能力、营销策划能力、资源整合能力、过程把控能力、内业编制能力和二次营销和客户维护能力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "六个专项行动,是指深化巡视整改、加强科技创新、清理低效无效资产、提升基础管理、推动信息化建设、狠抓安全生产专项行动；是否正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《公路工程建设项目招标投标管理办法(交通部2015年第24号文)》、《合肥市建设工程施工项目评标办法实施导则(2023年版)》均规定公路工程评标办法采用综合评估法或经评审的最低投标价法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程奖有限公司的风景园林工程设计资质为专项乙级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《基础设施和公用事业特许经营管理办法》明确将能源、交通运输、水利、环境保护、市政工程等五大吸纳资金规模巨大和投资收益含金量高的行业,开辟为特许经营的领域",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "立项时,上报水处理项目的时候,工程规模一定要注意备注(水处理量)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "立项工作关键词为提前、真实、准确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2023年,公司要求T20项目中标率为70%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "成本净利润率=税后利润/税前成本X100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "资产负债率=负债/(负债+所有者权益)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局第三建设有限公司的企业使命：拓展幸福空间",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工总承包利润率=所得税前施工总承包利润/施工总承包营业收入X100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "鲁班奖由中国建筑业协会颁发",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目立项时,工程类别：一定核实好项目类别；新基建和城市更新项目一定要在项目类别中勾选是,EPC项目选择工程总承包",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "火车站站房、机场场道、收费站、线性的绿化或环保工程均属于A类基础设施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局台辉高速公路豫鲁界至范县段—黄河特大桥项目,获得了2020～2021年度中国建设工程鲁班奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "5G基站建设、特高压、新能源汽车充电桩、大数据中心、人工智能、工业互联网七大领域都是新基建工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目立项时,工程规模中投资金额、建安造价、本次投标金额,逻辑关系如下：投资金额＞本次投标金额≥建安造价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "营销系统立项中,工程规模中的总长度与本次投标金额对应,若跟踪项目分多个标段,只需要立一个大标段即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目立项时,计价方式必须认真填写并核实；主要商务条款中可以简写人材机",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司的第三曲线分为两个维度,第一维度是强链补链业务,第二维度是动能培育业务()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目本身条件突破底线,但符合特殊要求的项目,可以直接在营销系统发起立项",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《合肥市十四五交通运输发展规划》,2022年合肥市将持续推进1155大交通计划,(暨到2025年末,建成及在建铁路1000公里、高速公路1000公里、轨道交通500公里、城市快速路500公里；环+放射+方格网的城市交通网基本构建完成)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程局有限公司在蚌埠市的信用等级为AAA",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局,现有员工50000人,下设五大分局,25家二级公司,2022年新签合同额7225亿元,营业额4154亿元",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目分类从管控维度看,主要分为局控工程和公司管控工程,局控工程一般指局责任状项目,其他均为公司管控工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市公司成立初期职能以区域市场营销为主,兼具生产履约管控、科技质量管理、项目成本控制等职能",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财政部会同国家发改委印发了《申报2022年新增专项债券项目资金需求的通知》,明确交通基础设施,能源,农林水利,生态环保,社会事业,城乡冷链,市政和产业园区,国家重大战略项目和保障性安居工程作为专项债券重点适用领域,同时也明确指出2022年基建投资将适度超前",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新型基础设施业态包括：城市更新、抽水蓄能、流域治理、城市管网、通用航空、智慧交通、智能建造、充电桩、土壤修复、光伏发电等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "滁公管【2021】2号文,综合评估法中业绩、奖项分值设置0-10分,业绩、奖项数量各不超过2个,每个分值宜为25分；业绩、奖项的设置应与项目规模、质量等要求相适应上述的业绩奖项包括企业或项目经理的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于印发《合肥市工程总承包项目招标投标导则》的通知2020年4月8日,本导则所称工程总承包,是指从事工程总承包的企业按照与招标人签订的合同,对工程设计、采购、施工或者设计、施工等阶段实行全过程的承包,并对工程的质量、安全、工期和造价等全面负责的承包方式,招标人只负责整体的、原则的、目标的管理和控制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程局有限公司建筑装修装饰工程专业承包二级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "詹天佑奖中国土木工程领域工程建设项目科技创新的最高荣誉奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局及三公司在亳州的信用分均为满分150分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "跨区域项目可以突破底线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中华人民共和国招投标法规定：涉及国家安全、国家秘密、抢险救灾或者属于利用扶贫资金实行以工代赈、需要使用农民工等特殊情况,不适宜进行招标的项目,按照国家有关规定可以不进行招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中华人民共和国招投标法规定：任何单位和个人不得将依法必须进行招标的项目化整为零或者以其他任何方式规避招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中华人民共和国招投标法规定：招标人应当有进行招标项目的相应资金或者资金来源已经落实,并应当在招标文件中如实载明",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "政府与社会资本合作(PPP)项目的实施方案需要获得投资方的批准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中华人民共和国招投标法规定：招标人有权自行选择招标代理机构,委托其办理招标事宜任何单位和个人不得以任何方式为招标人指定招标代理机构",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "融投资带动总承包项目概念：指为获取项目施工总承包权,而对项目进行小额度融资或投资,且在实施过程中不承担其他融投资及担保义务,并按约定时间和方式收回我方投入的本金及相应利息(或回报)的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中华人民共和国招投标法规定：招标人具有编制招标文件和组织评标能力的,可以自行办理招标事宜任何单位和个人不得强制其委托招标代理机构办理招标事宜",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我方与外部单位合作开展且我方股权比例较小的项目,原则上我方可以承担项目融投资责任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "融投资带动总承包项目,我方不作为牵头方且不对项目主要投资人和其他投资人投资承担连带责任,不为其投资本金和收益承担兜底责任,项目公司纳入我方合并会计报表范围",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标人采用公开招标方式的,应当发布招标公告",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "融投资带动总承包项目的回购担保,股权受让(或偿还我方出资款)主体为境外公司或信用评级低于AA+级的境内公司,且我方股权(或出资)比例超过3%的项目,须落实足额有效的股权转让(还款)担保",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标人根据招标项目的具体情况,必须组织潜在投标人踏勘项目现场",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人对已发出的招标文件进行必要的澄清或者修改的,应当在招标文件要求提交投标文件截止时间至少十五日前,以书面形式通知所有招标文件收受人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "目前中建股份和八局均设立城市更新中心,专职管理城市更新业务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标人不得组织单个或者部分潜在投标人踏勘项目现场",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新项目重点拓展项目类型包含旧城区、TOD类型(轨交上盖、机场搬迁、高铁枢纽、港口码头区域)、产业园区或老厂区等更新项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标截止后投标人撤销投标文件的,招标人可以不退还投标保证金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局投资管理要求,对于投融资带动总承包项目,我方可对项目主要投资人和其他投资人投资承担连带责任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "FEPC项目应有较大社会影响力,有良好的市场前景和综合效益,有利于战略市场、战略客户拓展、经营结构调整优化,符合全局发展战略",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我方与外部单位合作开展且我方股权比例较小的项目,原则上我方不得作为牵头方,不得提供保函/保证金,不得承担项目融资责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城镇综合建设项目概念：指以土地资源及土地相关权益为核心,以获取土地一级开发实施授权为基础,涵盖规划设计、土地一级开发、房建和基础设施工程承包、融投资建造、房地产开发业务、招商和产业构建等全部或多种业务领域的大型综合性开发建设项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国建筑第八工程局有限公司在安徽省公路建设市场信用信息管理系统中,2022年的信用等级为AA",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目公司设立后,由项目公司负责项目全生命周期管理,包括投资、建设、运营等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《A类基础设施项目投资业务指引》,基础设施类投资项目上报跟踪,局二级单位经内部评审后,报送至分局/办事处审批(若项目所在地无分局/办事处,则直接报至基础设施事业部),通过后由二级单位报局基础设施事业部进行评估、评审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《投资管理手册》对立项管理的规定,房地产投资项目由东孚公司主张；基础部负责基础设施投资项目的跟踪、立项、可研、投标；投资公司以高端公建业务、创新创投业务和城镇综合建设为主要拓展领域",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "股份公司批复实施前提条件未落实,原则上不得设立项目公司、签订PPP投资合同、实质性出资或开工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据中建股份投资管理要求,项目投资预算经局董事会审批通过后需上报股份公司",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "水利水电专业技术知识,包括水利水电工程勘测与设计,施工水流控制,地基处理工程,土石方工程,土石坝工程,混凝土坝工程,堤防与河湖整治工程,水闸、泵站与水电站工程,施工安全技术9类",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "融投资带动总承包项目指为获取项目施工总承包权,而对项目进行大额度融资或投资、并按约定收回我方投入的本金及利息的项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地方政府本级一般公共预算收入统计口径包含地方本级收入、上级政府对本级政府的税收返还和一般性转移支付、下级政府对本级政府的上解收入、上年结余收入、调入预算稳定调节基金、调入资金、债务收入及其他收入等",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据局投资管理规定,在签订PPP合同前,若政府未能完成项目PPP模式合法合规手续,则必须在PPP合同中约定,政府应在PPP合同签订之日起3个月内完成PPP模式合法合规手续,并将项目纳入财政部政府和社会资本合作(PPP)综合信息平台项目管理库(执行阶段)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局投资管理规定,在PPP项目执行阶段中,为保障项目的施工进度,我方可以适当垫资",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据局《投资管理手册》规定,若PPP项目合作期限超过15年,应在协议中明确我方享有在运营期内通过引入外部投资者或资产证券化等方式提前收回投资的权利",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我局综合类投资区域为1+7+3,1为核心区域上海,7为延伸布局区域山东、江苏、浙江、广东、辽宁、四川、重庆,3为点状布局区域西安、合肥和南宁基础设施和房建工程投资业务核心布局区域和上述相同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据局相关规定,公司既可以独立开展投资业务,也可作为投资项目工程承包主体,或在中建八局统筹管理之下参股投资项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "城市更新作为国家战略,在十三五期间,首次写到国家的两会报告中,随后各大城市出台城市更新细则、成立机构",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "客户全面履约内容主要包括沟通互动、过程履约、满意度调查和投诉处理四个方面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局七大工程战略举措,总体分为两类：一类是以业务发展为主涉及面较广,由局主要领导分别担任专班组长,包括主业强基工程、产业升级工程；另一类是以职能管理为主,内容相对聚焦,由分管(或协管)局领导担任专班组长,包括数字化转型工程、创新引领工程、国际化经营工程、人才强企工程、治理提升工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "华中分局市场营销管理办法底线管理：已立项的项目,如招标文件突破局底线管理规定,必须在开标前按照局有关要求进行特殊立项,开标后分局不再后补特殊立项审批流程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局属内部单位联合投标的项目,华中分局于投标前组织签订书面联合投标协议,明确各方的权利义务及责任,未履行协议的单位,分局将在区域内通报批评并对相关责任人问责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "华中分局区域有华中公司1家局属二级单位及9家三级单位,21家城市公司及营销中心,",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "华中分局投标权协调原则：同一项目两个或以上二级独立法人单位跟踪,在满足投标要求且无虚拟法人单位跟踪的前提下,10万㎡以下公建项目、20万㎡以下住宅类项目、2亿元以下基础设施项目优先使用二级单位资质参与投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部施工组织设计(A、B类施工方案),审批权限需要到分公司总工程师",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目部双优化效益认定,审批权限需要董事长(总经理)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "双优化：对施工组织设计(施工方案)的优化和施工设计的优化施工组织设计(施工方案)优化是指对项目责任成本下达时考虑的施工组织设计(施工方案)或投标阶段形成的施工组织设计(施工方案)进行的优化施工设计优化是指对工程设计图提出的优化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工交底分三级交底：施工组织(总)设计交底、施工方案交底和分部分项工程施工技术交底",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2021年度安徽省优秀建筑业企业名单,综合基础设施类企业25家,其中注册地在合肥18家",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程局有限公司有消防设施工程专业承包一级资质",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程局有限公司有建筑幕墙工程专业承包一级资质",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程局有限公司近三年资产负债率高于80%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "我国目标为2035年建筑工业化全面实现,迈入智能建造世界强国行列",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局第三建设有限公司近三年资产负债率低于中国建筑第八工程局有限公司",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国建筑业协会颁发的AAA级安全文明标准化工地已更名为建设工程项目施工安全生产标准化建设工地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国施工企业管理协会最后一次颁发全国优秀施工企业是在2018年3月,奖项名称为2017年度全国优秀施工企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国建筑第八工程局有限公司及三公司均有有2015年度、2016年度、2017年度全国优秀施工企业证书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接待迎客时,引导者或主人要走在客人的右侧方【办公室】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "诚信典型企业由中国施工企业管理协会颁发",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局第三建设有限公司无诚信典型企业证书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中国建筑第八工程局有限公司无诚信典型企业证书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "全国社会组织信用信息公示平台(试运行)的作用——查询企业所获荣誉的颁奖单位是否为依法注册的正规单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据安徽省住房和城乡建设厅《关于调整招标投标活动中有关住房城乡建设领域现场专业人员证书要求的通知》(建市函〔2019〕1112号)要求,不再将住房城乡建设领域现场专业技术人员(包括施工员、质量员、安全员、资料员、材料员、劳务员、机械员、标准员)及取样员持证情况列入招标投标文件,招标人或招标代理机构需按照住房和城乡建设部及安徽省相关标准规定在此表中明确投标人需要配备其他主要管理人员和技术人员数量的最低要求中标人和招标人在签订合同时应按照不低于本表人员配置的要求填写承包人主要施工管理人员表,并作为合同的附件之一",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "蚌埠市体育中心获得过鲁班奖、黄山杯、全国建设工程项目施工安全生产标准化工地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标代理机构在其资格许可和招标人委托的范围内开展招标代理业务,任何单位和个人不得非法干涉",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标人不能对已发出的资格预审文件或者招标文件进行澄清或者修改",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标工程量清单作为招标文件的组成部分,其准确性和完整性由招标人负责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "使用国有资金投资的建设工程发承包,必须采用工程量清单计价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "措施项目中的安全文明施工费必须按国家或省级、行业建设主管部门的规定计算,不得作为竞争性费用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "三级单位市场营销部/二级单位市场与客户管理部在提交投标文件前10天应完成投标阶段商务策划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "暂列金额由投标人根据工程特点按有关计价规定估算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标文件与中标人投标文件不一致的地方,应以招标文件为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "投标人可以进行总价让利,而不需将让利部分调整到分部分项清单子目中",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标工程量清单与计价表中列明的所有需要填写单价和合价的项目,投标人均应填写且只允许有一个报价,未填写单价和合价的项目,可视为此项费用已包含在已标价工程量清单中其他项目的单价和合价之中当竣工结算时,此项目不得重新组价予以调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投标函是指构成合同的由承包人填写并签署的用于投标的文件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各级地方人民政府可以根据实际需要,建立统一规范的招标投标交易场所,为招标投标活动提供服务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "投标后投标人撤销投标文件的,招标人可以不退还投标保证金",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标人可以根据投标人要求,组织单个或者部分潜在投标人踏勘项目现场",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "县级地方人民政府有关部门按照规定的职责分工,对招标投标活动实施监督,依法查处招标投标活动中的违法行为",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标代理机构不得在所代理的招标项目中投标或者代理投标,也不得为所代理的招标项目的投标人提供咨询",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标委员会成员收受投标人的财物或者其他好处的,没收收受的财物,处3000元以上5万元以下的罚款,取消担任评标委员会成员的资格",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "列入招标工程量清单内的预留金、材料购置费、零星项目工程费,在工程结算时应视为投标人所有",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程量清单计价合同价款调整中,对于任一招标工程量清单项目,如果因本条规定的工程量偏差和工程变更等原因导致工程量偏差超过15%,调整原则为：当工程量增加15%以上时,应予调低；当工程量减少15%以上时,应予调高",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标清单的完整性及准确性应由施工单位负责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "营销系统立项中,项目进展情况最多勾选到招标准备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目本身条件突破底线,但符合特殊要求的项目,可以直接在营销系统发起立项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "从管控维度看,主要分为局控工程和公司管控工程,局控工程一般指局责任状项目,其他均为公司管控工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "从资质维度看,主要分为局资质项目和子公司资质项目,分别指使用局资质和子公司资质承接的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分公司市场客户部是区域市场协调的第一责任单位,对辖区内的市场准入、工程协调负责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各二级单位可以随意跨各自经营区域承揽业务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各二级单位应以所在中心城市及本单位传统优势市场为营销重点区域,未得到公司的批准,不得超出现有市场区域开展营销活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "不同投标人的电子投标文件出自同一台电脑的,属于投标人相互串通投标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中华人民共和国招标投标法》规定,依法必须进行招标的项目,其招标投标活动可以在省级行政区域内作限制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人不得以不合理的条件限制或者排斥潜在投标人,对潜在投标人实行歧视待遇,强制要求投标人组成联合体共同投标,或者限制投标人之间的竞争",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如果投标人在投标有效期内补充、修改、撤回投标文件,招标人无权没收其投标保证金并要求其赔偿损失",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "资格预审结束后,招标人应当及时向资格预审申请人发出资格预审结果通知书未通过资格预审的申请人不具有投标资格通过资格预审的申请人少于5个的,应当重新招标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人采用资格后审办法对投标人进行资格审查的,应当在开标后由招标人按照招标文件规定的标准和方法对投标人的资格进行审查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人对招标项目划分标段的,应当遵守招标投标法的有关规定,不得利用划分标段限制或者排斥潜在投标人依法必须进行招标的项目的招标人不得利用划分标段规避招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局投资管理要求,对于我方与外部单位合作开展且我方股权比例较小的PPP项目,原则上我方不得作为牵头方,不得承担项目融资责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标人发生合并、分立、破产等重大变化的,应当及时书面告知招标人投标人不再具备资格预审文件、招标文件规定的资格条件或者其投标影响招标公正性的,其投标无效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "申请人在规定的资格审查申请文件提交截止时间后,可以对已经提交的资格预审申请文件进行替换或者撤回",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目立项时,注册资本金金额、单位、币种需填写准确；需要与上传启信宝附件内容完全一样",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投资类项目,不在办事处、分局审批范围也不需要在营销系统内立项",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目立项时,工程规模中投资金额、建安造价、本次投标金额,逻辑关系如下：投资金额＞本次投标金额≥建安造价)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "爆破作业单位实施爆破项目前,应按规定办理审批手续,批准后方可实施爆破作业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沥青针入度愈高,则沥青的感温性指标PI值就愈大()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "经审批的爆破作业项目,爆破作业单位应于施工当天发布公告,并在项目经理部张贴",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于大坍落度要求检测的扩展度,是指混凝土坍落后形成的最大直径尺寸和与之垂直方向测得的直径之和的平均值()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "爆破作业必须设警戒区和警戒人员,起爆前必须撤出人员并按规定发出声、光等警示信号",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工地实际采用的水泥剂量宜比室内试验确定的剂量多05%-1%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "作业人员在保管、加工、运输爆破器材过程中,严禁穿着化纤服装",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工地试验室的运行必须受母体试验检测机构的授权()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "由一人同时搬运炸药与雷管时,炸药与雷管必须隔离",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "减水率是指掺用外加剂混凝土的用水量与不掺外加剂混凝土的用水量的比值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "平面控制网可按精度划分为等与级两种规格,由高向低依次宜为二、三、四等和一、二、三级()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预应力筋张拉锚固后,孔道应尽早压浆,且应在72h内完成,否则应采取避免预应力筋锈蚀的措施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋的连接宜采用焊接接头或绑扎接头()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "轴心受拉和小偏心受拉构件不应采用绑扎接头()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "后张预应力混凝土结构或构件的所有管道均应在每个顶点设排气孔及需要时在每个低点设排水孔()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大体积混凝土工程的施工宜采用分层连续浇筑施工或推移式连续浇筑施工()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土运至浇筑地点后发生离析、坍落度不符合要求时,经试验人员现场同意后,可加水进行第二次搅拌()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "用回弹法检测混凝土强度,计算测区平均值时应从测区的16个回弹值中剔除1个最大值和1个最小值()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "路基冬期施工,开挖至路床顶面以上05m时,停止开挖,待冬期过后再施工()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "桥台等结构物台背回填,靠近结构物的地方采用大型机械碾压,增加压实度()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "当千斤顶使用时间超过6个月或张拉超过300次时,应重新进行标定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "两种集料的细度模数相同,它们的级配一定相同()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "连续梁竖向预应力筋应采用两次张拉方式,且滞后纵向预应力筋张拉不宜大于3个悬浇梁段()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土拌合物工作性能检查每100m³不应少于1次相邻两条变形缝区间的管廊结构,每次浇筑时留置的标准养护强度试件不得少于1组()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "交接检验是指由施工方与监理方经双方检查并对可否继续施工做出确认的活动()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程施工现场消防安全技术规范》,办公用房与宿舍间的防火间距不小于4米()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设工程质量检测是工程质量检测机构接受委托,依据国家有关法律、法规和工程建设强制性标准,对涉及结构安全项目的抽样检测和对进入施工现场的建筑材料构配件的见证取样检测()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对危险性较大的模板工程及高大模板支撑体系专项施工方案应按照相关规定组织专家论证()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工便道设置为单车道时,宽度宜不小于45m,并设置错车道间距不大于300m错车道宽度不宜小于65m,有效长度不宜小于20m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "水泥混凝土上加铺沥青面层的复合式路面,水泥混凝土路面结构可不检查抗滑构造深度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "钢梁制作时同一部位的焊缝返修不得超过三次,返修后的焊缝应按原质量标准进行复验,并且合格()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "顶进涵施工时,顶推力轴线应与桥涵中心线一致()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "植物成活率、覆盖率、植被盖度的检验至少在满二个年生长周期后进行()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "路基弯沉值代表值小于设计弯沉值时,相应分项工程为不合格()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土运输浇筑及间歇的全部时间可以超过混凝土的初凝时间()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "砂浆用水泥宜选用通用硅酸盐水泥()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "换填地基所用材料必须符合下列规定：换填用砂应为中、粗砂,有机质和含泥量均不得大于5％()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "涵管顶进施工中,混凝土达到设计强度90%方可顶进()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在冬、雨期施工时,不需更换混凝土配合比()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "半刚性基层的四个实测项目中,关键项目是压实度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "管道压浆前,事先对采用的压浆料进行试配水泥、高效减水剂、微膨胀剂、矿物掺合料、水等各种材料的称量准确到±2%()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各类砂浆均宜采用机械拌和,拌和时间宜为3～5min()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "压入管道的浆液采用搅拌速度不低于1000r/min的高速搅拌设备进行搅拌,浆叶最高速线速度限制在15m/s以内,保证浆液各项指标满足设计和压浆工艺要求,保证管道饱满密实()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "两焊接接头在钢筋直径的35倍且小于500mm范围内均视为同一截面()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在土质一定的条件下,含水率是影响击实效果的唯一因素",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土碳化主要危害是导致钢筋锈蚀",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "土的含水率是指土中水的质量与土体试样质量之比",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "细骨料泥块量时试样都需泡水24小时",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "试验机开机前的指针即使在零点时,不须进行调整,即可试验",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "54m长弯沉仪前后臂分别为36m和18m",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于大坍落度要求检测的扩展度,是指混凝土坍落后形成的最大直径尺寸和与之垂直方向测得的直径之和的平均值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水泥胶砂用标准砂必须满足规定的细度模数要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水泥胶砂试件成型时向搅拌机中加料的顺序为水泥、水、砂",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水灰比越大,普通混凝土的强度越大",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "原材料经监理平行试验定为不合格品,施工单位可申诉,但不能申请进行第三方试验",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土中掺入粉煤灰可以节约水泥,但不能改善混凝土的其他性能",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "试砼件抗压都是以三个抗压值的算术值作为其强度值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "做安定性试验时、试饼法可做为有争议时判定试验",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "两种砂子的细度模数相同,它们的级配不一定相同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在结构尺寸及施工条件允许下,应尽可能选择较大粒径的粗骨料,这样可以节约水泥",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "土工织物是柔性材料,主要通过抗拉能力来受荷载以发挥其工程作用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水泥比表面积测定的环境条件是：湿度不大于50%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土中的水泥用量越大,其质量就越好",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水泥混凝土流动性大说明其和易性好",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "流动性大的混凝土比流动性小的混凝土的强度低",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋牌号HRB400中400指钢筋的极限强度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土立方体抗压强度试验的标准养护条件为：温度20℃±2℃,相对湿度90%以上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钻芯法芯样经加工后,高度应为090～110d(d为芯样平均直径)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钻芯法可用于任何强度等级的混凝土强度的检测",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "细骨料和粗骨料取样的代表数量都按不超过400m³或600t为一个批次进行抽检",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水泥检测都要求有3天和28天的抗压、抗折强度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "隧道总体实测项目有隧道宽度隧道净高隧道偏位线路中心线与隧道中心线的衔接以及边坡仰坡",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "沉管法是将组装成一定长度的管段或钢筋棍凝土密封管段沉入水底开挖的沟槽内的管道铺设方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "有无超欠挖是洞身开挖外观鉴定的一项内容",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "隧道衬砌墙面平整度的规定值或允许偏差为20mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "喷射混凝土的工艺流程大致分为干喷、潮喷及湿喷",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二次衬砌混凝土强度达到5MPa时,方可拆模",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "自稳性极差的围岩宜采取压注水泥砂浆或化学浆液加固",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "隧道塌方后,应先清除塌体,再加固未塌方地段",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "隧道围岩节理(裂隙)按其发育程度可分为节理不发育、节理较发育、节理发育",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "隧道洞口工程包括石方开挖、洞口防护与排水工程、洞门建筑的制作、安装、明洞工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "隧道洞身开挖时,拱脚、墙脚以上1m允许个别欠挖",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "暗挖法修筑山岭公路隧道的施工方法有全断面法、台阶法、台阶分部法、上下导坑法、下导坑法、单侧壁导坑法(中壁墙法)、双侧壁导坑法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钻爆作业是根据现场情况随机进行钻眼、装药、接线和引爆",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二次衬砌混凝土厚度检查验收时可允许个别地方厚度小于设计值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预制构件的吊环必须采用未经冷拉的热轧光圆钢筋制作,且其使用时的计算拉应力应不大于60MPa",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "判别深埋与浅埋隧道的分界,可按荷载等效高度值,并结合地质条件、施工方法等因素综合判定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "隧道遇到溶洞处理措施,分别以引、堵、越、绕等措施进行处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "由于岩石风化需要一定时间,岩风化对开挖不生产影响",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "衬砌的施工缝应与设计的沉降缝、伸缩缝结合布置,在有地下水的隧道中,所有施工缝、沉降缝和伸缩缝均应进行防水处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二次衬砌的施作,应在围岩和锚杆支护变形基本稳定后进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "平面控制网可按精度划分为等与级两种规格,由高向低依次宜为二、三、四等和一、二、三级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "冬期施工,混凝土拌合物的出机温度不宜低于10℃",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预应力筋张拉锚固后,孔道应尽早压浆,且应在72h内完成,否则应采取避免预应力筋锈蚀的措施",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "有抗冻要求的桥涵混凝土工程,不得掺入引气剂,以免增加砼中含气量",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "轴心受拉和小偏心受拉构件不应采用绑扎接头",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "有抗渗要求的混凝土胶凝材料总量宜不小于300kg/立方米,砂率宜为35%-45%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢筋与模板之间设置的垫块,制作厚度不应出现负误差,正误差应不大于1mm",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "后张预应力混凝土结构或构件的所有管道均应在每个顶点设排气孔及需要时在每个低点设排水孔",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预应力筋张拉锚固后,孔道应尽早压浆,且应在48h内完成,否则应采取避免预应力筋锈蚀的措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对后张预应力混凝土梁、板,在施加预应力后可将其从预制台座吊移至场内的存放台座上后在进行孔道压浆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大体积混凝土工程的施工宜采用分层连续浇筑施工或推移式连续浇筑施工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钢筋保护层垫块可用砂浆垫块,垫块数量和位置应符合设计要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土运至浇筑地点后发生离析、坍落度不符合要求时,经试验人员现场同意后,可加水进行第二次搅拌",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "用回弹法检测混凝土强度,计算测区平均值时应从测区的16个回弹值中剔除1个最大值和1个最小值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "加密网应按一级GPS测量精度施测,其精度应保证最弱相邻点点位中误差下于±10mm",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "高强混凝土是指强度等级C50及以上的混凝土",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "网络RTK控制测量的测站设置,接收机的平面精度限值宜设置为20mm,高程精度限值宜设置为30mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大跨度拱桥悬浇拱圈时,应对拱肋在悬臂状态下的控制工况进行压屈分析计算,其压屈稳定系数大于3",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采用抗冻砂浆砌筑砌体时,抗冻砂浆使用时的温度可低于5℃,但不得低于3℃",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "基坑开挖时,为了保证边坡稳定,土体强度越高,要求边坡系数m越大",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地下连续墙深入基坑底面一下一定深度,仅起到减小动水压力防止流砂的目的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "测距作业时,仪器及反光镜的对中偏差不应大于2mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "强风化石料,崩解性岩石和盐化岩石经处理合格后方可用于路基填筑",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "路基冬期施工,开挖至路床顶面以上05m时,停止开挖,待冬期过后再施工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "贝克曼梁法测定弯沉值,为规范规定的标准方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公路工程施工应进行现场调查,应在施工组织设计中编制安全技术措施和施工现场临时用电方案,对于危险性较大的工程应编制专项施工方案,应附具安全验算结果,并组织专家进行论证、审查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "套箱围堰分为有底套箱和无底套箱",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "机械设备上各种安全防护、保险限位装置及各种安全信息装置必须齐全有效必须按照使用说明书规定的技术性能、承载能力和使用条件操作、使用,严禁超载、超速作业或任意扩大使用范围",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钢板桩围堰适用于各类土的水中基坑",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "龙门吊、架桥机等轨道行走类设备应设置夹轨器和轨道限位器轨道的基础承载力、宽度、平整度、坡度、轨距、曲线半径等应满足说明书和设计要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "桥台等结构物台背回填,靠近结构物的地方采用大型机械碾压,增加压实度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "高处作业上下通道应根据现场情况选用木爬梯、木人字梯、钢斜梯、钢直梯、人行塔梯,各类梯子安装应牢固可靠",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "导线测角中误差的计算可按左右角闭合差和导线方位角闭合差两种方式进行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "开工前,应根据施工需要设置安全作业区,并办理水上水下施工作业许可证,发布航行通告",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钻孔灌注桩施工中,如果施工顺利不需保留钻渣",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程船舶必须持有效的登记证书,船员必须持有与其岗位相适应的适任证书,船员配置必须满足最低安全配员要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "三角形网的水平角观测宜采用方向观测法,二等三角形网也可采用全组合观测法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "爆破作业单位实施爆破项目前,应按规定办理审批手续,在项目经理批准后方可实施爆破作业",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预应力孔道压浆用水泥浆强度不得低于20mpa",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "跨既有公路施工,通行区应搭设安全通道安全通道应满足通行要求,施工作业面底部应视实际情况悬挂安全网",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "自行吊机架设法适用于各种桥梁架设梁板",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "现浇墩、台身、盖梁施工使用的脚手架及作业平台应搭设牢固,不得与模板及其支撑体系联结",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "拌合站存料场地料仓硬隔离墙,隔离墙高度不应小于25m",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《安全生产风险分级管控办法》,C级及以上爆破工程均为一级风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当水准路线需跨越江河、湖塘、宽沟、洼地、山谷等时,两岸测站和立尺点应对称布设；跨越距离小于200m时,可采用单线过河；大于200m时,应采用双线过河并组成四边形闭合环",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据局《安全生产风险分级管控办法》,墩身、盖梁作业均为一级风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当千斤顶使用时间超过6个月或张拉超过300次时,应重新进行标定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据局《安全生产风险分级管控办法》,瓦斯隧道应为一级风险",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "桥梁施工,结构外露的模板,挠度为模板构件跨度的1/400",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据局《安全生产风险分级管控办法》,水下焊接应为一级风险",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "重力挡土墙中应设置排水孔,排水孔土中一侧应设置反滤包",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《安全生产风险分级管控办法》,有限空间作业应按照作业环境危险程度判定风险级别",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "热拌沥青混合料路面摊铺结束,若需提前开放交通时,可洒水冷却降低混合料温度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据局《安全生产风险分级管控办法》,场站生产作业应按照作业人数判定风险级别",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "岩石抗压强度与混凝土强度等级之比对于C60及以上的混凝土,应不小于2,其余应不小于1",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "隧道内施工不得使用以汽油为动力的机械设备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "沥青路面不得在气温低于8°C(高速公路和一级公路)或5°C(其他等级公路),以及雨天、路面潮湿的情况施工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "隧道施工应根据隧道内具体施工情况确定是否建立洞内外通信联络系统",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "沥青路面工程应积极采用经试验和实践证明有效的新技术、新材料、新工艺",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "双侧壁导坑法施工中,应及时施工初期支护并尽早封闭成环",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "路缘石宜采用石材或预制混凝土标准块",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "双侧壁导坑法施工中,侧壁导坑形状应近似于椭圆形断面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水泥混凝土流动性大说明其和易性好()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "仰拱应分段一次整幅浇筑,并应根据围岩情况严格限制分段长度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土碳化主要危害是导致钢筋锈蚀()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "隧道施工应采取综合防尘措施,并应配备专用检测设备及仪器隧道内存在砂尘的作业场作,每季度应至少取样分析空气成分一次、测定粉尘浓度一次",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "试验机开机前的指针即使在零点时,不须进行调整,即可试验()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "浅埋段不宜采用全断面法施工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "回弹法的检测面应为原状混凝土表面,并应清洁、平整,不应有疏松层()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地质条件不同的两孔隧道,宜先开挖地质条件较差的隧道,后开挖地质条件较好的隧道",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在进行石灰有效氧化钙和氧化镁的测定时,应将生石灰样品打碎,使颗粒不大于118mm,拌和均匀后用四分法缩减至300g左右,放置瓷研钵中研细()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于重要的工序或工程质量有重大影响的工序,实行三检制,三检制包括自检、互捡、抽样检查()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "发包人为政府,项目在中标后转履约需收取600万现金保证金,为突破营销底线项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "非现金收款银票大于80%不突破营销底线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "黄牌警示指公司在日常质量监管活动中,对质量管理问题突出、存在较大质量风险的单位实施公开警示并重点督促整改的管理措施()【科技质量部《公司质量风险红黄牌警示管理办法》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "质量管理体系主要由质量管理决策体系、质量保证体系、质量监督体系等组成【科技质量部《科技质量管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "四项基本原则是坚持社会主义道路,坚持人民民主专政,坚持共产党的领导,坚持马克思列宁主义、毛泽东思想()【出题来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "民主集中制是在公平的基础上的集中和集中指导下的民主相结合的制度,是党的根本组织制度和领导制度()【出题来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "两个维护是坚决维护习近平总书记党中央的核心、全党的核心地位,坚决维护党中央权威和集中统一领导()【出题来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "选拔任用党政领导干部必须坚持的原则一是党管干部；二是德才兼备、以德为先,五湖四海、任人唯贤；三是事业为上、人岗相适、人事相宜；四是公道正派、注重实绩、群众公认；五是民主集中制；六是依法依规办事()【出题来源：党委工作部《党政领导干部选拔任用工作条例》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党风廉政建设责任分工：纪委主体责任,党委监督责任()【出题来源：党委工作部《关于实行党风廉政建设责任制的规定》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党委(党组)书记全面从严治党第一责任人职责重要工作亲自部署,重大问题亲自过问,重点环节亲自协调,重要案件亲自督办()【出题来源：党委工作部《党委(党组)落实全面从严治党主体责任规定》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "三严三实：严以修身、严以用权、严以律己,谋事要实、创业要实、做人要实()【出题来源：党委工作部习近平总书记在十二届全国人大二次会议】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的群众路线是一切为了群众,一切依靠群众,从群众中来,到群众中去()【出题来源：党委工作部《毛泽东选集》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "乡村振兴战略：坚持农业农村优先发展,按照产业兴旺、生态宜居、乡风文明、治理有效、生活富裕的总要求,建立健全城乡融合发展体制机制和政策体系,加快推进农业农村现代化【出题来源：党委工作部《习近平总书记在十九大报告》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当需要采取工程质量约谈是,原则上采取逐级约谈【科技质量部《科技质量管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国特色现代国有企业制度：特就特在把党的领导融入公司治理各环节,把企业党组织内嵌到公司治理结构之中,明确和落实党组织在公司法人治理结构中的法定地位,做到组织落实、干部到位、职责明确、监督严格【出题来源：党委工作部《关于中央企业在完善公司治理中加强党的领导的意见》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建排头、行业领先的内涵：六个排头是指在中建系统做到经济指标、业务板块、体系管理、发展能力、团队建设、党建工作排头,六个领先是指在建筑行业实现战略引领、市场竞争、创新发展、精益管控、品牌打造、文化建设领先【出题来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业领导人员必须做到对党忠诚、勇于创新、治企有方、兴企有为、清正廉洁【出题来源：党委工作部《习近平在全国国有企业党的建设工作会议上的讲话》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业党委(党组)发挥领导作用,把方向、管大局、保落实,依照规定讨论和决定企业重大事项()【出题来源：党委工作部《中国共产党党组工作条例》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的作风问题,核心是党群关系问题()【出题来源：党委工作部习近平在中共中央政治局第十六次集体学习时的讲话】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全面建设社会主义现代化国家的首要任务是高质量发展【出题来源：党委工作部《党的二十大报告》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的干部是党的事业的骨干,是人民的公仆,要做到忠诚干净担当党按照德才兼备、以才为先的原则选拔干部,坚持五湖四海、任人唯贤,坚持事业为上、公道正派,反对任人唯亲,努力实现干部队伍的革命化、年轻化、知识化、专业化【出题来源：党委工作部《党章第六章三十五条》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "腐败是危害党的生命力和战斗力的最大毒瘤,反腐败是最彻底的自我革命只要存在腐败问题产生的土壤和条件,反腐败斗争就一刻不能停,必须永远吹冲锋号【出题来源：党委工作部《党的二十大报告》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司属二级单位指公司下属区域/专业分公司、设计研究院、子公司、城市公司、代管机构等()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "区域经理部的职能包括市场营销、项目集约管控、客户维护、专业业务协同()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司六化一引领举措中引领指市场引领()【企业策划与管理部+公司十四五规划】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司的企业使命是品质保障、价值创造()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "城市公司的组织架构是五部一室()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "战略评估是对战略规划及其执行情况进行的系统分析与评价,以确定战略规划的适宜性和战略实施的有效性()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党委会是企业最高决策机构,按公司法、公司章程的规定履行决策职能()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "已通过立项审批,并取得授权委托书的单位,如相当长时间内营销工作无实质性进展或新的重大突破,局总部可视情况取消其营销授权【基础设施事业部+局《市场与客户管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司党委会负责审定二级单位年度绩效考核结果()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "协同公司不需配置专职A类基础设施营销、投资人员【基础设施事业部+《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司执董会负责审定总部部门量化目标考核结果()【企业策划与管理部+战略与组织管理手册】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局协同项目指有两家或超过两家的局属二级单位自愿或通过局协调后,联合、共同参与同一项目的营销或生产工作的项目【基础设施事业部+局《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "目前房建总承包业务是公司最主要的收入和利润来源()【企业策划与管理部+公司十四五规划】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业践行愿景是成为中建领先、行业著名、客户满意、员工幸福的建设集团()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目中标后,根据项目性质组织相关人员进行的设计专项策划；对于EPC、PPP模式等处于设计阶段的项目,主要以与设计单位协调后入图为主【基础设施事业部+基础设施基础知识】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建造主业是我局赖以生存的根本()【企业策划与管理部+637战略】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "报名阶段项目名称发生改变的,不需先向局基础设施事业部提出名称变更申请【基础设施事业部+局《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《关于推动大型易地扶贫搬迁安置区融入新型城镇化实现高质量发展的指导意见》提出,将城镇安置区项目统一纳入所迁入地区国民经济和社会发展规划、国土空间规划及相关建设规划()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于招标文件评审,所有投标工程均先由三级单位组织评审,各部门根据《CSCEC8B-CL-2019合约法务管理手册》重大风险管理规定及评审表要求组织评审,并根据工程分类和风险规定逐级上报审批【基础设施事业部+《合约法务管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《江苏省政府印发关于推动经济运行率先整体好转若干政策措施的通知》提出阶段性缓缴工程质量保证金,房屋建筑、市政、交通、水利等在建项目在2023年1月1日至6月30日期间应缴纳的各类工程质量保证金,自应缴之日起可缓缴2个季度,建设单位不得以扣留工程款等方式收取工程质量保证金()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标拟派项目经理为局控项目经理的,当属于本单位自有项目经理,不需向局基础设施事业部核准【基础设施事业部+局《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《安徽省人民政府办公厅关于印发进一步盘活存量资产扩大有效投资实施方案的通知》提出,对权属清晰、运营成熟稳定的收费公路、港口等项目,支持通过基础设施领域不动产投资信托基金(REITs)、资产证券化等方式进行盘活()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级提请的各类评审信息必须真实有效,营销过程中相关信息发生重大变化应及时向局基础设施事业部/二级单位总部做出说明【基础设施事业部+局《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《安徽省人民政府办公厅关于印发进一步盘活存量资产扩大有效投资实施方案的通知》提出,允许参与水利开发利用的市场主体依法享有水资源利用优先权,在生态环境保护政策允许范围内从事农业、文旅、康养等产业开发()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局控项目经理主要指近5年有获得过全国优秀项目经理(全国优秀建造师)、国家级优质工程奖(主要包括鲁班奖、国优、詹天佑、钢结构金奖)或局重大工程的持证项目经理【基础设施事业部+局《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《安徽省人民政府办公厅关于印发进一步盘活存量资产扩大有效投资实施方案的通知》提出,以兼并重组、资产划转、联合整合等方式,将分属不同项目单位的同类型资产权属划转到同一原始权益人,积极通过REITs、资产证券化等方式盘活()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "5亿元以下基础设施类项目不需进行投标总结【基础设施事业部+《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《安徽省人民政府办公厅关于印发进一步盘活存量资产扩大有效投资实施方案的通知》提出,在能源与生态环保领域,支持存量可再生能源项目单位与各类银行金融机构通过补贴确权贷款合作等方式,提升存量项目现金流()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "室外游乐场属于基础设施【基础设施事业部+《A类基础设施业务管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《安徽省人民政府办公厅关于印发进一步盘活存量资产扩大有效投资实施方案的通知》提出,在新型基础设施领域,鼓励数据中心、第五代移动通信技术(5G)网络、人工智能、宽带网络等新型基础设施REITs项目发行上市,积极探索通过PPP模式盘活存量()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中建八局关于规范A类基础设施重点项目主要履约人员任职的通知》,主要履约人员不包括试验室主任【基础设施事业部+局基础设施事业部文件】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《安徽省人民政府办公厅关于印发进一步盘活存量资产扩大有效投资实施方案的通知》提出,在仓储物流领域中,推动枢纽和园区发展专业化、社会化物流信息平台,对闲置资产实施信息化、技术化改造探索以大型龙头企业托管、代管的方式,整合存量设施资源,有序盘活老旧仓储设施()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党风政风监督是指纪检机关对纪检队伍的自我监督【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《国家以工代赈管理办法》所称以工代赈是指社会投资建设基础设施工程,受赈济者参加工程建设获得劳务报酬,以此取代直接赈济的一项扶持政策()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的纪律检查工作坚持把一体推进不敢腐、不能腐、不想腐作为新时代全面从严治党的基本方针、反腐败斗争的重要方略【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《国家以工代赈管理办法》提出,公益性基础设施主要包括农村生活、农牧产业、交通、水利等基础设施、林业草原和城乡易地扶贫搬迁安置点配套公益性基础设施等()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "坚持教育党员、干部坚定理想信念宗旨,提高党性觉悟,提升道德修养,涵养廉洁文化,筑牢思想上拒腐防变的堤坝,强化不能腐【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "产业发展配套基础设施主要包括农牧产业、乡村文化旅游产业、林业草原产业等基础设施和城乡易地扶贫搬迁安置点后续产业基础设施等()【企业策划与管理部+时政信息】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业所得税种的高新技术企业享受10%税收优惠,减按15%征收【财务+企业所得税法】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》第二十三条规定,一人有本条例规定的两种以上(含两种)应当受到党纪处分的违纪行为,应当执行其中最重的处分【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "两铁一交一般指的是中国中铁、中国铁建、中国交建()【企业策划与管理部+时政信息】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "接受、提供可能影响公正执行公务的宴请或者旅游、健身、娱乐等活动安排,情节较轻的,依据《中国共产党纪律处分条例》第九十二条规定,给予警告或者严重警告处分【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "数字经济可以分为两大部分：产业数字化、数字产业化()【企业策划与管理部+公司战略资讯】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定,各级党组织应当把信任激励同问责追责结合起来,促使党的领导干部做到有权必有责、有责要担当,用权受监督、失责必追究【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司董事会的职权是定战略、作决策和防风险,其中定战略和防风险一般不授权,作决策中经理层事项、特别决议事项等不可授权,其他可授权()【企业策划与管理部+公司治理主体决策事项清单】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党纪律处分条例》,党组织和党员违反党章和其他党内法规,违反国家法律法规,违反党和国家政策,违反社会主义道德,危害党、国家和人民利益的行为,依照规定应当给予纪律处理或者处分的,都必须受到追究但自行为发生之日起,超过五年的不再追究【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "需公司党委会前置事项,一般不授权给执董会()【企业策划与管理部+公司治理主体决策事项清单】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党纪律处分条例》,党员受到撤销党内职务处分,一年半内不得在党内担任和向党外组织推荐担任与其原任职务相当或者高于其原任职务的职务【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "收到接待任务时,要根据领导要求,及时与对方联系,了解宾客信息：到访时间、目的、活动范围、人员情况(单位全称、职务、级别、性别、人数),往返情况(始发地、班次、车次、出发时间、预计到达及离开时间)；拟定初版的通知事项向分管领导汇报【办公室】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接待工作中,如来宾中有女宾,尽量确保至少2名女性接待人员【办公室】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "接待工作中,与对方沟通确定后,即可形成基本的日程安排【办公室】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据日程安排拟定接待方案,内容包括迎送陪同、视察参观、会议座谈、宴请配餐、住宿、车辆、着装要求等,接待方案中备注接待细节及注意事项【办公室】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接待工作中,准备接机(接站)牌,要用白纸黑字写明【办公室】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "上楼梯时,客人走在前,引导者或主人走在后；下楼梯时,引导者或者主人走在前,客人走在后【办公室】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "接名片时应以双手承接,若与领导一并接待或拜访客户时,则应在领导与客户交换名片后再视需要与客户交换名片【办公室】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "陪同领导坐车,领导之间若是在谈工作,除非问到你,或希望你介入,否则尽量不插话；对车内领导谈论的话题注意保密【办公室】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "年功津贴月标准为中建系统内认可工龄：0-5年,10元/年；6-15年,15元/年；16-30年,20元/年；31年及以上,25元/年【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收入证明开具应注明用途,开具的金额应为税前收入,可以超额开具()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "新提任岗位工资标准均执行该岗位档级中的最低档()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导干部操办本人和配偶、子女及父母的婚丧嫁娶事宜中,可以适当邀请与行使职权和执业有关的劳务和物资供应商等单位人员参加()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一级建造师应配合取得安全生产考核合格证(B类证)后,方可发放执业资格补贴,未取得的一律不得发放()【人力资源《执业资格管理办法》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对党员领导干部而言,家风是个人小事、家庭私事()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "技术(职称)津贴标准：高级300元/月()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "作假账、作假报表、设立小金库是财会人员的事情,与领导没有关系()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "女员工已参加生育保险的,产假期间的待遇按参保地生育保险有关政策由本人或委托他人申请领取()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导人员的配偶、子女、亲友在自己管理的管辖范围内可以从事项目分包工程或供销、租赁、加工等业务()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2020、2021年度考核等级存在不合格的人员,不予申报2022年度职称评审()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理须持有一级造价师证书()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "评标小组人员数量应为五人以上的双数【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "提任项目副经理岗位,须具备不少于1年的技术类岗位经历()【人力资源《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "将单项采购拆分为多个招标,化整为零,规避招标审批属于不合规行为【出题来源：采购管理部《中建八局采购合规管控实施细则》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主体、二次结构定标环节,需按照要求上传标前交底书【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理廉洁从业履职准则三主动包括主动公开,合法依规,公平公正主动回避,公私分明,克己奉公主动作为,规范操作,坚守底线【出题来源：采购管理部《中建八局采购管理廉洁从业准则》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党组织对违犯党的纪律的党员,应当本着严惩不贷的精神,按照错误的性质和情节轻重,给以批评教育直至纪律处分()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "不同投标单位的投标报价呈明显比例或梯队,可以认定为围标串标【出题来源：采购管理部《中建八局采购合规管控实施细则》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "最低投标价法,但投标价低于成本的除外,一般适用于技术难度一般没有特殊要求的施工分包、物资【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "综合评估法,一般适用于技术难度大要求高的施工分包、物资,如钢结构、高支模、地下暗挖、大型机械租赁、单边支模、爬架爬模租赁等高大精尖难项目,或工期超出定额工期20%以上分包需要采取特殊措施抢工的项目【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2023年要不断压缩采购全过程时间,不同项目业态要采取针对性招标方案和招标流程,确保从招标发起至合同签订平均用时控制在40天以内,力争35天以内【出题来源：采购管理部2023年工作会行政工作报告】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2023年要抓好集采成果落地,各单位加强过程中监督力度,物资要扎实做好验收工作,确保集采物资样品与送货质量无偏差,不合格品100%退场【出题来源：采购管理部2023年工作会行政工作报告】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "第三曲线业务具有前瞻性、成长性特征【工程研究院,第三曲线,2023董事长工作会讲话】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我国目标为2035年建筑工业化全面实现,迈入智能建造世界强国行列【工程研究院,第三曲线,住房和城乡建设部等部门关于推动智能建造与建筑工业化协同发展的指导意见】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在务虚会上明确了公司第三曲线的十个业务领域,包含涉水环保、涉铁业务、新基建、高科技厂房等领域()【工程研究院,第二第三曲线,2023年董事长工作报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "PPP在中国被称为政府和社会资本合作模式【投资发展部+投资基础概念】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局投资管理要求,对于投融资带动总承包项目,项目公司不应纳入我方合并会计报表范围【投资发展部+《投资管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《投资管理手册》规定,若PPP项目合作期限超过15年,应在协议中明确我方享有在运营期内通过引入外部投资者或资产证券化等方式提前收回投资的权利【投资发展部+《投资管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "融投资带动总承包项目概念：指为获取项目施工总承包权,而对项目进行小额度融资或投资,且在实施过程中不承担其他融投资及担保义务,并按约定时间和方式收回我方投入的本金及相应利息(或回报)的项目【投资发展部+《投资管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "原则上应在地方政府一般公共预算收入高、债务率高、偿债能力强、信用好的地区开展投资业务【投资发展部+《投资管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "实干奋斗争先的年度主题,目的就是引导和激励大家强化作风、提振士气、坚定信念、攻坚克难,各单位、各系统可根据实际情况再制定其他主题()【企业策划与管理部+23年工作会董事长报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑产业公司要转变思路,增加重资产投入,积极扩大轻资产运营方式()【企业策划与管理部+23年工作会董事长报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "EPC管理未来一年的工作重点将向商务条线倾斜()【企业策划与管理部+23年工作会董事长报告】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "明年公司将启动2+5规划编制工作()【企业策划与管理部+23年工作会董事长报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "要进一步完善监督体系,构建以党外监督为主导、各类监督贯通协调机制()【企业策划与管理部+23年工作会董事长报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "局和公司成立40周年活动应坚持隆重、热烈、简朴、奋进的原则()【企业策划与管理部+23年工作会行政报告】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "要坚持群建带动党建,党建服务群建的工作思路()【企业策划与管理部+23年工作会董事长报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司2023年要培育1个150亿级、2个100亿级分公司()【企业策划与管理部+23年工作会行政报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司流程优化的目标是推动公司从职能型组织向流程型组织转变()【企业策划与管理部+公司23年工作要点】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2023年,公司要加快久竣未结项目销项,确保2020年以前久竣未结项目结算完成率达到100%()【企业策划与管理部+公司23年工作要点】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导干部操办本人和配偶、子女及父母的婚丧嫁娶事宜中,可以适当邀请与行使职权和执业有关的劳务和物资供应商等单位人员参加()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "国有企业领导人员应当正确行使经营管理权,防止可能侵害公共利益、企业利益行为的发生()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业员工个人或数人可以集资购买机具、设备等转租给所属项目,但必须提前报备()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "国有企业员工严禁违反规定收送礼品、礼金、有价证券、支付凭证和商业预付卡()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对党员领导干部而言,家风是个人小事、家庭私事()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "坚持吃苦在前属于党员廉洁自律规范的内容()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "严禁公款旅游是党员必须牢记的廉洁纪律()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "任何项目管理人员不准接受劳务队、材料供应商和有关业务往来的单位及个人的现金、有价证券和贵重物品()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "员工不准以企业名义私下承揽、经营工程不准项目部私下承揽工程体外运行,把收入用作分配或他用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "效益好的项目,除了正常工资和项目兑现外,项目经理可以根据施工生产阶段,设立特殊奖励、补贴鼓励项目员工努力工作()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》第七十三条规定,不按要求报告或者不如实报告个人去向,情节较重的,给予警告或者严重警告处分()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导人员的配偶、子女、亲友在自己管理的管辖范围内可以从事项目分包工程或供销、租赁、加工等业务()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "用公款旅游、借公务差旅之机旅游或者以公务差旅为名变相旅游的,对直接责任者和领导责任者,情节较轻的,给予警告或者严重警告处分；情节较重的,给予撤销党内职务或者留党察看处分；情节严重的,给予开除党籍处分()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "加强党组织自上而下的监督,上级一把手必须抓好下级一把手()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "坚持受贿行贿一起查,是我们党惩治腐败的鲜明立场,也是深入推进反腐败斗争的基本原则()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导干部违规经商办企业未如实申报的,应当同时对违规经商办企业和未如实申报行为进行处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党的根本宗旨是全心全意为人民服务()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业践行愿景是成为中建领先、行业知名、客户首选、员工幸福的建设集团()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主要应对风险为政策风险、市场开发风险、合作伙伴风险()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国共产党的最高理想和最终目标是为人民服务()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党在社会主义初级阶段的基本路线是领导和团结全国各族人民,以经济建设为中心,坚持四项基本原则,持改革开放,自力更生,艰苦创业,为把我国建设成为富强民主文明和谐美丽的社会主义现代化强国而奋斗()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党执政兴国的第一要务是政治()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "发展的根本目的是人民当家做主()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "四项基本原则是坚持社会主义道路,坚持人民民主专政,坚持共产党的领导,坚持马克思列宁主义、毛泽东思想()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "两个维护是坚决维护习近平总书记党中央的核心、全党的核心地位,坚决维护党中央权威和集中统一领导()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我国社会的主要矛盾是人民日益增长的物质文化需要和不平衡不充分的发展之间的矛盾()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "五位一体总体布局是统筹推进经济建设、政治建设、思想建设、社会建设、生态文明建设【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "四个全面战略布局是全面建设社会主义现代化国家、全面深化改革、全面依法治国、全面从严治党()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "申请入党的年龄条件是年满十八岁()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合格党员标准：四讲四有,即讲政治、有信念,讲规矩、有纪律,讲道德、有礼貌,讲奉献、有作为【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预备党员的预备期为一年,从支部大会通过其为预备党员之日算起()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党员如果没有正当理由,连续一年不参加党的组织生活,或不交纳党费,或不做党所分配的工作,就被认为是自行脱党支部大会应当决定把这样的党员除名,并报上级党组织批准()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的最高领导机关是党的全国代表大会及其所产生的中央委员会()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的基层组织是党在社会基层组织中的战斗堡垒,是党的全部工作和战斗力的基础()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的基层委员会产生方式,党的基层组织设立的委员会一般由党员大会选举产生党员人数在200名以上或者所辖党组织驻地分散的,经上级党组织批准,可以召开党员代表大会进行选举()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员代表名额一般为100~200名,最多不超过250名()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员代表候选人的差额不少于应选人数的10%()【题目来源：党委工作部《新编基层党务工作手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的基层委员会委员候选人的差额不少于应选人数的15%()【题目来源：党委工作部《新编基层党务工作手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员代表大会选举主持由大会主席团主持大会主席团成员由上届党的委员会或者各代表团(组)从代表中提名,经全体代表酝酿讨论,提交党员代表大会预备会议表决通过()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "选举收回的选票数量等于或者多于投票人数,选举有效()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "选拔任用党政领导干部必须坚持的原则一是党管干部；二是德才兼备、以德为先,五湖四海、任人唯贤；三是事业为上、人岗相适、人事相宜；四是公道正派、注重实绩、群众公认；五是民主集中制；六是依法依规办事()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党支部的主要职责是直接教育党员、管理党员、监督党员和组织群众、宣传群众、凝聚群众、服务群众()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党最根本、最重要的纪律是组织纪律()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的纪律处分工作应当坚持的原则是坚持党要管党、全面从严治党,坚持党纪面前一律平等,坚持实事求是,坚持民主集中制,坚持惩前毖后、治病救人()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的思想路线是一切从实际出发,理论联系实际,实事求是,在实践中检验真理和发展真理()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的政治建设首要任务是全心全意为人民服务()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "党执政后的最大危险是脱离群众()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的伟大事业是中国特色社会主义伟大事业()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党的伟大工程是党的社会主义建设工程()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "国有企业党建工作要求进章程国有企业应当将党建工作要求写入公司章程,写明党组织的职责权限、机构设置、运行机制、基础保障等重要事项,明确党组织研究讨论是董事会、经理层决策重大问题的前置程序,落实党组织在公司治理结构中的法定地位()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业党建工作报告要求企业党组织每年年初向上级党组织全面报告上年度党建工作情况,党组织领导班子成员定期向本企业党组织报告抓党建工作情况()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党风廉政建设责任分工：纪委主体责任,党委监督责任()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "国有企业专职副书记的配备：中央企业党委(党组)配备专职副书记,专职副书记一般进入董事会且不在经理层任职,专责抓好党建工作规模较大、职工和党员人数较多的中央企业所属企业(单位)和地方国有企业党委,可以配备专职副书记()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业重大经营管理事项必须经党委研究讨论后,再由董事会或者经理层作出决定()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党委(党组)书记全面从严治党第一责任人职责重要工作亲自部署,重大问题亲自过问,重点环节亲自协调,重要案件亲自督办()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重大事项请示报告制度关于重大事项的规定：是指超出党组织和党员、领导干部自身职权范围,或者虽在自身职权范围内但关乎全局、影响广泛的重要事情和重要情况,包括党组织贯彻执行党中央决策部署和上级党组织决定、领导经济社会发展事务、落实全面从严治党责任,党员履行义务、行使权利,领导干部行使权力、担负责任的重要事情和重要情况()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "三严三实：严以修身、严以用权、严以律己,谋事要实、创业要实、做人要实()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国共产党人的初心和使命是为中国人民谋幸福,为中华民族谋复兴()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "共青团的性质、地位和作用：中国共产主义青年团是中国共产党领导的先进青年的群团组织,是广大青年在实践中学习中国特色社会主义和共产主义的学校,是党的助手和后备军【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "制定《中国共产党纪律检查机关监督执纪工作规则》的依据是：宪法【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "共青团中央委员会受地方各级组织党的委员会领导()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "廉洁文化示范点进项目,要求进行七项权力识别,主要指项目上的：审核权、人事实权、采购实权、放行实权、计量实权、财务实权、拥有关键信息权【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "上级纪检监察机关可以将其直接管辖的事项指定下级纪检监察机关进行审查调查【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "立案审查工作一般经过受理、初核、立案、审查、审理等五个阶段【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "受到诫勉的领导干部影响年度考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑第八工程局有限公司党委关于深入贯彻落实中央八项规定精神进一步加强作风建设的具体办法》中要求,改进调查研究工作,其中包括注重实效、轻车简从、简化接待【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑第八工程局有限公司党委关于深入贯彻落实中央八项规定精神进一步加强作风建设的具体办法》中要求,在精简会议活动中包括减少数量、控制规模和时间、提高效率和质量、严格控制经费【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑集团有限公司超英廉洁文化示范点建设实施细则》,超英廉洁文化示范点建设成效,主要看创建项目是否取得明显经济效益、社会效益和财务效益【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑集团有限公司超英廉洁文化示范点建设实施细则》,做到四个满意即业主满意、企业满意、员工满意和关联方满意【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "留党察看最长不超过两年党员在留党察看期间没有表决权和被选举权,但具有选举权【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员留党察看处分分为留党察看一年和留党察看二年【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新时代中国特色社会主义总任务是：实现社会主义现代化和中华民族伟大复兴,在全面建成小康社会的基础上,分两步走在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国特色社会主义文化三个坚持是坚持为人民服务、为社会主义服务,坚持百花齐放、百家争鸣,坚持发展经济、创新性发展()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "我国的基本政治制度是中国共产党领导的多党合作和政治协商制度、民族区域自治制度、基层群众自治制度()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党籍指党员资格,被批准为正式党员之日起即取得该资格()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "国有企业领导人员应当正确行使经营管理权,防止可能侵害公共利益、企业利益行为的发生()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业员工严禁违反规定收送礼品、礼金、有价证券、支付凭证和商业预付卡()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "坚持吃苦在前属于党员廉洁自律规范的内容()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的各级纪律检查委员会坚定维护党章,促进党组织和党员牢固树立党章意识、严格遵守党章规定,发挥党章作为管党治党总章程的作用,以严明的纪律巩固党的团结统一【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的各级纪律检查委员会协助同级党的委员会加强党风建设,锲而不舍落实中央八项规定精神,大力弘扬党的光荣传统和优良作风,驰而不息纠治形式主义、官僚主义、享乐主义和奢靡之风,坚决纠正损害群众利益的不正之风,保持党同人民群众的血肉联系【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "严禁公款旅游是党员必须牢记的廉洁纪律()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发挥党的纪律检查工作在党和国家监督体系中的重要作用,强化对权力运行的制约和监督,重点加强对领导干部特别是主要领导干部的监督,提升监督全覆盖质量,增强监督的政治性、严肃性、协同性、有效性【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "任何项目管理人员不准接受劳务队、材料供应商和有关业务往来的单位及个人的现金、有价证券和贵重物品()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "员工不准以企业名义私下承揽、经营工程不准项目部私下承揽工程体外运行,把收入用作分配或他用()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全面从严治党基础在全面、关键在严全面就是管全党、治全党；严就是真管真严、敢管敢严、长管长严【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "效益好的项目,除了正常工资和项目兑现外,项目经理可以根据施工生产阶段,设立特殊奖励、补贴鼓励项目员工努力工作()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目领导人员、关键岗位人员具有相对集中且独立的七项权力分别是：审核权、人事权、采购权、放行权、计量权、财务权、关键信息拥有权【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》第七十三条规定,不按要求报告或者不如实报告个人去向,情节较重的,给予警告或者严重警告处分()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "纪检监督是党内监督,担负着协助党发挥统揽全局、协调各方领导核心作用的重要职能,根本使命是为了维护党中央权威和集中统一领导【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》第十二条规定,党员受到留党察看处分,其党内职务自然撤销()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的十四届中央纪委二次全会,首次作出反腐败斗争的形势是严峻的重大判断【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "用公款旅游、借公务差旅之机旅游或者以公务差旅为名变相旅游的,对直接责任者和领导责任者,情节较轻的,给予警告或者严重警告处分；情节较重的,给予撤销党内职务或者留党察看处分；情节严重的,给予开除党籍处分()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "加强党组织自上而下的监督,上级一把手必须抓好下级一把手()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "坚持受贿行贿一起查,是我们党惩治腐败的鲜明立场,也是深入推进反腐败斗争的基本原则()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收受可能影响公正执行公务的礼品、礼金,只要领导干部的权力、地位对对方在政治、经济等方面存在一定影响即可认定,不要求发生实际未公正履职的情况【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导干部违规经商办企业未如实申报的,应当同时对违规经商办企业和未如实申报行为进行处理()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国共产党纪律处分条例》,开除党籍是党内最高处分【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全面从严治党永远在路上,党的自我革命永远在路上【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定,党委应当严格执行各项监督制度,加强职责范围内党内监督工作,既加强对本部门本单位的内部监督,又强化对本系统的日常监督【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定,党的领导干部应当强化自我约束,经常对照党章检查自己的言行,自觉遵守党内政治生活准则、廉洁自律准则,加强党性修养,陶冶道德情操永葆共产党人政治本色【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》规定,运用监督执纪四种形态,经常开展批评和自我批评、约谈函询,让红红脸、出出汗成为常态;党纪轻处分、组织调整成为违纪处理的大多数;党纪重处分、重大职务调整的成为少数;严重造纪涉嫌违法立案审查的成为极少数【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党纪律处分条例》,党员干部必须正确行使人民赋予的权力,清正廉洁,反对任何滥用职权、谋求私利的行为【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党执政兴国的第一要务是科技()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "党支部书记一般应当具有3年以上党龄()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党支部党员大会是党支部的议事决策机构,由全体党员参加,一般每3个月召开1次()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "现阶段我国社会的主要矛盾是人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预备党员的预备期为一年,从预备期满转为正式党员之日算起()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员如果没有正当理由,连续六个月不参加党的组织生活,或不交纳党费,或不做党所分配的工作,就被认为是自行脱党支部大会应当决定把这样的党员除名,并报上级党组织批准()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的中央委员会是党的全国代表大会选举产生,每届任期五年,在全国代表大会闭会期间,中央委员会执行全国代表大会的决议,领导党的全部工作,对外代表中国共产党()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的群众路线是一切为了群众,一切依靠群众,从群众中来,到群众中去()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业党委组成一般由6至9人组成,最多不超过10人,其中书记1人、副书记1至2人()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "两个一百年奋斗目标：到建党一百年时,全面建成小康社会；到新中国成立一百年时,全面建成社会主义现代化强国()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新时代坚持和发展中国特色社会主义的根本动力是全面深化改革()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "人类命运共同体在追求本国利益时兼顾他国合理关切,在谋求本国发展中促进各国共同发展()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当前党和国家工作总基调是开拓进取【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "乡村振兴战略：坚持农业农村优先发展,按照产业兴旺、生态宜居、乡风文明、治理有效、生活富裕的总要求,建立健全城乡融合发展体制机制和政策体系,加快推进农业农村现代化【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国精神是以爱国主义为核心的民族精神,以开拓进取为核心的时代精神【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一国两制即一个国家,两种制度,是中国政府为实现国家和平统一而提出的基本国策按照邓小平的论述,一国两制是指在一个中国的前提下,国家的主体坚持社会主义制度,香港、澳门、台湾保持原有的资本主义制度长期不变【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "营改增是指营业税改增值税,是指以前缴纳营业税的应税项目改成缴纳增值税,增值税只对产品或者服务的增值部分纳税,减少了重复纳税的环节",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "长三角一体化紧扣两个关键词：一体化、高经济【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "粤港澳大湾区范围：香港、澳门两个特别行政区,广东省广州、深圳、珠海、佛山、惠州、东莞、中山、江门、肇庆九个珠三角城市【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国特色现代国有企业制度：特就特在把党的领导融入公司治理各环节,把企业党组织内嵌到公司治理结构之中,明确和落实党组织在公司法人治理结构中的法定地位,做到组织落实、干部到位、职责明确、监督严格【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国有企业领导人员的第一职责是为国家工作【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当前我国疫情防控总体策略：外防输入、内防反弹,健全及时发现、快速处置、精准管控、有效救治的常态化防控机制【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我们党最可靠的力量源泉是人民群众拥护和支持【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "近代以来实现中华民族伟大复兴的三大里程碑是建立中国共产党、成立中华人民共和国、推进改革开放和中国特色社会主义事业【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "贯彻新形势下区域协调发展思路的要求:尊重客观规律,发挥比较优势,完善空间治理,保障民生底线【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新文化运动开始的标志是1915年9月,参加过辛亥革命的李大钊在上海创办《青年杂志》,新文化运动由此发端【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的历史上第一个中央纪律检查监督机构是中国共产党第三次全国代表大会选举产生的中央监察委员会【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "社会主义制度在中国确立的主要标志是三大改造胜利完成【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党支部的设置：凡是正式党员3人以上的,都应当成立党支部党支部党员人数一般不超过50人【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党费缴纳标准：每月工资收入(税后)在3000元以下(含3000元)者,交纳月工资收入的05％；3000元以上至5000元(含5000元)者,交纳1％；5000元以上至10000元(含10000元)者,交纳15％；10000元以上者,交纳2％【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建排头、行业领先的内涵：六个排头是指在中建系统做到经济指标、业务板块、体系管理、发展能力、团队建设、党建工作排头,六个领先是指在建筑行业实现战略引领、市场竞争、创新发展、精益管控、品牌打造、文化建设领先【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业领导人员必须做到对党忠诚、勇于创新、治企有方、兴企有为、清正廉洁【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业党委(党组)发挥领导作用,把方向、管大局、保落实,依照规定讨论和决定企业重大事项()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党的作风问题,核心是党群关系问题()【题目来源：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "董事会是全面风险与合规管理的决策机构,负责批准全面风险管理议案、相关机构设置、重特大风险事项研判与决策、风险评估报告审批、考核与追责事项审核等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "风险与合规管理委员会是本单位经理层关于合规管理的议事机构,主要合规管理职责包括：推进合规管理体系建设、听取并审议重大合规情况汇报、定期召开专题会议研究重点难点问题、加强部门协同配合统筹推进合规管理各项工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总部各部门和二级单位需每月10日前形成全面风险排查和处置情况简报,并按要求报公司商务管理部,由商务管理部汇总形成公司月度简报",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "纪检监察部门、违规经营投资责任追究委员会等监督机构,负责就监督过程中发现的风险问题,提出巡查整改建议,跟踪督促责任部门整改落实,同时对因风险事项识别预警不及时和管控应对不当造成的损失,按照规定进行追责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "应将合规管理要求、合规禁止清单纳入各级审计、巡视、巡察,对违规事项进行专项梳理、排查",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "海外规章制度、经济合同、重大决策等未经合规审查可以实施",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "激活合规管理两道防线,各部门、各单位在合规管理体系中各负其责、各司其职、紧密配合,确保合规管理体系运行通畅,合规风险得以有效防范",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合规管理要纳入企业主要负责人履行推进法治建设第一责任人职责,明确各业务系统、各级机构合规职责,加大违规风险排查力度,对违法违规行为严肃追责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总经理办公会是本单位经理层关于合规管理的决策机构,主要合规管理职责包括：建立健全合规管理组织架构、批准合规管理具体制度、批准合规管理计划、采取措施确保合规制度得到有效执行、明确合规管理流程、及时制止并纠正不合规的经营行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司全面风险管理的总体要求是通过完善全面风险管理体系与制度,在公司总部各部门、各层级强化风险的识别、预警、管控与处置责任,推进风险管理更加全面化、体系化、及时化与有效化,确保公司各类风险全面受控",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司全面风险管理的管理原则是：预防为主,体系融合,重点突出",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分公司商务法务部牵头负责本辖区的生产经营合规和项目风险管理,设立兼职风险联络员,牵头组织本辖区风险信息识别,督导风险应对方案的制定和实施,落实风险动态预警及管控流程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部商务部牵头负责组织本项目风险识别、预警,负责督导落实各项风险管理要求,对识别的重特大风险、应对方案和处置效果可以直接上报分公司商务法务部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司实行一般、较大、重大和特大四个风险等级管理,前十大风险由总部各部门每月进行评估与督导处置,并对其中内容与应对举措进行动态调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "私刻公章用于市场经营行为,用于经济类合同、协议的签订,直接造成公司被诉讼、市场停牌、对公司造成经济损失、商誉损失等重大风险的行为在风险等级中划分为重大风险等级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中央媒体对公司的负面报道事件在风险等级中划分为重大风险等级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "省部级媒体对公司的重大负面报道事件在风险等级中划分为较大风险等级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中标后及签约完成后,二级单位商务法务部应根据中标情况以及签约文本对营销阶段/签约阶段/履约过程中的所有优化立项进行一次性效益计算并上报审核,可以分次计算上报()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目层面的合同额转化率=项目实际完成产值(自行完成部分+甲方指定分包+甲方另行发包)/原承包合同签约额*100%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部在细分自行完成部分、甲方指定分包及另行分包部分后要对甲指分包、另行分包部分从载体、时点、方案、手段等方面进行策划并形成实际产值()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "其他类合同由项目部二级单位公司的业务主张单位/主责部门牵头组织评审、建立台账、归档以及实施履约管控",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "承包备案合同条件尤其是付款、计价与结算方式条件必须等同或优于实际履行的合同()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "承包合同中工期、质量罚款无上限约定的不属于重大风险()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "分供合同可以无故不使用公司示范文本()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "对债权债务明确的应诉案件,当年发生当年应予结案()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "诉讼(仲裁)案件委托律师处理,应尽可能地采取风险代理方式,将案件处理阶段、处理结果和律师费挂钩案件代理应当有一名公司内部法律人员担任特别授权代理人,共同参加开庭审理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "强化合同谈判策划,从营销源头介入招标文件、合同文本,特别是投标过程中承诺、保证、答疑回复等协议性文件的风险评估和条件优化谈判,提前集成谈判意见,减免无效谈判次数,从而加速合同优化谈判和评审进程()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《建设工程施工合同(示范文本)》(GF-2017-0201)明确约定瘟疫属于不可抗力的范围",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因合同一方迟延履行合同义务,在迟延履行期间遭遇不可抗力的,不免除其违约责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为帮助受伤工人办理工伤认定,项目部应在工伤认定审定单用人单位处加盖印章()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分公司没有独立法人地位,无法成为民事诉讼的被告,因此在合同上加盖分公司印章,一般认定为合同无效()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工人伤亡的责任主体一般为用人单位即分包单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于违反公司规定,导致案件发案的责任人,或案件处理中消极应对的人员,将视情况通报批评或经济处罚",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "每一位从事及接触市场营销、投标报价的员工都应与企业签订保密协议",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "赫茨伯格的双因素理论认为,满意和不满意就像是一枚硬币的两面,是相对的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "二级单位在开标现场发现主要竞争对手存在应废标但废标情形时,不能现场质疑,须先报公司市场部审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "有影响力的人拥有权力,但是,并不是所有有权力的人都有影响力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于局控项目,拟派项目经理如为公司自有项目经理,报公司市场部审批即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "感觉是指一个人为了给观察到的对象赋予一定的意义,而进行的组织和解释感觉印象的心理过程知觉是一个能动的过程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司《人力资源管理手册》规定B类员工可从事二级单位市场客户部内业岗位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "气质并不决定社会价值以及人的智力水平",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理奖项申报应由公司市场部核准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "从行为与制度的关系来看,组织公民行为行为是指员工做出的超出职位所要求的行为,积极越轨行为的本质是违反了组织中的规范",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钢结构工程大于等于3000万元,即属于营销统计口径的大项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "麦克莱兰德理论对管理的启示之一是:高成就需要者不一定是一个优秀的管理者",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各二级单位上报中标额只能上报已完成合同签约的项目,其他项目不得上报",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工心理幸福感指的是员工对自己生活的整体认知评价和情感体验",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "以局资质进行资审的局控项目,资审文件由二级单位市场部编制,并由公司市场部向局市场部报送审核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "所有中标项目,拟派项目铁三角均应为各单位自有",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "社交媒体营销对于商业品牌和雇主品牌的推广已经成为不可或缺的方式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "雇主品牌必须真实可信,但这不取决于你说了什么,甚至也不取决于你做了什么,这取决于目标对象的心理体验()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "世界各地的学生的职业目标在很大程度上是不一致的,有一部分人离开大学寻找工作保障和工作与生活的平衡()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建设真实雇主品牌的4E模型,其核心是以有效的方式表达价值主张()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "最有效的吸引工具是积极的受众参与和投入()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "潜在员工心目中对雇主的形象反映和价值承诺()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "经历和相信你的员工价值主张(EVP)定义的关键素质的工具和技术()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "雇主品牌意味着组织要内外兼修()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发动员工说出自己的职业故事,并且分享在社交媒体上,这是EVP落地并且深入人心的最好方式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司执董会负责审定总部部门量化目标考核结果",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预算调整对企业产生重大影响的,如：带息负债、两金、保理、投资预算等需要经由相关二级单位或总部申请,经公司董事会审议通过后报局预算管理委员会审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "团员不3人以上、7人以下的,应当按照地域相邻、行业相近、规模适当、便于管理的原则,成立联合团支部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司资质承接的签约条件差于立项条件且突破立项底线的项目不予核定相应的合同额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "A类基础设施项目项目部责任工程师填写的施工日志等同于项目部《每日情况报告》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "轴网、基底标高及楼层标高引测,建筑物垂直度观测应由劳务队完成,技术工程师复核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司六化一引领举措中引领指市场引领()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "战略性福利计划理念说明了一个组织的信仰和认为什么有价值它涵盖了组织部分的观念和必须怎样运作才能实现组织商业目标的愿景",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对人的正确知觉是建立正常的人际关系的依据,是有效开展活动的首要条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "现收现付制的养老金财务模式按照以收定支的思路进行待遇发放以及征缴收入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "信仰而建立起来的普遍规范超规范不仅具有超越不同文化和道德观念局限的普遍性,但是并不具有可操作性",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "所有的福利相关计划都应该使用相同的决策标准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在组织行为学的古典理论阶段,对人性的假设理性经济人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "福利理念不需要在整个组织内部进行广泛的沟通",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "群体转移即群体讨论会使群体成员的观点朝着更极端的方向转移,保守的会更保守,激进的会更冒险,但更多情况下,群体决策倾向于更为冒险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "拨入弹性消费账户的全额无须扣缴所得税,不过账户中的金额如未能在年度内用完,余额就归公司所有,既不可在下一个年度中使用,亦不能够以现金的形式发放",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "感觉是指一个人为了给观察到的对象赋予-定的意义,而进行的组织和解释感觉印象的心理过程知觉是一个能动的过程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "组织认同是以员工自我为中心,按照员工的自我标准对其自我身份的确认与寻求,组织认同是从组织那里折射出来的员工自我",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "组织必须提供有利可图的福利计划,以保留和吸引顶尖人才",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "性格是先天的神经类型特点与在生活经验影响下的神经系统形成的稳定神经联系",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导权变理论的基本观点在于每个组织的内在要素和外在环境都各不相同,因而在实际管理活动中不存在普遍适用的原则和方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "定期人寿保险是最典型的幸存者福利,该保险的赔偿会分期支付给员工指定的受益人(可以是任何人),定期人寿保险在雇佣关系终结的时候也宣告结束",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "积极越轨行为与组织公民行为有显著不同,从影响效果来看,组织公民行为导致积极的后果,积极越轨不见得马上见到积极后果",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "群体有命令型群体和任务型群体之分,所有的命令型群体也是任务型群体,但是任务型群体并不能跨越组织界限",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "非工作时间福利和其他类型的福利",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "认知风格,也叫做认知方式,是指人们偏爱使用的信息发送方式",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "组织中的反生产力行为是员工自愿做出的,并非出于迫不得已的原因,而且无论个体的行为是否对他人或组织产性了实际的负面影响,只要个体的行为拥有伤害他人的意图,那么这种行为就属于反生产力工作行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "气质描述了一个人的生理层面,特别是神经活动类型的动力特征",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "权力的发生在于人际互动关系之中,因此权力的主体是自然人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于公司而言,不仅要知道候选人是否满足工作资格条件,重要的是要清楚他们是否具备企业期待的文化价值观和驱动力()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "认知失调是指个体认识到自己的态度之间,或者态度与行为之间存在着矛盾任何形式的不-致,都会导致心理上的不适感,因而个体将试图减少这种不协调,寻求使不协调最少的稳定状态",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "雇主品牌指数(TBI)=雇主品牌辐射力/雇主品牌吸引力()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "沟通的目的是实现相互理解,达成意见一致",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工美誉度是雇主品牌的核心()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "自用建筑面积不足计容建筑面积50%的办公楼购置、建造项目属于房地产投资项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "群体规范主要反映了多数成员的意见,因此它会使成员的行为趋于平均水平,这种情况有时可能会限制群体中个别成员的积极性和创造性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招聘营销和内部参与的主要区别是,后者涉及对组织的经验有限的人,而前者是内部沟通的受众经历公司每天的现实()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "如项目内容既包括基础设施业务也包括房建工程业务,则基础设施建安费占比超过50%的归为基础设施投资项目,房建工程建安费占比超过50%的归为房建工程投资项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "财务和高层管理者,这是整个组织的事()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单项总投额低于80亿,我局可独立开展,不论中建新疆建工是否参与投资,原则上,应分配中建新疆建工不少于20%的施工任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "社交媒体营销对于商业品牌和雇主品牌的推广是不可或缺的方式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "A类基础设施项目策划回头看指在完成项目策划6个月内,通过检查《项目策划书》中组织机构设置、工期管理、资源配置、技术质量、商务合约等方面执行情况,验证项目策划编制的合理性,同时进行再评审、再修订的活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在过去的十年里雇主品牌管理的重点主要是建立差异化,但重点正在越来越转向一致性()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "A类基础设施项目重点工程月度产值、计划偏差8%的,公司总部要介入管理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "A类基础设施项目,对于较大投诉,负责投诉处理事项的负责人应在48小时内(或在投诉方规定的时间内)赶赴现场并拟定处理方案",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "A类基础设施项目项目出现1次不良信用评价信息事项隐瞒不报的,将停止评优评先",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "依据交通运输部规定的信用评价分A、B、C、D四个等级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "针对A类基础设施项目中主要临建构筑物三站两场一室专项方案的规定,预制梁厂、中心试验室专项方案按照B类方案进行报审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "省部级以上质量奖项目质量策划由项目部牵头组织编制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "关于铁路、公路项目试验室管理,日常监测,无相关要求时人员数量不得少于2师2员",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位每月开展质量巡查活动,月度巡查范围要100%覆盖A类基础设施项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司总部月度抽查A类基础设施项目项目不少于6个,季度抽查项目数覆盖超50%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "A类基础设施项目开工后要在10天内完成项目策划中质量策划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工价值主张就是员工的内在价值需求()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "人力资源数据的复杂性使得人力资源收集的数据往往在分析和应用方面很差()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "核心价值观念在大多数情况下的主要作用是建立负责任的企业行为的独特竞争优势()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "雇主品牌不仅是一个内部修炼的过程,还需要外部进行推广,这其中的关键在于培养人力资源部的营销技能()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "测量不同雇主品牌营销活动的有效性,在大多数组织中都是比较困难的()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于公司而言,重要的是要清楚它们正在寻找的潜在雇员身上的文化价值观和驱动力()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司党委会负责审定二级单位年度绩效考核结果()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "候选团队必须符合五有标准：即有劳模领衔、有创新团队有攻关课题、有创新成果、有场地经费",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "区域经理部的职能包括市场营销、项目集约管控、客户维护、专业业务协同()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重点工程、重大建设项目可结合项目现场实际,建设工友村,打造村站校家一体化服务平台",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目经理是质保金回收的第一责任人,项目经理离职则二级单位总会计师为第一责任人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "职工代表巡视,由工会牵头成立巡视小组,成员由职代会各专门小组负责人、相关部门负责人和基层职工代表组成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党风廉政建设责任制考评结果排名未进入前30%的,党建工作责任制考核结果不得为优秀；考评等级为较差的,党建工作责任制考核等级不得为良好",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工会经费收支预算,在当年二月十日前一式两份报局工会,经局工会审批核定后执行严格执行预算指标,年末,根据通知要求编制年度收支决算表",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分包经济签证单指令内容由项目商务工程师填制并经项目总工、商务经理、项目经理会审后下发《分包经济签证单》给分包商",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "B类编号人员满足转编号条件的,可转为A类编号",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据风险大小及问题严重程度,分别实施黄牌警示和红牌警示其中二级单位、项目部质量管理机构不健全,属于应给予红牌警示的风险事项",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各二级单位跟踪信息只可填报已通过公司信息筛选审查的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "物资按在生产中的作用,分为工程材料、周转材料、临时材料三大类",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "企业所得税种的高新技术企业享受10%税收优惠,减按15%征收",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "收入证明开具应注明用途,开具的金额应为税前收入,可以超额开具",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "人们的冒险意愿并不相同,高冒险性的个体比低冒险的个体可以更快地作出决策,管理者必须使员工的冒险倾向与工作的具体要求相匹配",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "环境和情境条件三个方面因素的影响",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中值增长越大,工资结构的薪等越大",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "绩效加薪工资制度对于增强内在激励性也有积极作用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "独立性低的工作,一般采取结果导向型绩效考核方法",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "所谓绩效管理沟通,是指在绩效管理过程中,管理者和员工之间就工作绩效相关问题进行的正式的反馈和沟通",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "提高其绩效,并通过将员工的个人目标与企业战略相结合以提高组织绩效的一个过程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "由于绩效考核的存在,员工改进绩效是因为利益的驱使和对惩罚的惧怕",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "以人为本,即不管是考核指标的设计还是考核体系的实施都要从员工出发,激励员工的积极性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般认为,目标管理法源自彼得德鲁克,他认为有了工作才有了目标,有了目标能够更好地确定每个人的工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "日本的人力资源管理模式的基本特点是以人为本,强调终身雇用,不注重市场调节,规范化和制度化程度高",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中低层级岗位采取行为导向型为主的绩效考核方法相对有效,高层级岗位则比较适合采取结果导向型为主的绩效考核方法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "绩效考评结果为C的项目,研发费用核销按计划进行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "参与项目研究的研究生、博士后、访问学者以及项目聘用的研究人员、科研辅助人员、临时聘用人员(如产品初试工人、示范工程工人)等,均可开支劳务费",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位每年举办一次技术交流会,进行公司范围内的技术创新总结与交流",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司聘用的方案审核师可由分公司刻制执业印章",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "省部级(含)以下质量奖项的创优策划书,由二级单位审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位及所属项目部仅发生重大质量事故时,才会影响当年的评先评优资格",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "斯坎隆计划的劳资协议被称为劳资合作的前沿这是一个员工参与的倡议,而不是一个薪酬计划(激励计划)如今,许多员工参与系统的根基都源于斯坎隆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "个人在质量事故调查报告中认定承担主要责任的,3年内不得提岗",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "整体薪酬可以分为狭义和广义两种定义方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据风险大小及问题严重程度,分别实施黄牌警示和红牌警示发生一般及以上质量事故,属于应给予红牌警示的风险事项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "泰勒的计件工资制度实际上是对动作进行估价的一套方法论和制度设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部视频监控网络不可与项目部办公网络共用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "已知某薪等最低薪酬为1000元,薪等高度为50%,求该薪等最高薪酬我们可以用公式1000*(1+50%)＝1500(元)来得到结果根据计算,1500元就是该薪等的最高值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司运营分析会、工作会和局重大视频会由各部门自行调试、保障",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工主体还是企业主体和员工价值主张六个方面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主数据是对公司的直观刻画,是公司最直接的财富包括组织、人员、项目、物料、供应商、客户等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "业务数据又称中介数据、中继数据,为描述数据的数据,主要是描述数据属性的信息,用来支持如指示存储位置、历史数据、资源查找、文件记录等功能",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司执董会负责审定总部部门量化目标考核结果()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "三公司六化一引领中六化策略包括：一是发展事业要坚持国际化,二是市场拓展要坚持区域化,三是主业支撑要坚持专业化,四是竞争能力要坚持差异化,五是要素统筹要坚持平台化,六是运营管理要坚持精益化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "反向保理未到期部分不占用各单位年度融资预算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "信度与效度是表示绩效考评工具考核质量的重要指标,信度是效度的必要而非充分条件,两者相互联系又相互区别",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党总支可设委员5-7人,最多不超过7人,可设书记1人,副书记1人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "战略导向的KPI指标体系假定人们不会主动采取行动以实现目标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合同变更和解除应当采用书面形式,如补充协议、备忘录、解除协议、签证单等金额超过合同额10%的签证与索赔原则上须以补充协议形式进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为确保KPI能够持续提高绩效,我们必须周期性地审核KPI来判断KPI是否有用和恰当",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "第二次世界大战后,人力资源管理的发展方向主要是：由工作的关心转向对人的关心,开始注重人和工作的匹配",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "战略分包商可同时承接多个项目,同时承接的项目不设数量上限",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "行为科学从认识人的本质出发,提出人性假设,并把它作为人力资源管理的前提",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "绩效评估和人力资源管理其他活动的所有关系,都没有评估和员工机会平等的关系更关键,尤其是绩效评估意味着晋升和解职时",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一级建造师应配合取得安全生产考核合格证(B类证)后,方可发放执业资格补贴,未取得的一律不得发放",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业践行愿景是成为中建领先、行业著名、客户满意、员工幸福的建设集团",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "直线经理对组织提供的无形报酬具有很重要的影响而通常这些无形报酬正好是吸纳和保留人才的主要工具和平台直线经理在为员工创造工作氛围,创造职业生涯开发和成长机会中扮演关键角色",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "能力薪酬有三种支付方式第一,替代基本薪酬计划第二,绩效加薪体系的一部分第三,奖金,不影响基本薪酬",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工作分析有两大成果第一,职位描述(JobDescription)：经过职位分析所得到的关于某一特定工作的职责与任务的书面说明第二,职位规范(JobSpecification)：对适合从事该工作的人的特征所进行的描述这两个成果也可以对应表达为任务清单和能力清单",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "绩效管理体系是人力资源管理的核心部分,也是整个企业管理体系当中的重要组成部分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "绩效已成为企业全体的关注对象,绩效管理的战略地位已经奠定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "绩效评估已经成为人力资源管理的核心,也是人力资源管理的重点",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "目标设置理论认为明确而具体的目标能够提高工作绩效,困难的目标,一旦为人们所接受,会比容易的目标带来更高的工作绩效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "简单排序法进行绩效考评时,需要根据绩效考评的要素,从该要素下绩效最好的人排到最差的人,以此类推直至排列完毕",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "企业内部员工工作的性质决定企业应当采取何种绩效考核方法",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "绩效考核的最终目的是希望通过考核确认员工的绩效水平,并通过对考核结果的运用达到激励员工努力工作的目的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "绩效考评技术和考评工具要符合效度与信度的要求,信度影响效度,考评尺度极度不可信也不可能有效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "绩效考评技术的信度指的是考评结果的一致性和可靠性,即用同一考核方法程序对员工在相近的时间内所进行的两次测评结果应当是一致的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当跨界招聘人才成为常态时,企业为雇主品牌进行投资的价值就越来越低了()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "人力资本的专用性越强,其市场流动性就越强,公司对其的投资的比例和风险也就越大",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "业绩评定法是一种被广泛采用的绩效考核方法,它根据限定的因素来对员工进行判断并评定等级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "经历和相信你的员工价值主张(EVP)定义的关键素质的工具和技术",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "绩效评估会使一个管理者陷入既要评判某人绩效,又要帮助其有效提高工作效率的两难境地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "服务企业通常在管理运营复杂性方面更自信更集中()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "重点项目的项目策划书经公司副总经理(分管生产)审批即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "360度考评反馈的核心要点是发挥相关考评主体的优点,克服其缺点,重点是反馈与改进",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "雇主品牌管理的作用不仅是为了吸引和预定人才,而目是汪入和强化正确的人才能力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "示范项目立项经公司副总经理(分管生产)审批即可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "绩效指的就是员工工作的产出",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "雇主品牌是HR的事,商业品牌是市场部的事,二者相互独立,彼此没有什么关系",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目产值计划编制时,内部配合产值同时计入主业单位和配合单位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "绩效管理需要企业管理者和员工都参与进来,并且需要持续的沟通",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工价值主张就是员工的內在价值需求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "竣工项目由二级单位生产副经理牵头组织市场客户部经理和项目经理定期(竣工第一年每半年回访一次,以后每年回访一次)对保修期内竣工项目进行回访和保修",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于一个组织来说,如果该组织分工层次不明晰,员工的个人工作绩效对组织绩效具有直接影响,那么采用结果导向型的绩效考核方法更为适宜",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "人力资源管理本质上是一项营销工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程材料(构成工程实体的物资)按性质、用途和重要程度,又分为A、B、C、D四种",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "只有当绩效管理循环是一个封闭的环的时候,它才是可靠的和可控的,同时也是不断提升和改善的保证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "以正确的方式迎接人才入职,这与招聘合适的人才一样重要",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司每两年组织进行一次分包商综合评价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "绩效管理是整个人力资源管理的核心,它涉及人力资源管理的各个方面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "核心价值观念在大多数情况下的主要作用是建立负责任的企业行为的独特竞年优势",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为了充分发挥雇主品牌的价值,企业应着力培养人力资源管理者的品牌运营能力()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司名义承接项目需在公司银行专用账户下开设专用实体账户或虚拟子账户",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司物资战略供应商在招投标过程中同等条件具有优先中标权",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "物资按在生产中的作用,分为工程材料和周转材料两大类",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "凡外观检查及物理性能、化学性能试验不符合国家标准,达不到有关技术指标或不能满足规定要求的,均视为不合格物资",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在运用社交媒体向目标人群宣扬雇主品牌时,应注重对品牌的单向宣传()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "监控设备硬盘录像机要求使用海康威视品牌,录像存储时间不少于14天",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "郭隗请始都表明了建立良好雇主声誉的重要作用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司数字信息化管理部原则上不接收来自项目部/分公司的需求申请",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工价值主张(EVP)的最高层次是社会认同()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "物资需求总计划编制,中标后7日内,根据中标文件编制初步物资需求总计划,施工图预算编制完成后7日内,提供完整物资需求总计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一组一致的员工价值主张成分应该出现在你所部署的雇主品牌营销活动的各个方面,你强调不同支柱和沟通主题的程度时可以上下调整()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "超过200万元的单项签证,提交发包人前,经二级单位商务法务部审核、总经济师审批后报出",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在组织中建设人才推荐官制度,可以为关键目标群体创建高质量的推荐渠道()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分供合同(不含框架协议)根据分供合同授权额度进行分层级审批,其中超出授权额度且≤3000万元的合同,由公司总经济师项审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在一项员工价值主张和创造性的方法完成之前,它应该在不同的市场环境和主要目标群体中被测试()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目物资工程师每月与供应方办理月度统计,时间点为本月1日至本月31日供应方按统计单数额开具发票,安全生产物资要单独开具发票,单独办理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目总包结算和该项目所有分包结算、分供结算完成后7天内,商务管理部及时通知公司财务资金部门发出《项目总分包结算结清通知单》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因抢工、应急等所需零星物资,单笔或单项采购金额5万元以内,片区加工厂年度累计或单个项目累计采购总额不超过20万元的零星采购,可使用询价采购方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2000万元以上的砼及砼构件由公司集中采购",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "单一来源采购,因重大变更等原因,需临时采购、快速进场的情形,可发起计划外采购申请",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工期超出定额工期20%以上分包需要采取特殊措施抢工的项目,一般采用最低投标价法进行评标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1969年颁布的《关于国营企业财务工作中几项制度的改革意见(草案)》中规定国营企业一律停止提取劳动保险金,导致我国国家保险变为事实上的企业保险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "B类编号人员满足转编号条件的,可转为A类编号()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "无论是谁在主导组织福利计划中变革的发生,这些变革都会导致成本的增加",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "非工作时间报酬项目主要指在用时间作为福利的项目和在不工作时间得到报酬的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "战略性福利计划战术是用来实现期望的变革的详细方法战术可能包括设计新项目或者重新设计现行项目的步骤",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "风险池是20世纪20至30年代出现的控制养老保险成本的方式之一",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "与欧洲发达国家相比,美国几乎是唯一一个缺乏针对所有或几乎所有人口的政府强制形式的全面健康覆盖的国家",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "福利计划可以使福利功能支持人力资源功能,但不能支持公司整体业务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业内部员工工作的独立性程度主要取决于相互间工作的依赖程度,这与工作内容的可分解程度密切相关",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业年金是一种补充性养老金制度,是指企业及其职工在依法参加基本养老保险的基础上,统一建立的补充养老保险制度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "日本企业实行一种固定员工或核心员工与非固定工并举的灵活用工机制,特别是低端的劳动力市场以及业务量变动很大的中小企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "从法律角度看,中国的员工福利类型可以分为法定福利和企业自主福利",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目班子及项目总监类人员调入两级总部岗位核定为业务经理的,可高套一档()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工作分析的基本任务是弄清楚工作或者环境所要求的行为的特征是什么",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "由两级总部调入项目的人员,新岗位工资按不低于原工资标准的最近一档工资执行,待参加分级考核后按实际结果调整档级()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "支持和推动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "KPI所体现的衡量内容最终取决于组织的战略目标,是对组织战略目标的进一步细化和发展,并随着组织战略目标的发展演变而调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "业绩评定法的优点在于标准制定简单迅速,评价者通过最能描述出员工及其业绩的每种因素及其所占比重来完成标准制定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于复杂程度高的工作往往以行为导向型考核方法为主,复杂程度低的工作则以结果导向型的方法为主",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "政工系列工作人员可参评正高级政工师()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "绩效管理是人力资源管理体系的核心内容,绩效考核是绩效管理体系中的关键环节",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "美国最早的退休金计划出现于20世纪,当时正是美国由农业经济转向工业经济的时期",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "经局评估授权后,各二级单位可自行开展工程师职称评审相关工作,并将评审结果报局人力资源部复核,复核通过后方可正式行文认定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大多数弹性福利计划都可以解决由于雇员特殊等级而产生的待遇给付问题",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "职称评审委员会原则上按照职称系列或者专业组建,特殊情况下也可跨系列组建综合性职称评审委员会()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "后金融危机时代,社会保障作为一个生产要素的呼声渐起,就业导向型和就业友好型将会是社保制度现代化改革方向",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工作休假长短常常基于工作年限和职位而定豁免员工通常能够比非豁免员工获得更多的假期,尤其在参加工作的前几年",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "养老保险,全称社会基本养老保险,是国家和社会根据一定的法律和法规,为解决劳动者在达到国家规定的解除劳动义务的劳动年龄界限或因年老丧失劳动能力退出劳动岗位后的基本生活而建立的一种社会保险制度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "医疗保险一般指基本医疗保险,是为了补偿劳动者因疾病风险造成的经济损失而建立的一项社会保险制度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司总部高级经理人数为2-3人,最多不得超过本部门D职级人数()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "专项奖励分为：创优类专项奖励和创效类专项奖励()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "从制度效率的角度来看,中国目前的城镇职工基本养老保险仍然不适合灵活就业人员参保",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "让员工参与决策,有利于建立一个员工参与的管理环境",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "定期人寿保险是最典型的幸存者福利,该保险的赔偿金会分期支付给员工指定的受益人(可以是任何人),定期人寿保险在雇佣关系终结的时候也宣告结束",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "区域经理部的职能包括市场营销、项目集约管控、客户维护、专业业务协同",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "EVP指的是员工价值主张(employeevalueproposition),意指在薪酬设计时,要把一切员工认为重要的东西都看成是对员工的报酬",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业自主福利：企业在国家政策框架下开展的自主福利项目只要在国家法律(主要是税收法律)不反对,企业可以自主创新员工福利项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司在第三曲线(孵化业务)聚焦六大业务领域：绿色低碳、全过程咨询、智能建造、数字产业、智慧运维、新型建材",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "房建项目16万平米以下或合同额低于5亿元规模、A类基础设施合同额5亿元以下、安装专业工程合同额5000万以下、装饰专业工程合同额3000万以下,可以设置专职劳务、行政、财务、资料管理人员()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "寻找对的绩效驱动力是奖励计划设计中的关键绩效驱动力是达成结果的关键措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "应收账款采用预期信用损失法进行减值计提,单项金额虽不重大(小于1000万元),但信用风险特征与相应组合法的信用风险特征存在显著差异的,按照组合计提法计提坏账",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "股权激励是指用股票相关的工具用来激励要激励的对象的薪酬实践它属于长期激励范畴",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "应付账款所属的交易合同应确保合法有效,不含资产转让限制条款,合同金额覆盖确权金额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "不同法人之间存货调拨,视同销售由调出单位向调入单位开具增值税专用发票调出单位按照存货调拨价格减去税金成本后冲减项目成本或管理费用,调入单位按照新购材料进行管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "PAQ有五个分析维度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导班子中的党员领导干部应结合各自分工,每人至少建立1个党建工作联系点,应经常深入联系点具体指导,每人每年到联系点调查研究、指导工作、解决问题不少于3次",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资产评估管理中,公司应向资产评估机构如实提供有关情况和资料,并对所提供情况和资料的真实性、合法性和完整性负责,不得隐匿或虚报资产",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "绩效加薪有利无害",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "战略福利计划的自上而下方法能够平衡公司业务目标和组织支持的人力资源和福利项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "控制价审批表(含缺项),最终审批人是二级单位总经济师",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "科技立项费用核算由研发支出和研发费用科目进行,国拨经费收取及转销在其他业务收入-科研经费科目核算、非国拨经费收取在递延收益收入核算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "绩效加薪关键在于改善绩效沟通,让员工了解我的绩效是有作用的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "所有员工福利费用都必须列支在员工福利费用下企业不应该用其他费用为员工发放福利",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "所有EPC项目需在中标后开始编制概算(估算)审查报告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "相关单位业务部门和人员发生经济业务对外付款时,必须取得与实际经营业务情况相符的发票,发票上的销售方、购买方、税收分类编码、商品名称、数量、单价、金额必须与实际经营业务一致,满足三流(发票流、资金流和物流)一致的要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收入分布比是一个反映基本工资与中值,或者中值与市场均值之间关系的统计量计算公式是收入分布比=(基本收入/中值收入)*100%一个收入分布比小于1的群体,其收入水平一定位于某个薪等的中位值一下,否则反之",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国的养老保险三支柱体系存在严重的结构问题,第一二支柱占比过高,第三支柱占比很少,与发达国家的比例相反",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "因填写、开具失误或者其他原因导致作废的法定票据,需统一处置或销毁",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "薪等高度(payrange)和薪等中位值(midpoint)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "能力和运营,战略性福利计划过程可以包括对福利管理和传递系统的一个重新评估,这样的评估可以为怎样实现福利管理项目的资源最优化配置和怎样帮助员工认识福利提供新的思路和借鉴",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投诉、申诉须经公司市场部同意后,报局市场部同意",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "原则上不得收取除100万元(含100万元)以下纸质银票外的其他纸质票据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "评估对公司和员工都有用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中值是薪酬管理中一个关键要素在工资管理决策中通常将它作为参考点,类似于目标将它作为参考是因为它被典型地设置成市场的平均水平",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "胜任力(Compentencies)而支付报酬的薪酬体系",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司属二级单位指公司下属区域/专业分公司、设计研究院、子公司、城市公司、代管机构等()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "跨区域临时从事生产经营活动的,不再开具《外出经营活动税收管理证明》,改向机构所在地的税务机关填报《跨区域涉税事项报告表》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "薪酬战略的核心是通过一系列报酬策略选择来帮助组织赢得并保持竞争优势",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "个人名章,除了用于支票的签发以及资金支付及调拨、出具财务报告等财务资金相关业务,不得用作其他用途",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "已知某薪等最低薪酬为1000元,薪等高度为50%25,求该薪等最高薪酬我们可以用公式1000*(1%2B50%25)＝1500(元)来得到结果根据计算,1500元就是该薪等的最高值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "雇主向下沟通主要是传递信息,告知员工一些规则,起到广而告之和解释某种计划的作用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "持续的绩效反馈能够使得员工内在激励得到提高",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为了保护临时工作性员工,一些国家制定了不少法规,以保证企业不歧视他们,保证他们受到公平对待,这会为好的劳动关系创造条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "薪酬调查是一个系统的过程,用于决定组织内工作的相对价值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "即使生活在非工会组织中的员工,也不能忽略集体争议处理技能",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "提供更多的贡献,那么员工必须感觉到价值感,努力能够得到认可和欣赏,从长期来看,他们为组织的付出和他们从组织中获得的回报能够取得平衡",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "研究对打破心理契约的原因的感知,是一件重要的事情",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据JOOWEN的看法,情商(EQ)是知道如何让别人做事的能力情商和强迫不同,情商激发人们去工作情商是关于如何发现工作方式,并提供支持和承诺",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "短期激励和股权是三种使用最为普遍的组合",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在理论上,员工通过地域竞争,会强化员工在与雇主谈判中的地位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "大部分的认可激励来自高层,而不是直线经理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当战略发生变化的时候,文化可能成为一个障碍因此根据文化制定适应战略是很关键",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "战略是一个组织的长期方向",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为了让企业有效经营,企业必须有权力进行管理,有些权力必须给到经理人员",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "员工关系和客户关系本质上没有什么不同如果每一个企业都创造一种文化,像对待客户那样对待员工,大部分冲突就会得到解决,或者不会升级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "CEO要做的是去创造一种团队,允许创新摩擦存在,同时在创新主意出现的时候,仍然可以合作,同时CEO还要保证创新的主意被执行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一个就业合同中,雇员可能有形式不同的合同,如临时工或者固定合同,都会被法律看成是就业关系在某些情况下,员工可以通过辞职和提出建设性解雇来获得这一义务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "组织发展建立在人本主义的价值观基础上的有计划变革的干预措施的总和,它寻求的是增进组织的有效性和员工的幸福",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "开放式问卷会给员工机会,让员工去表达自己的观点,并且能够让HR去获取有关信息,这些信息可能出乎原来设计问卷的预想之外这些答案可能是非常有价值的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "组织中的反生产力行为是员工自愿做出的,并非出于迫不得已的原因,而且无论个体的行为是否对他人或组织产生了实际的负面影响,只要个体的行为拥有伤害他人的意图,那么这种行为就属于反生产力工作行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "JeanGreaves认为,情商非常重要,智商在高绩效工作者的决定因素中只占到40~45%,剩下55~60%由情商决定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "处事方式以及物质环境等,这一切可能得到最广大员工的认可支持,也可能得不到支持",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "那些觉得自己的期望没有被满足的员工,可能减少绩效和对组织的承诺",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "有影响力的人拥有权力但是,并不是所有有权力的人都有影响力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工大部分是作为个体独自工作,而不是作为团队的一部分工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工关系战略要鼓励员工发声和员工参与才可以适应基于创新的战略",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业采取低价策略的战略不会对员工关系战略产生影响",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "应急主义的方法强调根据实际情况调整人力资源管理方法,而不是死抱教条",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "直线经理要建立一种环境,鼓励大家用开放的态度对待大家的不同看法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "强制性权力来自于一个人通过组织中正式层级结构中的职位所获得的权力",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "冲突可能因为合作者们的性格特征不同,导致他们很难合作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "性别在工作效率上无显著差异",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于两级总部一般管理人员、二级单位部门副职年度考核,被评为C档的部门不可以评选A+档,且C/D档比例不低于20%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在管理冲突的时候,不需要判断冲突到了哪一个阶段",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目分级考核中,项目班子成员、项目总监连续考核结果为三级、项目一般管理人员后两级的员工,不得参加年度任何评优活动()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一个好的谈判代表,需要很好的人际关系能力需要对人的感觉有很好的把握,把这种感觉用来达成交易他们拥有耐心,和正直的品格,能够换位思考,语言能力要强",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在工作时间和工作场所内,因工作原因受到事故伤害时,可以通过外伤申报报销医疗费用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "很多雇主自己设计了一些问卷这些问卷的一个可能的问题是问卷的信度,它取决于所问的问题是不是应该被问的问题",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "D3级领导人员任职谈话一般由公司主要领导进行谈话,公司党委工作部、干部人事部、纪检部负责人参加",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "校园招聘入职的毕业生,所学专业为财务,分配岗位为财务管理见习生,不需要参加项目安全实训()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在劳动市场内,需要一些规则来保护员工,在合理的成本支出下鼓励员工和雇主互动让企业比较容易吸纳劳动力和解雇劳动力的规则可能对一个国家吸外资很重要",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "心理反应的综合,它仅依赖于短时间内的评价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党委会第一议题,在党委会会前7天,由相关责任部门提出议题,党委工作部收集汇总",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "职称评审材料属于人事档案中的第四类()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "让员工参与决策,有利于建立一个员工参与的管理环境正确",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "组织行为学作为一门社会科学,属于基础性的社会科学",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "党委理论学习中心年度集中学习交流应不少于8次",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "直线经理要建立一种环境,鼓励大家用开放的态度对特大家的不同看法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级青年文明号创建,需满足集体内部35岁以下的青年占60%以上,至少有一名负责人年龄不超过40岁",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "斯坎伦认为,离现场越近的人越知道问题所在,知道问题的人可以找到最合适的解决问题的方案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "廉政档案的建档对象为D职级及以上的领导人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "沟通和员工沟通满意之间存在正向关系",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司纪委每季度向局纪委书面报告本单位处分结果执行情况,每半年向局纪委书面报告一次工作情况",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一个调解可以把问题解决在萌芽中,避免它们恶化在问题恶化之前,解决问题的位置就设定好了,并固定下来了这样也不一定要走司法途径,节省了费用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党委会讨论研究是董事会决策重大问题的前置程序,不得与其他会议套开",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在合同条款之外,命令他人的权威被马克斯韦伯描述为感性权威",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在员工关系中,遵循法律是一个底线但是法律在变化,员工的权力也在变化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "符合《中国共产党纪律处分条例》第十七条、第十九条规定和有关党纪党规规定的从轻、减轻之情形,主动认错、挽回损失、消除影响、有悔改表现的,或符合容错纠错相关规定等条件的,可以从高一级形态转化为低一级形态",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "应急主义的方法强调根据实际清况调整人力资源管理方法,而不是死抱教条",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在企业处于下降阶段时,裁员不可避免,很多冲突就会产生这时的员工关系战略的重点是如何有效地裁员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "接待群众来访来电,属于违规违纪问题的,能答复的当场答复意见,不能答复的应在了解清楚后告知举报人结果,举报人姓名、地址不清的除外受理范围外事项,应告知举报人向有关部门反映",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在一些情形中,员工的权力有的时候没有得到保护,企业的需求不合理地占据了首位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "表达员工的声音而员工关系主要关注员工和雇主之间的关系,通过双方的代表而不是通过工会来进行交流",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司六化一引领举措中引领指市场引领",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "如果一个企业对员工进行惩罚,在法律上可能是站得住脚的,但也符合伦理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "向上传递信息对一个现代的组织而言,是非常关键的,这样员工可以提醒管理者注意到员工的潜在问题,以及需要解决的问题向上沟通的效率取决于员工关系的状态,取决于信任关系是否存在",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司在第二曲线(成长业务)聚焦十大业务领域为：涉水与生态环保、涉铁业务、新型基础设施、高科技厂房、城市更新、军民融合、高端装饰、机电安装、综合投资、海外业务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "随着更多人使用网络来工作,政府需要加强这方面的立法保护员工,但同时又不能损害数字化经济的发展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "积极倾听知易行难,这也导致经理人员经常失败",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党委会是企业最高决策机构,按公司法、公司章程的规定履行决策职能",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一级建造师应配合取得安全生产考核合格证(B类证)后,方可发放执业资格补贴,未取得的一律不得发放(()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "JeanGreavesi认为,情商非常重要,智商在高绩效工作者的决定因素中只占到40~45%,剩下55~60%由情商决定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "超过合同收款约定时间45天未能收取工程款项的,二级单位经理应及时组织相关部门和人员进行协调,向业主发催款函、与业主进行谈判",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "应届毕业生在见习期期间可以发放年功津贴()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司让员工发声的渠道和机制越多,员工的保留工作就会做得越好员工关系决定了离职率,这是不争的事实",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党员教育的主要形式有培训和脱产轮训、座谈讨论、报告演讲、参观考察、电化教学、读书辅导、社会实践、知识竞赛等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "人事档案分为正本和副本,一般只建立正本()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "滥用权力和权威可能从根本上破坏规侧则和导致不公",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "同一时间段内的同一项目或同一当事人或同一实际控制人所引发的累计标的额达到1000万元及以上但不超过5000万元的案件,属于重大案件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在企业处于下降阶段时,裁员不可避免,很多冲突就会产生这时的员工关系战略的重点是如何有效地裁员,正确",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "科技研发项目撤销或终止时,组织专家进行评估,专家团队均由技术专家组成",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "员工可以通过辞职来和雇主解除员工关系而雇主可以通过解雇员工来解除员工关系",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "局名义项目投标保证金可从公司基本账户支出",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "如果通过冲突,一种创新的工作方法被引用,那是好事情,HR一定不会卷入到这种冲突中",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "涉及一类、二类机械设备安装、拆卸的,应优先选用产权、租赁、安装/拆卸、维保、操作人员(司机、信号司索)一体化的供方",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "雇主可以根据实际情况选择员工投入和参与的方法来提高绩效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "滥用权力和权威可能从根本上破坏规则和导致不公",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2020、2021年度考核等级存在不合格的人员,不予申报2022年度职称评审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一定数量的离职率对增加创新和提高效率是有好处的,但是较高的离职率可能反映企业员工的满意度较低",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集体谈判是由代表会员的工会与企业之间进行的谈判参与的双方是企业和员工代表他们坐到一起讨论有关就业的条款,目的是达成协议",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当需要采取工程质量约谈时,原则上采取逐级约谈",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "像对待客户一样地对待员工,员工关系就会很好",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对心理契约的理解到位,对处理员工关系不太重要",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "前期营销承诺交底给局/公司工程管理部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "那些觉得白己的期望没有被满足的员工,可能减少绩效和对组织的承诺",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "了解清楚调解经常在哪里失败,是一个很重要的点",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "EPC项目投标前可先不进行成本测算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "遗传建构了人格的前提条件和外围限制,但个体的总体潜能取决于如何调整自己以适应环境的要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目行政印章：原则上不刻制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "印章刻制公安机关指定的地点刻制任何单位(部门)和个人不得擅自刻制冠以公司为责任主体的印章",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发放印章时二级单位对收到的印章进行登记,并通知项目经理指定专人签字领用,并签订《印章保管与使用责任书》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总部部门申请公司行政印章用印由用印部门在管理平台发起申请,部门经理审核,办公室主任审核,分管领导审批(如涉及重大事项必须由主要领导审批)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各类印章应由专人保管,印章审批人与印章保管人不能为同一岗位人,经办人与用印人不能为同一岗位人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "不得未经合同评审,在合同协议类资料上加盖公司合同专用章或公章,合同、协议等加盖合同专用章后,可直接加盖法定代表人人名章；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部行政印章由二级单位综合办公室负责保管",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部工程技术专用章由项目总工负责保管",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "印章借用期间借用人对印章负有保管、监督使用的责任,借用人不得将印章转借他人,在借用期间的使用仅限于本申请的批准事项,如超出使用范围,借用人必须另行申请",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目印章遗失后需在公安机关指定的媒体上发布公告,声明作废",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部行政印章由二级单位部门/项目部管理人员在管理平台发起申请,项目经理/部门经理审核,二级单位分管领导审核,二级单位主要领导审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "农民工专户项目印章由二级单位部门/项目部管理人员在管理平台发起申请,项目经理/部门经理审核,二级单位总会计师审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部工技术专用章的用印管理,项目部应做好用印登记《印章使用登记表》,建立印章使用台账对项目全部用印情况进行监控,该台账作为项目竣工归档材料之一进行保管,印章回收时同时上交此资料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目用章记录每季度向所属二级单位综合办公室报备,二级单位行政印章用章记录每半年向公司办公室报备一次",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目农民工工资专户行政印章适用于农民工工资专户开设、注销、函件往来、农民工工资支付等,其责任部门为项目所属二级单位综合办公室",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部技术专用章适用于施工现场管理相关的工程技术资料用印及函件往来,其责任部门为项目总工程师",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "财务专用章适用财务资金相关业务,其责任部门为财务资金部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合同专用章适用一切经济合同及协议性文件,其责任部门为合约法务部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "(预)结算专用章适用成本结算相关业务,其责任部门为商务管理部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "发文流程中联合发文需要分管领导会签",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "归档本年度收文需于次年1月31日前移交档案室",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "通报不属行政文件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "外来行政文件由各级办公室统一管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "发文格式中版记应在奇数页",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公函中版头的格式科参考公文标准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "电子公文电子文件与纸质文件不具有同等效力",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "制度类文件根据其有效性定期更新",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公文落款日期应以发起流程的日期为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公文中版记要在偶数页",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据收文管理中要求,首先要填写文件传阅处理单",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目部收到来文,由安全员统一登记、处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司平台发布的电子公文,分公司在满足利用和浏览的条件下,可不再打印纸质件备案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收文工作相关工作文件有：《收文登记表》、《文件传阅单》、《文件处理单》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据文件来源,在一个单位内部可将公文分为收文和发文",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公文的装订是在右侧",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "批复的行文方向是固定的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "拟办是收文处理的核心问题",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公文最基本的作用功能是领导和指导作用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "签发人姓名标注在发文字号同一行,居右侧",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一级接待中,需要办公室人员全程陪同()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如果会客室的门是推开的,接待人员应先小步走进会客室,等客人进入后,再轻轻关上门()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部因特殊情况如需配车可采取一事一议方式,经公司董常会审批后,方可配置()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位配备、租赁经营和业务保障用车原则上不多于2辆,特殊情况下,采取一事一议方式,按购租程序报批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "海外二级单位原则上可购置经营和业务保障用车原则上不多于2辆购置车辆",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公务车辆购置价格包含购置税等",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目部不配置公务用车",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部可申请配备使用经营和业务保障用商务型车2辆",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "固定资产是单位价值在5000元以上,资产使用寿命超过一个会计年度的资产",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "档案系统上传的电子文件名要与实体文件名一致",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "如果会客室的门是拉开的,接待人员应先进入会客室后,才能让客人进入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标文件需单独组卷",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "去车站接站时,客人行李(除了托运的大型行李)要离地提起,不得着地拖拉行李()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "档案库房根据八防要求,需注意防火、防盗、防尘、防虫、防晒、防潮(控制在45%-60%)、防霉、防高温(温度应控制住14-24摄氏度)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "去车站接站时,接站人员要在客人的左前方,以引导手势主动示意客人行走路线",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工日志不需单独组卷成册",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目工友生活区工友食堂需公开招标,引入有相应餐饮资质的运营单位,经营期限、租金和管理费根据项目实际情况确定,项目在确定工友食堂经营方前需将相关资料报分公司综合办公室审批,公司办公室备案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工组织设计及施工方案可以单独组卷也可以组同一卷",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "会议安排中的会前准备包括文字材料、影音资料、会场物料、会议休息室安排",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目竣工后3个月内按要求完成资料纸质档案归档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在举办大型会议时,当领导人数为单数,采用居中排列法,主要领导居中,2号领导在1号领导右手位置,3号领导在1号领导左手位置",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "竣工资料中,技术资料与施工日志一齐组卷成册",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "当遇到长条型会议桌,纵向会议室时,进门左手边由领导或客方坐",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "竣工图应按专业进行组卷,可分为工艺平面布置竣工图卷、建筑竣工图卷、结构竣工图卷,给排水及采暖竣工图卷,建筑电气竣工图卷、智能建筑竣工图卷、通风空调竣工图卷、电梯竣工图卷、室外工程竣工图卷等每一专业可根据图纸数量多少组成一卷或多卷",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "接站前期准备中,接站人在到接站口后,在到站前二十分钟左右发送第二条短信",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑材料质量证明文件如为复印件时,应加盖原件存放单位公章存档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "低值易耗品是指购买单价低于5000元且耐用期一年以上的物品",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "技术交底文件属于施工文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司在接待活动中展示播放的视频片,可以被称为公司宣传片",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "图纸会审记录属于监理文件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "会议时可以不关闭手机铃声",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "28、工程资料组卷应遵循自然形成规律,保持卷内文件、资料内在联系工程资料可根据数量多少组成一卷或多卷(√)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "会议开始前,会务人员不需要提前进场布置",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "竣工图纸保管期限是30年",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "会议开始前,会务人员不需要准备茶水",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目竣工资料组卷案卷题名命名应根据项目名称、单体名称、专业、类型及概括本卷资料内容形成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "会务人员负责会议全程服务,应至少提前一天布置场地及熟悉议程安排",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接待服务质量：态度、效率、礼仪、安全、周到",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "轿车型经营和业务保障用车的购车价格可以在十八万元以上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "商务型经营和业务保障用车要控制在购车价格(不含车辆购置税)38万元以内、排气量30升(含)以下",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司办公室为全公司食堂管理监管部门,二级单位综合办公室为本单位食堂管理主管部门,各项目行政主管对本项目员工食堂和工友食堂负直接管理责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部综合办公室根据相关管理规定和具体要求负责项目员工食堂与工友食堂经营的管理和监督,重点做好从业人员健康素质、食品卫生、经营行为、满意度等方面的管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位综合办公室统筹管理各单位项目部食堂,负责对各项目食堂管理情况开展指导检查；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "员工食堂必须由项目自营,为非营利性质,要为员工提供优质的早、中、晚三餐,保证舒适的就餐环境和食品卫生安全此外,能承担一般公务接待",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "食堂的从业人员必须持有健康证,并按照卫生检验检疫部门要求定期进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "食堂内不需要配备消防器材",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "食堂必须单独设置水、电表,定期查抄,费用由经营者自己承担",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目应在开工前布局生活区时考虑项目超市(商店)的位置,超市应位于项目办公区",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司工会为全公司食堂管理监管部门,二级单位工会为本单位食堂管理主管部门",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工友生活区超市(商店)由项目部自行公开招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "各项目行政主管对本项目员工食堂和工友食堂负直接管理责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "超市(商店)必须单独设置水、电表,定期查抄,费用不需要经营者承担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各二级单位商务法务部和项目商务主管做好食堂费用结算管理工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "超市(商店)应建立完整的进货台账及票据,以备项目部及食品卫生防疫部门的查验",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司员工及其特定关系人不得参与项目工友食堂的经营",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为认真履行中建集团公司廉洁从业各项规定,回避关联交易,公司员工及其特定关系人不得参与项目超市(商店)的经营",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目员工食堂可由公开招标,引入有相应餐饮资质可盈利的运营单位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公务车辆出车前不需要派车单",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目工友生活区工友食堂需公开招标,引入有相应餐饮资质的运营单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因业主考察、上级领导检查等特殊情况,需要到外埠的长途用车(单程100公里以上),需经办公室/综合办公室分管领导批准方可调派",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目工友食堂实行保本让利经营,最终实现让利于工友",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "条件允许的大型项目须设置两个或两个以上不同外包主体的工友食堂,实现适当竞争",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一级突发事件指突然发生,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序造成一定危害或威胁,可能造成人员伤害、财产损失或环境污染和生态破坏,二级单位、项目部需要调度力量和资源进行应急处置的事件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一级突发事件指突然发生,事态严重,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序造成严重危害或威胁,已经或可能造成重大人员伤亡、财产损失或环境污染和生态破坏,造成较大社会影响和对企业声誉产生重大影响,公司、公司属二级单位必须调度多个部门和单位力量、资源应急处置的突发事件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一级突发事件是指突然发生,事态非常严重,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序带来十分严重危害或威胁,已经或可能造成特大人员伤亡、财产损失或环境污染和生态破坏,造成重大社会影响和对局声誉产生重大影响,公司必须在局的统一领导下,组织协调、调度各方面的资源和力量进行应急处置的突发事件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级突发事件指突然发生,事态严重,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序造成严重危害或威胁,已经或可能造成重大人员伤亡、财产损失或环境污染和生态破坏,造成较大社会影响和对企业声誉产生重大影响,公司、公司属二级单位必须调度多个部门和单位力量、资源应急处置的突发事件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级突发事件是指突然发生,事态非常严重,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序带来十分严重危害或威胁,已经或可能造成特大人员伤亡、财产损失或环境污染和生态破坏,造成重大社会影响和对局声誉产生重大影响,公司必须在局的统一领导下,组织协调、调度各方面的资源和力量进行应急处置的突发事件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "二级突发事件指突然发生,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序造成一定危害或威胁,可能造成人员伤害、财产损失或环境污染和生态破坏,二级单位、项目部需要调度力量和资源进行应急处置的事件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "三级突发事件指突然发生,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序造成一定危害或威胁,可能造成人员伤害、财产损失或环境污染和生态破坏,二级单位、项目部需要调度力量和资源进行应急处置的事件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "三级突发事件指突然发生,事态严重,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序造成严重危害或威胁,已经或可能造成重大人员伤亡、财产损失或环境污染和生态破坏,造成较大社会影响和对企业声誉产生重大影响,公司、公司属二级单位必须调度多个部门和单位力量、资源应急处置的突发事件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "三级突发事件是指突然发生,事态非常严重,对员工、相关方和人民群众的生命安全、设备财产、生产经营和工作秩序带来十分严重危害或威胁,已经或可能造成特大人员伤亡、财产损失或环境污染和生态破坏,造成重大社会影响和对局声誉产生重大影响,公司必须在局的统一领导下,组织协调、调度各方面的资源和力量进行应急处置的突发事件",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "环境突发事件专项应急预案属于公司安全生产监督管理部主责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "涉外突发事件专项应急预案属于公司办公室主责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "涉外突发事件专项应急预案属于海外分公司主责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "重大自然灾害突发事件专项应急预案属于公司办公室主责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司总部突发事件总体应急预案属于公司安全生产监督管理部主责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "信息稿的报送要求是事件活动发生前3-5天完成报送()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "综合稿的报送要求是3-5天()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "动态稿的内容要求是公司生产经营活动中的亮点,围绕具体业务的具体做法展开,注重条理、突出重点,注重数据、突出实效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在疫情常态化管控期间,为减少人员聚集和流动,原则上尽量采取视频会议形式；非必须召开的,可利用文件、视频、电话等方式传达部署的会议尽量不申请；能在本埠召开的会议不得在外地召开",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "人力资源部为集体户籍管理部门",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "总经理办公会专题会议包括：研究解决公司生产经营中的重大事项、各部门和各单位提请的专题事项、总经理认为需要研究的其他事项等会议由总经理或总经理委托的经营层其他领导人员按需临时召集和主持,由专题事项主管部门承办",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "《常住人口登记表》每次借出时间不超过一星期",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "总经理办公会体系月度会议：研究体系月度运行情况并部署相关工作(如：安全例会、生产例会、科技例会、营销例会、商务例会、财务例会等),每月由体系分管领导召集和主持,相应部门承办",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "务虚会的主要内容是就公司发展中的难点、重点、创新工作,选定议题开展研讨",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "办理借出手续的八局内部职工、退休人员需交押金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "高层对接一般指公司多位领导与战略合作客户或政府部门多位领导间的集体会见",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重要仪式指战略合作协议签订仪式、开(竣)工典礼、企业或机构成立(纪念)庆典、揭牌仪式等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "与公司签订劳动合同的应届毕业生(名单由人力资源部提供)工作1年以上后可办理集体户籍迁入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "接待工作中,填写《接待申请表》,按照流程履行接待方案,领导批准后组织实施,特殊情况可事前经主要领导口头同意后执行接待方案《接待申请表》被批准后,及时将方案告知参加接待的有关领导及参与配合的相关部门、单位和个人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司集体户不允许因离婚、卖房及其他原因将户籍转入公司集体户",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "其他类合同也需要控制价审批或者超控制价审批【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "清标过程中,采购小组成员应公平对待各投标单位,洽谈过程中可以带有倾向性或暗示、引导投标人的行为【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "通过完善制度,收紧权力,健全不敢腐、不能腐、不想腐的机制,防范廉洁风险,杜绝出现利益输送问题是采购管理主要应对的廉洁管理风险【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未对分供方的融资水平和合同内容进行严格审核,合同履约监控不到位、付款不及时等可能引起纠纷这是采购管理主要应对的合同履约风险【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未明确招标清单、回标要求、评标定标办法、废标条件等条款,或评定标环节未按照招标文件条款执行属于不合规行为【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目采购策划管理,应以成本为核心,以工期管理为主线【出题来源：采购管理部《项目采购策划管理指引》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目采购策划管理,应以盈利为核心,以工期管理为主线【出题来源：采购管理部《项目采购策划管理指引》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目采购策划书应依据合同范围、进度计划编制【出题来源：采购管理部《项目采购策划管理指引》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "虚假招标、无效招标主要表现是,伪造投标报价单,中标单位的工商登记信息完全不存在,中标单位不具备业务承揽资质【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "云筑网招标密钥文件及口令丢失后不可以重新设置【出题来源：采购管理部《采购全链条指导手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "云筑网招标任务,概算金额填写的是不含税概算【出题来源：采购管理部《采购全链条指导手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "云筑网招标任务,概算金额填写的是含税概算【出题来源：采购管理部《采购全链条指导手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在本单位第一次合作的主体、二次结构劳务分包必须考察【出题来源：采购管理部《中建八局采购合规管控实施细则》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在设计完成后,项目部人员就应推进认质认价工作【出题来源：采购管理部《项目采购策划管理指引》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标公告的报名时间未满48小时；招标公告未明确供方资质要求等核心要素属于不合规行为【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标过程中可以淘汰不在三公司本级资源库中的分供方【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标过程中涉及到技术难度较大、方案难以确定的情形,可组织两阶段招标,第一阶段开技术标,第二阶段开商务标【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标过程中涉及到技术难度较大、方案难以确定的情形,可组织两阶段招标,第一阶段开商务标,第二阶段开技术标【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "针对工程招标文件中对物资设备技术参数、品牌档次的要求,充分进行市场调研,利用战略合作供应商资源,引导物资设备的品牌、选型【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "针对公司集采,项目可单独议标,进行二次谈判,项目单独签订合同价格及条件不得高于集采结果【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局采购管理风险防控工作,完善公开监督机制【出题来源：采购管理部《中建八局采购合规管控实施细则》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局采购管理风险防控工作,完善公开招标机制【出题来源：采购管理部《中建八局采购合规管控实施细则》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "主体、二次结构劳务招标前在公司管理平台进行分包商推荐,推荐表必须在资审时上传云筑网【出题来源：采购管理部《采购全链条指导手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "主体、二次结构资审、定标需审批到公司层级【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主体结构、二次结构劳务资格审查表审批至三公司工程管理部【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主要采购方式包括MRO(云筑电商)采购【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "资审结果不符合招标公告要求,未按要求上传资审结果附件均属于不合规行为【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "违法分包指承包单位承包工程后违反法律法规规定,把单位工程或分部分项工程分包给其他单位或个人施工的行为【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "转包指承包单位承包工程后,不履行合同约定的责任和义务,将其承包的全部工程或者将其承包的全部工程肢解后以分包的名义分别转给其他单位或个人施工的行为【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "与合同有关的通知、批准、证明、证书、指示、指令、要求、请求、同意、意见、确定和决定等,可以采用书面或者口头形式,在合同约定的期限内送达接收人和送达地点",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢管桩的计量单位既可以按吨计量,也可以按根计量",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "地下连续墙工程量按设计墙外边线乘以厚度乘以槽深,以体积计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "对预制钢砼方桩的接桩费用,应另列项目计价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "施工定额是按社会平均先进水平编制的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "承包人采购的材料和工程设备,应保证产品质量合格,材料和工程设备到场后必须通知监理人检验",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一台某种机械工作24小时为一个台班",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "发包人提供的材料或工程设备不符合合同要求的,承包人有权拒绝,并可要求发包人更换,由此增加的费用和(或)延误的工期由发包人承担,并支付承包人合理的利润",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "定额具有地区性、时间性的特点",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "地面面层、垫层都是按面积计算工程量",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "发包人在收到承包人竣工结算文件后的30天内,不审核竣工结算或未提出审核意见的,视为承包人提交的竣工结算文件已被发包人认可,竣工结算办理完毕",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "门窗制作、安装工程量均按门窗扇尺寸计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "监理人发出变更指示无须经过发包人同意",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "材料二次搬运费属于定额直接费",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "预算定额是按社会平均水平编制的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全部使用国有资金投资或国有资金投资为主的建设工程施工发承包,必须采用工程量清单计价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "全国各地预算定额中人工工日单价是相同的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "沉井下沉工程量按设计井壁外围面积乘以下沉深度以体积计算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "梁、板、柱等构件的混凝土工程量按面积计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "土方体积应按照挖掘前的天然密实体积计算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "时间定额和产量定额之间的关系是互为倒数关系",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "暗挖土方的项目特征不考虑运距",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "平整场地的工程量就是建筑物的底面积",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "发包人和监理人对承包人提交的施工进度计划的确认,可以免除承包人根据法律规定和合同约定应承担的任何责任或义务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "定额直接费由人工费、材料费、机械使用费组成",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "由于市场物价波动影响合同价款的风险,应由承包人承担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "时间定额与产量定额互为倒数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工程量必须按照相关工程现行国家计量规范规定的工程量计算规则计算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "独立柱雨蓬按顶盖水平面积的一半计算建筑面积",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "不论合同专用条款如何约定,市场价格波动超过约定范围的均可以按规范要求进行调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "平整场地的工程量就是建筑物底平面的外形图示尺寸面积",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在合同订立及履行过程中形成的与合同有关的文件不是合同文件组成部分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑工程的砖基础与砖墙的划分界限是以室外设计地坪为界,以下分基础,以上为墙体",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合同文件包括合同当事人就该项合同文件所作出的补充和修改,属于同一类内容的文件,应以最早签署的为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "有地下室的满堂基础,其基础与墙体的分界线为地下室地面",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "不可抗力解除后复工的,若不能按期交工,发包人可以要求赶工,承包人应采取必要的赶工措施并承担相应费用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑物的檐高是从室内设计地坪±000算起的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "承包人未在合同约定的时间内提交竣工结算文件,经发包人催告后14天内仍未提交或没有明确答复的,发包人有权根据已有资料编制竣工结算文件,作为办理竣工结算和支付结算款的依据,承包人应予以认可()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工人工作时为恢复体力稍作休息的时间为非定额时间",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程工程量清单计价规范》(GB50500—2013),承包人无正当理由在约定时间内未递交竣工结算书,造成工程结算价款延期支付的,责任由承包人承担",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "供求因果增加费属于施工附加费",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依法应当公开招标的项目招标人无正当理由不与中标人签订合同的,由有关行政监督部门责令改正,可以处中标项目金额10%以下的罚款",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "甲类工程是固定资产方向调节税税率为0%的投资项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设行政主管部门负责建筑安全生产的管理,并依法接受劳动行政主管部门对建筑安全生产的指导和监督(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "报价最低的标底其评定价格也最低",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "书面文件和通知不得扣压,一方能够提供证据证明另一方拒绝签收或已送达,应视为对方已签收并应承担相应责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "天棚面层在同一标高或不在同一标高,均为一级天棚",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在收到支付申请的7天内经行核对,向承包人发出预付款支付证书,并在签发支付证书后的14天内向承包人支付预付款",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "大红、天蓝,、白色、浅湖等颜色在套用油漆定额时,套浅色定额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑施工企业和作业人员在施工过程中,应当遵守有关安全生产的法律、法规和建筑行业安全规章、规程,不得违章指挥或者违章作业()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "被本单位标记不良行为的分供方一律不予通过资审【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "铝合金门窗工程量按框外围面积计算,无框门按扇外围面积计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工单位视情况决定是否设立安全生产管理机构,配备专职安全生产管理人员(  ) ",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "被其他工程局标记不良行为的分供方一律不予通过资审【出题来源：采购管理部《采购合规管控要点》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "直接工程费由人工费、材料费、施工机械使用费三部分组成",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "承包人对安全文明施工费应专款专用,在财务账目中应单独列项备查,不得挪作他用,否则发包人有权要求其限期改正",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "实行工程量清单计价招标投标的建设工程,其招标标底、投标报价的编制、合同价款确定与调整、工程结算应按《建设工程工程量清单计价规范》执行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工现场暂时停止施工的,监理单位应当做好现场防护(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购策划对风险点、亏损点、赢利点进行辨识【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分部分项工程量清单包括的内容应满足两方面的要求,其一要满足规范管理、方便管理的要求；其二要满足计价的要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分包单位可以将其承包的工程再分包(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购成本降低率为采购成本降低额与标准成本金额的比值【出题来源：采购管理部《局P报表》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "清单项目是以形成工程实体为基础设立的,按计算容易、比较直观的原则来设置的",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "措施项目中的所有费用必须按照国家或省级、行业建设主管部门的规定计算,不得作为竞争性费用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "现在新计价办法和原2001年定额可以同时使用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "出现合同价款调增事项后的7天内,承包人应向发包人提交合同价款调增报告并附相关资料",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的诚信履约原则指的是坚持质量第一、效益优先,营造公平竞争的市场环境；强化采购前置,提升采购时效,助力高效建造【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "执行新计价办法后,依法招标的工程可以不执行新计价办法",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "实际工程量比招标工程量清单减少15%,且引起措施项目变化,若措施项目按系数计价,相应调低措施项目费",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的分级管理原则指的是实行局总部、公司总部、二级单位、项目部四级管控,构建纵向分级、横向分权的体系架构【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程量清单计价包括分部分项工程费、措施项目费、其他项目费、规费和税金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工程量清单应采用综合单价计价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的公平公正原则指的是要做到机会公平、过程公正、结果公开,尊重并保护相关方利益【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在编制工程量清单和工程量清单计价时应按照《建设工程工程量清单计价规范》规定的统一格式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的阳光高效原则指的是必须遵守国家法律、法规及企业规章制度,恰当的行使权利,诚信履约,重视和维护八局企业品牌及合法权益【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为了保证安全文明施工措施落实到位,现场安全文明施工措施费实行核定制度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "由于承包人使用机械设备、施工技术以及组织管理水平等自身原因造成施工费用增加的,应由发包人全部承担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的智慧采购原则指的是全面推行电子招标、电子评标、电子签约,实现采购管理大数据支撑、网络化共享、智能化协作【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "甲供材料的采保费应该在其他费用中考虑",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "因变更引起工期变化的,合同当事人均可要求调整合同工期",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中所指二次结构劳务分包是包含砌筑工程的非主体结构工程劳务分包【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "附录计算规则中已包含工程量合理损耗,投标人报价中无需自行考虑",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "合同中可以约定承包人承担无限风险",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理文化的核心是价值创造【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程量清单应由具有编制招标文件能力的招标人或受其委托的中介机构进行编制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "任何情况下,发包人不得压缩合理工期",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理文化的核心是智慧采购【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "单独装饰工程20米以上超高部分人工降效应按超过20米部分的人工费分段计算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合同约定由承包人采购的材料、工程设备,发包人可以指定生产厂家或供应商",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理展望是大数据共享、网络化协作、智能化支撑【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投标报价时,投标人结合本企业的实际情况,计价表中的人工、材料、机械台班耗用量可作适当调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合同工程发生现场签证事项,未经发包人书面签证确认同意,承包人擅自施工的,发生的费用应由承包人承担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理展望是大数据支撑、网络化共享、智能化协作【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程量清单中某些分部分项的工程量的计算规则与清单中工程内容的工程量的计算规则是一致的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购效益率为收入总额与采购总额差值与收入总额比值【出题来源：采购管理部《局P报表》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "同一标段包含多个单项(单位)工程时,措施项目及其他项目,应按同一标段综合报价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "存在缺项控制价的需审批至分公司总经济师【出题来源：采购管理部《商务管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "凡工程类别标准中,有两个指标控制的,必须要满足两个指标即可按该指标确定的工程类别",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "单项招标任务分供方报价不得短于72小时,集采报价时间不得短于5天【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "综合单价是完成工程量清单中一个规定计量单位项目所需的人工费、材料费、机械使用费、和利润",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "单一来源采购必须保证原有采购项目一致性或服务配套的要求,需要继续从原分供方处添购,且添购资金总额不超过原合同金额30%的【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预留金是指投标人为可能发生的工程量变更而预留的金额",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "定标金额不能超过招标概算额的10%,是指的上下浮动都不能超过10%【出题来源：采购管理部《采购合规宣贯培训课件》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "措施项目清单以项为计量单位,相应数量为l",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于评标参考价,单项劳务及专业分包招标不做强制要求【出题来源：采购管理部《采购合规宣贯培训课件》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "零星工作项目表可以不列出详细的人工、材料、机械名称",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "多家中标的情况,生成所有合同的合同额累计不超过概算额10%(集采除外)【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工程量清单可以采用工料单价计价",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分公司的集中采购、战略采购定标环节只需在分公司审批【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "分部分项工程量清单的综合单价,不包括招标人自行采购材料的价款",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "非工程实体采购招采流程统一由采购中心约标【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标工程如设标底,标底应根据提供的设计图纸和有关要求、施工现场实际情况、合理的施工方法以及按照省、自治区、直辖市建设行政主管部门制定的有关工程造价计价办法进行编制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分公司集中采购和2000万元以上的砼及砼构件的定标由分公司进行审批；【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程量清单及其计价格式中的任何内容不得随意删除或涂改,但可以添加",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分公司主体、二次结构劳务分包资格审查、定标由公司进行审批；【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单项工程费汇总表中的金额应分别按照分部分项工程量清单计价表、措施项目清单计价表和其他项目清单计价表的合计金额和按有关规定计算的规费、税金填写",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分供方在施工过程中增加合同范围(施工标段)之外的且与原合同约定的工作内容完全不一致的,应重新组织招标【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分部分项工程量清单综合单价分析表和措施项目费分析表,必须要填写",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司相关规定,主体、二次结构定标环节,需按照要求上传标前交底书【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据公司相关规定,主体、二次结构资审需审批到公司层级【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据管理要求,可选择云筑平台线上开标或线上线下同时开标【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于加强专业领域自主采购模式转变的通知中,专业工程自主采购13项有钢结构、幕墙、精装修、电气、给排水、消防、暖通、智能化、人防、园林绿化、金属屋面、体育工艺、医疗专项【出题来源：采购管理部《关于加强专业领域自主采购模式转变的通知》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合同额不能大于招标概算额的10%【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合同额不能大于招标概算额的30%【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "将公司战略材料设备品牌融合招标文件是采购策划管理组织实施阶段的工作要求【出题来源：采购管理部《项目采购策划管理指引》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "局发布的P3报表中策划类型包括选型策划、品牌策划、规格策划、调差策划、组价策划、错峰采购、模式创新、支付策划、其他【出题来源：采购管理部《局P报表》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "开标后,采购小组审核分供方投标文件,组织开展清标工作,投标文件中有含义不明确的内容、明显文字或者计算错误,招标人认为需要投标人作出必要澄清、说明的,应当通知该投标人投标人的澄清、说明不得超出投标文件的范围或者改变投标文件的实质性内容【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "劳务与专业分包月度产值单可以打包在云筑网上跨月录入【出题来源：采购管理部《中建八局采购合规管控实施细则》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "劳务与专业分包中主体、二次结构是由分公司采购公司审批【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一轮取消最高价中标权,即按报价由高到低顺序依次取消中标权,一轮取消中标权的单位数量原则上不少于1家,不高于投标单位数量的35%如果满足废标条件,则优先于最高价淘汰【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "拟定标供应商查看云筑网发现三公司其他分公司有过考察的,可以不再考察,直接发起定标【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "拟中标人数量(N)≤3时,有效投标单位不少于2N+1【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标成员参与过投标单位历史项目评标且评分过高人员,应主动回避【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "评标时,投标单位提供虚假资料、隐瞒误导招标单位的,由评标委员会审议后该投标文件可以按无效处理【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标小组人员数量应为五人以上的单数【出题来源：采购管理部《采购管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "审计计划指为完成审计业务,达到预期审计目的,对一段时期的审计工作任务或具体审计项目做出的事先策划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "审计工作底稿指审计人员在审计过程中形成的工作记录和其支持性资料,以及被审计单位提供的各种纸质和电子文档等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "审计报告指审计人员根据审计计划、审计实施方案对被审计单位实施必要的审计程序后,就相关审计事项,所出具的书面评价、结论或建议性文件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "审计质量控制指审计机构为确保审计质量符合公司审计职责定位、相关管理规定、审计实务,有效实现审计价值增值目标而制定和执行的政策和程序审计质量控制包括审计机构质量控制、审计项目质量控制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总部业务部门为审计整改的主体,被审计单位负责人为整改第一责任人对审计发现的问题和风险,被审计单位应及时制定审计整改方案并落实到位,及时将整改方案及整改结果反馈至各业务部门和公司审计部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导责任指根据企业内部分工,审计对象对其分管工作以及企业经营、投资等重大事项,因未履行或者未正确履行职责应负有的经济责任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "内部控制审计既可以作为单独的审计项目实施,也可作为其他类型审计的一项内容；可以单独审计其中某一业务流程,也可对其中若干业务流程同时实施审计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分支机构绩效审计可以单独进行,不可以与任期经济责任审计、财务收支审计等一并进行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "按审计对象,内部控制审计可以分为业务流程内部控制审计、非独立部门内部控制审计、独立实体内部控制审计、工程项目内部控制审计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "外部专家的聘请,由审计部根据工作需要提出建议,经主管领导或相关管理层批准外部专家可从公司外部聘请,也可在公司内部选聘",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司审计部为外来审计反现问题整改措施落实的监督部门,负责建立本单位审计整改台账,对审计发现问题的整改落实情况进行实时跟踪并将有关情况按要求及时报送各关业务部门和局审计部备案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司审计部可根据企业管理需要,对批准后的审计计划进行调整,不需要向局审计部提出审计计划调整的申请",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据成本效益原则,审计人员应兼顾成本效益原则,但对于重要的审计事项,可将审计成本的高低作为减少必要审计程序的理由",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "审计工作底稿是联系审计证据和审计结论的桥梁、是形成审计报告的主要依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "审计报告初稿经审计组成员讨论修订后,报审计部负责人审核,不需要书面征求被审计单位领导班子成员及相关部门意见",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "如果审计报告需要提供给本单位以外的人员使用,应遵守公司相关规定,并经主管领导批准；涉及公司有关商业机密或对公司有重大影响的经济事项,需经公司领导批准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对审计中发现的问题和审计建议,被审计单位应在六个月内向审计机构反馈整改和落实情况若被审计单位没有做出适当回应,审计人员有责任通过督促、正式通知提醒被审计单位,必要时向管理层报告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在利用外部专家服务结果作为审计证据时,应充分评价其充分性、相关性及可靠性评价内容应包括外部专家选用的假设和方法的适当性,以及所使用资料的充分性、相关性和可靠性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "被审计单位及其相关责任人员,可将其业务经过审计而代替、减轻或解除其应有的管理责任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "违规经营投资责任追究是指企业经营管理有关人员违反规定,未履行或未正确履行职责,在经营投资管理中造成国有资产损失或其他严重不良后果,经调查核实和责任认定,对相关责任人进行处理的工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单位和个人对禁入限制人员信息查询结果存在异议的,可向公司工作委员会办公室提交口头异议申请和相关证明材料",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "按照谁处理、谁负责的原则,对禁入限制人员信息的合法性、真实性、准确性负责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "委员部门责成分公司进行责任追究的,分公司应在作出处理决定后30日内将责任追究处理决定报工作委员会办公室备案",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "核查工作一般应于3个月内完成；对于违规情况复杂、发生时间久远、可申请延长一次,延长时间不得超过3个月",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "涉嫌违纪、职务违法或犯罪的,按照纪检监察相关规定移交公安检查机关",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在违规经营投资事项所涉及期间,由于不可抗力、失去人身自由等无法正常履职的可免除有关人员的责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对同一事件、同一责任人的薪酬扣减和追索,按照党纪处分、政务处分、责任追究等扣减薪酬处理的最低标准执行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "经过批准,参加各种会议、学习班等,凡由主办单位统一安排食宿的,住宿费凭票据实报销",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "按照程序审批的借出的备用金不需要作为单位公款进行管理,但要接受公司纪检监督工作部、财务资金部的监督管理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "违规经营投资责任根据工作职责划分为直接责任、主管责任和领导责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部自行提供的钢管损耗率控制在总进场量的17%以内,扣件损耗率控制6%以内；盘扣、方钢等周转料具损耗率控制在1%以内",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程剩余物资包括可回收物资和废旧物资",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "现场物资领用遵循限额领料,后进先出的原则,未经检验合格不得使用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据局《项目资产管理实施细则》限额领料是按照材料消耗定额或规定限额控制材料领发的一种管理形式,其本质就是施工预算不能突破施工预算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采购管理实行总部、分公司、项目部三级管控,统一归口总经体系管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《项目资产管理实施细则》按找谁使用、谁保管的原则设置资产保管人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标公告的报名时间未满48小时；招标公告未明确供方资质要求等核心要素属于不合规行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "周转料具是指企业能够多次使用、逐渐转移其价值但仍保持原有形态而不确认为固定资产的材料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "将单项采购拆分为多个招标,化整为零,规避招标审批属于不合规行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "活动拌饭、彩钢围挡、脚手架属于临时设施",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "招标过程中可以淘汰不在三公司本级资源库中的分供方",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "处理钢筋头的数量原则不能超过钢筋图纸净用量的15%或执行项目承包合同及劳务分包合同的约定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主体、二次结构劳务招标须在招标文件编制完成后,项目部领导班子成员对相应分包商进行集中标前交底",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "供应商签字、盖章/项目部审核确认时间为云筑网流程结束后7日内双方用印完毕",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "其他类合同也需要控制价审批或者超控制价审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "洗车台、雾炮、地磅主责部门为公司/二级单位安全生产监督管理部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "云筑网招标任务,概算金额填写的是不含税概算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "管理费用预算分解后,实际执行过程中,部门预算不足,可以在季度管理预算执行分析后,提出预算调整方案,经过批准后,进行部门预算的调整",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "对于评标参考价,单项劳务及专业分包招标不做强制要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单项金额超过人民币1,000万元的应收账款,判断信用风险特征与相应组合法的信用风险特征不存显著差异,所以不需要单项计提减值准备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据公司相关规定,主体、二次结构资审需审批到公司层级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "各类保证金由公司总部统一对外支付,分公司不得自行支付",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "单项招标任务分供方报价不得短于72小时,集采报价时间不得短于5天",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据新会计准则要求,由于工程质保金纳入合同资产核算,所以工程质量保证金不应纳入应收账款管理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司相关规定,主体、二次结构定标环节,需按照要求上传标前交底书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分公司在与业主合同谈判中对于质量保证金条款,双方约定,我方在缴纳工程结算额1%比例的质量保证金后,可以将工程款支付比例调整为100%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "劳务与专业分包中主体、二次结构是由二级单位采购公司审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "各个分公司需要在项目关账后才可以提交项目兑现申请",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二级单位集中采购、战略采购定标环节只需在二级单位审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司某个固定总价项目施工2年后,签订合同发生了追加,该追加合同为非固定价合同,由于业务为同一家单位,所以执行建造合同不需要进行合同的分立",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "监理人审查承包人按照专用合同条款的约定提供应当由其编制的与工程施工有关的文件可以减轻或免除承包人根据合同约定应当承担的责任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各级单位统计部门的原始记录应按专业分工实行分类管理,由专人据实填写和保管,任何人不得干涉和擅自修改",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "年度财务决算指标与年度经济活动分析相关指标预计差别较大的情况,要作专题说明,分析差异形成的原因",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "停工项目截止停工之日,累计确认的项目收入小于累计确认的项目成本财务核算时不做调整只需要将停工项目的预收账款余额转入工程结算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "用印遵循管用一体原则",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "暂列金额列入合同价格,且属于承包人所有",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "单份单项额度10万元以上或超过分包合同额10%的经济签证须签订补充协议",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公路工程施工图批复后,发包人组织设计、监理、施工单位按照统一格式核对两阶段施工图变化情况并经四方签认形成零号清单,作为工程量依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "商标在企业发生分立、合并、改制或更名等形态变化时,应及时办理商标停止使用手续,可以自行将注册商标转让给他人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "废旧物资上缴处理资金凭证为财务收据或转账凭证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业购置的单位价值超过5000元,使用寿命超过一年的资产应纳入固定资产核算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司对于预算预警界定主要针对的是对于发生的性质重要的、金额重大的,而对于反常的经济现象不需要发出预警",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对盘盈、盘亏、毁损的固定资产,应当查明原因,分清责任,提出处理意见,履行报批程序后及时进行相关处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "应付账款结清前,经办财务人员要认真核实账务情况,在最后一笔工程款支付前要求分供商提供盖有公章的收付两讫的证明资料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "《建筑法》是属于行政法规的范畴(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合同工程发生现场签证事项,未经发包人书面签证确认同意,承包人擅自施工的,发生的费用应由承包人承担",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在本次疫情作为不可抗力的情况下,建筑企业有权要求顺延工期,但无义务采取措施避免工期的进一步延误",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目副经理每周对周进度计划完成情况进行考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理每年对年进度计划完成情况进行考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二级单位施工管理部每月对各项目一级节点完成情况进行汇总考核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二级单位施工管理部每月对各项目二级节点完成情况进行汇总考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理每月对各项目三级节点完成情况进行考核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司每季度对二级单位产值完成情况进行通报考核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "产值不达标项目为月产值完成率低于85%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "专业工程师每天根据现场工作内容及材料进场、计划完成情况、机械设备使用情况完成施工日志填报,并报项目副经理审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重点工程月度产值、计划偏差8%的二级单位要介入管理、偏差10%的公司介入管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二级单位每季度对项目部产值完成情况进行通报考核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "重点工程的监理例会纪要的审批人是二级单位生产副总经理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "一般工程的监理例会纪要的审批人是二级单位生产副总经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "重点工程的项目周例会纪要的审批人是工程管理部经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一般工程的项目周例会纪要的审批人是工程管理部经理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二级单位的生产月度报告的审批人是公司生产副总经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收尾项目竣工前6月开始,除正常例会外,二级单位或包保制领导每月组织项目相关部门召开收尾项目推进会",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "创国家级奖项项目的预验收,公司科技质量部参与",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "供热与供冷系统保修期为2个采暖期,供冷期；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "四新技术包括新技术、新工艺、新材料和新设备,应在施工组织设计中作出部署,明确安全技术措施及相关管理要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "每天作业前,由专业工程师开展班前教育",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目安全总监每月开展班组长安全培训",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目生产经理组织开展现场月度安全教育",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基本工资是依据建筑工人当月实际考勤及劳动合同中约定的工日单价标准计算所得薪资(包括建筑工人向企业过程借款和企业向工人实发金额),绩效工资是除当月基本工资外的剩余工资",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目每半年至少开展1次工人工资支付纠纷应急演练,并对应急方案进行动态调整",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目部发生工人工资纠纷事件后,项目经理在收到信息1小时内立即逐级上报至公司工程管理部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司工程管理部每季度对二级单位分包商考察评价和合格分包商名录管理开展检查",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位施工管理部每月对项目部分包商考核定级、分包工程款制服、分包商进退场手续进行检查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "二级单位施工管理部每季度对项目部劳务实名制系统、建筑工人现场管理内业资料、工人工资支付、工人工资纠纷处理进行检查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工人工资支付管理的主要绩效指标包括建筑工人劳动合同签订率、总包代发率、劳务实名制覆盖率和工资纠纷处理及时率",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "PPP、EPC项目应增加绿色建造方案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对出现的各类信用处罚事件,纳入到二级单位组织绩效考核以及分管领导年度考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目策划完成后,组织编制绿色施工策划",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "环境管理重点关注绿色施工策划率、万元产值综合能耗、绿色施工检查考核、创优指标完成率四个关键绩效指标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "沥青路面施工时,若混合料的加热温度过高或过低时,易造成沥青路面的泛油()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1954年1月,水利工程一师师部和两个团改编组成建筑工程第四师后进驻上海市,增补了施工技术力量,对原部队官兵进行了技术培训【出题部门：党委工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预制构件的吊环必须采用未经冷拉的热轧光因钢筋制作,且其使用时的计算拉应力应不大于60MPa",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分包商在某个项目处于退场结算中,此项目可以纳入分包商在合作中的项目中",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司房建项目在主体结构完成前2个月开展分阶段策划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "接到中标信息,确定项目定位的主责部门是公司市场部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司工程管理部负责编制重点工程的策划任务书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部实施计划的编写责任人是项目经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司每月对项目部实施计划进行考核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "分公司每季度对项目部实施计划进行考核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "责任成本是以项目实现履约为前提,依据项目标准成本,经过三级单位和项目部协商一致确定的由项目部控制的成本总额",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目针对公司或二级单位对项目实施计划执行情况提出的整改意见,在7天内完成整改并回复",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部人员在项目预留的风险金尚未具备返还条件,在该项目部工作时间超过3个月调离,可全额退还或转抵,根据项目考核情况按考勤比例予以兑现奖金或从以后岗薪中扣除,退回部分由项目部补齐",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中标项目中标后2个月内每15天召开一次",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "总包预算书编制时间为收到全部图纸60天内,大型项目编制时间为90天",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "装饰装修与机电安装专业承包工程中标后1个月内至少召开1次开工推进会",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "低成本运营战略10大主要指标其中在建项目优化效益率是房建项目优化效益率≥8%,专业项目优化效益率≥13%,基础设施优化效益率≥11%；合同谈判效益率≥01%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目总工在中标后7天内编制完成项目总进度计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "商务优化三点分析指的是创效点、亏损点、风险点",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目年进度计划的编制责任人是项目副经理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "专项策划立项提交时间为施工前28天；审批时间为收到后14天内",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目月进度计划的编制责任人是项目副经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总包结算核对达成一致意见时,须项目商务经理、项目总工、项目经理、三级单位总经济师、经理会签后方能签字盖章",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目周进度计划的编制责任人是项目副经理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "竣工项目具备所有考核条件后,项目部应在28天内提出竣工考核申请,否则由二级单位单方组织考核,并作为最终考核兑现依据",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目部施工进度延误程度分为蓝色预警、黄色预警和红色预警",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理每月对月进度计划完成情况进行考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业投资项目的备案制,既不同于传统的审批制,也不同于投资体制改革决定中所规定的核准制备案制的决策程序更加简便,内容也更简略备案机关不得对备案项目设置任何前置条件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "原则上应在地方政府一般公共预算收入高、债务率高、偿债能力强、信用好的地区开展投资业务()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "原则上应在地方政府一般公共预算收入高、债务率低、偿债能力强、信用好的地区开展投资业务()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "融投资带动总承包项目,我方应对项目主要投资人与其他投资人开展详细的尽职调查,确保其具备必备的投资能力和履约能力()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我方可以通过向外部单位(中央企业除外)提供委托贷款形式开展融投资带动总承包项目()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "内部回报率又称内部收益率,是指项目投资实际可望达到的收益率实质上,它是能使项目的净现值等于零时的折现率()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "商业地产开发或招商引资项目,均可通过PPP模式开展()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "业主无法提供AA+及以上平台担保作为还款保障的投资类项目,我方应谨慎推进()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投资区域内拓展基础设施投资项目,不得以参与系统外单位联合体、不投资(包括极少投资)为理由直接或间接规避基础设施投资区域化布局要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投资各方财务内部收益率以投资各方财务现金流量表进行测算对于我方既是项目投资方又是施工总承包方的项目,应计算我方投入自有资金的综合收益率,将投资层面(股东层面)的现金流量与我方施工总承包层面的现金流量合并计算()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投资经营管理费,指投资项目带动施工总承包的,由总承包单位按承建的建安产值的一定比例向投资专业平台缴纳的用于承担日常过程管控的费用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于住建部《关于在实施城市更新行动中防止大拆大建问题的通知》中项目内拆建比不应大于2()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在城市更新项目实施阶段项目具体实施由合资公司作为运作主体,对项目进行分类策划,各投资平台按照各自职能分工作为投资主体,按股份及局相关审批要求上报投资流程,获批后履行出资义务,由二级单位负责项目具体实施,城市更新中心负责统筹、资源支撑及管控()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据南京市《居住类地段城市更新规划土地实施细则》居住类地段城市更新项目的工作过程可分为六个阶段：前期工作、上报计划、多方案设计、上报方案、实施建设、验收交付()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "城市更新中的留改拆中改一般指的是维修整治,不涉及拆除()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在《中建八局城市更新业务工作指引》中关于城市更新业务职能分工中局投资管理部负责融资策划、编制融资方案、推进融资落地相关事宜()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "EPC+N模式适用于二线及以下城市片区更新类项目()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新项目合资公司负责项目顶层设计、规划策划、投融资模式设计、整合社会各方资源,统筹运作城市更新项目实施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新储备项目指完成政府高层对接,达成合作意向,近期有望签署战略协议的项目；或已签战略协议、近期不具备落地条件、但具备营销价值的项目()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新中心牵头组织项目评估遴选、运作策划与实施方案编制、合资公司成立审核()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新中心牵头负责城市更新领域涉及的政策研究、行业调研、学术研讨,负责更新思路、模式、技术的创新成果推广()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "综合管理部承担投资、运营、综合三个大板块的职能,具体工作内容包括项目合作模式策划、经济测算分析、投融资方案设计、实施方案编制、协议起草评审、项目招投标、合资公司设立、运营考核、产业服务等()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "产业资源部承担项目拓展、资源配置、运营管控三项职能,牵头负责项目定位、功能构成、一期项目策划、空间落位、项目产业及运营策划组织,重点运营项目管控,模块运营资源组织及实施,产融合作等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "规划发展部承担城市更新项目拓展和项目管控两大职能,并进行必要的技术支撑体系构建工作负责牵头组织项目研判、运作思路和策划方案,积累规划资源,重点规划设计、核心方案等环节进行管控()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新技术研究所承担技术集成研发、资源整合、品牌建设、培训宣贯四项职能负责打造八局城市更新核心技术优势,联合二级单位整合优势资源培育新业务()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "原则上,除固定资产投资项目外,项目债务融资无需我方提供担保或其他增信措施；固定资产投资项目融资及增信按照股份公司有关规定执行()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "固定资产投资项目应符合股份公司及主张单位战略规划、经营布局优化和结构调整的要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基础设施投资业务布局区域由核心布局区域、延伸布局区域和点状布局城市组成我局综合类投资区域为1+7+3,1为核心区域上海,7为延伸布局区域山东、江苏、浙江、广东、辽宁、四川、重庆,3为点状布局区域西安、合肥和南宁",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "政府直接投资和注入资本金的投资项目,项目建议书的批复为立项,项目立项后,可纳入政府投资年度计划,作为编制可行性研究报告的依据,政府投资主管部门依据可行性研究报告的结论作为投资决策的依据项目决策后,转入实施准备阶段,上述表述：",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业投资项目,除《核准目录》范围以外的,一律实行备案制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目决策与评价是一个由浅入深的递进过程,主要包含项目规划、项目投资机会研究、项目建议书、项目可行性研究、项目评估、项目后评价等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目实施方案采用的工程范围、建设方案、产品或服务方案、投资估算、财务效益测算等基础资料,主要来源于该项目前期工作成果,包括项目建议书、可行性研究报告等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "PPP在中国被称为政府和社会资本合作模式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局投资管理要求,对于投融资带动总承包项目,项目公司不应纳入我方合并会计报表范围",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "PPP类投资项目经局董事会审批通过后方可参与投标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "PPP模式要求政府应与投资者明确PPP项日的退出路径,保障项日持续稳定运行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国家发展改革委提出要推进建立多元化可持续的PPP项目资金保障机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目社会资本方可以通过施共总承包等方式将完工风险转移给更为专业的上程保险机构",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "BOT模式在我国得到广泛使用,根本原因在于这种运作模式较好地体现了PPP模式所遵循的理念",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "财政部规定要严格按照《政府采购法》要求,采取竞争性招标方式,引入信誉好有实力的运营商参与示范项目建设和运营",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "英国习惯于将PPP和PFI两个概念等同使用,即通常将PPP视为政府付费类购买公共服务PFI模式,并强调要纳入政府采购的范畴进行管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《基础设施和公用事业特许经营管理办法》(国家发改委2015年第25号令)仅适用于授予境内法人特许经营权的情形",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "财政部《关于推广运用政府和社会资本合作模式有关问题的通知》(财金[2014]76号)要求,政府部门应负责基础设施及公共服务PPP项日的价格和质量监管,以保证公共利益最大化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式属于国际上:非常成熟的基础设施项目运作模式,并对项目运作结构框架已经达成非常清晰的国际共识",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式通过引入社会资本,平滑财政支出,可以有效缓解地方政府债务压力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于PPP项目实施方案专篇,涉及财政资金直接支付的,应开展财政承受能力论证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式在本质上属于政府购买服务,应按照政府采购的思路进行评价和管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目的融资成本--般应低于当地财政资金融资成本或地方政府平台公司的融资成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业以社会资本的身份参与PPP项目,难以实现发挥市场配置资源的决定性作用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财政部《政府和社会资木合作模式操作指南》(财金(2014)113号)规定本级政府所属融资平台公司能够以社会资本的身份参与当地PPP项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目的财政资金投入,要从补运营向补建设逐步转变,探索建立动态补贴机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式强调政府和社会资本开展合作,且政府必须投入资金,以便建立资本层面的合作伙伴关系",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目主要根据项目的预期收益资产以及政府扶持措施的力度来安排融资,是以项目发起力为信用主体的融资活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "PPP不应该成为政府向纳税人进行多次收费的理由",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目I社会资本方可以通过施工总承包等方式将完工风险转移给更为专业的工程保险机构",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式要求政府应与投资者明确PPP项目的退出路径,保障项目持续稳定运行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于使用者付费类PPP制度设计的核心是通过收费制度及价格形成机制的改革,建立政府付费型项目回报机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如果政府财政资金过度介入,说明不存在财政资金紧缺问题,因此从融资的角度看,没有必要采用PPP模式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "商业活动的特许经营(Franchise)不适合基础设施和公共服务领域PPP的范畴",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《基础设施和公用事业特许经营管理办法》(国家发改委2015年第25号令)仪适用于授予境内法人特许经营权的情形",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式使得提供公共服务的责任主体从地方政府转移到民营企业或社会资本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目社会资本或项目公司违反项目合同约定,威胁公共产品和服务持续稳定安全供给,政府有权临时接管项目,直至启动项目提前终止程序",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国家发改委要求建立实施PPP项日进展情况按月报送制度,设立PPP项目库,及时跟踪调度梳理汇总项目实施进展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于公共服务之外的领域,以及完全可以交给市场化运作的私人产品项目,不应纳入PPP的适用范田",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP模式强调要在项目运营期引入专业的管理理念和经营方法,实现让专业的人做专业的事,提高公共服务的效率",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目评标标准和办法要客观、具体、透明,禁止排斥、限例或歧视民间资本和外商投资,鼓励社会投资人联合体投标,鼓励设立混合所有制项目公司",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目如果需要政府股权投资,应由项目实施机构与社会资本方或其联合体成员共同发起成立项目公司",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "凡是具有利益共字、风险共担、建长期合作伙伴关系等特征基础设施及公共服务项目运作模式,都属于PPP模式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "BOT和PPP都是基础设施引入社会资本融资项目的具体运作模式,B0T项目本质上就是PPP项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目合同中涉及的政府支付义务,财政部门应结合中长期财政规划统筹考虑,纳入上级政府预算,按照预算管理相关规定执行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公开招标主要适用于核心边界条件和技术经济参数难以界定,符合国家法律法规和政府采购政策,且采购中不作更改的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当前我国缺乏的不是资金,而是具有财务可持续性的有价值的投资项目,需要探新的资金筹措机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当项月出现重大经营或财务风险,威胁或侵害侦权人利益时,债权人可依据与政府、社会资本或项目公司签订的直接介入协议或条款,要求社会资本或项目公司改善管理等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目必须有5家以上社会资本通过资格预审,项11实施机构才可以继续开展采购文件准备工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "B0T模式在我国得到广泛使用,根本原因在这种运作模式较好地体现了PPP模式所进循的理念",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目应按照风险分配优化风险收益对等和风险可控等原则,综合虑政府风险管理能力、项目回报机制和市场风险管理能力等安素,确定风险分配基本框架",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《关于在公共服务领域推广政府和社会资本合作模式的指导意见》(国办发(2015)42号)要求政府和社会资本合作模式应采取竞争性)方式择优选择社会资本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "推广应用PPP模式的根本目的是改善公共服务的供给方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国家发展改革委提出要推进建设多元化可持续的PPP项目资金保障机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目无论采用使用者付费还是政府付费,都是提供公共产品的具体方式,都需要占用公共资源,与公共利益密切相关",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财政部规定要严格按照《政府采购法》要求,采取竞争性招标方式,引入信誉好,有实力的运营商参与示范项目建设和运营",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国家发展改革委《政府和社会资本合作项目通用合同指南》(2014年版),由国家发改委委托中国国际工程咨询公司负责编写",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "从公共管理的视角看,使用者付费和政府付费本质上是相同的,因此应将使用者付费类特许经营PPP模式内容政府采购流程进行规范化管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "PPP项目的实施方案应出项目实施机构组织编制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "无论是使用者付费类PPP项日,还是政府付费类PPP项日,都强调加大政府财政资金对PPP项目投资的介入力度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财政部《政府和社会资本合作模式操作指南》提出要积极发挥第三方专业机构作用,全面统筹政府和社会资本合作管理工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "英国习惯于将PPP和PFI两个概念等同使用,即通常将PPP视为政府付费类购买公共服务PFI模式,并强调要纳入政府采购的范围进行管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "PPP项目的政府社会资本或项目公司应依法公开披露项口相关信息,保障公众知情权,接受社会监督",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "纳入当地基础设施PPP储备库的项目,实行动态管理、滚动实施、分批次推进对于需要当年推进实施的PPP储备项H,应纳入年度投资预算计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目:指在一定时间内,按预算规定的范围,为达到预定质量日标而进行的一项一次性任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "经营性项目:主要是直接用于物质生产或为满足物质生产需要服务的项目,项目投资目标是实现项目所有者权益的市场价值最大化和获取最大投资利益",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公共项目:是指为满足社会公众需要,生产或提供公共物品(或服务)的项目,属于非经营性项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竞争性项目:是以企业作为基本的投资主体,由企业自主决策、自担风险,由企业通过市场筹资、建设和经营",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目评估:是在可行性研究工作的基础上,对拟建项目的必要性、项目背景情况和建设条件的可行性,以及项目在技术上的先进适用性和经济上的合理有效性等诸多方面进行全面的综合审查和评价项目评估是实现投资决策的科学化和民主化的重要手段",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目周期:指一个投资项目从提出项目设想、立项、决策、开发、建设、施工,直到竣工投产,进行生产活动和总结评价的全过程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目建议书:是要求建设某-具体投资项目的建议性文件主要从项目建设的必要性,建设条件的可行性和获利的可能性等方面对项目提出建议,是选择项目初步决策依据和进行可行性研究的基础",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基础性项目:主要包括具有一定自然垄断性、建设周期长、投资大而收益较低、需要政府扶植的基础设施项目和一部分基础工业项目,以及直接增强国力的符合经济规模的支柱产业项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公益性项目:是指那些非赢利性和具有较大社会效益性的项目,主要包括科技、教育、文化、卫生、体育、广播电视和环保等事业的建设项目,公、检、法、司的政权机关的建设项目,以及政府机关、社会团体的办公设施和国防设施建设项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司成功加入了江苏省设协消防技术委员会,开通了消防设计重难点咨询渠道",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "下半年要对所长实行竞聘上岗",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "遇到舆情事件可以不经审批接受媒体采访",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "下半年要进行设计院的2+5规划编制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "设计经理以领导委派为主,不需要开展竞聘",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为防止地表径流冲刷地面,在汇水线上布置一些山石,借以减缓水流冲力降低流速,这些山石叫挡水石",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公园园路的主干道一般为15-35m",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "小游园平面布置形式可以分为规则式、自由式和混合式三种",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "城市绿地范围内的古树名木必须原地保留",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一池三山的形式最早出现在清代颐和园",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "《园冶》是明代造园大师计成的著作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "水体岸边设有活动场地的区域,应在近岸200m范围内、常水位水深大于(含)070m的人工驳岸处设置防护设施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "游人通行量较多的建筑室外台阶踏步数不应少于2级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "模纹花坛宜选择生长缓慢的多年生、耐修剪的观叶植物",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一般将乔木主干离地表面12m处的直径成为胸径",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目优化应事前立项,且一事一立项,立项基数为拟实施的单项优化预计效益≥30万",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于专业分包结算,按复审审减额的8%奖励；对于劳务分包及供方结算,按复审审减额的4%奖励",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目优化考核审批,三级单位在14天内完成,二级单位在28天内完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "月度平均工程计量确认率=本季度发包人确认的工程计量/本季度同期实际完成工程量",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "工程交竣工后,从项目超额完成利润中扣除工程保修和创奖费用,包干使用,且不再返还",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "直接与室外空气接触的楼板或与不供暖供冷房间相邻的地板作为供暖供冷辐射地面时,必须设置绝热层",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目季度目标考核兑现,人力资源部根据会签情况,确定项目奖励标准与金额,并于次月30日前考核兑现完毕",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "事点故通风的手动控制装置应在室内外便于操作的地分别设置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "出现亏损的项目将追究责任,亏损项目的项目经理原则上三年内不得再担任项目经理,不得升职任用,项目总工和项目商务经理降级使用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "放散有爆炸危险气体的场所应设置防爆通风设备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竣工目标考核完成后,对全面完成各项管理目标的项目返还预留风险金,由三级单位财务资金部办理返还手续",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对严寒地区公共建筑经常开启的外门,应采取热空气幕等减少冷风渗透的措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "供暖系统供水、供汽干管的末端和回水干管始端的管径不应小于DN32",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "排除、输送有燃烧或爆炸危险棍合物的通风设备和风管,均应采取防静电接地措施(包括法兰跨接),不应采用容易积聚静电的绝缘材料制作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设规模较小、技术难度较低、工期较短,且施工图设计已审查批准的建设工程可采用总价合同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "多台通风机并联运行的系统应在各自的管路上设置止回或自动关断装置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程计量、合同价款调整、合同价款结算与支付等工程造价文件的编制与核对,可以由非专业资格的人员承担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "燃气体管道、可燃液体管道和电线等,不得穿过风管的内腔,也不得沿风管的外壁敷设可燃气体管道和可燃液体管道,不应穿过通风、空调机房",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "非国有资金投资的建设工程,宜采用工程量清单计价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当风管内可能产生沉积物、凝结水或其他液体时,风管应设置不小于0005的坡度,并在风管的最低点和通风机的底部设排液装置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调系统的冬季热负荷,应按所服务各空调区热负荷的累计值确定,除空调风管局部布置在室外环境的情况外,可不计入各项附加热负荷",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调区的冬季热负荷,在计算时,室外计算温度应采用冬季空调室外计算温度,并扣除室内设备等形成的稳定散热量",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调系统的夏季冷负荷应计入新风冷负荷、再热负荷以及各项有关的附加冷负荷",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "空气中含有易燃易爆或有毒有害物质的空调区,应独立设置空调风系统",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调区的空气质量、温湿度波动范围要求严格或空气中含有较多油烟时,不宜采用风机盘管加新风空调系统",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "人员集中且密闭性较好,或过渡季节使用大量新风的空调区,应设置机械排风设施,排风量应适应新风量的变化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "空调系统可采用氨作制冷剂的直接膨胀式空气冷却器",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "空调冷(热)水和冷却水系统中的冷水机组、水泵、末端装置等设备和管路及部件的工作压力不应大于其额定工作压力",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "电动压缩式冷水机组电动机,单台电动机的额定输入功率大于900kW时,应采用高压供电方式",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当建筑物所有区域只要求按季节同时进行供冷和供热转换时,应采用两管制的空调水系统",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用辐射供冷末端设备时,供水温度应以末端设备表面不结露为原则确定;供回水温差不应小于5℃",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "除定流量一级泵系统外,空调末端装置应设置水路电动两通阀",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "变流量一级泵系统采用冷水机组定流量方式时,应在系统的供回水管之间设置电动旁通调节阀,旁通调节阀的设计流量宜取容量最大的单台冷水机组的额定流量",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "变流量一级泵系统采用冷水机组变流量方式时,在总供、回水管之间应设旁通管和电动旁通调节阀,旁通调节阀的设计流量应取各台冷水机组允许的最小流量中的最大值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调热水和空调冷水系统的流量和管网阻力特性及水泵工作特性不吻合的情况下,两管制空调水系统应分别设置冷水和热水循环泵",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "水泵定流量运行的一级泵,其设置台数和流量应与冷水机组的台数和流量相对应,并宜与冷水机组的管道一对一连接",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调水系统布置和选择管径时,应减少并联环路之间压力损失的相对差额当设计工况时并联环路之间压力损失的相对差额超过25%时,应采取水力平衡措施",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "空调水系统的定压方式,如果补水压力低于补水点压力,应设置补水泵",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空调冷热水的水质应符合国家现行相关标准规定当给水硬度较高时,空调热水系统的补水宜进行水质软化处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "空调水系统应设置排气和泄水装置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "冷水机组或换热器、循环水泵、补水泵等设备的入口管道上,应根据需要设置过滤器或除污器",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当空调设备冷凝水积水盘位于机组的正压段时,凝水盘的出水口宜设置水封",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当空调设备冷凝水积水盘位于负压段时,应设置水封,且水封高度应大于凝水盘处正压或负压值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "冷凝水干管坡度不宜小于0005,不应小于0003,且不允许有积水部位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "冷凝水水平干管始端应设置扫除口,冷凝水管道宜采用塑料管或热镀锌钢管",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "冷凝水排入污水系统时,应有空气隔断措施；冷凝水管不得与室内雨水系统直接连接",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当空调热水管道利用自然补偿不能满足要求时,应设置补偿器",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集中供暖的新建建筑和既有建筑节能改造必须设置热量计量装置,并具备室温调控功能",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "户式燃气炉应采用全封闭式燃烧、平衡式强制排烟型",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "集中供暖系统的施工图设计,必须对每个房间进行热负荷计算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "用于热量结算的热量计量装置必须采用热量表",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地下、半地下、地下室和半地下室锅炉房,严禁选用液化石油气或相对密度小于或等于075的气体燃料",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当锅炉房和其他建筑物相连或设置在其内部时,不应设置在人员密集场所和重要部门的上一层、下一层、贴邻位置以及主要通道、疏散口的两旁,",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当锅炉房和其他建筑物相连或设置在其内部时应设置在首层或地下室一层靠建筑物外墙部位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "燃油锅炉房室内油箱应采用闭式油箱;油箱上应装设直通室外的通气管,通气管上应设置阻火器和防雨设施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "燃油锅炉房的室内油箱上不应采用玻璃管式油位表",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "燃用液化石油气的锅炉间和有液化石油气管道穿越的室内地面处,严禁设有能通向室外的管沟(井)或地道等设施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "加压送风机和排烟风机的公称风量,在计算风压条件下不应小于计算所需风量的12倍",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "防排烟风道、事故通风风道及相关设备应采用抗震支吊架",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重力大于18kN的空调机组、风机等设备不宜采用吊装安装当必须采用吊装时,应避免设在人员活动和疏散通道位置的上方,但应设置抗震支吊架;",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "锅炉房、制冷机房、热交换站内的管道应有可靠的纵向抗震支撑",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "抗震设防烈度为6度及6度以上地区的建筑机电工程必须进行抗震设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根因业主书面指令或外部不可抗力导致的设计文件修改,可以进行签证的变更称为设计变更；因EPC总承包方(含联合体单位)内部原因导致的设计文件修改,业主不予确认相关费用的变更称为设计修改",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "成本管控的主要原则是在确保工程品质的前提下,强化限额设计管控及图纸成本管控理念,通过合理制定设计标准,明确目标成本,平衡品质效益与经济效益",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基于EPC价值工程理念,在追求合理利润、确保交付品质的基础上,完成合同约定内容的施工图控制上限成本为目标成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "超前一体化策划完成时间为双控,应在项目中标后20日内及设计开始前完成",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标人对已发出的招标文件进行修改或者澄清的,应当在招标文件要求的投标文件提交截止日期前15天,以书面形式通知投标人自招标文件发出之日起至投标文件提交之日止,最短不应少于20天",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中标通知书发出30天日内,招投标人应根据招标文件和投标文件签订书面合同,双方不能签订背离合同实质内容的其他协议",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "以暂估价形式包括在总承包范围内的工程、货物、服务属于依法必须进行招标的项目范围,且达到国家规定规模标准的,应当依法进行招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据国务院关于投资体质改革的决定,采用政府直接投资和资本金注入方式建设的项目,需要按照流程审核项目建议书、可行性研究报告和概算,其余项目采用核准制和备案制对于企业不使用政府投资的项目,也实行审批制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "设置在高层建筑内的一、二级耐火等级建筑内的营业厅、展览厅,当设置自动灭火系统和火灾自动报警系统并采用不燃或难燃装修材料时,每个防火分区的最大允许建筑面积不应大于4000m2()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据政府投资条例要求,政府采用直接投资方式、资本金注入方式投资的项目,项目单位应编制项目建议书、可行性研究报告和初步设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一类高层公共建筑和建筑高度大于32m的二类高层公共建筑,其疏散楼梯应采用封闭楼梯间()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "EP联动管理是基于价值工程理念,加强设计-采购-商务的体系联动管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "展览厅的疏散人数应根据展览厅的建筑面积和人员密度计算,展览厅内的人员密度宜按075人/m2确定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《城乡规划法》,城市规划区内建设工程在报请批准时,必须附有建设主管部门的选址意见书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "镶贴变形缝处的饰面板、饰面砖应按设计要求做出留缝宽度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑高度不大于50m的建筑,连续布置消防车登高操作场地确有困难时,可间隔布置,但间隔距离不宜大于25m()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建设工程的设计文件需做重大修改的,设计单位应报经施工图审查机构批准后,方可修改",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "一般阳角必须选用整砖,排砖从阳角开始,非整砖排到阴角部位()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "消防水泵房和消防控制室应采取防水淹的技术措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《招标投标法》,招标人和中标人应当自中标通知书发出之日起30日内,按照招标文件和中标人的投标文件订立书面合同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "常规情况下,座便的下水如需改变位置,最多可以移动10-15CM()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局部突出屋面的楼梯间、电梯机房、水箱间等辅助用房占屋顶平面面积不超过1/4者,可不计入建筑高()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设工程初步设计是根据可行性研究报告的要求进行具体实施方案的设计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "基层处理是板与墙基体是否粘结牢固的关键工序,毛化处理是方法之一()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "尽端式道路长度大于1200m时,应在尽端设置不小于150m×150m的回车场地()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑工程开工后,施工单位应当按照国家有关规定向工程所在地县级以上人民政府建设行政主管部门申请领取施工许可证",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《民用建筑工程室内环境污染控制规范》是由中华人民共和国建设部88、国家环境保护总局部门颁布的()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当基地自然坡度小于5%时,宜采用平坡式布置方式;当大于8%时,宜采用台阶式布置方式,台地连接处应设挡墙或护坡()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总概算=∑单项工程概算+工程建设其他费+预备费(基本预备费、涨价预备费)+建设期利息+铺底流动资金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "壁纸的检验应包括外观、基材、色差和施工等方面()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《南京市建筑物配建停车设施设置标准与准则》(2019版)规定,室內机动车停车库在两排柱子中间标划停放三个车位的,其净柱距应不小于78米;两排柱子中间标划停放两个车位的,其净柱距应不小于54米()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "如果某项目为超高层异型结构,施工图报审前必须要进行结构超限审查",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在地面施工时,地板安装的最大允许高差为3mm()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当凸窗窗台高度低于或等于045m时,其防护高度从窗台面起算不应低于09m;当凸窗窗台高度高于045m时,其防护高度从窗台面起算不应低于06m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主体工程与专项工程的造价分配,规避盲目做大土建,根据产品定位、客户需求、综合效益等进行分配,追求最大利润",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "瓷砖贴墙时,应根据瓷砖大小和墙面情况确定瓷砖的割裂位置,减少瓷砖的割裂()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "楼梯平台的宽度应大于或等于梯段宽度()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "专项分包招采前置,确保关键技术路线与主体设计同步开展工作,在主体设计阶段好做专项工程的预设计、预核算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "壁纸铺贴前,需要进行墙面处理,包括填补墙面缝隙、清理墙面、涂刷底漆等,以确保壁纸的牢固性和美观性()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑设计依据包括常年洪水位和地下水位()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "方案设计、初步设计与施工图阶段设计管理,接收过程图纸,由三级单位商务法务部和项目部进行图纸成本复核,并及时将管控需求反馈至项目设计管理部,经双方研判后,协调责任设计单位落实,即边画边算,边算边画,确保图纸成本不超目标成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地板施工完毕后,应立即开启空调或其他通风设备进行通风,以加速地板材料的干燥()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "按照有关规范,建筑内部装修材料按其使用部位和功能,分为6类()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "超前一体化策划会后15日内,明确目标成本,完成最终《超前一体化策划报告》及《目标成本控制表》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "天花板工程的验收标准主要包括天花板的平整度和造型尺寸两项指标()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中学校普通教室面积的大小,一般由学校决定()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目中标后7天内,由设计经理组织项目风险识别",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑装饰装修工程验收的基本规定包括验收的分类、验收标准和验收程序等,这种说法正确吗()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对于大多数民用建筑而言,日照是确定房屋正面间距的主要依据()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在建筑装饰装修工程中,墙面石材应当采用挂板固定的方式()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "按照国家有关规定,普通住宅的层高,以28米为宜()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在装修地面的过程中,如果发现地面有裂缝或凹陷,可以直接在上面铺设地板()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "某经营润滑油的商店设置在高层民用建筑的首层()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在室内装修中,石膏线条的施工顺序应当是先墙面再顶棚()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "某商店营业厅设置在三级耐火等级的地上二层()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "室内墙面的刮腻子工序是必需的,而且需要刮至少三遍()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "某商店营业厅设置在地下三层()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在建筑装饰装修工程中,墙体防水处理可以采用喷涂材料的方式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "某采用三级耐火等级的商店建筑,建筑层数为2层()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑装饰装修工程中,墙面装饰材料应当先进行湿润处理,然后再进行粘贴()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "5有爆炸危险的甲、乙类厂房宜独立设置,并宜采用敞开或半敞开式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑装饰装修工程中,一般情况下,混凝土楼板的浇筑应当分层进行,每一层的浇筑厚度应当小于5厘米()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "有爆炸性危险的甲乙类厂房的承重结构宜采用钢筋混凝土或钢框架,不宜采用排架结构和砖墙结构()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在进行石膏线条安装时,为了防止收缩开裂,应当将石膏线条进行预处理,并在安装前进行适当的浸泡()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "有爆炸危险性的甲类厂房与高层民用建筑之间的防火间距不应小于50m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在墙面瓷砖铺贴中,使用挤缝器进行缝隙填充可以避免缝隙产生空鼓现象()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "有爆炸危险性的甲类厂房与散发火花地点的防火间距不应小于30m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在进行地面石材铺贴时,需要采用多种方法来防止石材翘曲变形,如适当控制粘结剂的配比和施工温度等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑高度为80m的住宅楼的耐火等级不应低于二级()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在进行室内地面的平整度验收时,如果测量结果的偏差在5毫米以内,则可以认为该地面达到了验收标准()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑高度大于100m的民用建筑,其楼板的耐火极限不应低于150h()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在进行建筑物外墙隔热施工时,隔热层的厚度越大,则隔热效果就越好()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "替代防火墙的防火卷帘应符合防火墙耐火极限的判定条件,耐火极限不小于30h()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在进行室内采光面积计算时,应该将门窗面积也纳入考虑范围()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "防火卷帘应具有火灾时考自重自动关闭的功能()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在进行建筑物外墙涂料工程时,应该选择相同材质的涂料进行配合()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "除中庭外,当防火分隔部位的宽度为20m时,防火卷帘的宽度可以为7m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在进行室内地面装修时,应该将地面进行平整度、硬度、耐磨性等方面的测试,并对测试结果进行记录()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "除中庭外,当防火分隔部位的宽度为40m时,防火卷帘的宽度可以为25m()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "卫生间、阳台等地面找坡度,地面面层材料向地漏处的排水坡度为01%~02%,地漏处标高应根据门口至地漏的坡度确定()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "风玫瑰图表明了1个地区1年中,不同风向出现的频率,甚至包括夏季主导风向()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "吊顶转交处副龙安装完成后,在转角处裁割L型05mm白铁皮加固()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "正置式保温是将防水层设置在保温层与结构层之间的做法,使保温层不受温度变化的影响",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地砖铺贴前基层应彻底清扫干净,铺砂浆前先浇水湿润,采用1:2水泥砂浆(中、粗沙)扫浆均匀后,随即铺设结合层()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "安装石膏板的自攻螺丝与板边或板端的距离不小于15mm,也不大于18mm,从板中间向边缘依次安装自攻螺丝()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢架隔墙的施工,如是卫生间、厨房、阳台等潮湿区域,应做300mm高的C20混凝土导墙()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢化玻璃栏板安装时,建议玻璃卡槽采用成品U型钢板制作,高度不小于120mm卡槽上口不要用水泥砂浆灌缝,可用石膏灌实()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "木地板四周踢脚板下留10~15mm的伸缩缝,或预埋一同等宽度的V行弹簧卡件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "150m及以上的超高层公共建筑的消防负荷应为一级负荷中的特别重要负荷()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对于不允许电源瞬时中断的负荷,应设置柴油发电机组供电()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一级负荷应由双重电源供电,当一个电源发生故障时,另一个电源不应同时受到损坏()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "互为备用工作制的生活水泵、排污泵为一级或二级负荷时,可由配对使用的两台变压器低压侧各引一路电源分别为工作泵和备用泵供电",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当供电电压为35kV且负荷集中、配电线路电压损失符合要求、无其他高压用电设备、经济性合理时,不可直接降至低压配电电压",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "大型城市综合体建筑的供配电系统宜按照不同业态设置相对独立的供配电系统",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "方案设计阶段可采用单位指标法；初步设计及施工图设计阶段,宜釆用需要系数法",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当单相负荷的总计算容量小于计算范围内三相对称负荷总计算容量的20%时,可全部按三相对称负荷计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "35kV及以下无功补偿宜在配电变压器低压侧集中补偿,补偿基本无功功率的电容器组,宜在变电所内集中设置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "变电所设计应根据工程特点、负荷性质、用电容量、供电条件、节约电能、安装、运行维护要求等因素,合理确定设计方案,可不必考虑未来发展的可能性",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "配电变压器的长期工作负载率不宜大于85%；当有一级和二级负荷时,宜装设两台及以上变压器,当一台变压器停运时,其余变压器容量应满足一级和二级负荷用电要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "变压器低压侧电压为04kV时,单台变压器容量不宜大于2000kVA,当仅有一台时,不宜大于1250kVA；预装式变电站变压器容量采用干式变压器时不宜大于800kVA,采用油浸式变压器时不宜大于630kVA",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当UPS输出端的隔离变压器为TN-S、TT接地形式时,中性点应接地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "供避难场所使用的用电设备,可不从变电所采用放射式专用线路配电",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "三相四线电路中,相导体截面积不大于16mm2(铜)或25mm2(铝/铝合金)的电线电缆,中性导体至少应和相导体具有相同截面积",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "TN-C-S系统中的保护接地中性导体从某点分为中性导体和保护接地导体后,不得再将这些导体互相连接",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "低压配电线路采用的上、下级保护电器,其动作宜具有选择性,各级保护电器之间应能协调配合；对于非重要负荷的保护电器,可采用无选择性切断",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于突然断电比过负荷造成损失更大的线路,仍应设置过负荷保护切断电源",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "低压配电系统的电击防护应包括基本保护(直接接触防护)、故障保护(间接接触防护)和特殊情况下采用的附加保护",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "明敷于潮湿场所或埋于素土内的金属导管,应釆用管壁厚度不小于20mm的钢导管,并釆取防腐措施明敷或暗敷于干燥场所的金属导管宜采用管壁厚度不小于12mm的镀锌钢导管",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "可弯曲金属导管布线,其金属外壳应可不靠接地",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "槽盒内电缆的总截面积(包括外护层)不应超过槽盒内截面积的40%,且电缆根数不宜超过30根",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "母线槽水平敷设时,底边至地面的距离不应小于22m除敷设在电气专用房间外,垂直敷设时,距地面18m以下部分应采取防止机械损伤措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "线槽水平敷设的支持点间距不宜大于25m垂直敷设时,应在通过楼板处采用专用附件支承并以支架沿墙支持,支持点间距不宜大于25m",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "发包人在招标工程量清单中给定暂估价的材料、工程设备不属于依法必须招标的,应由承包人按照合同约定采购,经发包人确认单价后取代暂估价,调整合同价款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竖井内高压、低压和应急电源的电气线路之间应保持不小于03m的距离或采取隔离措施,但高压线路可不设有明显标志",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "电击防护应采取基本防护和故障防护组合或基本防护和故障防护兼有的保护措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "照明母线槽可吊装于吊顶内部,也可侧装于建筑物或构筑物墙体表面,固定点间距应均匀,固定点距离不宜大于3m",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "交流电动机的主回路应由隔离电器、短路保护电器、控制电器、过负荷保护电器、附加保护器件和线缆等组成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "电梯井道内应设置照明,且照度不应小于501x,应在距井道最高点和最低点05m以内各装一盏灯,中间每隔10m的距离应装设一盏灯,并应分别在机房和底坑设置控制开关",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "电梯机房、井道和轿厢中电气装置的故障防护,与建筑物的用电设备采用同一接地系统时,可不另设接地网",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "已标价工程量清单中没有适用的也没有类似于变更工程项目的,应由承包人根据变更工程资料、计量规则和计价办法、工程造价管理机构发布的信息价格和承包人报价浮动率提出变更工程项目的单价,并应报发包人确认后调整",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "自动旋转门、电动门、电动卷帘门、电动伸缩门应由就近的任意配电回路供电",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "清单计价规范规定工程量偏差超过15%时可进行调整,当工程量增加15%以上时,增加部分的工程量的综合单价应予提高,当工程量减少15%以上时,减少后剩余部分工程量的综合单价应予降低",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "交流充电桩电源进线宜选用燃烧性能不低于B2级、产烟毒性为t2级、燃烧滴落物/微粒等级为d2级的电线、电缆",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "因承包人原因造成的超出合同工程范围施工或返工的工程量,发包人不予计量",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于照明灯具选择应根据使用场所合理地选择照明光源的光效、显色性、寿命、启动点燃和再点燃时间等光电特性指标和环境条件对光源光电参数的影响因素",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "灯具的结构和材质应便于维护、清洁和更换光源灯具表面以及灯用附件等高温部位靠近可燃物时,应采取隔热、散热等防火保护措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当承包人费用索赔与工期索赔要求相关联时,发包人可以只作出费用赔偿决定,而不需作工期延期决定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "年预计雷击次数大于025的住宅、办公楼等一般民用建筑物应划为第三类防雷建筑物",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "要在独立接闪杆、接闪网、引下线和接闪线支柱上悬挂电话线、广播线和低压架空线等时,只要不影响防雷系统即可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "竣工结算应在竣工验收报告批准之后进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "层顶上的永久性金属物作为接闪器时,其所有部件之间均应连成电气通路,对于钢管、钢罐的壁厚不应小于25mm,当钢管、钢罐一旦被雷击穿,其介质对周围环境造成危险时,其壁厚不得小于4mm",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "承包人对安全文明施工费应专款专用,并在财务账目中应单独列项备查,不得挪作他用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "防雷引下线在易受机械损坏的地方,地面上17m至地面下03m的外露引下线应加保护设施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "进度款的支付比例按照合同约定,按期中结算价款总额计,不低于70%,不高于90%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "民用建筑宜优先利用钢筋混凝土基础中的钢筋作为防雷接地网当需要增设人工接地体时,若敷设于土壤中的接地体连接到混凝土基础内钢筋或钢材,则土壤中的接地体可采用铝导体",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程完工后,发承包双方必须在发包方确定的时间内办理工程竣工结算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "利用建筑物构件内钢筋作为防雷装置时,构件内有箍筋连接的钢筋或成网状的钢筋,其箍筋与钢筋、钢筋与钢筋应采用土建施工的绑扎法、螺栓、对焊或搭焊连接单根钢筋、圆钢或外引预埋连接板、线与构件内钢筋的连接应焊接或采用螺栓紧固的卡夹器连接构件之间必须连接成电气通路",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合同工程竣工结算核对完成,发承包双方签字确认后,发包方可以要求承包人与另一个或多个工程造价咨询人重复核对竣工结算()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "用于输送可燃液体或气体的金属管道,供暖管道、供水、中水、排水等金属管道,可用作接地极",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在保修期内的工程缺陷都应由承包人负责修复且承担查验和修复的费用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "屏蔽接地可分为静电屏蔽体接地、电磁屏蔽体接地、磁屏蔽体接地三种系统,三种系统的接地电阻值不宜大于10Ω",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "低压配电系统的接地形式可分为TN、TT、IT三种类型,其中TN系统又可分为TN-C、TN-S与TN-C-S三种形式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在工程合同价款纠纷处理中需作工程造价司法鉴定的,应委托有管辖权的人民法院进行鉴定()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "除另有规定外,智能化系统接地宜采用共用接地装置,接地电阻不应大于4Ω",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程工程量清单计价规范》(GB50500—2013),发包人应在收到支付款申请的7d内进行核实,向承包人发出预付款支付证书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "智能化系统设备外壳应设置两根不同长度的等电位联结线,其长度各为不同于1/4干扰波长的倍数,并不宜大于05m",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程工程量清单计价规范》(GB50500—2013),发包人应在工程开工后的28d内预付不低于当年施工进度计划的安全文明施工费总额的70％,其余部分与进度款同期支付",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于火灾自动报警系统中的消防联动控制设备的直流电源电压,应采用36V安全电压",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程工程量清单计价规范》(GB50500—2013),工程量必须以承包人完成合同工程应予计量的工程量确定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "民用建筑内的消防水泵不宜设置自动巡检装置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "消防用电设备配电系统的分支干线宜按防火分区划分,分支线路不宜跨越防火分区",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "消防水泵、消防电梯、消防控制室等的两个供电回路,应由所在楼层或防火分区的消防配电箱放射式供电",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公共建筑物顶层,除消防电梯外的其他消防设备,可采用一组消防双电源供电由末端配电箱引至设备控制箱,应采用放射式供电",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "进度款的支付比例按照合同约定,按期中结算价款总额计,不低于60%,不高于80%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在人员密集场所疏散通道采用的火灾自动报警系统的报警总线,应选择燃烧性能B2级的耐火铜芯电线、电缆",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "发包人应在签发最终结清支付证书后的14天内,按照最终结清支付证书列明的金额向承包人支付最终结清款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑高度超过100m的公共建筑,非消防负荷线缆与通信电缆的选择应选择燃烧性能B1级及以上、产烟毒性为t0级、燃烧滴落物/微粒等级为d0级的电线和电缆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发承包双方在收到总监理工程师或造价工程师的暂定结果通知之后的14天内未对暂定结果予以确认也未提出不同意见的,应视为发承包双方已认可该暂定结果",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "长期有人滞留的地下建筑,非消防负荷线缆与通信电缆的选择应选择烟气毒性为t0级、燃烧滴落物/微粒等级为d0级的电线和电缆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在工程合同价款纠纷案件处理中,需作工程造价司法鉴定的,应委托具有相应资质的工程造价咨询人进行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "保修责任期终止后,承包人按照合同约定应承担的质量保修责任和应履行的质量保修义务即被免除",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "《示范文本》为非强制性使用文本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合同当事人另行签订的与原合同条款不一致的应以补充协议条款为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "承包人：是指与发包人签订合同协议书的当事人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "收到发包人提供的的图之后,承包人发现差错或缺陷的,应及时通知监理,并对其承担责任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "赢得值具有反映进度和费用的双重特性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未经发包人书面同意,承包人不得为了合同以外的目的而复制、使用发包人提供给承包人的图纸、发包人为实施工程自行编制或委托编制的技术规范以及反映发包人要求的或其他类似性质的文件或将之提供给任何第三方",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发包人应当在移交施工现场前向承包人提供地质勘察资料,并对所提供资料的真实性、准确性和完整性负责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "为了工程进度发包人可以要求承包人违章作业、冒险施工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程总承包项目合同管理应包括工程总承包合同和分包合同管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "荷载分项系数是一个小于1的数值()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "结构各构件之间的连接,构件节点的破坏,不应先于其连接的构件；预埋件的锚固破坏,不应先于连接件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "高度为65m的框架结构,计算风荷载时,风荷载取值按基本风压来计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "结构体系应避免因部分结构或构件破坏而导致整个结构丧失抗震能力或对重力荷载的承载能力()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "框架梁的纵向钢筋可以与箍筋、拉筋及预埋件等焊接()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在不同媒介发布的同一招标项目的资格预审公告或者招标公告的内容可以不一致",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "地震作用由地震动引起的结构动态作用,包括水平地震作用和竖向地震作用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "平面不规则的类型包括扭转不规则、楼板凹凸不规则和楼板局部不连续()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "房屋高度是指自首层室内地面至房屋主要屋面的高度,不包括突出屋面的电梯机房、水箱、构架等高度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "框架-核心筒结构的周边柱间必须设置框架梁()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中标人可向他人整体转让中标项目,但不得将中标项目肢解后分别向他人转让",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "深梁是指跨高比小于2的简支单跨梁或跨高比小于25的多跨连续梁()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对抗震设防烈度不低于7度的建筑与市政工程,当地面下20m范围内存在饱和砂土和饱和粉土时,宜进行液化判别()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采购人能够自行建设的项目可以不进行招标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "大跨度框架是指跨度不小于18m的框架()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "结构构件中钢筋外边缘至构件表面范围,用于保护钢筋的混凝土,简称保护层()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "抗震设防烈度6度及以上地区的各类新建、扩建、改建建筑与市政工程必须进行抗震设防()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部人员在项目预留的风险金尚未具备返还条件,开工3个月即调离该项目部的,预留风险金退回本人,不再承担项目盈亏风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "抗震结构体系对结构材料(包含专用的结构设备)、施工工艺的特别要求,可不用在设计文件上注明()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "责任成本是指以项目实现履约为前提,依据项目标准成本,经过二级单位和项目部协商一致确定的由项目部控制的成本总额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于框架结构房屋,应考虑填充墙、围护墙和楼梯构件的刚度影响,避免不合理设置而导致主体结构的破坏()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分包签证单由项目商务部统一管理,发生签证事项时由专业工程师向商务部门领取并负责办理签证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑的非结构构件及附属机电设备、其自身及与结构主体的连接,可以不进行抗震设防()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中途解除合同离职的人员,将没收风险金,不再承担项目盈亏风险与兑现奖罚",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "木结构房屋的建筑结构平面布置应简单规则,不应有平面凹凸或拐角()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在分包招标过程中,二级单位不得自行设定分包招标管理限额和权限范围",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "地下室顶板施工活荷载标准值不应小于50KN/m2()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程计量是指发承包双方根据合同约定,对承包人完成合同工程的数量进行的计量和确认",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "将动力荷载简化为静力作用施加于楼面和梁时,应乘以动力系数,动力系数不应小于105()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "承包人未在规定的时间内提交竣工结算文件,经发包人促后7天内仍未提交或没有明确答复,发包人有权根据已有资料编制竣工结算文件,作为办理竣工结算和支付结算款的依据,承包人应予以认可",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预制构件节点及接缝处后浇混凝土强度等级不应低于预制构件的混凝土强度等级()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发包人在收到承包人竣工结算文件后的7天内,不审核竣工结算或未提出审核意见的,视为承包人提交的竣工结算文件已被发包人认可,竣工结算办理完毕",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预埋件和连接件等外露金属件应按不同环境类别进行封闭或防腐、防锈、防火处理,并应符合耐久性要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因承包人违约解除合同的,发包人应在合同解除后28天内核实合同解除时承包人已完成的全部工程款以及已运至现场的材料和工程设备货款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "外挂墙板宜采用双层双向配筋,竖向和水平钢筋的配筋率均不应小于010%()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "总监理工程师或造价工程师在收到发包人或承包人就合同价款争议提交的文件后14天之内应将暂定结果通知发包人和承包人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "桩基承台施工顺序宜先深后浅()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发承包双方在收到总监理工程师或造价工程师的暂定结果通知之后的14天内,未对暂定结果予以确认也未提出不同意见的,视为发承包双方已认可该暂定结果",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "验收检测时,宜先进行桩身完整性检测,后进行承载力检测()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对调解人的调解决定承、发包方存在异议时,应在收到调解决定后14天内,向另一方发出异议通知,并说明争议的事项和理由",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司内部贷款方式包括现金、银行承兑汇票、商业汇票、保理、信用证等,内部贷款的发放贯彻诚实守信,有偿使用的原则",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "房产税出租的税率为租金收入的12%缴纳",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "应付票据：是指我方作为债务方,基于真实贸易背景向债权方开立的用于结算交易款项的商业汇票",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对禁止局内部单位间的工程款采用开立股份外部金融机构票据的方式结算；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "发票的保管中,抵扣发票收到后装订成册,保管期限为30年",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "开立信用证必须用于生产经营,禁止用于非生产性的支出；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "支付投标保证金超过500万的由局总部审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "收到的信用证进行议付,视同带息负债管理,在核算中应反映为带息负债",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "网银管理中,禁止单人操作资金支付的全过程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "严禁办理线下供应链金融业务；严禁以供应链金融的名义,为供应商融资变相提供担保；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "竣工类项目分包未结算也可以付款",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "供应链资产证券化由局金融业务部统一管理和审批原则上公司无权开展资产证券化业务公司办理的供应链资产证券化在局的统一安排下配合办理；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位按季盘点抵债资产,按季度上报抵债资产统计表和以物抵债资产分析报告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "供应链资产证券化的未到期业务余额占用各单位年度融资预算；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "所有增值税发票都需在财务一体化系统中查验,超过1000元的非增值税发票不需提供发票查验记录",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "供应链资产证券化产品到期,由发起时选择的实际支付单位发起一体化供应链资产证券化到期付款申请,参照执行还本付息流程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我司员工A如果每个月的工资不变,那么该员工每个月的个税都是固定不变的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "原则上,禁止采用有追索权应收账款保理方式收取工程款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "流动负债=资产总额-所有者权益",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "无追保理业务应考虑全部风险,不得增信、不能兜底,不承诺回购、不再行回表",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "处置固定资产收到的现金属于投资活动收到的现金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "办理分供商资金支付时,无论何种情况,收款账户名称和合同名称必须一致,严禁一切分供商付款委托支付",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "任何单位和个人不得转借、转让、代开发票",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位出纳应按照逐日逐笔登记银行账簿记录,并定期编制银行余额调节表,经财务资金部经理签字后留存备查",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司《CSCEC83-FTCR-2020财务资金降杠杆管理手册》,职工薪酬必须要经过公司审计部审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "现金包括货币资金、银行存款和其他货币资金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "非现金收款是指项目用现金以外的保理、票据等方式收取工程款,非现金收款不包括以物抵债",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分公司财务资金部是项目资金策划工作的牵头部门",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "出纳可以保管不同银行账户的财务专用章和个人名章",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "关于三项费用的管控比例,办公费为核定基数*03%,差旅费为核定基数*02%,业务招待费为核定基数*01%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "新生报到差旅费,在一体化中提交差旅费报销流程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为谨防信用风险,二级单位反向保理到期未还款的,将纳入信用考核,并进行扣分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司总部库存现金限额10万元,各分公司8万元",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位应在反向保理到期的前一个工作日归还保理款项,未按要求归还的执行信用扣分处理,情形严重的将酌情通报",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "无形资产的管理主责部门是工程部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "保险利益必须是法律上承认的利益,即必须是得到法律认可和保护的合法利益,法律不予认可或不予保护的利益不构成保险利益",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "银行预留印鉴中的财务印章、个人名章由不同人员监督管理,财务印章由资金部门负责人或被授权人管理,个人名章由本人或被授权人管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "以物抵债事项,不超过200万元的,由分公司经理、总会计师、总经济师审批决定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "押金需按照合同约定回收时点15天内收回,但是需要持续提供服务的,可以老押金替代新押金",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "其他应收款管理中,应收保证金、应收代垫款、押金与备用金因支付对象不同应采用不同的减值比例计提减值准备",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目经理是项目质保金回收的第一责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据股份会计制度要求,接受捐赠的存货应按照实际成本和同类或类似产品的市场价值孰低的价值确认初始成本",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "我公司存货盘点采用的是永续盘存制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据公司批复的固定资产处置申请审批后,分公司将固定资产原值及折旧通过通过固定资产清理科目归集,待固定资产处置完成后,直接通过资产处置损益进行财务账面处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目废旧物资处理必须先收定金再装车计量",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部财务人员应定期与分供商对账,对账过程中可先向对方提供付款及欠款信息,由对方核对后出具对账单,并签字盖章",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "投资者投入固定资产的成本应当按照投资合同或协议约定的价值加上应支付的相关税费确定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工外地出差住宿费于旺季时可比规定标准上浮25%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司账户销户后印章应当封存,不得再启用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对外出售、转让、投资、置换、抵债、租赁的固定资产,必须聘请中介评估机构进行评估并出具评估报告,评估价格作为价格参考,处置价格应以经核准或备案的评估结果为基础确定",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预算管理中,对于发生的性质重要的金额重大的反常的经济现象要发出预警",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部财务人员应定期(一年至少一次)与分供商对账对账过程中应财务人员可以先向对账单位提供付款清单",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "银行余额调节表的编制人员为出纳",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目会计是应收账款回收的第一责任人,项目财务人员及时做好收款及核算工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目经理是应收账款回收的第一责任人,项目财务人员及时做好收款及核算工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "随同高级别领导出差,随行人员住宿标准可以按照级别高的领导标准执行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目成本员是应收账款回收的第一责任人,项目经理及时配合财务人员进行收款工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "质量保证经只能从应收账款中按照合同比例预扣除不得另行交纳任何质量保证金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "业务招待费用是指为满足经营管理需要,用于业务承揽洽谈、对外联络、公关交往、来宾招待、处理突发事件等工作中必须发生的接待、用餐和礼节性纪念品等费用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "应收账款单项损失≤100万元需要局审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "根据费用报销管理要求,取得票据必须加盖发票专用章才可以予以核销",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "我司属于高新技术企业所有按照法规见面政策,现在征收率为10%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "财务报告审批签字过程中领导不在,可以授权委托让他人给予代签字",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "个人所得税的基本费用扣除是72000每年",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在收取银行承兑汇票时,考虑分供商的资金成本和难处,我司应主动承担贴现利息损失",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "资产证券化是指以基础资产未来所产生的现金流为偿付支持,通过结构化设计进行信用增级,在此基础上发型资产支持证券的过程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在一体化系统中,手工录入未开票收入登记后,不需要生成凭证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "财务资金部负责核定内部债权债务挂账金额及核算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "商务管理部负责协调与核对内部交易形成的商务结算情况",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "补贴以发票核销替代,收到购置办公用品增值税专用发票,因是补贴性质,所以不需要价税分离,也不需要发票认证",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合约法务部负责协调解决公司内部单位之间因法律合约因素形成的债权债务纠纷",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "审计部负责对重大争议内部债权债务清理进行专项审计",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "金融资产包括应收账款、其他应收款、合同资产",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "利润中心关账,财务资金部需推进资产负债清理,审核利润中心关账",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑股份有限公司会计制度》规定,企业应当按照下表所规定的使用年限和10％的预计净残值率,采用年限平均法(直线法)计提折旧",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "利润中心关账,二级单位总经理负责利润中心关账的审批,确保关账项目按计划完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "利润中心关账,公司总部财务资金部负责关账目标的制定及责任考核的公平公正",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水泥和商品混凝土的税率均为13%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目关账只要锁定债权债务即可,无需填制项目《关账会签表》和关账报告",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合约法务部对款项回收的法律风险进行评估,配合相关部门和项目部解决款项回收中的法律问题",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "实行车补政策后,享受车补人员提供的修理费专用发票可以进行进项税抵扣",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目部按照业务岗位职责和项目目标责任书,制定催收防欠管控措施,落实责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "超过合同收款约定时间30天未能收取工程款项的,二级单位经理应及时组织相关部门和人员进行协调,向业主发催款函、与业主进行谈判,必要时采取律师函、索赔、缓建、停工等措施进行应对",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财务资金部依据相关法规及制度,协调、督促、推动低效资产变现或处置工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "降杆杆领导小组是内部债权债务管理的决策机构,对内部债权债务清理事项进行决策",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财务资金部负责牵头组织公司内部债权债务日常管理及清理工作,向降杠杆工作领导小组递交清理方案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "商务管理部应完成关账项目的项目考核责任,出具两制考核报告,完成风险预留金考核等事项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工程管理部负责关账项目后期维护成本,保修金计提比例及有关计提手续",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理是利润中心关账第一责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "低效经营机构清单及销项治理资料由企划部确认",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "随同高级别领导出差,随行人员交通费标准可以按照级别高的领导标准执行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对已竣工已结算项目,列入催收清欠责任状的项目奖罚：按实际收回数的04‰计提奖励,按应收未收回的02‰处罚",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当需要采取工程质量约谈时,约谈方式不要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "接名片时应以双手承接,若与领导一并接待或拜访客户时,则应在领导与客户交换名片同步与客户交换名片",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "提任项目副经理岗位,须具备不少于2年的技术类岗位经历()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局三公司员工守则规定,员工在本单位工作满半年的,与配偶或父母不同城居住,可以享受探亲假待遇",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各类保证金由公司总部统一对外支付,特殊情况下,分公司可以自行支付",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "非现金收款是指项目用现金以外的保理、票据、以物抵债等方式收取工程款",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业购置的单位价值超过5000元,使用寿命超过一年的资产应纳入固定资产核算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "我单位固定资产折旧采用年限平均法,预计净残值率为5%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司某项目2019年10月,经项目商务分析,确定当月预计总成本预计总收入,此时应在当月计提合同预计损失准备,计入存货跌价准备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业在日常经营活动中发生的仓库保管人员的工资应当计入存货成本()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "潜亏项目清单及销项治理资料由商务管理部确认",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "存货的加工成本是指加工过程中实际发生的人工成本等,不包含分配的制造费用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "降杠杆防风险工作简报,是总结公司降杠杆防风险月度工作,分析主要指标完成情况,明确下一阶段工作计划的重要载体",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业接受投资者投入的商品应该按照该商品在投出方的账面价值入账()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "降杠杆月度例会主要由财务资金部组织",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "确定外购的存货实际成本时,购买价款是指企业购入材料或商品的发票账单上列明的价款,但不包括按规定可以抵扣的增值税进项税额()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "特殊疑难事项可以采取一事一议、一事一处理的方式与二级单位签订单项责任状,按责任状约定进行奖惩",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "固定资产采用双倍余额递减法计提折旧时,不管其有无净残值,均不予以考虑()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "应税营业账簿的计税依据,为账簿记载的实收资本(股本)金额()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "固定资产处于处置状态或者预期通过使用或处置不能产生经济利益的,应予终止确认()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业10月份预缴申报第3季度(按季预缴)或9月份(按月预缴)企业所得税时,可以自主选择就前三季度研发费用享受加计扣除优惠政策对10月份预缴申报期未选择享受优惠的,可以在企业所得税汇算清缴时统一享受()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "固定资产盘盈时,应该作为前期差错,通过以前年度损益调整科目处理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般纳税人在开具专用发票当月,发生销货退回、开票有误等情形,无需收回发票联、抵扣联,可以直接作废发票()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业自行建造固定资产,已达到预定可使用状态但在年度内尚未办理竣工决算手续时,应按估计价值暂估入账,确认固定资产成本,并自次月起开始计提折旧待办理了竣工决算手续后再调整固定资产成本和折旧()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "自2018年5月1日起,对按万分之五税率贴花的资金账簿减半征收印花税,对按件贴花五元的其他账簿免征印花税()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于已经计提减值准备的固定资产,在以后期间价值恢复时,可以转回原已计提的减值准备金额()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "增值税一般纳税人取得2017年1月1日及以后开具的增值税专用发票、海关进口增值税专用缴款书、机动车销售统一发票、收费公路通行费增值税电子普通发票,取消认证确认、稽核比对、申报抵扣的期限()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业购建的安全生产设备、环保设备不能为企业带来直接经济利益,因此企业应将相关支出计入当期损益,不确认固定资产()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "纳税人只能享受一次首套住房贷款的利息扣除()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "已达到预定可使用状态但尚未办理竣工决算手续的固定资产,应按估计价值确定其成本,并计提折旧,办理竣工决算手续后,再按照实际成本调整原来的暂估价值,但是对已经计提的累计折旧金额不需调整()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "A公司于2020年6月成立,9月1日登记为增值税一般纳税人2021年5月,A公司办理了2020年度的汇算清缴申报,结果确定是小型微利企业A公司于2022年4月征期申报2022年1-3月的六税两费时,可以享受减免优惠()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业固定资产的预计报废清理费用,可作为弃置费用,按其现值计入固定资产成本,并确认为预计负债()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "增值税纳税人2011年12月1日以后缴纳的技术维护费(不含补缴的2011年11月30日以前的技术维护费),可凭技术维护服务单位开具的技术维护费发票,在增值税应纳税额中全额抵减()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业接受投资者投入的一项固定资产,按照投资合同或者协议约定的价值入账()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "自2022年4月1日至2022年12月31日,增值税小规模纳税人适用3%征收率减按1%执行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "自行建造固定资产达到预定可使用状态前,该项目的工程物资盘盈应当计入当期营业外收入()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业应在当年度企业所得税法规定的汇算清缴期结束前取得税前扣除凭证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "使用寿命不确定的无形资产,应在发生减值迹象时进行减值测试()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "财务费用不需要开具发票",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业已计提减值准备的无形资产的价值如果又得以恢复,则应在已计提减值准备的范围内将计提的减值损失予以全部或部分转回()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "一般纳税人转售自来水适用3%税率",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业将土地使用权用于自行开发建造自用厂房的,该土地使用权与厂房应分别进行摊销和提取折旧()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般纳税人销售自产机器设备的同时提供安装服务,应分别核算机器设备和安装服务的销售额,安装服务可以按照甲供工程选择适用简易计税方法计税",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "无法区分研究阶段支出和开发阶段支出,应当将其所发生的研发支出全部资本化,计入无形资产成本()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "纳税人对安装运行后的机器设备提供的维护保养服务,按照其他现代服务缴纳增值税",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "外购无形资产的成本,包括购买价款、相关税费以及直接归属于使该项资产达到预定用途所发生的其他支出()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位所管理银行账户的资金结算,应实行多级审核,至少应设制单、初审终审三级程序",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于非同一控制下的控股合并,合并方所支付合并对价的公允价值与账面价值的差额均应计入营业外收支()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《银行存款余额调节表》后应附银行对账单和公司账页,经出纳复核,财务资金管理部经理审核签字,交会计档案管理人员统一装订、归档保管",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "除同一控制下的企业合并之外,以发行权益性证券方式取得的长期股权投资,其初始投资成本为所发行权益性证券的公允价值扣除为发行权益性证券所支付的手续费、佣金后的净额()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "未使用的支票应在10日内归还银行；已经使用的支票应在10日内按财务报销流程核销支票,出纳将支票存根联交会计进行账务处理；若申请人在规定期限内未到银行出纳处核销支票,做个人借款处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评估投资方对被投资单位是否具有重大影响时,应当考虑潜在表决权的影响,但在确定应享有的被投资单位实现的净损益、其他综合收益和其他所有者权益变动的份额时,不应考虑潜在表决权所对应的权益份额()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "保函可以不明确到期日,可以无固定截止日期",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "非同一控制下的控股合并,以享有被投资方可辨认净资产公允价值的份额作为长期股权投资的入账成本()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各单位通过现金池归集到中建财务公司的资金算上存资金",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "同一控制下的控股合并中,投资方对于投资后分得的现金股利,应调整冲减长期股权投资的成本()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "保函须有明确的到期日,避免敞口",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于同一控制下的控股合并,合并方应以所取得的对方相对于最终控制方而言的账面净资产份额作为长期股权投资成本()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "原则上,保函允许转让",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "权益法下,长期股权投资的初始投资成本小于投资时应享有被投资单位可辨认净资产公允价值份额的差额,应计入资本公积()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预付款保函,预付款抵扣完毕时及时注销",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "长期股权投资采用权益法核算的,被投资单位发行可分离交易的可转债时,投资单位应调整长期股权投资的账面价值,同时确认资本公积()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "指定担保公司开立的保函,原则上保函格式应是不可转让的,非敞口保函；如遇特殊情况需要开立的,一事一议",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业对被投资单位不具有控制、共同控制或重大影响的权益性投资,均属于长期股权投资,应通过成本法核算()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "我方为联合体牵头人,如需以联合体牵头人名义开立全额保函,则应先由外部单位按照股权比例向我方提供相应反担保(包括提供银行保函、反担保承诺函、反担保合同等书面保证等);如我方为联合体成员方或我方股权比例较小的项目,原则上不得超过我方股权比例",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采用权益法核算,被投资企业发生盈亏,投资企业应于会计期末按持股比例相应调整长期股权投资账面价值,同时借记或贷记投资收益账户()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "严禁代系统外单位或个人办理现金收付业务和转账套现",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "处置长期股权投资时,不同时结转已计提的长期股权投资减值准备,待期末一并调整()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "8周岁以上的未成年人和不能完全辨认自己行为的成年人,是无民事行为能力人()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业因处置部分股权导致对被投资单位丧失控制权,且对剩余股权投资不具有共同控制和重大影响的,应视同处置全部股权投资处理,并将处置价款与剩余股权投资的公允价值之和与丧失控制权前股权投资的账面价值之间的差额确认为当期损益()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对国家税务总局的具体行政行为不服的,向国务院申请行政复议()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "因追加投资导致金融资产转换为非同一控制下的企业合并(不构成一揽子交易),原确认的其他综合收益转换日需要全部转入当期投资收益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "设立股份有限公司,应当有2人以上200人以下为发起人,其中,须有半数以上的发起人在中国境内有住所()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "同一控制下,因追加投资导致金融资产转换为成本法核算的长期股权投资(不构成一揽子交易),原计入其他综合收益的累计公允价值变动应当全部转入当期投资收益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "有限责任公司只能以发起方式设立,公司资本只能由发起人认缴,不允许向社会募集,而股份有限公司既可以发起设立,也可以募集设立()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "长期股权投资成本法与权益法相互转换时,均应进行追溯调整()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合伙人发生与合伙企业无关的债务,相关债权人可以代位行使该合伙人在合伙企业中的权利()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "自行建造投资性房地产期间,发生的土地开发费、建筑成本、安装成本等都计入投资性房地产成本()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "有限合伙人转变为普通合伙人的,对其作为有限合伙人有限合伙企业发生的债务,以其认缴的出资额为限承担责任()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "已采用公允价值模式计量的投资性房地产,不得从公允价值模式转为成本模式()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当然退伙以退伙事由实际发生之日为退伙生效日()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "投资性房地产发生的日常维护支出,应于发生时计入其他业务成本科目()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "普通合伙企业,全体合伙人可以在合伙协议中约定普通合伙人可以从事与本企业相竞争的业务()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "成本模式和公允价值模式计量下的投资性房地产,均以实际成本进行初始计量()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "人民法院强制执行有限合伙人的财产份额时,应取得全体合伙人的一致同意()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业为了提高投资性房地产的使用效能,通过装修而改善室内装潢,改扩建支出一律费用化处理()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于合伙协议未约定或约定不明确的事项,实行合伙人一人一票并经全体合伙人半数以上通过的表决办法()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业将某项房地产部分用于出租,部分自用,如果出租部分能单独计量和出售,企业应将该项房地产整体确认为投资性房地产()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "普通合伙企业的合伙人对合伙企业债务依法承担无限连带责任,法律另有规定的除外()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资产负债表日,采用公允价值模式计量的投资性房地产的公允价值高于其账面余额的差额,计入公允价值变动损益()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "甲、乙、丙、丁成立一普通合伙企业,合伙人书面签订合伙协议,合伙协议中约定了合伙人的姓名、住所,合伙目的和合伙经营范围,合伙事务的执行,争议解决的办法等,但是没有约定经营期限,那么该合伙协议的约定不符合规定()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "企业通常应当采用成本模式对投资性房地产进行后续计量()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "已经设立抵押权的动产又被留置的,抵押权人优先受偿()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "处置采用成本模式计量的投资性房地产时,与处置固定资产和无形资产的核算方法相同,其处置损益均计入资产处置损益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "甲企业向乙银行借款50万元,丙企业以自己的一辆汽车为该笔借款提供抵押担保并办理了登记,抵押期间,丙公司的该汽车发生交通事故毁损,取得保险赔款40万元,若甲企业到期无法偿还欠款,银行可就该笔保险赔款优先受偿()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "处置采用公允价值模式计量的投资性房地产时,与之相关的其他综合收益应转入投资收益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "机关法人提供担保的,担保合同无效,但是经国务院批准为使用外国政府或者国际经济组织贷款进行转贷的除外()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业将采用公允价值模式计量的投资性房地产转换为存货时,应当以其转换当日的账面价值作为存货的入账成本()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "所有权,是指所有权人对自己的不动产或动产,依法享有占有、使用、收益、处分的权利()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "房地产的转换,是指企业对房地产重新改建后新确认的资产()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "承诺既可以撤回也可以撤销()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "企业出售投资性房地产产生的净损益,属于直接计入利润的利得和损失()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "合同抗辩权的行使都是基于同一双务合同()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业将成本模式计量下的投资性房地产转为非投资性房地产,无须确认损益账户金额()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "自用房地产或存货转换为采用公允价值模式计量的投资性房地产时,投资性房地产应当按照转换当日的公允价值计量,公允价值与原账面价值的差额计入所有者权益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业确定外币未来现金流量的现值时,应当先算出外币现金流量的现值,再将该外币现值按照当日的即期汇率进行折算()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "若某资产生产的产品供企业内部使用,应以内部转移价格为基础预计资产未来现金流量()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在进行减值测试时,企业只能采用单一的未来每期预计现金流量和单一的折现率预计资产未来现金流量的现值()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预计资产未来现金流量现值时,如果资产未来现金流量的发生时间不确定,企业应当根据资产在每一种情况下的现值乘以相应的发生概率加总计算()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如果某资产组在计算可收回金额时考虑了某项负债的金额,则该资产组在计算账面价值时也应考虑这部分负债的金额()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "《银行存款余额调节表》后应附银行对账单和公司账页",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因企业合并形成的商誉和使用寿命有限的无形资产,无论是否存在减值迹象,都应当至少于每年年度终了进行减值测试()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "《银行存款余额调节表》后不用附公司账页",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "资产减值准则所指的资产,除了特别说明外,只包括单项资产,不包括资产组()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "《银行存款余额调节表》后不用附银行对账单",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "资产组账面价值的确定基础应当与其可收回金额的确定方式相一致()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预算执行要对预算执行情况进行总结形成报告并上报上级单位,所有预算的报告分析应按照季度进行分析并上报",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "资产减值损失确认后,减值资产的折旧或者摊销费用应当在未来期间作相应调整()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预算控制的核心就是加强对预算关键性指标的控制,通过控制找出发展过程中的偏差,并采取措施纠正,真正消除偏差,促进企业发展质量的不断提升和发展风险可控",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "资产组经测试确认的减值损失金额,应首先抵减分摊至资产组商誉的账面价值()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "资产组组合,是指由若干个资产组组成的任何资产组组合()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "出纳在签发支票时,可以按照公司领导要求签发远期支票",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当企业计算分摊总部资产时,通常应根据各资产组的账面价值和剩余使用寿命计算出考虑权重的账面价值,然后再按各资产组加权后的账面价值比例分摊()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因填写、开具失误或者其他原因导致作废的银行票据,对于超过法定保管期限、可以销毁的票据,可以由出纳直接销毁",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "如果企业管理其金融资产的业务模式既以收取合同现金流量为目标,又有出售的动机,同时该金融资产的合同现金流量为本金加利息,则通常是将该金融资产分类为以公允价值计量且其变动计入当期损益的金融资产()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "金融负债终止确认,是指企业将之前确认的金融负债从其资产负债表中予以转出()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对银行账户已经撤销以及其他原因失效的财务印章,要立即送交财务资金部门,办理交接手续并撤回《承诺书》再由财务资金部门统一封存或销毁",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "其他债权投资与交易性金融资产不能随意重分类,但在满足一定条件下,可以重分类()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "非财务事项使用财务印章的,需要填制《财务印签交接表》,载明事项,经财务负责人签字批准后方可带出使用",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在非同一控制下的企业合并中,企业作为购买方确认的或有对价形成金融负债的,该金融负债应当按照以摊余成本计量的金融负债处理()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业取得的金融资产在初始确认时,如果能够消除或显著减少会计错配,企业可以将其指定为以公允价值计量且其变动计入当期损益的金融资产该指定作出后,若以后不符合相关条件,可撤销原指定,再重新划分为其他类金融资产()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于应收账款和其他应收款,当信用风险特征与相应组合法的信用风险特征存在显著差异时需要单项计提减值准备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于以公允价值计量且其变动计入其他综合收益的金融资产,资产负债表日公允价值变动计入其他综合收益,不计提减值损失()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目根据合同支付的购货定金不属于预付账款管理范围",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业对债权投资初始确认金额与到期日金额之间的差额既可以采用实际利率法进行摊销,也可采用直线法进行摊销()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业根据其管理金融资产的业务模式和金融资产的合同现金流量特征,对金融资产分类为以摊余成本计量的金融资产、以公允价值计量且其变动计入其他综合收益的金融资产和以公允价值计量且其变动计入当期损益的金融资产()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "备用金应在半年(6月30日)和年末(12月31日)清零,对于未能清零的借支人,即使在借款时未签署借款人从工资扣除的的承诺,也可以直接从其本人工资中扣除,当月未能扣除的,继续从下月工资中扣除,直至扣完为止",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "以摊余成本进行后续计量的金融资产一般包括债权投资、其他债权投资等；以公允价值进行后续计量的金融资产通常包括交易性金融资产和其他权益工具投资()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "外币其他权益工具投资于资产负债表日确认的汇兑差额与公允价值变动,应分开核算,分别计入当期损益和所有者权益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业计算超过专门借款部分的资产支出加权平均数时,应当与资产支出相挂钩()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各分公司按照合同支付分供商进度款虽然超过1000万元,但属于合同内比例支付,所以不需要报公司审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业所借入的外币专门借款发生的汇兑差额,属于借款费用,应当予以资本化()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在借款费用资本化期间内,一般借款有闲置资金的,利息资本化金额还应扣除一般借款闲置资金产生的利息或收益()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "借款利息,仅包括企业向银行或者其他金融机构等借入资金发生的利息、发行公司债券发生的利息()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "符合资本化条件的资产在购建过程中因生产用料没有及时供应发生了中断,且中断时间连续超过3个月,企业应暂停借款费用资本化()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在符合资本化条件的资产的实际购建或者生产过程中,如果所购建或者生产的符合资本化条件的资产分别建造、分别完工,则企业在界定借款费用停止资本化时点时,应当遵循的及时性原则()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "符合资本化条件的资产,是指需要经过半年以上的购建或者生产活动才能达到预定可使用或者可销售状态的固定资产、投资性房地产和存货等资产()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "如果只存在一笔一般借款,则资本化率是不需要重新计算的,一般借款的资本化率就是其实际利率()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财务印章、发票专用章的授权人为公司总会计师,接收授权人为公司总会计师指定人员",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "借款费用资本化期间是指从借款费用开始资本化时点到停止资本化时点的整个期间()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "严禁一切分供商出具的付款委托支付否则,财务资金部有权拒绝办理付款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑施工企业工地管理人员的工资,应当核算到管理费用账户",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "局名义投标项目,由局统一审批,统一支付",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "应收账款、预收账款、其他应收款均为资产",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各二级单位应通过办理银行账户结算卡完成项目开票缴税工作,可以使用员工个人卡办理缴税业务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "授信是指金融机构向非金融机构直接提供的资金,或者对企业在有关经济活动中可能产生的赔偿、支付责任做出的保证",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建筑安装企业收入、成本、费用必须以权责发生制为基础,遵循配比原则进行确认与计量",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "反向保理未到期部分占用各单位年度融资预算,各单位应在年度融资预算范围内开展业务,合理安排业务开展时间和规模",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目预计总收入是指预计完成全部项目可从工程发包方收回的全部价款,由合同初始收入、合同变更收入、合同索赔收入、合同奖励收入组成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新型融资业务是指项目业主在各类线上平台支付的新型供应链产品,通常形式为带电子签章的付款承诺单据,实质为我方债权凭证,具有可拆分流转、可在线融资的特点",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《建筑股份有限公司会计制度》规定,企业应当按照下表所规定的使用年限和10％的预计净残值率,采用年限平均法(直线法)计提折旧",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司《安全生产费用管理与会计核算暂行办法》规定,各单位以工程项目为单位按月提取安全生产费用,以上月发生的营业成本为计提依据",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "商票收取应遵循合同约定,同时密切关注业主兑付能力每次申请收取商票时应履行风险评估程序；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建造合同完成以后,工程施工账户与工程结算账户应对冲,对冲后工程施工账户应没有余额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "如业务需要必须收取商票的,建议收取6个月以内的电子商业承兑汇票",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业应按月提取折旧,当月增加的固定资产,当月不提折旧,从下月起计提折旧；当月减少的固定资产,当月仍计提折旧,从下月起不提折旧",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "禁止局内部单位间的工程款采用开立股份外部金融机构票据的方式结算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我公司于2015年认定为高新技术企业,可以享受企业所得税减免10%的税收优惠政策",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "典型的新型融资产品有建行的建信融通E信,工行的工银E信,中企云链的云信,农行的E账通等视同收取商票管理,遵循非收现管理规定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "国内差旅费住宿标准规定公司领导班子副职上限为600元/天",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各收票单位原则上应先制定背书计划再收取票据,原则上谁接收,谁消化,无法全部消化的应及时上报到公司财务资金部,由公司财务资金部进行统筹安排支付,尽可能提高应收票据消化效率",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "其他公务招待活动,接待对象超过10人的,陪餐人数原则上不超过接待对象的二分之一",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "评标小组人员数量应为五人以上的双数",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "评标小组人员数量应为五人以上的单数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "云筑网招标任务,概算金额填写的是含税概算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二级单位集中采购、战略采购定标环节只需在二级单位审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的公平公正原则指的是要做到机会公平、过程公正、结果公开,尊重并保护相关方利益",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的智慧采购原则指的是全面推行电子招标、电子评标、电子签约,实现采购管理大数据支撑、网络化共享、智能化协作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的分级管理原则指的是实行局总部、公司总部、二级单位、项目部四级管控,构建纵向分级、横向分权的体系架构",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的诚信履约原则指的是坚持质量第一、效益优先,营造公平竞争的市场环境；强化采购前置,提升采购时效,助力高效建造",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "未对分供方的融资水平和合同内容进行严格审核,合同履约监控不到位、付款不及时等可能引起纠纷这是采购管理主要应对的合同履约风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "通过完善制度,收紧权力,健全不敢腐、不能腐、不想腐的机制,防范廉洁风险,杜绝出现利益输送问题是采购管理主要应对的廉洁管理风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中所指二次结构劳务分包是包含砌筑工程的非主体结构工程劳务分包",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分公司主体、二次结构劳务分包资格审查、定标由公司进行审批；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分公司集中采购和2000万元以上的砼及砼构件的定标由分公司进行审批；",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "针对公司集采,项目可单独议标,进行二次谈判,项目单独签订合同价格及条件不得高于集采结果",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "定标金额不能超过招标概算额的10%,是指的上下浮动都不能超过10%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "多家中标的情况,生成所有合同的合同额累计不超过概算额10%(集采除外)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "劳务与专业分包月度产值单可以打包在云筑网上跨月录入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分供方在施工过程中增加合同范围(施工标段)之外的且与原合同约定的工作内容完全不一致的,应重新组织招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "评标时,投标单位提供虚假资料、隐瞒误导招标单位的由评标委员会审议后该投标文件可以按无效处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "具有施工总承包资质的企业,未取得覆盖范围内的专业承包资质,可以承接其他施工总承包企业依法分包的专业工程或者建设单位依法发包的专业工程",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采购成本降低率为采购成本降低额与标准成本金额的比值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采购效益率为收入总额与采购总额差值与收入总额比值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标过程中涉及到技术难度较大、方案难以确定的情形,可组织两阶段招标,第一阶段开商务标,第二阶段开技术标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "招标过程中涉及到技术难度较大、方案难以确定的情形,可组织两阶段招标,第一阶段开技术标,第二阶段开商务标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采购管理廉洁从业履职准则三主动包括主动公开,合法依规,公平公正主动回避,公私分明,克己奉公主动作为,规范操作,坚守底线",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于加强专业领域自主采购模式转变的通知中,专业工程自主采购13项有钢结构、幕墙、精装修、电气、给排水、消防、暖通、智能化、人防、园林绿化、金属屋面、体育工艺、医疗专项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局发布的P3报表中策划类型包括选型策划、品牌策划、规格策划、调差策划、组价策划、错峰采购、模式创新、支付策划、其他",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "不同投标单位的投标报价呈明显比例或梯队,可以认定为围标串标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在本单位第一次合作的主体、二次结构劳务分包必须考察",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "拟定标供应商查看云筑网发现三公司其他分公司有过考察的,可以不再考察,直接发起定标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "虚假招标、无效招标主要表现是,伪造投标报价单,中标单位的工商登记信息完全不存在,中标单位不具备业务承揽资质",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "主体、二次结构劳务招标前在公司管理平台进行分包商推荐,推荐表必须在资审时上传云筑网",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "清标过程中,采购小组成员应公平对待各投标单位,洽谈过程中可以带有倾向性或暗示、引导投标人的行为",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "最低投标价法,但投标价低于成本的除外一般适用于技术难度一般没有特殊要求的施工分包、物资",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "综合评估法,一般适用于技术难度大要求高的施工分包、物资,如钢结构、高支模、地下暗挖、大型机械租赁、单边支模、爬架爬模租赁等高大精尖难项目,或工期超出定额工期20%以上分包需要采取特殊措施抢工的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据管理要求,可选择云筑平台线上开标或线上线下同时开标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "主体结构、二次结构劳务资格审查表审批至三公司工程管理部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "云筑网招标密钥文件及口令丢失后不可以重新设置",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "资审结果不符合招标公告要求,未按要求上传资审结果附件均属于不合规行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未明确招标清单、回标要求、评标定标办法、废标条件等条款,或评定标环节未按照招标文件条款执行属于不合规行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "针对工程招标文件中对物资设备技术参数、品牌档次的要求,充分进行市场调研,利用战略合作供应商资源,引导物资设备的品牌、选型",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "评标成员参与过投标单位历史项目评标且评分过高人员,应主动回避",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "开标后,采购小组审核分供方投标文件,组织开展清标工作投标文件中有含义不明确的内容、明显文字或者计算错误,招标人认为需要投标人作出必要澄清、说明的,应当通知该投标人投标人的澄清、说明不得超出投标文件的范围或者改变投标文件的实质性内容",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采购管理文化的核心是智慧采购",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "单一来源采购必须保证原有采购项目一致性或服务配套的要求,需要继续从原分供方处添购,且添购资金总额不超过原合同金额30%的",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "主要采购方式包括MRO采购",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "非工程实体采购招采流程统一由采购中心约标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目采购策划管理,应以盈利为核心,以工期管理为主线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "将公司战略材料设备品牌融合招标文件是采购策划管理组织实施阶段的工作要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中建八局采购管理风险防控工作,完善公开招标机制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "合同额不能大于招标概算额的30%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "存在缺项控制价的需审批至分公司总经济师",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在设计完成后,项目部人员就应推进认质认价工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采购策划对风险点、亏损点、赢利点进行辨识",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采购管理文化的核心是价值创造",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目采购策划管理,应以成本为核心,以工期管理为主线",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局采购管理风险防控工作,完善公开监督机制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "合同额不能大于招标概算额的10%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "竞争性谈判招采小组中商务及技术人员比例不少于2/3",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "拟中标人数量(N)≤3时,有效投标单位不少于2N+1",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目采购策划书应依据合同范围、进度计划编制",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "被其他工程局标记不良行为的分供方一律不予通过资审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "采购管理展望是大数据支撑、网络化共享、智能化协作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一轮取消最高价中标权,即按报价由高到低顺序依次取消中标权,一轮取消中标权的单位数量原则上不少于1家,不高于投标单位数量的35%如果满足废标条件,则优先于最高价淘汰",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "采购管理展望是大数据共享、网络化协作、智能化支撑",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "采购管理手册中的阳光高效原则指的是必须遵守国家法律、法规及企业规章制度,恰当的行使权利,诚信履约,重视和维护八局企业品牌及合法权益",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "被本单位标记不良行为的分供方一律不予通过资审",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2009年4月1日,南京南站站房工程开工,工程于2011年8月20日竣工",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "先确定BIM应用具体内容,然后制定BIM应用业务目标,最后选择BIM应用技术路线这样的BIM实施规划流程是否正确()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "基于BIM的项目协同管理平台是指对各类BIM工具软件产生的BIM数据进行有效的管理,以便支持建筑全生命期BIM数据的共享应用的应用软件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "BIM实施技术路线是指对要达到项目目标准备采取的技术手段、具体步骤及解决关键性问题的方法等在内的研究途径()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "由设计主导的BIM应用管理模式的特点是设计招标难度大,具有风险性()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在进行信息提交的过程中需要对信息的三个主要特性进行定义,这三个主要特性是指状态、类型、作用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "BIM算量软件特征包括的是基于三维模型进行工程量计算、支持按计算规则自动算量、支持三维模型数据交换标准()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "Sketchup属于BIM深化设计软件()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "业主自主BIM应用管理模式适用于规模较大、专业较多、技术复杂的大型工程项目()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑工程信息模型交付物可以分为6类()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "使用老虎窗可以在屋顶创建洞口()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "延伸条形基础以满足建筑的需求,可以使用端点控制柄编辑条形基础的长度这些控制点显示为一些填充小圆,用于指示所选条形基础的端点附着在哪个位置()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "Revit中,可以使用连接几何图形命令让空心预留预埋族实现开洞效果()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "BIM是一种技术、一种方法、一种过程,它既包括建筑全生命周期的信息模型,同时又包括建筑工程管理行为的模型()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "BIM平台软件一般为基于Web的应用软件,能够支持工程项目各参与方及各专业工作人员之间通过网络高效的共享信息()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "按照数据交换格式的公开与否,BIM应用软件的数据交换方式可以分为两种,一种是基于公开的国际标准的数据交换方式,另一种是基于私有文件格式的数据交换方式DWG文件格式属于基于公开的国际标准的数据交换方式()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一体化指的是基于BIM技术可将几何、材料、空间关系、进度、成本等多种项目信息集成与三维模型中,并对其进行综合应用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "能耗管理属于BIM技术在运维阶段中的应用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "所有项目相关者都可以访问CDE()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "BIM技术是一种仅限于三维的模型信息集成技术,可以使各参与方在项目从概念产生到完全拆除的整个生命周期内都能够在模型中操作信息和在信息中操作()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "可以使用基于面的常规模型创建预留预埋件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在Revit楼梯间创建中,绘制的楼梯路径必须始于第一条踢板线,而结束于最后一条踢面线不能延伸到第一条或最后一条踢面线之外()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在Revit独立基础里,结构基础(基脚)的底部高程在名为底部高程的只读实例参数中报告然后可以通过使用带高程标记的结构基础标记对基础进行标记,在视图中显示此值()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "弯曲梁有结构分析模型,可以是平滑或分段模型如果分析模型是分段的,可以调整段的数目和位置是()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "基于BIM技术的碰撞检查应用中的缺陷检测是属于综合碰撞检查()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "5DBIM施工管理软件是在3D模型的基础上,附加施工的几何和时间信息()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "场地中,在Revit中创建子面域不会生成单独的表面,若要创建可独立编辑的单独表面,请使用拆分表面工具()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "场地中,如果地形表面的拆除的阶段属性未设置为无,然后再拆分地形表面,则生成的表面中会有一个的值更改为无()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "参数化建模是通过数字建立和分析模型()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "BIM工程师在设计方面的工作应用体现,不包括砌体二次排砖深化设计()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "BIM与虚拟现实的集成应用,可提高模拟的真实性、有效支持项目成本管控、可有效提升工程质量、可提高模拟工作中的可交互性,在未来的设计、施工中的应用前景广阔,是一个必然的趋势()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "BIM战略总监职责包括：负责企业、部门或专业的BIM总体发展战略,包括组建团队、确定技术路线、研究()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基于BIM技术,重点从钢材、混凝土、场地、模板等方面进行施工节材与材料资源利用控制应用与项目管理()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "给排水系统存水弯放置在管道上可以将存水弯放置在斜管道上()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "弯曲梁有结构分析模型,可以是平滑或分段模型如果分析模型是分段的,可以调整段的数目和位置()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "电缆桥架的三通可以更改为四通,也可以更改为弯头()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基于BIM技术的工程设计专业协调主要体现在基于三维可视化模型,可实现对设计成果的直观展示,减少不必要的沟通分歧()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "支持工程项目模型文件管理,包括模型文件上传、下载、用户及权限管理、支持模型数据的签入签出及版本管理、支持模型文件的在线浏览功能都属于施工管理BIM平台软件的特征()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "BIM技术在竣工阶段的具体应用主要包括检查结算依据、公共安全管理()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "使用BIM技术将复杂的钢筋节点的钢筋排布做成动态视频进行施工交底可以体现BIM可视化应用特点()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工序质量控制就是对工序活动条件即工序活动效果的质量分析及分项工程质量的控制利用BIM技术进行工序质量控制主要体现在利用BIM技术能够更好地确定工序质量控制工作计划；利用BIM技术能主动控制工序活动条件的质量；能够及时检验工序活动效果的质量；利用BIM技术能够设置工序质量控制点(工序管理点),实行重点控制()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "线管连接件可以是单个连接件,也可以是多个连接件()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "屋顶可以在三维中绘制编辑()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "编辑屋顶中,在Revit中根据给定尺寸绘制好标高以及参照平面,依次绘制大屋顶和小屋顶,为了更好地确定小屋顶与大屋顶的相对位置,一般用拉伸屋顶来绘制()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "目前碰撞检查软件与设计软件的互动方式主要可分为通过软件之间的通讯,在同一台计算机上的碰撞检查软件与设计软件进行直接通讯,在设计软件中定位发生碰撞的构件；以及通过碰撞结果文件的互动,碰撞检测的结果导出为结果文件,在设计软件中加载该结果文件,定位发生碰撞的构件()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目质量控制是为了确保项目达到客户所规定的质量要求所实施的一系列管理过程,其包含项目质量规划()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "可以使用面洞口工具在各种结构图元(例如梁、支撑或结构柱)中剪切洞口,梁洞口会剪切整个图元()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "设计阶段是工程项目建设过程中非常重要的一个阶段,在这个阶段中将决策整个项目实施方案,确定整个项目信息的组成,对工程招标、设备采购、施工管理、运维等后续阶段具有决定性影响,此阶段一般分为方案设计、初步设计和施工图设计三个阶段()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "Revit中可以通过属性或结构设置调整支撑的默认收进和缩进,而只能使用结构设置对桁架进行调整()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "室内装饰的色彩选择不属于BIM技术在概念设计中应用的体现()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "使用老虎窗可以在墙创建洞口()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "空间形式的思考是BIM技术在概念设计中应用的体现()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "空间造型设计就是对建筑进行空间流线的概念化设计()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "空间形式及研究的初步阶段在概念设计中称其为区段划分,是设计概念运用中首要考虑的部分()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "利用BIM技术的协同技术计和性能模拟分析等各种功能,可提高建筑性能和设计质量,有助于及时优化设计方案、量化设计成果,实现绿色建筑设计()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在Revit中,绘制构造柱,底部标高为标高1(0000),底部偏移-600,顶部标高为标高2(4000),顶部偏移为800,柱高度为5400()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "可在创建完成的屋檐底板中增加封闭草图达到开洞效果()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对关键复杂的墙板进行拆分,解决钢筋绑扎、顺序问题等,并对该部分进行施工图深化属于钢结构深化()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢结构三维实体建模出图进行深化设计的过程,一般分为三个阶段：搭建三维模型、碰撞校核、基于BIM模型出图()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "连接到柱的梁始终根据收进和缩进进行调整,但是不能使用梁/柱连接工具手动调整垂直柱()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "用BIM技术对钢网架复杂节点进行深化设计,提前对重要部位的安装进行动态展示、施工方案预演和比选,可以更加直观化的传递施工意图,避免二次返工()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在绘制存在高差的管道连接时,软件会自动生成立管和管件连接在一起()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "制平行管道命令可以向包含管道和三通的现有管道管路中添加平行管道()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一体化管理以信息一体化为基础要求各方、各阶段信息透明、共享各方能以非常小的信息成本获得足够的、透明的所需信息()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "虚拟施工管理在项目实施过程中的优势包括施工流程专业化()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "利用BIM技术进行资产管理的优势包括利用BIM可以实现资产信息管理可视化()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "监理单位并不参与具体的项目建设,主要负责监督管理建设项目中与本机构智能相关的内容()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "施工单位是项目的最终实现者,是竣工模型的创建者()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "绘制平行管道命令可以向包含管道和弯头的现有管道管路中添加平行管道()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "选中的配电盘可以有多个可用的插槽,且必须与连接的线路的配电系统匹配()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "Revit中将楼板边缘添加到楼板后,可以更改楼板边缘的大小,但不能更改方向()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "在Revit内建模型,空心形式和实心形式的创建工具都相同()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "柱创建过程中,双击柱实例会进入草图模式()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "BIM在施工节地中的主要应用内容有场地分析、土方量计算、施工用地管理及空间管理等()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建立系统运行实施标准属于项目BIM实施的保障措施()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "一般我们将建筑全生命周期划分为四个阶段,即规划阶段、分析阶段、施工阶段、运维阶段()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "Revit中,跨度属于桁架的实例属性()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "深化设计阶段的应用点包括施工方案深化设计()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "BIM技术在施工企业投标阶段的应用优势正确的是提高施工效率()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "关于梁的创建和使用,没有轴网时也可以通过绘制的方式添加梁()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在Revit中,腹板厚度属于梁类型属性()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "成本控制要求属于绿色建筑对CFD软件计算分析的要求()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "节能在绿色环保有面具体有两种体现,一是帮助建筑形成资源的循环使用；二是实现建筑自身的减排()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建造阶段的BIM应用点不包括施工方案管理()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "关于深化设计说法是为了增强管理者对施工过程的控制能力()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "建筑能耗模拟模型与BIM模型的差异不包括结构尺寸不完全一样()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "选中一段已绘制完成管段,只要通过单击【修改|管道】>【坡度】,激活坡度编辑器选项卡才能更改管道坡度()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "可选择楼板时,其任一端都会出现一个拖曳控制柄,可使用这些控制柄移动图元或修改其大小或形状()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建排头、行业领先的内涵：六个排头是指在中建系统做到经济指、业务板块、体系管理、发展能力、团队建设、党建工作排头,六个领先指在建筑行业实现战略引领、市场竞争、创新发展、精益管控、品牌打造、化建设领先",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "员工不准以企业名义私下承揽、经营工程不准项目部私下承揽工程体外运,把收入用作分配或他用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导人员的配偶、子女、亲友在自己管理的管辖范围内可以从事项目分包工或供销、租赁、加工等业务()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "经验总结属于编制BIM实施计划内容()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "使用按面创建的洞口总是与面垂直()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "高效性属于项目管理特点()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "于BIM技术在工程进度管理上的应用可视化的工程进度安排()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "租赁管理是BIM技术在空间管理中的应用()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "业主单位是建设工程生产过程的总集成者——人力资源、物质资源和知识的集成,也是建设工程生产过程的总组织者()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "梁绘制时默认Z轴对正为底()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "管理三控三管一协调中的三控不包括成本控制()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "优化总体规划是属于BIM技术在设计阶段的应用内容()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "通过应急管理决策与模拟,提供实时的数据访问,在没有获取足够信息的情况下,做出应急响应的决策能够体现出BIM技术在施工中的应用()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2009年4月1日，南京南站站房工程开工，工程于2011年8月20日竣工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司承建的安徽亳州民用机场项目是皖北第二个民用机场项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局三公司六个项目首次获得ISA国际安全大奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司南京市大厂污水处理厂新建工程(一期)获全国市政工程最高质量水平评价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "医智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砼智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2021年5月，公司智能装配造桥机10在盐洛高速项目成功运行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司自研的自行走测量机器人在盘城2号保障房项目实现应用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司申报的江苏省数字城市智慧建造与运维工程研究中心获江苏省发改委批复认定，这也是公司获得的首个省级工程研究中心",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2021年两岸企业家峰会于2021年12月7日在公司承建的扬子江国际会议中心举办",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司承建的财盛大厦是海南建省后的第一幢高层，被称誉为海南速度",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司的前身最早可以追溯到新四军皖东游击队",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司的前身部队曾改编为华东野战军建制部队，参加了涟水、孟良崮、淮海等解放山东、安徽和苏北的大小数十次战役和战斗",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1954年1月，水利工程一师师部和两个团改编组成建筑工程第四师后进驻上海市，增补了施工技术力量，对原部队官兵进行了技术培训",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司前身曾先后承建了西北光学仪器厂、东方机械厂、远东机械制造公司等10项重大工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1966年8月至1973年7月，211大队先后隶属基建工程兵整编办公室和基建工程兵西安指挥所，承担了陕西地区的三线建设重任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1973年8月至1978年6月，211大队随基建工程兵22指挥部调驻辽宁省辽阳市，参加国家特大型重点工程辽阳石油化学纤维总厂的建设",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1977年—1982年，建设南京烷基苯厂，年产烷基苯72万吨，合成洗衣粉25万吨，为当时我国最大的烷基苯生产基地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的徐州移动大楼2003年竣工，是公司在徐州市公建领域的第一个国优奖",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2015年，公司再次进入中建号码公司十强之列",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2022年，公司荣获江苏省建筑百强企业总承包类第五名",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京地铁九号线项目，是中建八局2020年承建的合同额、体量最大的新基建项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2021年，公司建设的江苏大剧院、国际青年文化中心、南京市公共卫生医疗中心、溧水区市民中心、侵华日军南京大屠杀遇难同胞纪念馆(三期)五大工程入选南京市十三五十大优秀公共建筑工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司承建的南京奥林匹克体育中心主体育场工程，荣获2005年全国十大建设科技成就奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1993年4月东海三公司承建的海口市体育馆举行竣工典礼，海南省省长阮崇武，副省长毛志君、江啸风，海口市市长曾浩荣等领导出席",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年3月31日建设部原部长萧桐在湖北省武汉市建委领导的陪同下，视察神龙汽车总装车间工程，对总装车间的建设速度和工程质量表示满意5月29日国务院副总理李岚清视察公司承建的武汉神龙汽车有限公司工地，对施工速度和质量表示满意7月7日法国工业部长视察公司承建的武汉神龙汽车有限公司工地，称赞中国工人好样的9月28日中建总公司副总经理孟广水等视察公司承建的武汉神龙汽车有限公司总装车间，对参加施工的职工给予表扬10月18日上午10时，中共中央总书记、国家主席江泽民视察公司承建的武汉神龙汽车有限公司总装车间，对工程建设表示满意",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年6月27日无锡市陈林荣副市长视察无锡商贸中心工地(无锡八佰伴)称赞这个工地现场管理好，进度快7月公司承建的金川公司多功能厅、造矿厂尾矿车间浓密池被评为甘肃省优质样板工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年8月18日公司承建的中国水泥厂2000吨/熟料生产线技改工程开工典礼举行，江苏省副省长王荣、南京市委书记顾浩出席，并为工程奠基",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年12月公司被江苏省委、省政府授予1993～1994年文明单位称号；公司被江苏省建筑协会评为江苏省建筑业最佳企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年4月26日公司施工的南京禄口新机场航站楼地下室提前2天完工，工期共计79天，创造了用最短的工期完成华东地区最大地下室的奇迹新机场建设指挥部向南京公司颁发奖金20万元",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年11月3日－13日公司对质量体系实施情况进行内部审核12月中旬，北京ISO9000认证中心专家对公司进行模拟审核，顺利通过了北京ISO9000质量认证中心的质量体系认证；成为建筑行业首批获取9000认证的企业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年12月17日中建总公司总经理马挺贵到公司视察工作，并为公司题词：创辉煌业绩，争同行第一；广招人才，发展科技，再铸辉煌，争创第一",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1995年12月公司被评为江苏省建筑业最佳企业；江苏省建设系统1994～1995年文明建设先进单位；南京市1994～1995年文明单位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2022年8月10日中建集团党组书记、董事长郑学选来三公司调研时指出：八局的开拓精神，最能在八局三身上体现，对此我有两个印象深刻的地方：一是新的八局三经过一轮磨砺又发展壮大了起来，八局三百折不挠、求变图强的开拓精神和韧性让人钦佩；二是承建阿尔及利亚松树俱乐部——喜来登大酒店，这个项目是中国公司在海外第一个总承包的五星级酒店工程，承建方八局三和安装能打硬仗、攻坚克难，仅用1年零8个月时间完成了施工任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2022年8月10日中建集团党组书记、董事长郑学选来三公司调研时指出：八局的开拓精神,最能在八局三身上体现,对此我有两个印象深刻的地方：一是新的八局三经过一轮磨砺又发展壮大了起来,八局三百折不挠、求变图强的开拓精神和韧性让人钦佩；二是承建阿尔及利亚松树俱乐部——喜来登大酒店,这个项目是中国公司在海外第一个总承包的五星级酒店工程,承建方八局三和安装能打硬仗、攻坚克难,仅用1年零8个月时间完成了施工任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2022年8月10日中建集团党组书记、董事长郑学选来三公司调研时指出：八局的开拓精神,最能在八局三身上体现,对此我有两个印象深刻的地方：一是新的八局三经过一轮磨砺又发展壮大了起来,八局三百折不挠、求变图强的开拓精神和韧性让人钦佩；二是承建阿尔及利亚松树俱乐部——喜来登大酒店,这个项目是中国公司在海外第一个总承包的五星级酒店工程,承建方八局三和安装能打硬仗、攻坚克难,仅用20个月时间完成了施工任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2022年8月10日中建集团党组书记、董事长郑学选来三公司调研时指出：八局的开拓精神,最能在八局三身上体现,对此我有两个印象深刻的地方：一是新的八局三经过一轮磨砺又发展壮大了起来,八局三百折不挠、求变图强的开拓精神和韧性让人钦佩；二是承建阿尔及利亚松树俱乐部——喜来登大酒店,这个项目是中国公司在海外第一个总承包的五星级酒店工程,承建方八局三和安装能打硬仗、攻坚克难,仅用18个月时间完成了施工任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2002年4月撤销南京公司，南京及其周边地区项目归公司直接管辖，实现公司扁平化管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2002年7月30日中建总公司总经理孙文杰一行，在中建八局局长梁新向等的陪同下，来到公司施工的山西太原卫星发射中心厂房建设工地进行慰问，孙文杰勉励大家：八局是由基建工程兵改编的企业，在巴丹吉林沙漠优质高速建成的火箭垂直总装测试厂房，为神舟飞船的胜利腾飞做出了贡献今天，又在为中华建造射天之箭，其创造之功，彪炳千秋希望你们发扬大漠精神和解放军的光荣传统，把这个工程建成名留青史的精品工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "招标过程中可以淘汰不在三公司本级资源库中的分供商",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "未对分供商的融资水平和合同内容进行严格审核,合同履约监控不到位、付款不及时等可能引起纠纷这是采购管理主要应对的合同履约风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分供商是指提供物资、设备、劳务与专业分包、专业服务及租赁等标的物,具有相应资质的法人或组织",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标文件评审内容包括不限于：招标人信息、招投标文件范本、招标清单、框架协议、施工图纸等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "供应商评价标准中全年综合评定得分：定期评价占比40%,动态评价占比60%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "不合格供应商两年内不予合作,再次合作时必须重新组织评价",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "任何单位和个人不得将依法必须进行招标的项目化整为零或者以其他任何方式规避招标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "招标人不得以不合理的条件限制或者排斥潜在投标人,不得对潜在投标人实行歧视待遇",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024版《采购管理手册》规定,需要由公司组织招标的包括：公司总部集中采购、战略采购、EPC项目四大专项工程",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024版《采购管理手册》规定,需要由二级单位采购公司审批的包括：主体、二次结构、二级单位集中采购",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024版《采购管理手册》规定,除公司采购外的其他招标均由二级单位组织发起",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024版《采购管理手册》规定,二级单位主体、二次结构劳务分包资格审查、定标由公司进行审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024版《采购管理手册》规定,二级单位集中采购的资格审查审批至二级单位即可,定标由公司进行审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "单项招标任务分供商报价不得短于72小时,集采报价时间不得短于5天",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "最低投标价法,但投标价低于成本的除外,一般适用于技术难度一般没有特殊要求的施工分包、物资",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "主体、二次结构资审、定标需审批到公司层级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分公司的集中采购、战略采购定标环节只需在分公司审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "与外部单位(大学、研究机构、技术专业服务机构等)合作开发的项目,项目责任单位应与外部合作单位事先签署具有法律约束力的协议,明确任务分工及知识产权归属和利益分配机制,合作项目研究开发费用总额原则上不应超过研发经费总额的80%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "桩基础复核项目有桩基的定位；桩长、桩径、入岩深度；成孔、清孔；钢筋笼制作及安装,隐蔽验收；混凝土强度等级、配合比、塌落度、浇筑方式,浇灌记录,试块留置",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "钢筋工程的复核组织人为专业工程师",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "二级单位原则上每15个项目可聘用1-2名方案审核师",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一般不合格品：指工序中出现的不合格和过程产品中虽未达到规定要求但不影响结构安全和使用功能且易于纠正的不合格品如质量问题中的质量缺陷;工程质量通病；其直接经济效益损失低于50万元的不合格品",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "屋面、机房、管井策划在施工前30天将策划方案按照B类方案上报,需包含深化图、细部节点图、施工工序管理三部分内容,其他内容可简化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "产生水土流失的基本动力是降雨()【工程研究院,第二第三曲线,2022年一级建造师水利水电工程实务题库】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于特殊过程,应在施工前完成相关的工艺评定或工艺测验,确定工艺参数,并编制作业指导书等工艺文件；施工人员的配置,必须具有规定的资格；施工机具、计量器具的配备必须满足过程实施和监测的需要；施工过程中应对过程参数进行监控,必要时进行连续监控,并做好特殊过程连续监控记录",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二类对象的履职记分采用12分制,以季度为周期,包括二级单位月度检查考核情况、公司和局总部当月检查考核、第三方质量评价情况",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "黄牌警示：指公司在日常质量监管活动中,对质量管理问题突出、存在较大质量风险的单位实施公开警示并重点督促整改的管理措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "红牌警示：指公司在日常质量监管活动中,对质量管理问题突出、存在重大质量风险的单位实施公开警示并重点督促整改的管理措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "抽水蓄能技术的优点是可将电网负荷低时的多余电能,转变为电网高峰时期的高价值电能【工程研究院+《抽水蓄能电站设计规范》(NB/T10072—2018)】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "碳中和是指人为排放与人为吸收达到平衡【工程研究院+习近平主席在第七十五届联合国大会上讲话】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "科技成果是科学技术研究成果的简称,在《科技质量管理手册》中主要指研发资料、科技奖、工法、专利、论文、标准等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "兼职研发人员是指企业内主要从事研究开发项目的专业人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "专职研发人员是指企业内在本职工作之外兼职承担研究开发项目的人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "沥青用量越大,则马歇尔试验流值越大()【工程研究院】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "透水混凝土的渗透系数越大,其强度和耐久性越低()【工程研究院】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "火山灰和粒化高炉矿渣均属于活性掺合料()【工程研究院】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司总部科学技术委员会具有审批公司级科技研发项目立项审批和公司级科技奖评审的权限",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土的活性掺合料在非碱性环境下也可以发生水化反应()【工程研究院】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "科技研发项目管理流程中的立项阶段需要公司财务部的参与",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "科技研发项目管理流程中的验收阶段不需要科学技术委员会的参与",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发项目管理的工作要求中,立项预审是公司科技质量部在立项申报后15天内完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发项目管理的工作要求中,公司执董会在立项申报后30天内,组织立项评审会从项目可行性、技术先进性、经济性等方面,拟定推荐立项项目,并经公司总工程师审核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "关于科技研发项目管理的工作要求中,公司科技质量部根据公司执董会审批通过的立项项目,在审批通过后15天内下达年度科研立项计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "高科技厂房在整个建造生命周期过程中有许多与一般工程不同的地方【工程研究院】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发项目管理的工作要求中,建立专项预算的主责部门是公司科技质量部,相关部门是公司财务部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "电子厂房建设分为传统现浇结构建造和预制结构建造【工程研究院】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发项目管理的工作要求中,实施策划是在立项计划下达后1个月内,由公司组织召开局级及以上研发项目开题会议,二级单位组织召开公司级研发项目开题会议,进行研究目标与内容实施策划,落实课题负责人,签订责任书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发外部合作与委托项目管理,与外部单位(大学、研究机构、技术专业服务机构等)合作开发的项目,项目责任单位应与外部合作单位事先签署具有法律约束力的协议,明确任务分工及知识产权归属和利益分配机制,合作项目研究开发费用总额原则上不应超过研发经费总额的80%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发经费管理中经费核定原则,二级单位申请的研发项目,公司资助经费应不低于研发项目审定后总经费的30%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技研发经费管理中经费控制,当课题验收不通过时,将暂缓经费拨付,给予课题组3-6个月的整改期整改后再次进行验收,仍未通过验收的课题,强制销项,经费按销项(终止)课题退回,并取消课题负责人下一年公司级研发课题申报资格",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于科技成果评选与推优,科技成果评选分为内部科技成果评选、外部科技成果评选两类",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在加快构建公司第二三曲线业务增长中,工程研究院负责洞察数字化前沿动态,把握数字技术发展方向()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "第三曲线分为两个维度,第一维度是规模支撑业务,第二维度是利润提升业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司经营重心目前由十三五时期的以高端房建为主,兼顾基础设施正在转向高端房建和基础设施双轮驱动,拓展新兴业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新型基础设施业务包括数据中心工程()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "第三曲线分为两个维度,第一维度是强链补链业务,第二维度是动能培育业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司要坚定高质量发展战略,由规模优先、保证质量转向质量优先,合理增速()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全过程咨询属于公司提出的第二曲线业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "智慧运维业务要依托建筑主业优势,深耕智慧城市运营等领域,培育智慧运营上市公司()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "城市更新业务要重点拓展长三角、京津冀、粤港澳、川渝等城市群、都市圈的城市更新业务,从单一型点状更新项目和发达城市优质片区更新项目着手,积累经验、培育团队,逐步拓展至经济重点城市片区开发项目()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新型基础设施业务要力争两年内超百亿规模()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为促进创新业务发展,公司要每月汇总统计各单位创新业务完成情况,月度例会进行通报【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "数字经济的快速发展与经济社会的绿色转型正在成为推动实体经济高质量发展的驱动双轮【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "光伏发电属于公司提出的第二曲线中新型基础设施业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "园林景观属于公司提出的第二曲线中新型基础设施业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "城市防洪排涝属于公司提出的第二曲线中新型基础设施业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "智能装备属于公司提出的第三曲线中新型建材业务()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司应把加快发展第二、第三增长曲线视为公司二次创业()【企业策划与管理部+公司二三曲线实施方案】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "收取总承包服务费的专业工程暂估价部分属于非自施合同额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "自施合同额指发承包双方签订的工程承包合同额中,承包人自行施工部分对应的合同额,即承包人自主决定合同收入和实际成本(自主与发包人办理竣工结算,自主组织招议标确定分包分供单位)的工作范围内的合同额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预计总成本指为完成项目预计要发生的全部耗费,由项目累计发生实际成本和项目尚需发生的预计成本组成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目实际成本指为完成工程顺利履约所投入的全部承包范围内的费用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "成本锁定指项目竣工后,自施部分实际成本已办理结算性文件,锁定项目投入",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "自施产值是指已完成工程(工作)中自施部分,按承包合同约定的计价条款,确定的工程造价(自施合同收入),包含总承包服务费和定点类分包缴纳总包管理费",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "自施产值是指已完成工程(工作)中自施部分,按承包合同约定的计价条款,确定的工程造价(自施合同收入),不包含总承包服务费和定点类分包缴纳总包管理费",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "产值确权率指同期业主确认产值与产值的比值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "产值确权率指业主确认产值与产值的比值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "工程计量确权率指同口径下业主确认产值与项目实际成本的比值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "策划预计创效金额指一体化创效策划立项过程中,根据测算该项策划完成后的预计盈亏数减去策划实施前的预计盈亏数每项创效策划立项金额合计为整个项目创效策划预计创效金额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "策划预计创效金额指一体化创效策划立项过程中,根据测算该项策划完成后的盈亏数减去策划实施前的盈亏数",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分阶段结算指在工程竣工验收(履约证书颁发)前,发承包双方对施工内容中单位工程(子单位工程)造价达成一致意见,并对该造价签订书面文件;及发承包双方对施工合同内容签订书面文件的经济行为",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分阶段结算指在工程竣工验收(履约证书颁发)前,发承包双方对施工内容中单项工程或单位工程(子单位工程)造价达成一致意见,并对该造价签订书面文件;及发承包双方对施工合同内容进行重计量并对计量内容签订书面文件的经济行为",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "账面利润指按建造合同会计准则确认的财务账面反映的项目所有利润具体以财务账面为准",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "账面利润指按建造合同会计准则确认的实际账面反映的项目所有利润具体以财务账面为准",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "定点分包缴纳总包管理费指总承包人依据定点分包合同及分包与发包人办理的竣工结算或产值确权,与分包人办理结算或产值确权时扣取的金额此部分金额可计入总包方的自施产值或冲减自施成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "定点分包缴纳总包管理费指总承包人依据定点分包合同及分包与承包人办理的竣工结算或产值确权,与分包人办理结算或产值确权时扣取的金额此部分金额可计入总包方的自施产值或冲减自施成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "风险金预留完成率＝实际预留(缴纳)金额÷应预留(缴纳)金额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "预计总收入＝初始预计合同总收入+合同变更+索赔收入+奖励收入",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "预计总收入＝初始预计合同总收入+合同变更+索赔收入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "预计总成本＝累计实际发生的合同成本+尚需发生的合同成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "产值确权率＝业主确认产值÷同期产值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "产值确权率＝实际产值÷业主确认产值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "产值利润率＝(产值-成本)÷产值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "现场经费占比=现场经费成本÷自施产值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "现场经费占比=现场经费成本÷产值",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "临时设施(临水、临电)占比=临设成本÷产值",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竣工结算率=∑本年度结算项目数÷(∑截止上年度末竣工未结项目数+∑本年度630前竣工项目数)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竣工已结项目平均结算周期(月数)=本年度结算项目(项目结算日期-竣工日期)+∑本年度结算项目数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "久竣未结项目占比=∑久竣未结项目数÷(∑期末在建项目数+完工未结项目数)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考核兑现完成率=∑完成考核兑现项目数÷具备考核兑现条件项目数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "考核兑现完成率=∑完成考核兑现项目数÷上报兑现项目数",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考核兑现管理办法中,项目优化考核包括所有与项目有关的过程开源节流、化解风险工作的立项、考核兑现",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分公司成立在建项目季度目标考核小组,考核小组包括分公司经理、人力资源岗、总经济师、总会计师、商务法务部、财务部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考核兑现管理办法中建立目标设定,过程考核、节点考核和竣工考核相结合的项目考核体系,下列包括项目策划考核兑现、季度目标考核兑现、节点目标考核兑现",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "坚持责任到人的原则,发布《采购优化效益考核兑现实施细则》,推行采购管理人员积分制,推进物资量差、采购价差创效激励",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "总承包项目规模为10-15亿元的项目整体预留额度是30万元",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "《项目目标管理责任书》签订后 14天内预留风险金",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目部人员在项目预留的风险金尚未具备返还条件,开工6个月内即调离该项目部,预留风险金退回本人,不再承担项目盈亏风险",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "风险金的特殊处理一般由项目部提出申请,人力资源部组织相关部门审核",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "本人提出《项目人员风险金返还审批表》申请,由分公司总会计师负责核算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "考核兑现管理办法中,竣工考核奖金按工程款实际回收发放的比例：工程款回收比率在60%以下,计算兑现总额的50%,工程款回收比率在80%(含)~95%,计算兑现总额的80%,工程款全额收回,全额兑现",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据预结算管理办法(2022版)中规定,停工项目,要有停工报告书,对现场的人员、机械、材料设备、已完成、签证工作需要有业主签字的有效资料",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预结算管理办法(2022版)中建议期中结算分土桩基四大块、地下室封顶、主体封顶、二次结构完成、专业工程等几个阶段,并对每个阶段完成时间进行约定",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据预结算管理办法(2022版)中规定,下列属于二级单位审批权限的是结算责任状完成考核、结算专用章使用审批、结算奖罚事宜审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据预结算管理办法(2022版)规定,总包结算管理小组组员有项目铁三角、总经济师、二级单位商务法务部、商务管理部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "预结算管理办法(2022版)的管理原则是注重时效、梳理归纳、业务归口、精心策划",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "物资需求总计划编制,按照施工进度计划和流水分段作业的要求,分部、分项、分阶段进行编制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "机械租赁方报量时间点为上月21日至本月20日,必须有机械租赁方签字、盖章,不能盖章时,机械租赁方签字代表人必须取得机械租赁单位的授权委托书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在项目优化实施前30天,申报单位提交《项目优化立项申报表》相应策划立项一式三份,并附相应优化方案对于超过申报时间未立项的,原则上不予考核奖励",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "通过签证、索赔化解项目风险点和亏损点,实现增加效益或减少亏损以及提高利润点,根据创造效益按项目优化奖标准给予奖励",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "通过编制补充定额的奖励化解项目风险点和盈利点,实现增加效益或减少亏损以及提高利润点,根据创造效益按项目优化奖标准给予奖励",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "房建、基础设施、专业板块成本控制主要目标：临时设施费,临时设施、临水、临电费用≤1%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "单一来源采购、结算与总包关联的分包控制价审批最终审批人总经济师",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "物资需求总计划编制：按照施工进度计划和流水分段作业的要求,分层、分段、分规格、分构件进行编制中标后7日内,根据中标文件编制初步物资需求总计划,施工图预算编制完成后7日内,提供完整物资需求总计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "总包结算资料不齐全、结算书未上报前,项目主要管理人员不得调离",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位商务法务部(计量中心)参照图纸说明及相关图集对竣工结算初稿复核工程量准确性,并对项目清单组价进行指导",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总包签证管理要求：超过200万元的单项签证,提交发包人前,经二级单位商务法务部审核、总经济师审批后报出",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分包签证管理要求：项目专业工程师负责组织项目相关部门进行会审会签,专业工程师对分包指令完成情况进行初步审核,项目总工(项目副经理)确认签证实事,项目商务经理审核签证合理性及价款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "分包签证管控方面质量问题返工、修补：谁施工谁负责返修,并承担返修材料费用损失,不允许签点工或费用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重点关注案件指因违规对外融资借贷、对外担保、虚假交易、保理等问题导致的案件,或产生重大影响的案件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投标合作类、财务资金类、投资发展类、海外合同、办公服务类、招聘培训类、企划类其他类合同审批权限为公司总经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程竣工后,在向发包人递交结算报告后的7个工作日内,但不得晚于竣工后2个月内,项目商务经理应组织进行合同总结,经二级单位商务法务部审核后上传至公司管理平台",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分供合同签订,使用公司示范文本在定标后1日内起草",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分供合同签订用印,审批通过后3天内,从定标至签约总体控制在12天内",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "现场临时设施参考《中建八局项目临建标准化管理办法》,开工前需呈报方案及预算,需约定占自施合同额比例,此文件将作为结算附件,在办理结算时一同上交",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工图预算编制自收到施工图纸60天内(合同有约定从约定),大型项目分阶段编制/收到设计变更图纸60天内完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "拌和作业开机前应警示,拌和机后不得站人,拌和过程中人员不得跨越皮带或调整皮带运输机",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混合料运输应按指定线路行走,不得超载、超速卸料升斗时,人员不得在车斗的正下方停留",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "小型机具洒布沥青时,喷头不得朝下,喷头10m范围不得站人,不得顺风作业",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目策划完成后,二级单位应高度重视项目首次资源要素配置,避免频繁更换项目主要管理人员和主要劳务队伍",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目策划回头看指在完成项目策划6个月内,通过检查《项目策划书》中组织机构设置、工期管理、资源配置、技术质量、商务合约等方面执行情况,验证项目策划编制的合理性,同时进行再评审、再修订的活动",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "月进度计划不予调整；现场工况发生变化或月进度计划滞后需在次月计划中进行纠偏",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "周进度计划不予调整；现场工况发生变化周进度计划滞后需在次周计划中进行纠偏",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "年进度计划不予调整",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当现场工况变化,年进度计划不再适用需对年进度计划进行调整；年计划调整可以突破总进度计划各节点时间要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公路工程施工安全生产应贯彻安全第一、预防为主、综合治理的方针",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公路工程施工前应进行危险源辨识,并应按要求对桥梁、隧道、高边坡路基等工程进行施工安全风险评估,编制风险评估报告,现场应监控",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工便道与既有道路平面交叉处应设置道口警示标志,有高度限制的应设置限高线",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },

  {
    question:
      "施工便桥应根据使用要求和水文条件进行设计,并应设置限宽、限高、限载标志,建成后应验收",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "通过栈桥的电缆应绝缘良好,并应固定在栈桥的两侧",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水上或潮湿地带的电缆线必须绝缘良好,电缆线接头必须经防水处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "模板、支架的拆除应遵循先拆承重模板、后拆非承重模板、自上而下、分层分段拆除的顺序和原则",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "承重模板应纵向同时、横向对称均衡卸落",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "简支梁、连续梁结构模板宜从支座方向向跨中依次循环卸落；悬臂梁结构模板宜从悬臂端开始顺序卸落",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋加工机械转动部件宜根据实际情况安装防护罩",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "钢筋冷弯作业时,弯曲钢筋的作业半径内和机身不设固定销的一侧不得站人或通行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "密闭空间内实施焊接及切割,气瓶及焊接电源应置于密闭空间外",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "密闭空间焊接作业应严格按照要求设置气体监测、绝缘、照明装置和应急救援装备",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "吊装作业应设警戒区,警戒区不得小于起吊物坠落影响范围",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "流动式起重设备通行的道路、作业场地应平整坚实,吊装前支腿应全部打开,并应按要求铺设垫木",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "高空吊装梁等大型构件应在构件一端设溜绳",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "吊装大、重、新结构构件和采用新的吊装工艺应先进行试吊",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程船舶必须持有效的船检证书,船员必须持有与其岗位相适应的适任证书,船员配置必须满足最低安全配员要求",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "潜水员在构件基本就位后可以靠近待安装构件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "潜水员在构件稳定后可以靠近待安装构件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "供气管不得置于构件缝中,流速较大时,潜水员应顺水流操作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "潜水员身体的任何部位不得置于两构件之间",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "潜水员在沉井或大直径护筒内作业时,沉井和大直径护筒内侧水位应低于外侧水位",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "潜水员在沉井或大直径护筒内作业时,潜水员不得独自在沉井刃脚下或护筒底口以下作业",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "爆破作业必须设警戒区和警戒人员,起爆前必须撤出除警戒人员外的全部人员并按规定发出声、光等警示信号",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "水下爆破引爆前,警戒区内的船舶上不得滞留人员",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "盲炮检查应在爆破15min后实施,发现盲炮应立即安全警戒,及时报告并由专业爆破人员处理",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "需使用2台及以上手拉葫芦同时起吊重物时,需提前编制专项施工方案",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "弃方作业应遵循弃土与支护同步的原则",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "路堑开挖应采取保证边坡稳定的措施,边坡有防护要求的应开挖一级防护一级,且应自上而下开挖,不得掏底开挖、上下同时开挖、乱挖超挖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砂浆喷射作业应严格执行操作规程,边坡喷射砂浆应自上而下顺序施作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "人工挖孔作业时,应持续通风,现场应至少备用2套通风设备",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "人工开挖支挡抗滑桩施工时,土石层变化处和滑动面处应选择性分节开挖,并应及时加固防护护壁内滑裂面",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "人工开挖支挡抗滑桩施工时,同排桩施工应跳槽开挖,相邻桩孔不得同时开挖,相邻两孔中的一孔浇筑混凝土,另一孔内不得有作业人员",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "滑坡体上开挖路壁和修筑抗滑支挡构筑物时,严禁分段跳槽开挖,不得大段拉槽开挖,并随挖、随砌、随填、随穷；",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "岩溶地区施工时,应由专业人员先对洞内有害气体和物质进行排除后,其余人员方可进入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "岩溶地区施工时,人员进入不稳定洞穴应分批次进入",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工中,拌和楼、发电站(机)、运输车、滑模摊铺机、轨道摊铺机、沥青摊铺机等大型机械设备及其辅助机械(具)操作手不得擅自离开操作台",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "退休前在多地缴纳的养老保险应提前办理接续至退休地账户",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "到达退休年龄但因手续原因未领取退休金时应继续领取在职工资",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目经理属于E2职级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "20级(T4-1)及以上人员,评审晋升每1年组织一次",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "T2职层晋升至17级(T3-1),需满足T3-1基本任职资格条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "冗余人员进入人力资源调配中心的,第二个月起停发津补贴",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "进入人才沉淀池的人员待岗期为累计不超过6个月",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司停止为待岗人员缴纳住房公积金及企业年金",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "待岗期间,待岗人员需要每天到所在单位考勤",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "校园招聘入职的毕业生,所学专业为财务,分配岗位为财务管理见习生,不需要参加项目安全实训",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "见习生未通过安全实训考核的,不可以参加转正考核专业考试",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "跨专业序列转评职称时,可以转评高一级的职称；",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "所学和所从事岗位为非工程系列的人员,能以工程师职称为基础申报高级工程师、高级经济师或高级会计师职称",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "局总部和有自行评审权的单位原则上不接受外部单位委托评审,确有特殊需要的,可在接收委托函后直接评审",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "正式员工甲2015年入职本单位,2018年在外部单位评工程师职称,现其可直接在公司内参评高级工程师职称",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "专科学历不可参评副高级职称",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "评审会议由主任委员或者副主任委员主持出席评审会议的评委人数应当不少于职称评审委员会人数的三分之二",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "通过评审、社会化考试取得职称人员必须聘任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "无故不服从公司工作安排的年度考核应为C档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "履职能力、行为与态度评议为80分以下(不含)人员年度考核应为C档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对企业造成100万元及以上严重损失的人员年度考核应为C档",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目总监每季度由项目自行组织开展日常绩效考评工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "海外项目的项目经理无一级建造师可以入A/A+档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于T2职层跨职层晋升至T3职层及T3职层内职级晋升,只需满足近两年考核有A/A+档",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "连续两次年度考核为A/A+的B类人员在满足条件的情况下报送转为Y类,签订正式合同",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "营销激励人员同时项目享受企业效益奖和营销奖双重激励",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各分公司可自行与员工签订协议制工资",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "执行年薪制人员可以发放年功津贴",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "执行年薪制人员可以享受过节费、降温费等货币性福利",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "协议制人员可以发放注册类证书补贴",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "罚款不可以缴纳现金",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "副职的绩效年薪根据考核结果同一单位副职年薪高低差原则上不低于20%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "专项奖金的申请部门与资金类别一定是人力资源部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "科技奖、质量奖的申请部门与资金类别为科技部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "职效工资制的管理原则为以级定薪、易级易薪,以岗计奖、易岗易奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工岗位变了,数字职级一定变",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工过程考核结果为D档的,过程考核周期内的绩效工资为0",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工效益奖金与员工岗位挂钩,与职级不关联",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "外单位借调的人员占用原部门效益奖包",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司内部借调人员,借调部门承担借调人员的效益奖包",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "本科的见习生见习期间统一定为12数字职级",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "员工休带薪年休假期间,享受与正常工作期间相同的工资收入",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "取得执业资格证书后,由个人进行补贴申报,注册类证书从注册通过(其中一级建造师需取得安全B证)且收到员工申报后次月执行,无需注册的证书从取证后且员工申报后次月执行,因个人原因未及时申报的,不予补发",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "干部人事档案专审的重点内容为三龄二历一身份三龄包括档案中的年龄、工龄、党龄",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "干部人事档案专审的重点内容为三龄二历一身份两历包括档案中的学历和工作经历",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "干部任免审批表必须彩色、单面打印",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "查阅干部人事档案应如实填写干部人事档案查阅审批材料,按照程序报单位负责同志审批签字并加盖公章；查阅档案应当2人以上",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "人事档案分为正本和副本,一般只建立正本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "干部是中共党员的,其档案材料必须有入党志愿书",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "干部人事档案专审的重点内容为三龄二历一身份一身份指的是干部身份",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "干部档案转递的渠道和方式有专人送取和机要交通转递",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "职工履历表中政治面貌只有中共党员和群众两种",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "我国最高学历是博士研究生",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目班子成员因私出国(境)均应通过DHR系统的备案人员因私出国(境)申请",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "备案人员因私出国(境)经DHR系统备案人员因私出国(境)申请流程审批通过后凭局出具的申办出入境证件函方可办理出国(境)手续",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "备案人员因私出国(境)在DHR系统提交申请时,需上传因私出国(境)行前教育材料,且在归国后提交备案人员因公因私回国后访谈问卷办理归档手续",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建集团规定备案人员因公出国(境)需要通过出国(境)人员行前教育考核,做到不取证不派出,非备案人员不需要",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "女员工已参加生育保险的,产假期间的待遇按参保地生育保险有关政策由本人或委托他人申请领取",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "年金基数上下限与社保基数上下限保持一致",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公积金基数上下限与社保基数上下限保持一致",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中建系统内年金账户转移需要提供转移函",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中建系统外年金账户转移需要提供转移函",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "未在南京缴纳公积金时在南京缴纳公积金需办理账户转移",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对党的组织关系在地方、干部管理权限在主管部门的党员、干部以及监察对象涉嫌违纪违法问题,应当按照谁主管谁负责的原则进行监督执纪【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "线索处置不得拖延和积压,处置意见应当在收到问题线索之日起15天内提出【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "纪律检查委员会是党内监督的专责机关,纪委书记牵头,办公室设在纪检监督工作部【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "留置时间不得超过三个月在特殊情况下,可以延长两次,每次延长时间不得超过三个月【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员因违犯党纪受到处分,影响期满后,党组织无需取消对其的处分【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业员工个人或数人可以集资购买机具、设备等转租给所属项目,但必须提前报备()【题目来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的各级纪律检查委员会坚定维护党章,促进党组织和党员牢固树立党章意识、严格遵守党章规定,发挥党章作为管党治党总章程的作用,以严明的纪律巩固党的团结统一【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的各级纪律检查委员会协助同级党的委员会加强党风建设,锲而不舍落实中央八项规定精神,大力弘扬党的光荣传统和优良作风,驰而不息纠治形式主义、官僚主义、享乐主义和奢靡之风,坚决纠正损害群众利益的不正之风,保持党同人民群众的血肉联系【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发挥党的纪律检查工作在党和国家监督体系中的重要作用,强化对权力运行的制约和监督,重点加强对领导干部特别是主要领导干部的监督,提升监督全覆盖质量,增强监督的政治性、严肃性、协同性、有效性【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党风政风监督是指纪检机关对纪检队伍的自我监督【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "全面从严治党基础在全面、关键在严全面就是管全党、治全党；严就是真管真严、敢管敢严、长管长严【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目领导人员、关键岗位人员具有相对集中且独立的七项权力分别是：审核权、人事权、采购权、放行权、计量权、财务权、关键信息拥有权【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "纪检监督是党内监督,担负着协助党发挥统揽全局、协调各方领导核心作用的重要职能,根本使命是为了维护党中央权威和集中统一领导【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的七大《党章》将对党员的处分简化为五种类型,并沿用至今【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的十四届中央纪委二次全会,首次作出反腐败斗争的形势是严峻的重大判断【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的纪律检查工作坚持把一体推进不敢腐、不能腐、不想腐作为新时代全面从严治党的基本方针、反腐败斗争的重要方略【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "坚持教育党员、干部坚定理想信念宗旨,提高党性觉悟,提升道德修养,涵养廉洁文化,筑牢思想上拒腐防变的堤坝,强化不能腐【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》第二十三条规定,一人有本条例规定的两种以上(含两种)应当受到党纪处分的违纪行为,应当执行其中最重的处分【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "收受可能影响公正执行公务的礼品、礼金,只要领导干部的权力、地位对对方在政治、经济等方面存在一定影响即可认定,不要求发生实际未公正履职的情况【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国共产党纪律处分条例》,开除党籍是党内最高处分【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全面从严治党永远在路上,党的自我革命永远在路上【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定,各级党组织应当把信任激励同问责追责结合起来,促使党的领导干部做到有权必有责、有责要担当,用权受监督、失责必追究【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定,党委应当严格执行各项监督制度,加强职责范围内党内监督工作,既加强对本部门本单位的内部监督,又强化对本系统的日常监督【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定,党的领导干部应当强化自我约束,经常对照党章检查自己的言行,自觉遵守党内政治生活准则、廉洁自律准则,加强党性修养,陶冶道德情操永葆共产党人政治本色【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》规定,运用监督执纪四种形态,经常开展批评和自我批评、约谈函询,让红红脸、出出汗成为常态;党纪轻处分、组织调整成为违纪处理的大多数;党纪重处分、重大职务调整的成为少数;严重造纪涉嫌违法立案审查的成为极少数【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党纪律处分条例》,党组织和党员违反党章和其他党内法规,违反国家法律法规,违反党和国家政策,违反社会主义道德,危害党、国家和人民利益的行为,依照规定应当给予纪律处理或者处分的,都必须受到追究但自行为发生之日起,超过五年的不再追究【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党纪律处分条例》,党员受到撤销党内职务处分,一年半内不得在党内担任和向党外组织推荐担任与其原任职务相当或者高于其原任职务的职务【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党纪律处分条例》,党员干部必须正确行使人民赋予的权力,清正廉洁,反对任何滥用职权、谋求私利的行为【出题来源：纪检监督工作部】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局发展愿望：成为世界一流的投资建设集团",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2024年,各分公司要有一个以上投资带动项目落地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,各分公司要有二个以上投资带动项目落地",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年,公司各系统要制定月度考核评价办法,每月对各单位、各体系进行大排名,评比晾晒",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "钢梁制作时同一部位的焊缝返修不得超过三次,返修后的焊缝应按原质量标准进行复验,并且合格( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2024年,公司各系统要制定季度考核评价办法,每月对各单位、各体系进行大排名,评比晾晒",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2024年,公司发展的主题实干,奋斗,争先",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2024年,要确保客户满意度达到95分",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,要确保客户满意度达到100分",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2024年,二次客户中标金额同比提升至50%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,二次客户中标金额同比提升至60%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "顶进涵施工时,顶推力轴线应与桥涵中心线一致( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,二次客户中标金额同比提升至70%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2024年,要推动项目人证合一,年底前达到双百目标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,要推动项目人证合一,年底前达到95%目标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "2024年,公司关键节点按时完成率95%以上",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,公司关键节点按时完成率100%以上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "当千斤顶使用时间超过6个月或张拉超过300次时,应重新进行标定( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,公司关键节点按时完成率98%以上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "植物成活率、覆盖率、植被盖度的检验至少在满二个年生长周期后进行( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2024年,要重点管控安全标准化设施超标问题,警示标志和挂图等推广使用KT板",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "用灌砂法测定路基压实度,当试洞成上部大、下部小圆锥形时,会使实测密度偏小( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "2024年,要畅通分供投诉渠道,公司及分公司总经理作为投诉第一责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "路基弯沉值代表值小于设计弯沉值时,相应分项工程为不合格( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },

  {
    question: "二级、三级项目临建策划评审需报三公司副总经理(生产)审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "确定临建等级的时间要求是项目进场后三天内",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "开工推进会在中标后2个月内每15天开展一次",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目以工期为主线,试行三级计划、三级节点、三级管控的计划管理体系",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "总计划编制内中应该包含5大节点类型",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "月进度计划作为项目施工阶段性计划,准备工作计划须体现下月计划实现所必需的人、材、机、方案、工作面、资源等工作的计划安排及责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "总计划的各大节点类型的维护需要项目副经理负责验证",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "两种集料的细度模数相同,它们的级配一定相同( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司管理平台上节点的维护时效为三天(及三天内上传节点完成资料)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目部进度延误15天内属于蓝色预警",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目部在收到监理例会纪要后2天内上传管理平台",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预制桩制品现场影像资料留存要求有制品名称、直径、长度及制作时间、根数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "示范项目评比考核中连续两次为取消示范项目创建资格",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目策划执行率=累计实际执行的项目策划清单项数/累计计划执行项目策划清单项数",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收尾项目竣工前6个月开始,除正常例会外,每15天组织相关部门召开竣工推进会",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "当混凝土原材料和施工工艺等发生变化时,必须重新选定配合比( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目部应在竣工前两个月内编写《项目部管理总结计划表》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司挂图作战主要应对风险包括防范各级单位因目标引领不明确、计划管控不到位、管理动作不规范造成的生产履约风险、客户投诉风险、成本浪费风险",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在项目工作完成审批事项通过30天内申请《项目部撤销令》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各单位围绕公司生产系统及二级单位年度重点工作,科学准确确定本单位生产系统年度工作目标,制定下发下一级单位年度、季度施工任务书(工作指令单)",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "项目竣工前两个月内必须编写完工总结报告",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司总部每年初给二级单位下发年度目标责任书,年末进行考核评价；每月初对二级单位下发月度施工任务书(工作指令单),月末进行考核评价,结果应用到二级单位系统排名",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部确认工程具备移交条件后,向建设单位提出移交申请,办理移交手续,移交《工程使用手册》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目按信息化部要求在开工30天内连线公司远程监控中心(除保密项目等不具备视频连线的项目)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目总工组织编制周转料具投入方案、投入总计划需由区域流转图汇总形成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "连续梁竖向预应力筋应采用两次张拉方式,且滞后纵向预应力筋张拉不宜大于3个悬浇梁段(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二级分包商：可同时承接4个(含)10万m²以内的项目",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "三级安全管控分为公司级、分公司级和项目级管控",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "沥青路面施工时,若混合料的加热温度过高或过低时,易造成沥青路面的泛油( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "应急预案包括综合应急预案、专项应急预案、现场处置方案三种类型,各单位应根据其辨识出的可能发生的应急事故(事件),编制本单位应急预案",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中建八局深化项目管理提升发展质量三年行动方案》中,核心目标为围绕企业层和项目层的项目管理,强化法人管项目体制建设",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "可能导致2-3人死亡事故时,启动二级响应",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "劳务管理十项管理底线包括：项目必须将工人信息录入云筑实名制平台；项目必须收集工人工资卡信息；项目每月必须通过建筑工人工资专用账户发放建筑工人工资",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局深化项目管理 提升发展质量三年行动工作任务清单中,制定首次资源配置清单主责部门是工程管理部",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分包管理三全：实名制管理全覆盖、总包代发全覆盖、工资监管全覆盖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分包管理中的一牌指的是维权信息告示牌",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "混凝土运输浇筑及间歇的全部时间可以超过混凝土的初凝时间( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "P项目关键节点：支护桩基施工图图审合格、开工许可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "劳务管理员配置标准：现场高峰期劳动力连续3月超过500人的项目,设置一名专职劳务管理员,连续3月超过1000人的项目每增加1000人再增设一名专职劳务管理员",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分包商等级为战略：一级：二级：三级=10%：30%：40%：20%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局深化项目管理 提升发展质量三年行动工作任务清单中,完善项目经理选拔、任用、调岗机制,强化过程管控,动态监控各二级单位人证合一率,力争在2025年底实现双率100%的提升目标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "产值不达标项目为月产值完成率低于80%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混凝土拌合物工作性能检查每100m³不应少于1次相邻两条变形缝区间的管廊结构,每次浇筑时留置的标准养护强度试件不得少于1组(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部临建标准化管理全过程需要准备的文件内容有：临建策划、临建方案、临建预算审批表、临建验收记录表、临建结算审批表、临建考核评价报告",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收尾销项工作计划内容包括：工程资料预验收计划、项目设备、器械、用具清理、归还或入库,以及相应的安全、质量、环保、成本控制、保安控制措施等内容",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总计划中节点类型包括：前期准备类、设计类、采购类、工程类、取证验收类、产值类和资金类",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "月进度计划的编制要求除了每月实现的形象进度和三级节点,还包括：作为项目施工阶段性计划,准备工作计划须体现下月计划实现所必需的人、材、机、方案、工作面、资源等工作的计划安排及责任人；验收工作计划须体现总进度计划中各分部工程或分部工程节点及计划验收的各分项工程的计划安排及责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "日例会的管理要求有：将周进度计划分解到每天并以碰头会等形式传达给各专业工程师,明确控制要求及措施、以及相关部门及人员的协作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工日志的填写内容包括：根据现场工作内容及材料进场、计划完成情况、机械设备使用情况完成施工日志填报",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目经理月报的生产板块填写内容有：生产板块要按照模板涵盖策划、产值、计划、工况、工艺、工序的变化、验收等内容",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收尾工程三层销项包括：第一层次为主要从工序上销项；第二层次为按部位或房间整修项目、遗漏项目等逐项盘点销项,即关门计划；第三层次为按照验收移交区段划分进行最后扫尾销项,即交钥匙管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竣工验收方案包括：进入收尾阶段前1周,编制验收方案,方案内容包括专项验收、预验收、竣工验收的计划和需要准备的验收条件,建立条件清单,按清单提前准备",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "砂浆用水泥宜选用通用硅酸盐水泥( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分包商定级标准级别划分为四个等级：战略、一级、二级、三级",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司环境目标分为三个层次：管理总目标、年度管理目标、项目绿色施工目标和指标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "禁止55周岁以上男性、45周岁以上女性机械设备特种作业人员进入施工现场从事机械设备安装、拆卸、维保、操作等工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建筑工程质量的适用性即功能,是指工程满足使用目的的各种性能( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工人退场时完成《退场工人工资支付情况说明》,由分包单位收集后报项目劳务管理岗备案,作为分包最终结算依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "临建分级四项标准：建筑面积/里程、总承包合同额、自营合同额、项目定位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年工程管理工作要点中,项目部要扛起治理主要责任,做好执行,确保全年超合同工期项目治理率不低于80%,竣工项目合同工期延期率不超过15%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2024年工程管理工作要点中,刚性执行公司《临时设施标准化管理办法》,进一步强化临建标准化分级管理,从严治理超标临建等违规行为,严肃追责问责,排查一起、处罚一起,年内临建配置合规率达到100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目立面进度图的更新频次要求为每周更新",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目动态风险事项明细表需挂图的岗位为项目经理、项目副经理、计划经理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "换填地基所用材料必须符合下列规定：换填用砂应为中、粗砂,有机质和含泥量均不得大于5％( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,项目中标后,各级企业要秉承跑步进场,快速达标达产理念,由项目上一级企业主要领导牵头,组织项目进场启动会,重点项目提级组织",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分部(子分部)工程应由施工单位项目技术质量负责人进行验收( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,项目管理要以《项目策划书》为纲领,为企业和项目部实施项目管理提供依据,要做好策划、用好策划、管好策划,强化业务协同,优化创新管理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目管理人员要根据项目生产任务细化分解个人工作计划,做好工作落实",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,二三级子企业是项目管理资源(项目经理和其他主要管理人员)、生产资源(分包和物资设备等)配置的责任主体",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,工期计划要根据工作任务重要程度及不同层级管理精度需求,形成三级计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,一级工期计划由企业牵头进行编审,在项目策划阶段完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,二级工期计划由项目经理组织编制并审核,报企业审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,三级工期计划由项目生产负责人组织编制,经项目经理审批后实施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中建八局深化项目管理提升发展质量三年行动方案》中12339的2是指围绕项目两层管理,即围绕公司层和项目层的项目管理,强化法人管项目体制建设",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《中国建筑股份有限公司项目工期管理指导意见》,根据各级节点的延误程度进行分级,分为一般延误、较大延误、严重延误并实行分色预警,预警信息分级推送至相应企业层级处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "涵管顶进施工中,混凝土达到设计强度90%方可顶进( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "交接检验是指由施工方与监理方经双方检查并对可否继续施工做出确认的活动( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2024年生产系统工作的总体要求是：锚定高质量发展目标,全面贯彻落实局和公司2024年工作会的有关要求,围绕局三标杆、两示范战略愿景和637战略布局,坚持以价值创造为核心,以工期管理为主线,进一步夯实项目基础管理,不断提高生产系统服务支撑能力,全面提升履约品质",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "三减两降一提升精益建造理念中一提升指的是提升工程品质",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年,要将内部应急资源作为应急管理的第一要务来抓,加强外部资源对接和维护,做好应急物资、装备储备工作",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局深化项目管理 提升发展质量三年行动工作任务清单中提出要聚焦工期零延误、客户零投诉的双零目标,全面贯彻工期节约就是最大的成本节约之一的理念升,强化工期管理水平",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局深化项目管理 提升发展质量三年行动工作任务清单中提出要制订《项目策划双向考核表》,明确策划组织单位对项目部的考核清单事项,策划组织单位的上一级单位对策划组织单位的考核事项清单",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年,优化分包资源,年内引进主体及二次结构分包50家,专业分包150家,充分发挥资源整合优势,确保各级分包资源储备充足,严禁分包资源超等级、跨专业承接项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程施工现场消防安全技术规范》,施工现场周边道路满足消防车通行及灭火救援要求时,施工现场内可不设置临时消防车道( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "在冬、雨期施工时,不需更换混凝土配合比( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2024年,按照一项一策原则,1月底前制定超合同工期项目治理计划,年底进行治理效果评价,力争全年超合同工期延期率不超过12%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2024年,按照一项一策原则,1月底前制定超合同工期项目治理计划,年底进行治理效果评价,力争全年超合同工期延期率不超过10%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年,要严肃事故调查与责任追究,严格落实一票否决制度,对于反复发生事故的单位主要领导,按照制度给予撤职、降职处分,真正起到有利的震慑和警示作用",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "1+4+N策划管理机制中N指的是N个专项策划(商务、设计、采购等)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "签约额=签约合同额-联合体份额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重点项目策划回头看由公司总部牵头组织,一般项目策划回头看由分公司牵头组织",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "自施合同额=签约合同额-暂估价-暂列金-联合体份额-协同单位份额",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目策划时同时形成策划双向考核表,公司总部负责对项目部需重点落实的策划事项及分公司应对项目部提供的支撑工作进行双向考核；分公司负责对项目部需重点落实的策划事项进行考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "甲指分包按照行业惯例一般理解为在实行建筑工程施工总承包的工程中,对于列入总承包合同暂估价中的专项(专业)工程或非暂估价的专业工程或分部分项工程等,由业主选定专项(专业)分包单位施工的分包方式",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目分阶段策划(重点工程)由公司监管,二级单位主责,项目部配合",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程施工现场消防安全技术规范》,办公用房与宿舍间的防火间距不小于4米( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "水泥混凝土流动性大说明其和易性好(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "半刚性基层的四个实测项目中,关键项目是压实度( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司总部和二级单位要推进营销、履约的有效衔接,项目中标后,市场部应及时完成局营销系统中标交底审批,工程管理部确定项目定位和目标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年是实施十四五规划的关键一年,也是实现公司2+5规划的开局起势之年",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "双向考核的定义：一是策划组织单位对项目部的考核,二是策划组织单位的上一级单位对策划组织单位的考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一级临建策划由公司副总经理(生产)审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二级及以下临建策划由二级单位副总经理(生产)审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司获评局2023年施工生产先进单位,安全考核A档,获评2023年度安全生产平安单位,南京公司获局平安集体",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "EPC项目的项目关键节点包括支护桩基施工图图审合格和开工许可",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设工程质量检测是工程质量检测机构接受委托,依据国家有关法律、法规和工程建设强制性标准,对涉及结构安全项目的抽样检测和对进入施工现场的建筑材料构配件的见证取样检测( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "总进度计划应明确体现出关键线路和关键节点、一级节点、二级节点",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "混凝土碳化主要危害是导致钢筋锈蚀(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总进度计划需体现各分部工程及各分部工程阶段/节点的起止时间和重要措施任务,即总进度计划应编制到分部,体现一二三级节点的分布和计划开始、计划完成时间",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "管道压浆前,事先对采用的压浆料进行试配水泥、高效减水剂、微膨胀剂、矿物掺合料、水等各种材料的称量准确到±2%(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司三减两降一提升精益建造理念中一提升为提升工程品质",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "原则上,工程承包类项目均应签订《项目目标管理责任书》,由主责部门在项目标价分离完成、项目目标管理责任书审批通过且项目经理到岗后两周内组织签订完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级企业要结合项目经济运营指标底线管理要求、内控工期节点指标、人均效能指标等,设置项目季度产值效率奖考核申请底线条件",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目部设置劳务管理工作小组,由项目经理任组长,相关负责人任组员,负责本项目分包资源考察入库、分包进场和分包商考核；实名制设备安装与运营维护；工人进退场管理；工人工资支付管理；劳务维稳和蓝色预警级别的应急纠纷处置工作；设置专(兼)职劳务管理员,负责本项目工人工资支付监督管理的具体工作；当项目不具备设置生产经理条件的,由项目经理履行相关管理职责",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "建筑工程质量事故常有发生,因此,必须采取有效的措施,对常见的质量问题和事故先加以预防,并对已经出现的质量事故及时进行分析和处理( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "试验机开机前的指针即使在零点时,不须进行调整,即可试验(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "自施合同额=签约合同额-暂估价-暂列金-联合体份额",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "各类砂浆均宜采用机械拌和,拌和时间宜为3～5min(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "平面控制网可按精度划分为等与级两种规格,由高向低依次宜为二、三、四等和一、二、三级( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分包商考察时,拟引进项目的项目经理应参与实地考察",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单位(子单位)工程质量竣工验收记录表由建设单位填写,验收结论由施工单位填写( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "回弹法的检测面应为原状混凝土表面,并应清洁、平整,不应有疏松层(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "压入管道的浆液采用搅拌速度不低于1000r/min的高速搅拌设备进行搅拌,浆叶最高速线速度限制在15m/s以内,保证浆液各项指标满足设计和压浆工艺要求,保证管道饱满密实(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "预应力筋张拉锚固后,孔道应尽早压浆,且应在72h内完成,否则应采取避免预应力筋锈蚀的措施( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对危险性较大的模板工程及高大模板支撑体系专项施工方案应按照相关规定组织专家论证( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在进行石灰有效氧化钙和氧化镁的测定时,应将生石灰样品打碎,使颗粒不大于118mm,拌和均匀后用四分法缩减至300g左右,放置瓷研钵中研细(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "钢筋的连接宜采用焊接接头或绑扎接头( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "两焊接接头在钢筋直径的35倍且小于500mm范围内均视为同一截面(  )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当钢结构工程质量经有资质的检测单位检测鉴定达不到设计要求但经原设计单位核定认可能够满足结构安全和施工功能的检验批,可予以验收( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "轴心受拉和小偏心受拉构件不应采用绑扎接头( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沥青针入度愈高,则沥青的感温性指标PI值就愈大(   )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "分包单位综合评价分值=项目部月度平均分×60%+二级单位季度平均分×40%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司管理手册中约定总进度计划编制需根据合同、投标文件、施工图、局工期分级管理办法,参照(局13类《工程总承包计划管控实操指引》系列模块)编制；须体现关键节点一、二、三级节点",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "关于分包商差异化管理中,可同时承接项目数量包含退场结算中初审未完成的项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "永久性普通螺栓应牢固、可靠,外露丝扣不应少于2扣( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "后张预应力混凝土结构或构件的所有管道均应在每个顶点设排气孔及需要时在每个低点设排水孔( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涉及超10人、涉及金额超50万元、或到地级市政府监管部门上访、或涉及欠薪负面舆情、网络自媒体曝光等产生一定关注度并已经扩散的响应级别为III级(二级单位)",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于大坍落度要求检测的扩展度,是指混凝土坍落后形成的最大直径尺寸和与之垂直方向测得的直径之和的平均值(  )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "计划竣工项目按期完成率=考核期内实际竣工项目数量/考核期内计划竣工项目数量×100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "重点项目策划原则上由二级单位负责组织,局工程管理部根据项目情况或由二级单位申请,组织专家进行局级策划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "大体积混凝土工程的施工宜采用分层连续浇筑施工或推移式连续浇筑施工( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "施工单位对其首次采用的钢材、焊接材料、焊接方法、焊后热处理等,应进行焊接工艺评定,并应根据评定报告确定焊接工艺( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "工地实际采用的水泥剂量宜比室内试验确定的剂量多05%-1%(   )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级企业应由主要领导牵头,统筹部署工作搭建各层级1+N责任管控体系,其中N是指配合部门及配合人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合同中要求总承包单位为业主、监理提供临建的,可根据实际酌情增加临建费用,为分包单位提供临建的,可根据分包合同额占比,按照上述要求增加临建费用；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级企业应由主要领导牵头,统筹部署工作搭建各层级1+N责任管控体系,其中1是指牵头部门及责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "业主不提供临建场地需租赁场地的费用不计入临建费用；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "租赁民房用于办公居住的租金计入临建费用；",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "混凝土运至浇筑地点后发生离析、坍落度不符合要求时,经试验人员现场同意后,可加水进行第二次搅拌( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工便道设置为单车道时,宽度宜不小于45m,并设置错车道间距不大于300m错车道宽度不宜小于65m,有效长度不宜小于20m( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },

  {
    question: "工地试验室的运行必须受母体试验检测机构的授权(   )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《项目策划书》的主要内容包括：项目定位；项目管理模式；工期、质量、安全、环保等主要目标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级企业和项目部应构建履约统领、协调各方、通力合作的一核心、两保障、三协同大履约体系,其中,一核心是指合同履约为核心",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级企业和项目部应构建履约统领、协调各方、通力合作的一核心、两保障、三协同大履约体系,其中,两保障是指保障项目质量、保障项目安全",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各级企业和项目部应构建履约统领、协调各方、通力合作的一核心、两保障、三协同大履约体系,其中,三协同是指协同市场开拓、协同项目结算、协同资金回收",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "一级节点按期完成率确保值为60%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "用回弹法检测混凝土强度,计算测区平均值时应从测区的16个回弹值中剔除1个最大值和1个最小值( )",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "产值完成率确保值为95%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "水泥混凝土上加铺沥青面层的复合式路面,水泥混凝土路面结构可不检查抗滑构造深度( )",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "首次资源配置匹配率不低于80%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局企业愿景：世界一流的综合建设服务商",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "无论是使用者付费类PPP项目,还是政府付费类PPP项目,都强调加大政府财政资金对PPP项目投资的介入力度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府和社会资本合作项目应聚焦使用者付费项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府可以通过可行性缺口补助、承诺保底收益率、可用性付费等方式,使用财政资金弥补项目建设和运营成本",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府b不可以通过可行性缺口补助、承诺保底收益率、可用性付费等方式,使用财政资金弥补项目建设和运营成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,不得因采用政府和社会资本合作模式额外新增地方财政未来支出责任",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,可以按照一视同仁的原则,在项目建设期对使用者付费项目给予政府投资支持",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府可以在PPP项目合作中向社会资本承诺保底收益率",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府付费只能按规定补贴运营、不能补贴建设成本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府付费可以补贴建设成本",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(115号文)的要求,政府和社会资本合作应全部采取特许经营模式实施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(117号文)的要求,要最大程度鼓励民营企业参与政府和社会资本合作新建(含改扩建)项目",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(118号文)的要求,市场化程度较高、公共属性较弱的项目,应由民营企业独资或控股",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(119号文)的要求,关系国计民生、公共属性较强的项目,民营企业股权占比原则上不低于35%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(121号文)的要求,少数涉及国家安全、公共属性强且具有自然垄断属性的项目,应积极创造条件、支持民营企业参与",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(122号文)的要求,少数涉及国家安全、公共属性强且具有自然垄断属性的项目,民营企业不可参与",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(123号文)的要求,《支持民营企业参与的特许经营新建(含改扩建)项目清单(2023年版)》以外的项目,民营企业不可参与",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(127号文)的要求,各级财政部门要严格执行预算管理制度,加强地方政府债务管理,加大财会监督力度,严肃财经纪律",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(128号文)的要求,项目实施机构应根据经批准的特许经营方案,通过公开竞争方式依法依规选择特许经营者",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(129号文)的要求,项目实施机构可以根据经批准的特许经营方案,通过非公开竞争的方式选择特许经营者",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(132号文)的要求,特许经营期限原则上不超过40年",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(133号文)的要求,特许经营期限原则上不超过30年",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(134号文)的要求,对政府采用资本金注入方式给予投资支持的特许经营项目,应按照《政府投资条例》有关规定履行审批手续",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(135号文)的要求,对由社会资本方单独投资的项目,应按照《企业投资项目核准和备案管理条例》有关规定履行核准或备案手续",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(136号文)的要求,对由社会资本方单独投资的项目,应依法履行审批手续",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(138号文)的要求,严禁以提前终止为由将特许经营转变为通过建设—移交(BT)模式变相举债",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(139号文)的要求,拟继续采取特许经营模式的,应按规定重新选择特许经营者,同等条件下可优先选择原特许经营者",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(140号文)的要求,拟继续采取特许经营模式的,不需要重新选择特许经营者",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(141号文)的要求,支持在不改变项目地表原地类和使用现状的前提下,利用地下空间进行开发建设,提高土地使用效率",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(142号文)的要求,鼓励特许经营者通过技术创新、管理创新和商业模式创新等降低建设和运营成本,提高投资收益",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(143号文)的要求,项目额外收益主要归特许经营者所有",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于规范实施政府和社会资本合作新机制的指导意见》的通知(144号文)的要求,项目额外收益主要归实施机构所有",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),成本净利润率=税后利润÷税前成本×100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),综合成本净利润率=(项目公司税后利润+所得税后施工总承包利润)÷税前成本×100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),施工总承包利润率=所得税前施工总承包利润÷施工总承包营业收入×100%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),高端房建项目包括投资规模10亿元以上的文化场馆、会议展览、机场港口、城市综合体",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),公司二级单位营销副总应兼职本单位投资/城市更新责任人",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "根据投资类项目营销管理手册(2023),公司二级单位可进行可研审批申请",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "根据投资类项目营销管理手册(2023),投标审批需报至股份公司决策",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),我局综合类投资区域为1+7+3,其中1为核心区域上海",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),我局综合类投资区域为1+7+3,其中7为延伸布局区域山东、江苏、浙江、广东、辽宁、四川、重庆",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),我局综合类投资区域为1+7+3,其中3为点状布局区域西安、合肥和南宁",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),投资公司以高端公建业务、创新创投业务和城镇综合建设为主要拓展领域",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据投资类项目营销管理手册(2023),城市更新项目应重点拓展五大战略区域+两大城市群业务区域范围内目标城市,项目需位于目标城市建成区范围内",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "财政部《关于推广运用政府和社会资本合作模式有关问题的通知》(财金[2014]76号)要求,政府部门应负责基础设施及公共服务PPP项目的价格和质量监管,以保证公共利益最大化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国家发改委要求建立实施PPP项目进展情况按月报送制度,设立PPP项目库,及时跟踪调度梳理汇总项目实施进展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全面开展结算项目尤其是铁路类项目的总包结算策划,全年总包结算不低于300亿元",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "公司加强基础设施项目履约管控,全年交竣工项目不低于6个,一级节点和年度计划完成率均不低于85%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "深化工期治理,年内实现竣工项目52个,一级节点按期完成率95%,计划竣工项目按期完成率100%,高效建造完美履约率达到65%,竣工项目合同工期延期率≤10%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "发布无效成本管控方案,重点聚焦工期、临建、CI等无效成本,成本压降突破1%",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "夯实运营质量,竣工已结算项目当年利润占比不低于86%；加强负流项目管控,确保1231时点正现金流个数占比不低于815%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "智科公司2024年初已经成功申报省级专精特新企业",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企划今年将修订公司奖惩管理办法,结合公司实际优化调整奖惩内容及标准,将奖惩效力真正转化为员工的内驱动力,更好地激发员工工作的积极性、主动性和创造性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企划部今年将对濒临局低效单位底线的二级单位给予警示提醒,并联动相关部门制定提升方案,进行定点帮扶提升,确保在2024年度局三级经营机构评价中实现明显进位",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位要积极与地方住建部门、建筑业协会、行业社团组织牵线搭桥,保持良好互动,促进行业健康发展的同时争取资质、荣誉、惠企政策",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "持续推进基层满意度调查,调查覆盖人员不低于4000人",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "2025年底之前建立覆盖国内业务的数字化流程型组织,并在2030年底前进一步扩展至涵盖公司所有业务的全球化的数字化流程型组织",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "树牢工期节约就是最大的成本节约理念,聚焦二级单位、项目的管理体系和管理行为,狠抓工期执行和考核,持续提升合同工期履约率",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "战略评估是对战略规划及其执行情况进行的系统分析与评价,以确定战略规划的适宜性和战略实施的有效性",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "建造主业是八局赖以生存的根本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "第三曲线业务属于公司规模支撑业务",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "新质生产力是由技术革命性突破、生产要素创新性配置、产业深度转型升级而催生的当代先进生产力,它以劳动者、劳动资料、劳动对象及其优化组合的质变为基本内涵,以全要素生产率提升为核心标志",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "城市公司的组织架构是五部一室()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "战略评估是对战略规划及其执行情况进行的系统分析与评价,以确定战略规划的适宜性和战略实施的有效性()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党委会是企业最高决策机构,按公司法、公司章程的规定履行决策职能()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: " 屋面工程中,细部构造各分项工程每个检验批应全数进行检验()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      " HPB235级钢筋末端应做180°弯钩,其弯弧内直径不应小于钢筋直径的3倍()",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: " 钢筋安装时,受力钢筋的品种、级别、规格和数量必须符合设计要求()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      " 先张法预应力筋张拉后与设计位置的偏差不得大于5mm,且不得大于构件截面短边边长的4%()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: " 墙体节能工程的保温材料在施工过程中应采取防潮、防水等保护措施()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "黄牌警示指公司在日常质量监管活动中,对质量管理问题突出、存在较大质量风险的单位实施公开警示并重点督促整改的管理措施()【科技质量部  《公司质量风险红黄牌警示管理办法》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "质量管理体系主要由质量管理决策体系、质量保证体系、质量监督体系等组成【科技质量部  《科技质量管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "选拔任用党政领导干部必须坚持的原则一是党管干部；二是德才兼备、以德为先,五湖四海、任人唯贤；三是事业为上、人岗相适、人事相宜；四是公道正派、注重实绩、群众公认；五是民主集中制；六是依法依规办事()【出题来源：党委工作部    《党政领导干部选拔任用工作条例》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党风廉政建设责任分工：纪委主体责任,党委监督责任()【出题来源：党委工作部  《关于实行党风廉政建设责任制的规定》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党委(党组)书记全面从严治党第一责任人职责重要工作亲自部署,重大问题亲自过问,重点环节亲自协调,重要案件亲自督办()【出题来源：党委工作部  《党委(党组)落实全面从严治党主体责任规定》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "三严三实：严以修身、严以用权、严以律己,谋事要实、创业要实、做人要实()【出题来源：党委工作部  习近平总书记在十二届全国人大二次会议】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的群众路线是一切为了群众,一切依靠群众,从群众中来,到群众中去()【出题来源：党委工作部  《毛泽东选集》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "乡村振兴战略：坚持农业农村优先发展,按照产业兴旺、生态宜居、乡风文明、治理有效、生活富裕的总要求,建立健全城乡融合发展体制机制和政策体系,加快推进农业农村现代化【出题来源：党委工作部    《习近平总书记在十九大报告》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当需要采取工程质量约谈是,原则上采取逐级约谈【科技质量部  《科技质量管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国特色现代国有企业制度：特就特在把党的领导融入公司治理各环节,把企业党组织内嵌到公司治理结构之中,明确和落实党组织在公司法人治理结构中的法定地位,做到组织落实、干部到位、职责明确、监督严格【出题来源：党委工作部  《关于中央企业在完善公司治理中加强党的领导的意见》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业领导人员必须做到对党忠诚、勇于创新、治企有方、兴企有为、清正廉洁【出题来源：党委工作部   《习近平在全国国有企业党的建设工作会议上的讲话》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国有企业党委(党组)发挥领导作用,把方向、管大局、保落实,依照规定讨论和决定企业重大事项()【出题来源：党委工作部  《中国共产党党组工作条例》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的作风问题,核心是党群关系问题()【出题来源：党委工作部  习近平在中共中央政治局第十六次集体学习时的讲话】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "全面建设社会主义现代化国家的首要任务是高质量发展【出题来源：党委工作部   《党的二十大报告》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的干部是党的事业的骨干,是人民的公仆,要做到忠诚干净担当党按照德才兼备、以才为先的原则选拔干部,坚持五湖四海、任人唯贤,坚持事业为上、公道正派,反对任人唯亲,努力实现干部队伍的革命化、年轻化、知识化、专业化【出题来源：党委工作部   《党章第六章三十五条》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "腐败是危害党的生命力和战斗力的最大毒瘤,反腐败是最彻底的自我革命只要存在腐败问题产生的土壤和条件,反腐败斗争就一刻不能停,必须永远吹冲锋号【出题来源：党委工作部   《党的二十大报告》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "年功津贴月标准为中建系统内认可工龄：0-5年,10元/年；6-15年,15元/年；16-30年,20元/年；31年及以上,25元/年【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "收入证明开具应注明用途,开具的金额应为税前收入,可以超额开具()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "新提任岗位工资标准均执行该岗位档级中的最低档()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "一级建造师应配合取得安全生产考核合格证(B类证)后,方可发放执业资格补贴,未取得的一律不得发放()【人力资源  《执业资格管理办法》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "技术(职称)津贴标准：高级300元/月()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "女员工已参加生育保险的,产假期间的待遇按参保地生育保险有关政策由本人或委托他人申请领取()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2020、2021年度考核等级存在不合格的人员,不予申报2022年度职称评审()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目经理须持有一级造价师证书()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "提任项目副经理岗位,须具备不少于1年的技术类岗位经历()【人力资源  《人力资源管理手册》】",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在务虚会上明确了公司第三曲线的十个业务领域,包含涉水环保、涉铁业务、新基建、高科技厂房等领域(  )【工程研究院,第二第三曲线,2023年董事长工作报告】",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "企业廉洁文化包括高尚的品德,廉洁的操行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范,对中国建筑全体员工的日常行为进行重点引领和倡导；反对行为明确行为底线,对背离中国建筑文化倡导行为进行高压警示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中建信条》既是中建人对七十余载薪火相传信仰信念的高度凝练,也是中建人面向新时代、开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉,总结提炼中国建筑精神,使文化基因与新时代发展相协调,形成中国建筑在新形势下团结奋斗的思想基础,引领企业上下一心,厚植政治优势,汇聚发展动能,以高质量党建引领和保障高质量发展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1997年,在天上无飞鸟、地上石头跑的巴丹吉林沙漠,高质量完成酒泉卫星发射中心建设任务,创出三项世界第一、一项亚洲第一、三项中国第一的建筑奇迹",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2019年,中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中国建筑精神是全体中建人理想信念、责任担当、价值追求、精神风貌、政治品格的概括和凝练,外化为全体中建人共同具有的工作倾向和态度,具体表现为爱国、奋斗、求实、奉献、诚信、创新、超越、共赢等维度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "满意用户、成就员工、回报股东、造福社会共同构成我们使命的主旋律",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "品质保障的管理要点,思想上,要树立品质重于泰山、品质高于一切的坚定信念",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在会议中、与别人洽谈或用餐时,关闭手机或调到静音状态,尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未经报批同意,不擅自以工作职务或单位名义接受媒体采访,不以单位名义、工作身份在网络平台开通个人账号个人账号可随意针对社会热点、敏感议题发表评论不发布涉及企业和工作内容的非公开图片、文字、视频及相关负面敏感信息不造谣、不信谣、不传谣",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中建信条》系统展现中国建筑所坚信并奉行的价值核心,是中国建筑为利益相关方所信任并委以重托的依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "创新是我们的立业之基",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "发展是我们的价值追求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "清欠工作中,因签订还款协议未按时执行被二次投诉的,可以再以签订还款协议方式办结",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "分供合同,合同条款约定总包竣工后支付至结算值的80%是背靠背条款",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "分供合同条款中可以约定供应商不得在工信部投诉,否则罚款2万等条款",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "清欠工作中,项目应当在醒目位置公示投诉举报电话、云筑网平台,建立首位负责制,确保分供商投诉有门、维权有道",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "滑坡体上开挖路壁和修筑抗滑支挡构筑物时,严禁分段跳槽开挖,不得大段拉槽开挖,并随挖、随砌、随填、随夯",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "混合料运输应按指定线路行走,不得超载、超速卸料升斗时,人员不得在车斗的正下方停留",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "无法采用机械成孔且无地下水或有少量地下水,无不良地质的地区,可采用人工挖孔",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "倾斜的沉井应视具体情况进行接高",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "支架在承重期间,不得随意拆除任何受力杆件承重模板支架应在张拉完成后拆除",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "存梁台座应坚固稳定,且应高出地面01m以上,存放地点应设置排水系统",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "梁、板构件移动吊点位置应符合设计规定,经冷拉的钢筋不得用作构件吊环,吊环应顺直,吊绳与起吊构件的交角小于45°时应设置吊梁或起吊扁担",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "架桥机纵向移动应一次到位,不得中途停顿",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "梁、板安装及架桥机移动过孔期间,作业区域下方应设警戒区",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "架设安装时,箱梁在起落过程中应保持水平顶落梁时梁体的两端应同步缓慢起落,并不得冲击临时支座",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "参加索塔施工的人员应体检,患高血压、心脏病、高空作业禁忌症及医生认为其他不适合从事高空作业的人员,不得从事索塔施工作业",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "起重支架在索鞍吊装作业前,应进行荷载试验试吊加载的重量分别为设计吊重的80%、100%、110%和125%,其中110%和125%加载时为静载试验,80%和100%加载时为动载试验",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "单柱墩桥梁防撞护栏应两侧对称施工",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "装配式梁式桥防撞护栏施工前,边梁应与中梁连接牢固",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "压力容器操作人员应按照有关规定经专业机构培训,并应取得相应的从业资格",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "隧道内施工不得使用以柴油为动力的机械设备",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "石质边、仰坡应采用预留光爆层法或预裂爆破法,不得采用深眼大爆破或集中药包爆破开挖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "洞口开挖应先支护后开挖、自上而下分层开挖、分层支护不得掏底开挖或上下重叠开挖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "双侧壁导坑法施工中,应及时施工初期支护并尽早封闭成环",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "双侧壁导坑法施工中,侧壁导坑形状应近似于椭圆形断面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "隧道内不得加工钢筋,钢筋焊接作业在防水板一侧应设阻燃挡板",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "仰拱应分段一次整幅浇筑,并应根据围岩情况严格限制分段长度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "通风管沿线应每100～150m设立警示标志或色灯",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "隧道施工应采取综合防尘措施,并应配备专用检测设备及仪器隧道内存在矽尘的作业场所,每月应至少取样分析空气成分一次、测定粉尘浓度一次",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "瓦斯隧道两个作业面之间应串联通风",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "瓦斯隧道严禁使用黑火药或冻结、半冻结的硝化甘油类炸药",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "瓦斯隧道同一工作面不得使用两种不同品种的炸药",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "地质条件不同的两孔隧道,宜先开挖地质条件较差的隧道,后开挖地质条件较好的隧道",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "连拱隧道施工,中导洞不得作为爆破临空面",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "半幅施工作业区与车行道之间应设置隔离设施应设专人和通信设备,指挥交通,疏导车辆弯道顶点附近不宜堆放物料、机具",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "沙漠地区施工时,外出作业每组不得少于2人,并应配备通信设备",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "海拔3000m以上地区施工作业应严格执行高海拔地区有关规定,制定相应规章制度,并应采取有效保障措施",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《现浇桥梁施工安全十必须(2023版)》,挂篮移位、拆除须提前1天进行高风险作业审批",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据局《现浇桥梁施工安全十必须(2023版)》,混凝土浇筑过程中,至少有1名责任工程师进行现场盯控,必须安排专人对模板进行监测",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业廉洁文化包括高尚的品德,廉洁的操行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范,对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线,对背离中国建筑文化倡导行为进行高压警示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中建信条》既是中建人对七十余载薪火相传信仰信念的高度凝练,也是中建人面向新时代、开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉,总结提炼中国建筑精神,使文化基因与新时代发展相协调,形成中国建筑在新形势下团结奋斗的思想基础,引领企业上下一心,厚植政治优势,汇聚发展动能,以高质量党建引领和保障高质量发展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1997年,在天上无飞鸟、地上石头跑的巴丹吉林沙漠,高质量完成酒泉卫星发射中心建设任务,创出三项世界第一、一项亚洲第一、三项中国第一的建筑奇迹",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2019年,中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中国建筑精神是全体中建人理想信念、责任担当、价值追求、精神风貌、政治品格的概括和凝练,外化为全体中建人共同具有的工作倾向和态度,具体表现为爱国、奋斗、求实、奉献、诚信、创新、超越、共赢等维度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "满意用户、成就员工、回报股东、造福社会共同构成我们使命的主旋律",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "品质保障的管理要点,思想上,要树立品质重于泰山、品质高于一切的坚定信念",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在会议中、与别人洽谈或用餐时,关闭手机或调到静音状态,尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未经报批同意,不擅自以工作职务或单位名义接受媒体采访,不以单位名义、工作身份在网络平台开通个人账号个人账号可随意针对社会热点、敏感议题发表评论不发布涉及企业和工作内容的非公开图片、文字、视频及相关负面敏感信息不造谣、不信谣、不传谣",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中建信条》系统展现中国建筑所坚信并奉行的价值核心,是中国建筑为利益相关方所信任并委以重托的依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "创新是我们的立业之基",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "发展是我们的价值追求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1994年3月31日建设部原部长萧桐在湖北省武汉市建委领导的陪同下,视察神龙汽车总装车间工程,对总装车间的建设速度和工程质量表示满意5月29日国务院副总理李岚清视察公司承建的武汉神龙汽车有限公司工地,对施工速度和质量表示满意7月7日法国工业部长视察公司承建的武汉神龙汽车有限公司工地,称赞中国工人好样的9月28日中建总公司副总经理孟广水等视察公司承建的武汉神龙汽车有限公司总装车间,对参加施工的职工给予表扬10月18日上午10时,中共中央总书记、国家主席江泽民视察公司承建的武汉神龙汽车有限公司总装车间,对工程建设表示满意",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "礼仪九章是对全体员工的关键行为和习惯的倡导及要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "行为十典是中国建筑员工的礼仪规范,按照全球化公司的标准,阐明了员工在商务社交场合应注意的礼仪及行为细节,是中国建筑员工提高职业修养、提升沟通技能、树立企业形象的礼仪遵循",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "行为十典中关键行为明确标准规范,对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线,对背离中国建筑文化倡导的行为进行高压警示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团三级及以下单位层面,遵照中国建筑企业文化管理组织设计的相关规定,按照二级单位的要求进行文化管理组织的设计,并承担履行相应职责",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团宣传思想文化工作领导小组审定企业文化建设总体目标、中长期发展规划、年度工作计划和重大事项",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "集团层面,总部党建工作部(企业文化部)依据集团党组关于企业文化建设的总体安排,编制并完善集团企业文化中长期发展规划、年度工作计划,规划年度重大事项,督促二级单位制定本单位的企业文化年度工作计划",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团层面,总部党建工作部(企业文化部)制定部门文化建设工作计划与专项文化推进计划,在职能线统筹推进、落实",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "集团二级单位党组织负责审定落实本单位企业文化建设年度工作计划(可列入年度党建/宣传思想/思想政治工作计划中)、年度重大事项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团二级单位层面,企业文化管理部门制定并落实企业文化建设年度工作计划(可列入年度党建/宣传思想/思想政治工作计划中),规划年度重大事项,引领三级及以下单位企业文化建设方向,并提供实施指导",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团二级单位层面,企业文化管理部门落实上级职能部门专项文化建设工作计划或方案,实施文化建设工作计划",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "集团党建工作部(企业文化部)负责收集整理全系统对《中建信条》修订的意见和建议,将《中建信条(修订版)》提交到集团宣传思想文化工作领导小组研究,报请集团党组审批经集团党组审定后方可面向全系统发布、贯彻落实",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团三级及以下单位原则上不能编制文化手册,只能制定文化执行手册,重在贯彻集团核心文化理念和二级单位特定理念,在路径和方法上体现特色",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团二级单位整合及丰富企业文化物质载体,完善企业文化设施,搭建企业文化交流分享平台,规范企业文化传播渠道",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "集团二级及以下单位制定并落实企业文化宣贯方案,将企业文化纳入各级党委工作部的培训体系中,开展相关企业文化宣贯",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国建筑集团有限公司企业文化建设管理规定(2024版)》定自2024年1月5日起施行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国建筑集团有限公司企业文化建设管理规定(2024版)》由集团党建工作部(企业文化部)负责解释、修订",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "CI管理流程中,项目等级审批在项目进场前参照临建等级审批执行,一级项目逐级报公司总经理审批,二级及以下项目报公司副总经理(生产)审批",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "CI管理流程中,公司管理平台立项20天内,由项目经理根据项目策划组织编制CI及文明施工投入方案,方案应包括项目投入内容清单、配置标准、资金来源、投入概算、使用周期、管理职责分工等内容",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "CI管理流程中,项目方案审批完成后3天内依据项目方案,编制投入预算,并提交预算审批表",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "企业廉洁文化包括高尚的品德,廉洁的操行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范,对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线,对背离中国建筑文化倡导行为进行高压警示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中建信条》既是中建人对七十余载薪火相传信仰信念的高度凝练,也是中建人面向新时代、开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉,总结提炼中国建筑精神,使文化基因与新时代发展相协调,形成中国建筑在新形势下团结奋斗的思想基础,引领企业上下一心,厚植政治优势,汇聚发展动能,以高质量党建引领和保障高质量发展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1997年,在天上无飞鸟、地上石头跑的巴丹吉林沙漠,高质量完成酒泉卫星发射中心建设任务,创出三项世界第一、一项亚洲第一、三项中国第一的建筑奇迹",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2019年,中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中国建筑精神是全体中建人理想信念、责任担当、价值追求、精神风貌、政治品格的概括和凝练,外化为全体中建人共同具有的工作倾向和态度,具体表现为爱国、奋斗、求实、奉献、诚信、创新、超越、共赢等维度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "满意用户、成就员工、回报股东、造福社会共同构成我们使命的主旋律",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "品质保障的管理要点,思想上,要树立品质重于泰山、品质高于一切的坚定信念",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在会议中、与别人洽谈或用餐时,关闭手机或调到静音状态,尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未经报批同意,不擅自以工作职务或单位名义接受媒体采访,不以单位名义、工作身份在网络平台开通个人账号个人账号可随意针对社会热点、敏感议题发表评论不发布涉及企业和工作内容的非公开图片、文字、视频及相关负面敏感信息不造谣、不信谣、不传谣",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中建信条》系统展现中国建筑所坚信并奉行的价值核心,是中国建筑为利益相关方所信任并委以重托的依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "创新是我们的立业之基",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "发展是我们的价值追求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "企业廉洁文化包括高尚的品德,廉洁的操行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范,对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线,对背离中国建筑文化倡导行为进行高压警示",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中建信条》既是中建人对七十余载薪火相传信仰信念的高度凝练,也是中建人面向新时代、开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉,总结提炼中国建筑精神,使文化基因与新时代发展相协调,形成中国建筑在新形势下团结奋斗的思想基础,引领企业上下一心,厚植政治优势,汇聚发展动能,以高质量党建引领和保障高质量发展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1997年,在天上无飞鸟、地上石头跑的巴丹吉林沙漠,高质量完成酒泉卫星发射中心建设任务,创出三项世界第一、一项亚洲第一、三项中国第一的建筑奇迹",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2019年,中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中国建筑精神是全体中建人理想信念、责任担当、价值追求、精神风貌、政治品格的概括和凝练,外化为全体中建人共同具有的工作倾向和态度,具体表现为爱国、奋斗、求实、奉献、诚信、创新、超越、共赢等维度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "满意用户、成就员工、回报股东、造福社会共同构成我们使命的主旋律",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "品质保障的管理要点,思想上,要树立品质重于泰山、品质高于一切的坚定信念",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在会议中、与别人洽谈或用餐时,关闭手机或调到静音状态,尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未经报批同意,不擅自以工作职务或单位名义接受媒体采访,不以单位名义、工作身份在网络平台开通个人账号个人账号可随意针对社会热点、敏感议题发表评论不发布涉及企业和工作内容的非公开图片、文字、视频及相关负面敏感信息不造谣、不信谣、不传谣",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中建信条》系统展现中国建筑所坚信并奉行的价值核心,是中国建筑为利益相关方所信任并委以重托的依据",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "创新是我们的立业之基",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "1996年6月,中建总公司在建筑行业率先导入CI战略,进行了CI的设计和推广,以内联素质、外塑形象推动企业发展",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2000年12月,中建总公司发出《中建总公司行为识别规范手册》和《中建总公司理念识别规范手册》",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1999年4月,中建八局承建的酒泉卫星发射基地被评为国家科技进步一等奖,为中国建筑行业第一个科技进步奖",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2010年9月,中国建筑向国家商标局申请注册的中国建筑和中国建筑+CSCEC各45个类别的商标获得批准,中国建筑成为中国建筑股份有限公司的注册商标",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2008年5月12日,汶川地震在抗震救灾过程中,中国建筑为四川、甘肃等地援建临时安置型住房110万平方米,居全国之最中国建筑近年来在地震灾区的51个竣工项目、71个在建项目,建筑结构主体均未出现问题",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在北京奥运会工程建设中,中建系统共承建了北京奥运会40%的场馆及配套设施建设任务",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2011年2月,利比亚战乱,经过精心组织,中国建筑成功完成10241名中建驻利比亚中国员工及957名孟加拉、越南籍员工的利比亚大撤离时任中建八局副局长张作合主持本次大撤离工作",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "1994年6月7日,中国工程院公布首批院士(96人)名单,中国建筑西北设计研究院总建筑师、全国工程勘察设计大师张锦秋当选为工程院院士这是中建历史上第一个院士",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2013年12月19日,中国工程院公布2013年院士增选结果,中建总公司肖绪文同志当选院士这是中建历史上第二个院士",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2024年4月组织公司领导班子集体学习中建集团文化133工作体系要求和中建集团2024版手册",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各基层党支部2024年3月依托三会一课、主题党日等形式,通过集中学习、专题研讨、座谈交流等形式,组织党员开展专题学习",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "人力资源部要将中建集团2024版手册作为公司内部各类培训的基础内容,纳入新员工入职培训、党员培训等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "海外分公司要在5月组织好海外员工学习《中建信条十典九章(海外文化融合版)》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党委工作部要遵循中建集团2024版文化手册,局新版《铁军宣言》文化手册,修订公司执行文化手册并报局审阅,7月完成发布梳理2015年后三公司还有在局甚至中建系统多少个第一,打造个性化",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据中建集团2024版手册内容,修订CI规范,更新机关挂画、项目图牌,确保各级机关总部、项目部实现文化理念全覆盖在建项目6月完成,新开项目按新标准执行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企划部要将2024版手册中国建筑精神、企业使命、企业愿景、核心价值观等提法与阐释,融入企业发展战略和管理制度中,使各项制度与企业文化理念保持一致",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党委工作部要按照中建集团争做文明有礼中建人活动要求,宣贯八局相关倡议书,组织三公司员工制作主题标语,主题海报并积极投稿,活动9月完成",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党群系统要组织项目部积极参与六有六强项目文化示范点创建宣贯新版示范点创建标准,细化创建规定性动作,督促督导各单位指导项目开展好项目经理接待日、分包分供方沟通会、文明工地、文明班组评比等形式多样的主题活动,做好公司年度示范点打擂评比,并推荐参加局擂台赛等",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党群系统要组织开展干部职工网络行为专项培训和舆情应对专项培训,组织《干部职工媒体采访行为规范十条》专项考试,开展干部职工言行、媒体、网络行为、个人账号管理等专项治理,规范公司员工职业行为,提升全员媒介素养与社会沟通能力最迟9月完成",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司各业务系统、各条线结合业务特点、年度工作,将文明有礼内容纳入学习培训、宣讲宣教、竞赛比赛中",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "掘选树先进典型和身边榜样,培育选树宣传一批在践行中建文化、助人为乐、见义勇为、诚实守信、敬业奉献、孝老爱亲等方面做出表率的身边榜样,在七一之前完成",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "加强贯彻落实中建集团文化深植133工作体系组织领导由党委书记任第一责任人,分管领导任直接责任人,班子其他成员按照一岗双责要求抓好分管部门和领域的文化建设工作,党委工作部牵头组织协调落实",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司总部各部门要认真贯彻落实集团要求,按照公司工作方案,结合本部门工作,制定切实可行的工作计划,明确时间节点,细化责任分工,确保宣贯工作取得实效",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党委工作部要将总结推广工作中涌现的好经验、好做法,组织评选优秀案例,并将工作开展情况纳入月度考核和年度党建工作责任制考核",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的二十大报告指出，以人为本是立党为公、执政为民的本质要求。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党的二十大报告指出，党的十八大以来，我们创立了新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义的基本方略，提出一系列治国理政新理念新思想新战略，实现了马克思主义中国化时代化新的飞跃。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国共产党第二十次全国代表大会，是在全党全国各族人民迈上全面建设社会主义现代化国家新征程、向第二个百年奋斗目标进军的关键时刻召开的一次十分重要的大会。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党章规定，中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "党章规定，中国共产党是中国共产主义的先锋队。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "党章规定，发展党员必须把德才兼备、以德为先的原则放在首位。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党章规定，对党员的纪律处分有五种，从轻到重依次是警告、严重警告、撤销党内职务、留党察看、开除党籍。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《关于新形势下党内政治生活的若干准则》规定，必须把改革作为开展党内政治生活的首要任务。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《关于新形势下党内政治生活的若干准则》规定，每个党员要把维护党的集中统一，严格遵守党的纪律，作为自己言论和行动的准则。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《关于新形势下党内政治生活的若干准则》规定，坚持党内民主平等的同志关系，党内一律称同志。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党廉洁自律准则》规定，中国共产党全体党员和各级党员领导干部必须遵纪守法，接受监督，永葆党的先进性和纯洁性。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "最新的《中国共产党纪律处分条例》自2018年10月1日起施行。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》仅适用于违犯党纪应当受到党纪追究的党员。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律处分条例》规定，党员干部受到党纪处分，需要同时进行组织处理的，党组织应当按照规定给予组织处理。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于在立案审查中因涉嫌违犯党纪被免职的党员，审查后依照本条例规定应当给予撤销党内职务处分的，应当按照其原任职务给予撤销党内职务处分。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于受到改组处理的党组织领导机构成员，除应当受到撤销党内职务以上处分的外，均自然免职。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党员有嫖娼或者吸食、注射毒品等丧失党员条件，严重败坏党的形象行为的，应当给予开除党籍处分。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党员行为虽然造成损失或者后果，但不是出于故意或者过失，而是由于不可抗力等原因所引起的，酌情追究党纪责任。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "对于违纪行为所获得的经济利益，应当收缴或者责令退赔。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "参加迷信活动或者个人搞迷信活动，造成不良影响的，给予严重警告或者撤销党内职务处分。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "违反有关规定自定薪酬或者滥发津贴、补贴、奖金、福利等，对直接责任者和领导责任者，情节较轻的，给予批评教育、责令检查。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定，发现领导干部有思想、作风、纪律等方面苗头性、倾向性问题的，有关党组织负责人应当及时对其诫勉谈话。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党党内监督条例》规定，下级纪委至少每年向上级纪委报告1次工作，并进行述职。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      '《关于加强对"一把手"和领导班子监督的意见》规定，落实纪检机关、组织部门负责人同下级“一把手”谈话制度，发现一般性问题及时向本人提出，发现严重违纪违法问题向同级党委主要负责人报告。（）',
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      '《关于加强对"一把手"和领导班子监督的意见》规定，领导班子和领导干部对来自其他领导干部家属亲友的违规干预行为应当坚决抵制，视情况需要向党组织报告。（）',
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党巡视工作条例》规定，巡视期间，发现被巡视地区、单位存在群众反映强烈、明显违反规定并且能够及时解决的问题，巡视组可直接向被巡视党组织或者其主要负责人提出处理意见。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },

  {
    question:
      "《中国共产党问责条例》规定，问责对象是党组织、党的领导干部，重点是党委（党组）、党的工作机关及其领导成员，纪委、纪委派驻（派出）机构及其领导成员。()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中国共产党问责条例》规定，对党组织问责的，可以不对该党组织中负有责任的领导班子成员进行问责。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国共产党纪律检查委员会工作条例》规定，各级纪律检查委员会不能审查同级党委委员和同级纪委委员。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党组织处理规定（试行）》，有关机关、单位在执纪执法、日常管理监督等工作中发现领导干部存在需要进行组织处理的情形，可以向党委(党组)报告，或者向组织(人事)部门提出建议。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党组织处理规定（试行）》，组织处理可以单独使用，也可以和党纪政务处分合并使用。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国共产党组织处理规定（试行）》，组织处理，是指党组织对违规违纪违法、失职失责失范的领导干部采取的岗位、职务、职级调整措施，包括停职检查、调整职务、责令辞职、免职、降职。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员个人有权决定本级领导人员的薪酬和住房补贴等福利待遇。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，未经企业领导班子集体研究，国有企业领导人员不能擅自决定捐赠、赞助事项。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员即使离职后也不得接受管理和服务对象提供的物质性利益。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员个人可以在本企业的同类经营企业中投资人股。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员经批准可以在其他企业中兼职，但不能擅自领取薪酬。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业应当将涉及职工切身利益的事项向职工代表大会报告。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员在企业发生非政策性亏损或者拖欠职工工资期间，不得购买或者更换小汽车、公务包机、装修办公室、添置高档办公设备等。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业需经职工代表大会讨论通过的事项，应当经职工代表大会讨论通过后实施。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，履行国有资产出资人职责的机构和审计部门应当依法开展各项审计监督，严格执行国有企业领导人员任期和离任经济责任审计制度。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员受到免职处理的，两年内不得担任国有企业的领导职务。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员违反《国有企业领导人员廉洁从业若干规定》获取的不正当经济利益，应当责令清退。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员因违反《国有企业领导人员廉洁从业若干规定》获取的不正当经济利益，给国有企业造成经济损失的，应当依据国家或者企业有关规定承担经济赔偿责任。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国公职人员政务处分法》规定，记过处分的期间是18个月。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国公职人员政务处分法》规定，被撤职的公务员，按照规定降低职务、职级、衔级和级别，同时降低工资和待遇。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国公职人员政务处分法》规定，公职人员受到降级、撤职政务处分，在政务处分期内有悔改表现，并且没有再发生应当给予政务处分的违法行为的，政务处分期满后，恢复原职务、职级、衔级、级别、岗位和职员等级、职称、薪酬待遇。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国刑法》规定，涉嫌巨额财产来源不明，数额在10万元以上的，应予立案。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国刑法》规定，因被勒索给予国家工作人员以财物，没有获得不正当利益的，也是行贿。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中华人民共和国刑法修正案（十二）规定，对犯行贿罪的，情节特别严重的，或者使国家利益遭受特别重大损失的，处五年以上有期徒刑或者无期徒刑，并处罚金或者没收财产。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国公司法》规定有限责任公司的注册资本为在公司登记机关登记的全体股东认缴的出资额。全体股东认缴的出资额由股东按照公司章程的规定自公司成立之日起三年内缴足。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国公司法》规定股东会的议事方式和表决程序，除本法有规定的外，由公司章程规定。股东会作出决议，应当经代表三分之二以上表决权的股东通过。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国公司法》规定有限责任公司可以按照公司章程的规定在董事会中设置由董事组成的审计委员会，行使本法规定的监事会的职权，同时需要设置监事会或者监事。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "习近平总书记关于党的自我革命的重要思想作为认识论，深刻回答了我们党“怎样推进自我革命”的重大问题，是新时代新征程深入推进全面从严治党、党风廉政建设和反腐败斗争的根本遵循。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "习近平总书记在中央纪委三次全会强调，党的十八大以来，在推进全面从严治党的伟大实践中，我们不断进行实践探索和理论思考，在毛泽东同志当年给出“让人民来监督政府”的第一个答案基础上，给出了第二个答案，那就是不断推进党的自我革命。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "习近平总书记在中央纪委三次全会强调，纪检监察机关是推进党的自我革命的重要力量，肩负特殊政治责任和光荣使命任务，必须始终做到绝对忠诚、绝对可靠、绝对纯洁。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2023年，集团持续塑强品牌引领力，深入实施“中国建筑品牌引领行动”，深化推广“中国建筑价值观引领型品牌建设模式”，落实央企跨文化融合等专项任务，深化“鲁班工匠计划”工作机制，联合中外主流媒体开展“建证幸福”等主题传播。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "下列对酒驾与醉驾的说法是否正确：驾驶员血液中乙醇含量超过20mg/100ml即为“酒驾”，属于违法行为；超过80mg/100ml则构成醉驾，属于犯罪行为。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "留党察看最长不超过两年。党员在留党察看期间没有表决权和被选举权，但具有选举权。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各境外企业根据规模，分别设置首席合规官、合规官、合规专员，统称为合规官。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "党员留党察看处分分为留党察看一年和留党察看二年。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党员被立案审查期间，可以批准其出差、出国(境)、辞职，或者对其交流、提拔职务、晋升职级、进一步使用、奖励，或者办理退休手续。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中国建筑廉洁文化理念是“崇德善建 尚廉筑基”。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "局廉洁文化品牌是“铁军清风”。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "被谈话函询的党员干部个人应当在民主生活会、组织生活会上就本年度或者上年度谈话函询问题进行说明，讲清组织予以采信了结的情况；存在违纪问题的，应当进行自我批评，作出检讨。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "二级单位纪律检查委员在同级党的委员会和上级纪律检查委员会双重领导下进行工作。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑集团有限公司境外反贿赂腐败指南》有关规定，集团不参与驻在国的任何政治活动，禁止任何资金或实物形式的政治捐款或捐赠。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "合规管理监督机构是加强境外廉洁合规监督的专门机构，在同级领导班子和上级合规管理监督机构双重领导下进行工作。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "纵容、默许配偶子女及其配偶等亲属、身边工作人员和其他特定关系人利用党员干部本人职权或者职务上的影响谋取私利，情节较轻的，给予警告或者严重警告处分;情节较重的，给予撤销党内职务或者留党察看处分;情节严重的，给予开除党籍处分。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党的二十大报告鲜明提出要健全党统一领导、全面覆盖、权威高效的监督体系，集团成立了党风廉政建设和反腐败工作领导小组，加强监督力量的统筹领导，探索把协调小组作为统筹监督的有效平台和重要抓手，促进各类监督力量贯通融合。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据中央八项规定精神，集团党组结合实际，制定了包括改进调查研究工作、精简会议活动、精简文件简报、规范因公临时出国（境）活动、改进新闻报道、厉行勤俭节约、切实改进作风、改进督促检查等八个方面的具体办法。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中国建筑集团有限公司超英廉洁文化示范点建设实施细则》，“七项权力”是指审核权、人事实权、采购实权、放行实权、计量实权、财务实权、拥有关键信息权。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "董事会授权董事长决策的事项，董事长一般应当召开专题会集体研究讨论。董事会授权总经理决策的事项，总经理一般采取总经理办公会议等会议形式集体研究讨论。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "上市公司董事、监事和高级管理人员应当保证公司及时、公平地披露信息，以及信息披露内容的真实、准确、完整，不存在虚假记载、误导性陈述或者重大遗漏。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "进入董事会的党组织领导班子成员按照党组会形成的意见发表意见。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中央八项规定及其实施细则精神在内部管理活动中要严格贯彻执行，但在市场营销和外部招待中允许根据需要适当进行突破。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "重大经营管理事项，必须经党委（党组）前置研究讨论后，再由董事会作出决定，或审议通过后按程序报股东会或国资委决定。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对在信访工作中推诿、敷衍、拖延、弄虚作假造成严重后果的机关、单位及其工作人员，应当向有管理权限的机关、单位提出追究责任的建议。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导班子主要负责人是职责范围内的党风廉政建设第一责任人，应当重要工作亲自部署、重大问题亲自过问、重点环节亲自协调、重要案件亲自督办。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "总部办公场所建设项目管理设置例会机制和联合验收机制，总部有关部门、参建单位共同参与执行。()",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "因工程变更导致合同金额变化超过总金额5%以上时，需及时签订工程合同补充协议，变更事项应根据项目审批权限重新申报审批。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "销毁国家秘密载体应当履行清点、登记、审批手续，并送交保密行政管理部门设立的销毁工作机构或者保密行政管理部门指定的单位销毁。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涉密人员脱密期内不得在境外驻华机构或外商独资企业工作，不得为境外组织或人员提供劳务咨询或者其他服务。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业可以使用自主开发的企业微信、内部办公程序等即时通讯工具处理、存储、传输涉密信息或内部敏感信息。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "不得在未经审批的涉密信息系统中存储、处理和传输国家秘密信息。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "保密要害部位、涉密会议和活动场所，禁止带入便携式电子设备，并要设置显著的禁止带入标识。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "加强和改进思想政治工作，要认真落实定期分析报告制度，党组（党委）每年至少召开1次党组（党委）会议进行研究。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "行为十典主要包括笃诚守信、专业敬业、守正创新、规范高效、品质至上、协同联动、主动担当、接续奋斗、清正廉洁、绿色人文。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "礼仪九章主要包括尊重平等、真诚宽容、适度适宜、自律自省、协调、有序、规范、适时、随俗。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党员领导干部参加民主生活会后仍需参加所在党支部（党小组）组织生活会。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "民主生活会列席人员可以发言，对领导班子及其成员提出批评或者建议。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "战略规划制订完成并进入实施阶段后，公司各层级在有效期内原则上应保持战略规划的稳定性，如遇外部宏观经济形势和行业政策等外部环境或内部条件发生重大变化的情况，也应监控其履行完毕。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建股份及下属各机构投资的参股企业，企业命名可以冠以“中建”字号。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "八局对“瘦身健体、提质增效”工作取得成效的二级企业，当年在完成低效亏损任务基础上，超额注销长期经营法人机构的，允许增加同等户数新设长期经营法人机构指标数。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未来在“房住不炒”的大背景下，城市建设市场分化加剧，绿色化、智能化将成为房地产业发展的主旋律。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国建筑是国务院国资委正式确定的全国建筑业唯一一家“创建世界一流示范企业”。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "近年来，中国建筑的基础设施业务取得突飞猛进的发展，已成为国内基础设施领域的主力企业。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "“一创五强”战略目标和“一六六”战略路径是不可分割的整体，都是中建集团战略体系的重要组成部分。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "房建是中建集团的首位优势业务，《中国建筑“一六六”战略路径》提出要“塑强房建卓越优势”。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国建筑“一六六”战略路径》中的“六个塑强”，围绕房建、基建、地产、设计、海外五大业务及业态融合，明确提出了锻长板、补短板、育新板的路径。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "八局“637”战略布局发布于2022年。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司创新大会每季度召开一次。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司第二曲线业务有涉水与环保、涉铁业务、新型基础设施、高科技厂房、城市更新、军民融合、机电安装、高端装饰。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "ESG是指环境、社会和公司治理三个方面。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司第三曲线业务有全过程咨询、新型建材、绿色低碳、智能建造、智慧运维和数字产业。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },

  {
    question:
      "根据《中建集团领导人员管理规定》，采取内部推选方式确定考察对象的，应当经过民主推荐。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据中央《党委（党组）讨论决定干部任免事项守则》，讨论任免事项时，与会成员应当逐一发表同意、不同意、缓议等明确意见，党委主要负责人应最后表态。意见分歧较大时，暂缓进行表决。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据领导人员选拔任用有关工作要求，在提请党组织会议研究讨论前，不准临时动议决定领导人员任免，不得临时调整人选任免意见，如变更或者增加人选，调整拟任职单位或者职务等。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据中央《关于在干部教育培训中进一步加强学员管理的规定》，领导人员在培训期间，班级、小组可以以集体活动为名进行聚餐，增加班级凝聚力。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据中央《关于严格规范领导干部参加社会化培训有关事项的通知》，领导人员可以自费读EMBA。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据中央有关要求，对于暂未成立党组织的新设企业，可以通过总经理办公会议讨论决定领导人员任免事项。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中建集团领导人员管理规定》，各子企业党组织应及时向集团报告领导人员分工，未经集团同意不得调整。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中建集团关于加强境外机构（项目）领导岗位和关键岗位人员监督管理细则（试行）》，境外机构（项目）领导岗位和关键岗位人员可以根据个人需要办理国（境）外永久居留资格、长期居留许可或者国籍。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据领导人员选拔任用有关工作要求，中央企业所属企业领导人员正在接受纪检监察机关、司法机关调查，履行出资人职责的机构专项核查，或者正在接受审计时，不得辞去公职。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中建集团关于禁止与管理人员亲属所办企业发生业务往来的管理规定》，禁止管理人员本人经商办企业，禁止集团所属各单位（含项目部）与管理人员亲属、以及与管理人员本人有共同利益关系的其他人员所办企业发生业务往来。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "填报领导人员有关事项时，有单独产权证书的车库、车位、储藏间等不需要进行填报。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《干部教育培训工作条例》，干部教育培训以深入学习贯彻习近平新时代中国特色社会主义思想为主题主线，以党的理论教育、党性教育和履职能力培训为重点，注重知识培训，全面提高干部素质和能力。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "采取统一调度等方式保障负责人公务活动用车的，不属于为负责人配备公务用车。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导人员原则上配置使用一处办公用房，确因异地工作需要另行配置办公用房的，应当履行内部决策程序。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "除在国家规定标准内参加基本社会保险，享受企业年金、补充医疗保险和住房公积金等福利待遇之外，企业负责人不得违规领取其他福利性货币收入，不得在国家规定之外领取由地方政府或有关部门发放的奖金及实物奖励，不得在兼职企业（单位）领取工资、奖金、津贴等任何形式的报酬。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "担任正职领导人员后，其亲属可以新进入其任职的企业工作。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "开展商务宴请可以提供用野生保护动物制作的菜肴。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据费用管理合规性要求，在参与领导允许的情况下可以消费高档白酒。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据费用管理合规性要求，在参与领导允许的情况下可以馈赠少量现金。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "严禁任何形式的虚增收入、虚列利润以及成本费用不入账的行为。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位现金收入要及时入账，不得坐支现金，不得私设“小金库”公款私存，不得白条抵库、贪污挪用、账外设账，严禁现金收入不入账。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "原则上，不得向业主方提供现金履约保证金。确因承揽工程建设项目需要向业主方支付现金履约保证金、合作诚意金（不含土地竞买保证金）的，各单位应履行集体决策程序及资金支付审批程序。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据中建八局有收款权应收账款催收“246”标准，业主逾期6个月以上未支付款项，应启动法律手段。对流动性暂时出现困难、但确有必要继续合作的项目，由实施单位提起申请，报上级主管部门联签后纳入监管台账。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对业主单位拖欠到期账款超过1000万元且时长超过6个月，经协商仍不能支付或达成付款协议的大额负流项目，应当实施垫资熔断。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "按照《中建八局清理拖欠企业账款专项方案》要求，因拖欠账款发生重大舆情或造成恶劣影响、清欠过程中激化矛盾、出卖单位利益或不沟通不解决引导投诉或起诉情形，将按照领导干部管理权限，视情形对相关责任领导采取批评教育、责令书面检查、通报批评、诫勉、停职、调离工作岗位、降职、改任非领导职务、责令辞职、免职等组织处理，扣减班子成员绩效薪等形式进行追责。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "严禁与系统外单位或个人发生无真实交易的资金往来。严禁通过虚构商品贸易、工程分包合同等方式办理各类委托付款或开具各类票据进行贴现、承兑，违规套取银行信用。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各二级子公司可以授权三级子公司以下法人公司或非法人机构开展融资业务。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各二级子公司及所属公司可以为下属合资、参股公司提供全额担保。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据国资委《关于加强中央企业融资担保管理工作的通知》（国资发财评规〔2021〕75号），中央企业严禁对集团外无股权关系企业担保，严禁对参股企业超股比担保。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "严禁对集团外无股权关系企业提供借款；原则上对金融子企业和未纳入合并范围的参股企业不得提供借款，确有必要的需严格履行审批手续。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "银行印鉴保管人可为非A类员工编号人员。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "局名义项目农民工工资专户，原则上预留“中国建筑第八工程局有限公司农民工工资专用账户财务专用章（或带编号）”，和二级单位主要负责人人名章。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "二级单位之间资金拆借仅需拆借双方主要领导同意。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "上年度营业收入5亿以下的子企业，原则上不得开展授信业务。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "系统内单位负责设计或施工的投资项目，投资项目公司与施工项目部（施工单位）应按照“投建分离”原则分别设立，不能“两块牌子、一套人马”。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "子企业应该在经股份公司批准的年度投资预算范围内开展投资业务，不得超预算投资和计划外投资。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据国资委34号令有关规定，中央企业应当明确投资决策机制，对投资决策实行统一管理，向下授权投资决策的企业管理层及原则上不超过两级。因此，集团对子企业的投资授权可以转授给三级子企业。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "不得投资股份公司及局境内投资项目负面清单、境外投资项目负面清单及上级机构相关政策法规、通知等文件规定的禁止类项目。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "股权投资带动总承包模式下，投资带动比下降超经批准的《可研》测算值15%目低于投资底线标准属于投资重大变更。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "投资项目后评价工作原则上应在达到评价条件后3个月内完成，经批准的《项目可行性研究报告》中，如项目分期进行实施，每一期达到后评价规定的时点，则分期进行后评价。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "竣工考核具备的条件有项目已通过竣工验收，总分包结算已审定，实际成本已核定，债权债务已确认；项目的应付账款必须核实无误，应附有与账面余额相符的确认单并按应付账款单位分列明细；项目其他应收款（含备用金）必须清理完毕，不留余额；项目独立对外缴纳税费的，应有缴纳税费的票据；项目竣工资料已移交完毕。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工程计量确权管控结算阶段注意事项，全面核实项目发生的实际成本，梳理确权产值、自施产值、实际成本之间的关系，制定上报值、目标值、保底值，签订结算目标责任书。制定结算资料收集、结算书编制及报送计划，分析结算中可能存在争议问题，制定施工图纸、设计变更、签证等量价变化子目的核对方案，提升结算效率。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "商务策划的动态监督管控机制指一项目一策划、凡策划必有清单、凡清单必有责任落实。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "久竣未结项目专项治理关于“四最”运营模式指的是竣工结算最快、工程成本最优、过程收款最高、利润结构最佳。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "法律部门是合规管理的责任主体，履行“第一道防线”职责，按规定承担本部门经营管理合规性的主体责任。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "重大决策事项未经首席合规官审核签字，不得提交决策会议决策。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "股份公司仅负责管理“中建”“CSCEC”“中国建筑”等主商标，对于非关联商标，子企业可自行注册。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在合同评审过程中，合同评审部门应在职责范围内对合同相关内容进行评审，但不需要对相关合同条款是否合规发表明确意见。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "合同审批与事项决策为两个独立流程，不得以事项会议决议、招投标审批或以其他形式代替合同审批程序，以事项决策流程代替合同审批流程的，合同视为未审批。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "法律合规与风险管理部是企业合规管理的“第一道防线”。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在局属各单位与分供方签订的分供合同中，关于付款条件可以设置“背靠背条款”。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司规定，授权委托书应当有明确的授权有效期，代理人可以将授权委托事项转委托。代理人转委托的第三人也可以再次转委托。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据公司规定，项目部可以使用“项目技术专用章”签订分供方合同。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "专业分包单位可以将其承接的专业分包工程进行劳务分包。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目工期紧，先安排队伍进场施工后重新补招标流程。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "为规避招标审批，可将单项采购拆分为多个招标，降低专业承包资质要求，化整为零。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "被局及集团标记的不合格分供方可根据实际情况，在资审环节通过资审。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "劳务分包合同中可以包含主要材料和大中型机械费用。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建八局第三建设有限公司公，主要维护军工企业为中国兵器集团有限公司、中国航天科技集团有限公司。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国融通集团经营范围主要包括：房地产、农业、融旅饭店、酒店及旅游业、商业服务、资源开发、医疗健康、安保服务等领域。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局第三建设有限公司2024年军民融合业务中标额指标为50亿元（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "可以利用职权或职务上的影响，通过“打招呼”、“递条子”、授意虚假竞标串标等方式违规插手干预招标。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于所有地产类项目，不得低于成本价投标、签约，严禁以任何形式违规垫资。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国招标投标法实施条例》规定：单位负责人为同一人或者存在控股、管理关系的不同单位，不得参加同一标段投标或者未划分标段的同一招标项目投标。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "中建集团党组发布的《中建集团市场营销“十条禁令”》中明确规定：严禁中标公示后恶意投诉、诋毁竞争对手，严禁出借、出租、转让企业资质，搞联营挂靠。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《关于印发中国建筑地产类项目承接底线管理标准的通知》（中建股法字〔2020〕777号）规定，对处于监管橙色档的地产类业主，严格控制商票、保理、以房抵债等非现金支付方式；对所有地产类项目，不得协助业主提供任何形式的融资，包括但不限于协助其提供融资担保或增信、变相协助融资、协助签署特定交易文件等。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据立项可撤销原则，已通过立项审批并取得授权委托书的单位，如半年内营销工作无实质性进展或新的重大突破，分局可视情况取消其营销授权，并报局总部审批，届时有条件的单位可介入运作（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "为消除恶性竞争，维护中建集团整体利益，集团市场管理部与各子企业签订了《中建集团市场行为自律公约（试行）》，要求自觉遵守开标结果、尊重业主选择，维护中建整体利益。对中标公示“第一中标候选人”是中建企业的项目，其他中建投标人严格遵守“第一中标候选人”共同维护机制，主动放弃顺位中标权。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《国有企业领导人员廉洁从业若干规定》，国有企业领导人员在企业拖欠职工工资期间，不得购买小汽车、添置高档办公设备，但可以装修办公室。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《中建八局城市更新业务工作指引（2023版）》，将全局城市更新业务分为Ia、Ib和IIa、IIb两大类四小类。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《中建八局城市更新业务工作指引（2023版）》，为实现城市更新业务发展的战略目标，现阶段应着力构建整体策划、资源整合和品牌影响三大能力。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "围绕集团“一六六”战略路径，落实“抓整改、保增长、促创新、深改革、固基础、防风险、强党建”七大任务，抓实“三大提升”行动，推进党建经营深度融合。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "基础设施三大纵队管理中，三级主力公司应为近三年平均中标额达到50亿元以上的三级单位，或近三年平均中标额达到30亿元以上且A类基础设施中标额占比20%以上。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "八局的A类基础设施业务，包含铁路、公路、轨交、市政、涉水工程、生态环保、清洁能源、新基建、机场、体育场、文化旅游等。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "加快基础设施专业人才引进，加大校招人员规模，鼓励内部人才向基础设施转型员工，不断扩大基础设施人才队伍规模，确保A类基础设施从业人员在全局总人数中的占比不低于规模占比。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "涉水、清洁能源、生态环保等新型业务2024-2030年增速不低于15%，新型业务中标额在A类基础设施中占比不低于40%。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中国建筑海外市场营销“十条禁令”》明确，严禁参与国别（地区）政治活动，擅自承接涉及多国利益或派系争端的项目。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "出国（境）团组成员在国（境）外可随意接受外国记者采访。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "境外机构再投资设立机构无须报请股份公司审批。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "拟签署高风险及以上国家和地区的项目，或向风险及以上国家和地区的项目派出中方人员，本单位应将安全评审纳入决策审批中。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如发生对境外企业的投资合作造成极大干扰、人员生命及资产安全受到威胁的安全风险事件，应提醒企业谨慎前往有关国家开展投资合作活动，已在当地的境外单位和人员密切关注形势、及时采取措施，制定应急预案，加强风险防范。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "按照集团规定，首报重大突发事件信息一般先口头后书面报送，在口头报告后30分钟内报送书面信息，对人员伤亡情况变化大的突发事件，每小时滚动电话报告最新情况，并视情报送书面信息。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如发生对境外企业的投资合作造成极大干扰、人员生命及资产安全受到威胁的安全风险事件，应提醒企业谨慎前往有关国家开展投资合作活动，已在当地的境外单位和人员密切关注形势、及时采取措施，制定应急预案，加强风险防范。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如发生严重危及我境外企业的生存、人员生命及资产安全受到极大威胁的安全风险事件，应提醒境外企业在风险降低前暂勿前往有关国家开展投资合作活动，已在当地的境外单位和人员加强风险防范，并在必要时根据驻外使领馆的统一安排及时撤离。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如发生严重危及我境外企业的生存、人员生命及资产安全受到极大威胁的安全风险事件，对外投资合作企业在做好必要安全保障措施的情况下可继续赴有关国家开展投资合作活动，在必要时根据驻外使领馆的统一安排及时撤离。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如发生对境外企业的投资合作活动造成干扰和影响的安全风险事件，应提醒企业及已在当地的境外单位和人员密切关注形势，及时采取措施，制定应急预案，加强风险防范。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业负责人是境外安全管理的第一责任人，对境外企业机构和人员预防和处置境外安全事件承担领导责任。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国领事保护与协助条例》适用于领事保护与协助以及相关的指导协调、安全预防、支持保障等活动。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国务院有关部门根据各自职责开展国外安全的宣传、教育培训工作，提高相关行业和人员国外安全风险防范水平，着重提高在国外留学、旅游、经商、务工等人员的安全意识和风险防范能力。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "驻外外交机构应当结合当地安全形势、法律环境、风俗习惯等情况，建立领事保护与协助工作安全预警和应急处置机制，开展安全风险评估，对履责区域内的中国公民、法人、非法人组织进行安全宣传，指导其开展突发事件应对、日常安全保护等工作。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "避难所应能达到防护枪击的目的，至少坚守30分钟。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "未经批准，出访团组不得擅自增加往访国家和地区，不得延长在外停留时间。不得以任何理由绕道旅行，必要的过境应按最为经济合理的原则安排。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "集团所属子企业一般人员出国（境），由本单位主要负责人审批，报总部海外部备案核准。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在中华人民共和国境内进行工程建设项目，包括项目的勘察、设计、施工、监理以及与工程建设有关的重要设备、材料等采购，国有资金投资项目不用必须进行招标。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "分包单位对所招用农民工的实名制管理和工资支付负直接责任（）。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "承包单位将其承包的全部工程肢解以后，以分包的名义分别转给其他单位或个人施工的属于转包（）。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "“11233核心理念的新内涵”，即“一个核心（以价值创造为核心），一条主线（以项目工期管理为主线），二层管理（企业和项目部的项目管理），三个基本目标（过程精品、依法合规、相关方满意），三个基本抓手（策划引领、计划驱动、精准激励）。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "双向考核的定义：一是策划组织单位对项目部的考核，二是策划组织单位的上一级单位对策划组织单位的考核。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "施工产值统计包括自施部分、甲指分包、平行发包的所有产值（）。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "信用中国一般失信行为的行政处罚信息公示期限为3个月。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《中华人民共和国建筑法》规定，未经安全生产教育培训的人员，可以先上岗工作，并利用业余时间进行培训。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "生产经营单位发生生产安全事故后，事故现场有关人员应当在1小时内报告本单位负责人。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业提取的安全生产费用从成本（费用）中列支并专项核算，专职安全管理人员的薪酬、福利应当在企业安全生产费用中列支。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "安全生产“三管三必须”，指的是管行业必须管安全、管业务必须管安全、管生产经营必须管安全。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "生产经营单位为应对某一种或者多种类型生产安全事故，或者针对重要生产设施、重大危险源、重大活动而制定的防止生产安全事故的应急预案为综合应急预案。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《安全检查和生产安全事故隐患排查治理办法》中隐患治理“五落实”原则的是:必须保证治理责任得以落实、必须保证治理措施得以落实、必须保证所需资金得以落实、必须保证治理时限得以落实、必须保证应急预案得以落实。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "2221特别防护期工作机制主要包括“两会两查两带班一报告”，即期前的安全工作部署会和期后安全总监例会；期前的安全检查和期后复工的安全检查；期间领导带班安全督导检查和项目领导班子成员带班生产；每日安全生产报告。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "根据《分包商安全管理办法》,安全生产不良记录指租借资质、违法挂靠、超资质承接，违法分包、转包，提供虚假证明材料等司法诉讼记录，安全生产行政处罚记录、严重失信记录、事故记录等。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《安全生产法》，生产经营单位应当建立安全生产教育和培训档案，如实记录安全生产教育和培训的时间、内容、参加人员以及考核结果等情况。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《安全生产法》，从业人员发现直接危及人身安全的紧急情况时，有权停止作业或者在采取可能的应急措施后撤离作业场所。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中华人民共和国建筑法》，在建的建筑工程因故中止施工的，建设单位应当自中止施工之日起三个月内，向发证机关报告，并按照规定做好建筑工程的维护管理工作。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《中华人民共和国建筑法》，在建筑物的使用寿命内，因建筑工程质量不合格受到损害的，有权向责任者要求赔偿。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《中华人民共和国职业病防治法》，建设项目职业病危害分类管理办法由当地卫生行政部门制定。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "依据《中华人民共和国职业病防治法》，用人单位对从事接触职业病危害的作业的劳动者，应当给予适当岗位津贴。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "依据《中华人民共和国特种设备安全生产法》，特种设备使用单位应当建立岗位责任、隐患治理、应急救援等安全管理制度，制定操作规程，保证特种设备安全运行。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司对获得国家高等级科技奖项的获奖单位和项目团队进行奖金奖励。实施奖励的国家高等级科技奖励包括国家科学技术奖和中国专利奖（金奖、银奖）。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "对于科技人才评价要坚持以论文、职称、学历、奖项为主，创新能力、质量、实效、贡献为辅。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "“十四五”期间要不断提高科技创新体系整体效能，增强科技创新能力，确立企业创新主体地位。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司科创产业应聚焦“双碳”和数字经济两个主攻方向，以核心技术自主可控、创建知名品牌为基本要求，以打造“专精特新”“高精尖特”企业为重要路径，积极培育“独角兽”“哪吒”等企业，打造原创技术策源地，构建集团第二增长曲线。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "公司科创产业仅允许科创专业公司发展，其他二级单位坚持发展主业，可以不发展科创产业。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "施工单位应对超越资质承揽工程、出借资质、转包或者违法分包、偷工减料、不按图施工、未取样检测、不履行保修义务等行为承担相应的法律责任。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "根据《建设工程质量管理条例》，建设工程发包单位，不得迫使承包方以低于成本的价格竞标，不得任意压缩合理工期。建设单位不得明示或者暗示设计单位或者施工单位违反工程建设强制性标准，降低建设工程质量。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "建设工程发包单位，不得迫使承包方以低于成本的价格竞标，不得任意压缩合理工期。建设单位不得明示或者暗示设计单位或者施工单位违反工程建设强制性标准，降低建设工程质量。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "按局《科技质量管理手册（2023版）》，因质量原因出现大面积反工返修的，处罚项目经理10000-50000元，还应按照实际经济损失的5-10%处罚有关责任人。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "按局《科技质量管理手册（2023版）》，科技成果奖奖励类别包括科技进步成果奖、专利成果奖、优秀施工组织设计奖、优秀施工方案奖、优秀工法奖5类。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "已出租的抵入房产属于五类资产中的闲置抵债资产。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "我方参股的投资项目欠款应纳入五类资产管控。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "已竣工2年以上的地产存货属于五类资产。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "法律规定的禁止流通物不可以作为抵债资产。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "全局课题主要由工程研究院执行并统一进行考核。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "《中建八局战略性新兴产业培育方案》不光确定了战新产业的重点方向，也明确了各产业的责任部门。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "八局设计匹配现有工程管理架构，嵌入设计体系，与工程管理体系融为一体，实现“设计还原度高、项目质量好、投资造价可控”的EPC项目管理。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局设计管理总院为局总部部门，负责全局设计业务（含设计管理和设计生产）的归口管理、全局EPC管理体系建设及EPC协同联动牵头工作，是EPC联动管理的牵头部门；负责全局EPC业务全链条数据管理及归纳、运用支撑；是全局高端设计咨询业务的孵化生产服务单位。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "图纸是项目全过程管理的重要载体，管好图纸才能管好项目。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "EPC项目岗位设置时，可根据需要配置设计经理。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "深化设计是项目实施精益化管控的重要抓手，深化设计图纸是落实施工图设计要求、开展材料设备采购、落实施工工艺工序要求、控制工程成本、保障工程质量的直接依据。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "EPC的E（Engineering）不仅仅是设计（Design），而是要求在保障工程的功能性、安全性的同时，还要保障采购、施工的便利性、工程运维的方便、经济性，以及保障承包商可以在约定的合同工期内顺利履约，并获得合理利润。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建集团信息化以“中建136工程”作为主要落地抓手。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工转岗、离岗后仍可保有在岗、在职期间各系统的访问权限。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "全球数字经济发展比重最大的领域是产业数字化。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "局“211+工程”始终2个领建项目、2个协建项目、1个示范应用。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "员工转岗、离岗后仍可保有在岗、在职期间各系统的访问权限。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "全球数字经济发展比重最大的领域是产业数字化。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "被审计单位需针对屡审屡犯问题制定专项整改措施，并在整改报告中反馈整改落实情况。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "国资委《关于深化中央企业内部审计监督工作的实施意见》（国资发监督规〔2020〕60号）要求，中央企业对所属子企业确保每3年至少轮审一次。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "内部审计机构对审计发现问题整改落实负有监督检查责任，被审计单位对问题整改落实负有主体责任，单位主要负责人是整改第一责任人，相关业务职能部门对业务领域内相关问题负有整改落实责任。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "《审计管理手册》规定，员工离职审计仅针对项目负责人。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "各单位要加强追责问责典型案例通报，持续开展追责例会及专题培训，引导各级管理人员合规经营、正确履职。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "各单位要常设迎审领导小组及工作小组，由公司主要领导任领导小组组长，统筹安排相关工作，做到亲自抓、亲自管。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "坚决做好上级审计发现问题整改，主要包括国家审计署发现问题整改以及股份公司审计发现问题整改。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "集团所属三级子企业都应该开展巡察工作。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "巡视巡察工作要坚持问题导向，只讲问题不讲成绩。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "被巡视巡察党组织应当召开领导班子整改专题民主生活会，结合反馈意见进行深刻剖析、对照检查，提出整改措施。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "被巡视党组织承担巡视整改主体责任，党组织书记承担巡视整改第一责任人责任。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "巡察工作中要求通过业务看政治就是透过现象看本质，就是要善于把业务问题放在党的领导、党的建设、从严治党的政治层面上去分析研判。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "常用巡察方式包括听取汇报、执纪审查、下沉了解、个别谈话等。（）",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "总书记指出，要把抓巡视整改融入日常工作，融入深化改革，融入全面从严治党，融入班子队伍建设。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "巡视工作坚持发现问题、形成震慑，推动改革、促进发展的方针。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "职工代表大会是企事业单位实行民主管理的基本形式，是协调劳动关系的重要制度，是职工行使民主管理权力的机构。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中国工会是中国共产党领导的职工自愿结合的工人阶级群众组织，是中国共产党联系职工群众的桥梁和纽带。（）",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "人力资源管理理念是“以奋斗者为本、为践形者担当、让实干者有为有位”",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于承担公司重大战略经营任务或处于初创期的公司属二级单位，经党委会审议班子职数最高可突破一档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单位运营规模（营业收入）连续三年达不到核定范围的，领导班子职数配备进行调整",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "提D职级领导表现优异的学历可放宽至公办大专及以上",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "首次提任D职级的，应具有同系列专业中级及以上专业技术职务任职资格，有相关注册类职业资格证书的视同拥有",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导人员组织考察的考察组通常由二人组成，特殊情况经报批后方可由一人担任",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "校招方面，如毕业生为985院校毕业生未通过中建测评可破格",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "社招方面，全日制公办本科学历，毕业院校和所学专业均符合目录要求，即可赋予Y号",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "每项目最多配备1名专业主管",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "提任项目商务经理需持有注册造价师证书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "提任项目负责人，也必须持有一级建造师证书",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "核定公司总部高级经理具有同系列专业中级及以上职称或取得注册类执业资格证书可不作为强制要求",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "公司聘任内部讲师需本科及以上学历",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "因培训产生的餐费、差旅费不得列入员工教育培训经费",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "借调人员由借调部门考核，占用原部门考核指标",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "绩效面谈只需要对考核为C/D档人员面谈，其余人员不需要",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "应届毕业生未通过BIM实训考核不可参加专业考试",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "跨统筹地区就业的，失业保险关系随本人转移，缴费年限不可累计计算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "企业年金是企业及其职工在依法参加基本养老保险的基础上，自主建立的补充养老保险制度",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "公司可与同一员工在试用期考核不达标后再签一次不长于3个月的试用期",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "试用期只有在员工第一次与公司签订劳动合同时发生，续签劳动合同没有试用期",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "劳动合同书应在双方见证下签字，必要时候经本人授权也可由被授权人代签",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "人事档案分为正本和副本，一般只建立正本",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "个人如需查阅本人档案需填报《查阅人事档案审批表》",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "因公出（国）境，严格遵循“一事一报”的原则，即一次审批只能包含一个行程，因私不作限制",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "在工作中存在重大失误，出现质量安全事故或对企业造成严重损失的，可以进行编号逆向调整",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导班子年度综合考核评价为D档（较差）或连续两年为C档（一般）时，次年内班子调整率不低于30%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "领导人员绩效年薪最高与最低之间的差距不低于20%",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "两级总部（区域经理部、专业事业部）部门副职年中考核采用分组考核模式",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "年度考核部门考核为C的必须产生C档",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "对企业造成100万元及以上严重损失的年度考核可直接认定为C档",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "被公司党委巡察组借调参与巡察有关工作，采用“双考核”机制，即所在单位/部门和巡察办共同考核，最终考核结果就高执行",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于T1职层跨职层晋升至T2职层，需满足近两年考核有A/A+档且没有C/D档",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "两级总部部门副职及以上人员年度考核为D档或连续两年年度考核为C档，视为不胜任工作，经党委会、二级单位党总支（支部）委员会审议后调出两级总部",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "项目商务工程师安全履职档案在一个周期内被扣分超过12分的纳入A/A+禁入项",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "考取一级建造师（建筑），在注册通过并取得安全员B证后可发放每月补贴",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中级职称每个月补贴金额为100元",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "除不可抗力等特殊情况外，逾期不返回单位又未履行请假续假手续的，按旷工处理",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "当年内受到诫勉、处分的领导人员经营业绩结果不得评为A/A+档，并取消当年评优资格",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "管理序列与专业序列双职级并行时，职级工资就高执行",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "如果高中学校的原始学籍材料遗失，可以通过学校出具的学习经历证明（原件），并通过邮政EMS标准快递的方式转递归档。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "干部考察时，人选所在单位党组织只需对人选的廉洁从业情况提出初步意见，无需党组织书记和纪委书记签字确认。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "职工企业年金个人账户中单位缴费及其投资收益，在职工与本单位解除劳动合同时，如果工作年限不足1年，则归属比例为0%。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "员工丙于2024年1月1日入职E公司，双方于2024年2月15日签订劳动合同。劳动合同期限为3年，约定试用期为3个月，试用期限为1月1日至3月31日。劳动合同中未对员工丙的薪酬进行明确。3月30日，公司人力资源部通知丙，由于其试用期内表现不佳，公司要延长其试用期至6月30日。5月30日，公司以员工丙在试用期间被证明不符合录用条件为由，单方面解除劳动合同，并提交了证明材料。因为合同中未明确员工丙的薪酬，因此E公司向员工丙支付的薪酬只要不低于当地的最低工资标准，即为合法。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "T6及以上人员不参加局总部及局属二级单位组织的复审。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "社会招聘需求分析与校园招聘需求分析的步骤完全不同。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导人员的亲属可以在同一单位担任双方直接隶属于同一领导人员的职务。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "所有工资性支出应按照有关财务会计制度核算，不得在工资总额之外列支任何工资性支出，即职工工资必须经过”应付职工薪酬/工资“科目核算",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业职工一方与用人单位可以就劳动报酬、工作时间等事项订立集体合同。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "申报人在受到记过以上处分期间可以申报参加职称评审。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "培训需求调研的方法之一是通过观察员工的工作表现来识别培训需求。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "职工如果请病假累计超过一定时间的，是不休年假的。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "职工教育经费主要用于职工上岗和转岗培训、执（职）业资格培训等。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "系统内员工可以自由选择参加社会上的职称评审，无需经过局人力资源部审批。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "干部履历表需要重新填写的情况包括：五年内未重新填写履历表，或者现职务与上次填写时的职务发生变化但未填写新的履历表。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "管理序列C、D职级领导人员可以申请参评高于对应职级的专业职级，评审认定后不占用该职层职数。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "劳动者在试用期的工资不得低于本单位相同岗位最低档工资的百分之六十。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "参加国(境)外培训原则上应在一国(地区)内完成，同一人员本年度内不得再安排其他出国(境)培训任务。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "毕业生违约管理是指企业对于已经签订就业协议但最终未能履行协议入职的毕业生所采取的管理措施和应对策略。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "签约全过程管理中，企业无需在签约后与学生保持沟通。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "退休前基本养老保险关系在户籍所在地的，由户籍所在地负责办理待遇领取手续，享受基本养老保险待遇。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "破格提拔的特别优秀领导人员，必须在关键时刻或承担重大专项任务中表现出色。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在人才市场、劳务市场办理人事代理手续的人员，其参加工作时间应根据其与单位签订的劳动合同约定的起始时间确定。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "用人单位与劳动者协商一致，可以变更劳动合同约定的内容。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "退出领导岗位转聘至专业序列的人员，或其他组织聘任的专家，2年内不占用职数。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "年薪制分配原则之一是坚持战略导向，各单位负责人薪酬策略要支撑、促进公司战略目标的达成。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "受到诫勉处理的领导人员，6个月内不得提拔或者重用。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "单位出现经营亏损、重组并购等特殊情况无法履行缴费义务时，应当中止单位缴费，职工个人缴费不受影响。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "ISD模型是一种系统化开发课程的方法，包括分析、设计、开发、实施和评估五个阶段。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "校园招聘计划的制定不需要考虑预算安排。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "局积极推动干部能上能下和交流任职工作，强化干部离职管理，不断提升干部队伍综合素质激发干部队伍活力。总部部门、各级领导班子内部同职级岗位变化不属于交流范畴，不重新计算任职时间。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在讨论领导人员任免的会议中，如果意见分歧较大，应该立即进行表决。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "领导人员受到党内严重警告处分的影响期为1年。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "中专学历的员工不能申报工程系列中级及以上职称。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "用人单位可以要求劳动者提供担保或收取财物。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "职工因工致残被鉴定为五级、六级伤残的，享受一次性伤残补助金和每月伤残津贴，标准分别为本人工资的70%和60%。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "校园招聘质量指标中，仅关注985和211高校的招录情况。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "127培训法则指出，70%的学习来自于个人的工作实践。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新提任项目经理、项目生产经理等关键岗位，需满足6个月以上的项目安全工作履历底线要求。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "领导人员任前公示的时间不少于5个工作日。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "“三龄两历一身份”中的‘三龄’指的是干部的出生时间、参加工作时间和入党时间。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "除国家规定的境外工作补贴以及履职待遇、业务支出相关补贴等，以及参加或承担符合规定的非本单位课题、项目和参加评审、讲课或写作等所获得的补贴（劳务费）外，企业负责人不得违规领取其他津补贴",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "经调查，有关机构认定领导人员不存在违纪违规事实的，补发停职期间暂缓兑现的薪酬，恢复停职前的中长期激励行权资格。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "五险包括养老保险、医疗保险、失业保险、工伤保险和生育保险，其中养老保险、医疗保险和失业保险由企业和个人共同缴纳，工伤保险和生育保险全部由个人承担。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "员工外出培训费用由单位提供的，学习培训报销费用在20000元（含）以上的参培人员，应与公司签订服务协议。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "用人单位与劳动者在用工前订立劳动合同的，劳动关系自用工之日起建立。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "领导人员任职时作出的承诺包括任职3年内一般不因个人原因提出辞去领导职务。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局的内部讲师小马想要晋升为局级高级讲师，他需要满足的条件之一是聘期内考核量化赋分高于80分。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "上海市优秀项目经理属于中建八局III类高层次人才。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "职效工资制坚持‘以级定薪、易级易薪，以岗计奖、易岗易奖’的管理原则。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "参加职工符合下列条件之一时，可以享受本细则规定的企业年金待遇：达到国家规定的退休年龄、因病(残)完全丧失劳动能力、出国(境)定居、退休前身故。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "拟任人选所在企业党（工）委未对廉洁自律情况作出结论性意见的，该人事任免事项仍可提交会议讨论。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "员工乙为C公司的非全日制用工人员，双方未订立书面的劳动合同。口头约定试用期为15天。C公司要求员工乙每周工作30小时，每天工作6小时。员工乙同时在D公司以非全日制用工形式工作。某日，C公司无理由通知员工乙，从第二天起终止用工。C公司需要向员工乙支付补偿金。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "劳务派遣用工是我国企业用工的主要形式。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "当档案认定出生日期与身份证上的出生日期相差超过58天时，可以直接按照身份证上的日期认定。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "局属各二级单位引进、转化创新业务关键核心人才的，两年内不纳入人均效能计算基数。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局校招人才画像包括执行能力、团队合作、学习能力等维度。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "出现降级情形的人员，由各级人力资源部发起降级流程，经相应人才管理委员会主任审核，所在单位第一责任人审批后，执行降级。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "《入党志愿书》中上级党委批注的入党时间与支部大会接收预备党员时间不一致时，原则上以上级党委批注的时间为准。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "绩效年薪不得预发。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "如果劳动者开始依法享受基本养老保险待遇，劳动合同应当续延。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导干部培训管理要求C职级以上领导干部每5年参加集中培训累计不少于3个月或50学时。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "选拔任用干部时，不允许临时动议决定任免事项。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "薪酬分配的公平是指有理有据的不公平、不一致。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "领导人员受到党内警告处分的影响期为6个月。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "社会招聘渠道管理中，企业应根据自身需求选择合适的招聘渠道。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "硕士研究生及以上学历的员工在局系统内工作满半年即可申报职称。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "新栋梁培养计划适用于局D职级优秀年轻干部。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "档案室库房内应配置铁质档案柜、空调机、去湿机、灭火器、温（湿）度表、干燥剂和驱虫剂等设施。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "新提任的C职级干部在试岗期内，如果发生平职岗位调整，无论在原岗位履职时间长短，新岗位的试岗期都是半年。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "异地就医备案后，参保人出院时可在异地定点医疗机构直接进行结算，享受异地就医实时结算待遇。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "项目经理序列专家人数不超过本单位项目（执行）经理总人数的20%。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "毕业生违约管理是指企业对已签订就业协议但最终未能履约的毕业生采取的管理措施。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "年薪制的薪酬构成包括基本年薪、绩效年薪、中长期激励收入和履职待遇、业务支出相关的津贴补贴等其他货币性收入。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我局严格管理C职级领导人员社会兼职，严控兼职数量，按照规定执行报批制度。领导人员到龄免职未退休或者退休后，确因工作需要到社会团体、基金会、国际组织兼职的，兼任社会团体（或者基金会）、国际组织职务均不得超过1个。兼职的任职年龄界限为70周岁。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "选拔任用干部时，可以由主要领导个人决定任免事项。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "因公出国（境）团组计划需每年定期通过“中国建筑外事管理系统”报送，但计划外任务不允许单独报批。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "党校学历（无教育部学历证书电子注册备案表）可以作为职称申报的条件。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "劳务派遣单位与被派遣劳动者订立的劳动合同可以是一年以下的。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "津补贴除个别国家规定需要设置的，均由企业结合业务自主决定是否设置，应减少一般性津贴补贴设置。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "劳动者月工资高于用人单位所在直辖市、设区的市级人民政府公布的本地区上年度职工月平均工资三倍的，经济补偿年限最高不超过十二年。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中建八局规定，提拔担任C3职级的人员，必须具有D1、D2职级2年以上工作经历和3年的基层工作经历。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局党委在干部选拔任用上始终坚持集体决策和依法依规任职。党委常委会议讨论决定人事任免事项时，涉及到与会人员及其亲属的，本人可以参加会议，不做表态、不投票",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "对于早期因入伍、上学填写较大年龄，后改回真实年龄的情况，为维护公平，应维持其填写的较大年龄。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局‘云实践’仅包括线上案例分享。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "T4职层的职数上限为专业子序列人数的5%，如果人数超过1000人，则职数上限为3%。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "中建八局院系活动包括开设‘新砼人预备营’、组织校企‘党建联建’等。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "档案室的库房面积每千卷需20至25平方米，且应设立专门的档案库房，确保档案库房、阅档室和档案人员办公室三室分开。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "王某，男，50岁，因工作出差在外地，突发心绞痛，符合急诊抢救标准，在外地非定点医疗机构发生急诊抢救费用，产生的医疗费用可以报销。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "党委常委会讨论人事任免议题时，干部人事部负责人需要列席会议并汇报任免事项。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "中长期激励是为了促进单位长期发展，通过多种中长期激励方式，将单位和管理团队中长期目标与利益捆绑在一起。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "项目员工所在项目的承接主体、劳动合同、社保缴纳单位应保持一致，若出现不对应情况时无需立即整改。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "本科及以下学历的员工需要在局系统内工作满1年才可申报职称。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "局党委在干部选拔任用上始终坚持集体决策和依法依规任职。提拔、进一步使用、职级提任、非领导职务改任同级领导职务的，应当进行任前公示。公示期不少于五个工作日，从发布公示通知的当天起算",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "柯氏四级评估模型中的行为层评估是在培训结束后的一段时间内观察学员在工作中的行为变化。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "职工发生事故伤害后，所在单位应当自事故伤害发生之日起30日内，向统筹地区社会保险行政部门提出工伤认定申请。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "专业序列T4职层对应数字职级19～21级。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "基本年薪是各单位负责人的年度基本收入，按月固定发放，反映单位负责人岗位的基本市场价值。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "企业按按人按标准定期发放或报销的交通补贴、通讯补贴、住房补贴、采暖补贴、过节费、餐补等均属于工资总额。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "我局严格管理C职级领导人员社会兼职，严控兼职数量，按照规定执行报批制度。任期届满连任的，不用重新报批，可直接连任。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "取得注册会计师专业阶段考核合格证可以作为申报高级会计师的条件。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question: "校园招聘需求分析仅涉及人力资源现状评估和业务需求预测两个步骤。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "领导人员的亲属可以在有直接隶属关系的领导班子中担任与领导人员分管业务相同的职务。",
    options: ["对", "错"],
    answer: "错",
    type: "判断题",
  },
  {
    question:
      "干部人事档案任前审核中，如果发现人事档案存在涂改或信息涉嫌造假的情况，应该立即查核并在未核准前暂缓考察，并停止任职和录用程序。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "接受有关机构调查的领导人员，在暂停职务期间，停止预发绩效年薪或奖金，暂缓兑现绩效年薪或奖金、任期激励收入，中止中长期激励行权资格。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "在选拔任用过程中，如果人选在上一年度考核结果为基本称职及以下等次，则不得列为考察对象。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "校园招聘“四进”活动包括进教室、进操场、进宿舍、进食堂。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question:
      "工伤申报时，用人单位未在规定时限内提交工伤认定申请，在此期间发生符合本条例规定的工伤待遇等有关费用由该用人单位负担。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },
  {
    question: "劳务派遣单位应当与用工单位订立劳务派遣协议。",
    options: ["对", "错"],
    answer: "对",
    type: "判断题",
  },{
question:'校园大使的主要职责是组织校园内的宣讲会和职业发展讲座。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'年薪制是以年度为周期，依据企业的生产经营业绩、贡献程度、个人业绩，确定并支付企业负责人薪酬的分配方式。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'专业序列人才职级在20级及以上的，如聘任为专家，才需按专家人才进行考核、使用。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'中建八局的“云实践”活动包括线上项目参访，不涉及数字科技应用。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'集体合同中劳动报酬和劳动条件等标准可以低于当地人民政府规定的最低标准。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'中建测评的第一轮测试和第二轮测试都是为了评估应聘者的专业能力和思维能力。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'培训需求分析仅需考虑员工个体的需求，无需考虑组织和工作的需求。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'对于新提任的C职级干部，试岗期满后，如果考核结果为基本称职，可以免去试岗职务或延长试岗时间一年。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'因公出国（境）团组人员构成须坚持少而精的原则，每次出访原则上不得超过3个国家和地区。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'参加工作时间的认定，如果《转正定级表》记载的时间与就业报到证记载的时间不一致，通常以《转正定级表》记载的时间为准。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'专项奖罚要与企业战略和发展重点相匹配，向基层一线倾斜，纳入绩效薪酬统一管理，建立定期评估调整机制，除国家规定的专项奖励，其他专项奖励的评估调整周期原则上不超过2年，届满即默认取消或重新研究制定',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'技能序列的职层O1～O6每个职层都有3个职级。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'校园大使项目的目的之一是增强企业在校园中的品牌影响力。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'年度综合评价或年度经营业绩考核结果为D档（不称职）、年度综合评价和年度经营业绩考核结果均为C档（基本称职）的，绩效年薪为零。年度双考核中有一项为基本称职（C档）时，绩效年薪不超过标准值（平均值）的70%',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'领导人员的亲属可以在其中一方担任领导职务的单位从事组织（人事）、纪检监察、审计、财务工作。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'校园招聘面试方法中的行为描述面试法（STAR）主要测评与面试者将来工作相关联的过去行为。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'年薪保护是指为促进领导人员交流任职，在一定期限内对领导干部设置的薪酬保护机制。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'成人学习理论认为，成人学习者更倾向于被动接收知识而非主动探索。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'工伤保险待遇中，职工住院治疗工伤的伙食补助费以及经医疗机构出具证明，报经办机构同意，工伤职工到统筹地区以外就医所需的交通、食宿费用从工伤保险基金支付。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'非全日制用工可以约定试用期。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'校园招聘‘四进’活动指的是进教室、进操场、进宿舍、进食堂。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'国内全日制学历学位材料归档时，只能由学校通过机要通信或邮政EMS标准快递方式转递，不允许本人携带。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'职效工资制的薪酬构成包括职级工资、绩效工资、岗位贡献激励、专项奖罚、津补贴。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'专家人才的专业综合评价结果直接影响其年度岗位绩效考核结果。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'内部讲师分为局级、公司级、项目级，其中局级内部讲师分为首席讲师、高级讲师和中级讲师三个级别。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'薪酬成为”激励因素“的核心要素是动态调整与合理差异。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'留学回国人员的学历学位材料归档时，需要提供的材料包括教育部留服中心出具的《学历学位认证书》原件或电子版认证书彩印件、毕业证、成绩单。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'领导人员的亲属可以同时在有直接隶属关系的领导班子中担任主要领导。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'T5职层的职数比例上限随着专业子序列总人数的增加而减少。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'中建八局的一名员工小吴，近期计划参加一次外部培训，预计费用为3万，根据职工教育管理办法，他的费用可以由单位全额支付，但不需要签订任何服务期承诺。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'社保缴费基数是根据职工上一年度的月平均工资收入来确定的，用于计算职工应缴纳的社会保险费用。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'企业负责人不得在兼职单位领取工资、奖金、津贴等任何形式的报酬，除上级单位批准的薪酬之外，不得领取其他任何工资性收入。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'中建八局‘干部十条’胜任力模型是从综合素质、领导能力和成长潜力三个维度来定义的。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'C1职级领导人员距离退休年龄2年时，一般免去领导职务。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'领导人员受到降职处理的，两年内不得提拔职务、晋升职级或者进一步使用，且当年不得评选各类先进。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'对于高层次人才申请晋升的，可给予任职资格放宽。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'社保账户主要分为股份账户、局账户、二级单位法人账户和二级单位非法人账户四类。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'领导人员因违规违纪违法被追究责任，受调整职务处理或者轻处分后，需要进一步使用或者提拔使用的，无需区分所犯错误性质、情节轻重等因素。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'345薪酬，是指以四个人的工资吸引、选择和激励3个合适的人让他们在组织支持下创造5个人的业绩，是囊括选择合适的人、替代不合适的人、加大薪酬激励和提供组织支持等立体多位体系。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'我局严格管理C职级领导人员社会兼职，按照规定执行报批制度。C职级领导人员经申报可以在兼职单位领取工资、奖金、津贴等任何形式的报酬和获取其他额外利益',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'用人单位单方解除劳动合同，无需事先将理由通知工会。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'执行考察调研任务团组总人数可以超过6人，出访一国不超过5天。',
options:['对','错'],
answer:'错',
type:'判断题'
},
{
question:'生源信息管理涉及与高校合作，获取大四和研究生最后一年的学生名单。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'人事档案中的材料包括履历材料、自传材料、考察考核鉴定材料等十大类，这些材料对于档案的完整性和准确性至关重要。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'绩效年薪是指与公司整体经营业绩、各单位负责人个人绩效考核结果和业绩贡献、专项工作奖罚等情况相联系的收入。',
options:['对','错'],
answer:'对',
type:'判断题'
},
{
question:'除在国家规定标准内参加基本社会保险，享受住房公积金、企业年金和补充医疗保险等待遇和非货币性集体福利外，企业负责人不得违规领取其他福利性货币收入',
options:['对','错'],
answer:'对',
type:'判断题'
},

];
