// ==UserScript==
// @name KTC 36-40
// @namespace https://forum.blackrussia.online
// @version 0.0.1
// @description pohy mne 
// @author @xmoore
// @match https://forum.blackrussia.online/threads/*
// @include https://forum.blackrussia.online/threads/
// @grant
// @license MIT
// @collaborator
// @icon https://i.yapx.ru/ViO6c.png
// @downloadURL https://update.greasyfork.org/scripts/485369/KTC%2036-40.user.js
// @updateURL https://update.greasyfork.org/scripts/485369/KTC%2036-40.meta.js
// ==/UserScript==
(function () {
	'use strict';
	const UNACCEPT_PREFIX = 4; // префикс отказано
	const PIN_PREFIX = 2; // префикс закрепить
	const COMMAND_PREFIX = 10; // команде проекта
	const CLOSE_PREFIX = 7; // префикс закрыто
	const DECIDED_PREFIX = 6; // префикс решено
	const TECHADM_PREFIX = 13 // теху администратору
	const WATCHED_PREFIX = 9; // рассмотрено
	const WAIT_PREFIX = 14; // ожидание (для переноса в баг-трекер)
	const NO_PREFIX = 0;
	const closedANDzakrep = 0;
	const buttons = [
	{
		title: 'Приветствие',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] текст [/CENTER][/FONT][/SIZE]',
	},
	{
      title: 'Рассмотрение',
      content:
      '[CENTER][SIZE=3][I][FONT=georgia]Доброго времени суток, уважаемый игрок[/FONT][/I][/SIZE] <br>'+
     "[FONT=georgia][SIZE=3][I]Благодарим вас за обратную связь. "+
     "Ваше обращение было принято к рассмотрению, и мы рады сообщить, что мы стараемся оперативно отвечать на все обращения. "+ 
     "Пожалуйста, ожидайте ответа, как только он будет доступен. "+
     "Мы внимательно следим за всеми обращениями и благодарим вас за терпение и понимание."+
     "Если у вас возникнут дополнительные вопросы или потребуется дополнительная информация, не стесняйтесь обращаться к нам. "+
     "Мы всегда готовы помочь! <br><br>"+
     'На рассмотрении[/I][/SIZE][/FONT][/CENTER]',
      prefix: PIN_PREFIX,
      status: true,
  },
  {
      title: 'Ожидайте вердикта Руководства',
      content:
      '[CENTER][FONT=georgia][SIZE=3][I]'+
     "Доброго времени суток, уважаемый игрок <br>"+
     "Ваша тема закреплена и ожидает вердикта моего руководства.[/I][/SIZE][/FONT]"+
     '[SIZE=3][FONT=georgia][I]  Создавать подобные темы не нужно, пожалуйста, ожидайте ответа.[/I][/FONT][/SIZE][/CENTER]',
      prefix: PIN_PREFIX,
      status: true,
  },
  {
      title: 'Дублирование',
      content:
      '[CENTER][FONT=georgia][SIZE=3][I]Доброго времени суток, уважаемый игрок <br><br>'+
      "Данная тема является дубликатом вашей предыдущей темы. Пожалуйста, прекратите создавать идентичные или похожие темы - иначе Ваш форумный аккаунт может быть заблокирован. На первый раз предупреждение будет устное, при повторном дублировании на ваш аккаунт будет выдвинуты санкции в виде штрафных баллов. При последующих нарушениях ваш формный аккаунт будет заблокирован.[/I][/SIZE][/FONT] <br><br>"+
      '[I][FONT=georgia][SIZE=3]Отказано.[/SIZE][/FONT][/I][/CENTER]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  }, 
  {
      title: 'Обжалование не подлежит вообще',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок' +
      "[CENTER]Ваше наказание обжалованию не подлежит.<br>Вы получили блокировку за серьезное нарушение, которое невозможно обжаловать/обнулить.<br><br>" +
      '[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  {
      title: 'Наказание будет снижено',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      "[CENTER]Проверив вашу историю наказаний, было принято решение о снижении наказания.<br>Будьте аккуратнее в следующие разы, ведь на встречу пойти мы врятли сможем.<br><br>" +
      '[CENTER]Закрыто.[/CENTER][/FONT][/SIZE]',
      prefix: UNACCEPT_PREFIX,
      status: false,
  },
  {
      title: 'Выдача компенсации',
      content:
      '[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый игрок [/CENTER]<br><br>' +
      "[CENTER]Ваше игровое имущество/денежные средства будут восстановлены в ближайшее время. <br>Убедительная просьба, не менять никнейм до момента восстановления.<br>" +
      '[CENTER]Для активации восстановления используйте команду: /recovery.[/CENTER]<br>' +
      '[CENTER]Решено.[/CENTER][/FONT][/SIZE]',
      status: false,
      prefix: DECIDED_PREFIX,
  },
    {
      title: 'Отсувствуие ответа'
  ,content: 
  '[CENTER][I][FONT=georgia]Здравствуйте, уважаемый игрок[/FONT][/I] <br><br>' +
  "[FONT=georgia][I]Если ваша проблема актуальна - пожалуйста, пересоздайте тему."+
  "[SPOILER=Почему ваша тема могла быть закрыта?][/SPOILER][/I][SPOILER=Почему ваша тема могла быть закрыта][/spoiler][/FONT][SPOILER=Почему ваша тема могла быть закрыта][/spoiler]"+
  "[SPOILER=Почему ваша тема могла быть закрыта?"+
  '[FONT=georgia][I]1. Ваша тема могла быть закрыта из-за отсутствия активности в обращении с вашей стороны;'+
  '2. Ваша тема могла быть закрыта из-за наличия у команды технических специалистов актуальной, достоверной информации; [/I][/FONT][/SPOILER]'+
  '[I][FONT=georgia]Рассмотрено[/FONT][/I][/CENTER]',
   
  prefix: WATCHED_PREFIX,
  status: true,
},
    
    {
      title: 'Выдано верно, Покупка ИВ/Банк',
      content:
      '[CENTER][SIZE=3][FONT=georgia][I]Доброго времени суток, уважаемый[B] игрок[/B] <br><br>' +
    "Вам на банковский счёт переводились денежные средства от продавцов игровой валюты.<br>"+
    "Ошибки в переводе быть не может, после перевода деньги благополучно снимались. <br>"+
      "Об ошибочном переводе вы никому не сообщали. <br>"+
      "Исходя из вышеперечисленного делаю вывод, что вы знали от кого и с какой целью вам переводяться денежные средства.<br>"+
      "Соответственно вы предполагали тот вариант, что ваш игровой аккаунт может быть заблокированным, но почему-то сослались на некомпетентность технического специалиста или же, что данное действие Вам сойдёт с рук.<br>"+
      "Мы понимаем, что блокировка аккаунта приносит вам не самые лучшие эмоции, но хочу вам напомнить, что ваш аккаунт был заблокирован из-за ваших отрицательных действий, которые в дальнейшем могли испортить экономику сервера.<br>"+
      "Вы все сами прекрасно знаете, ведь игровую валюту просто так никому не переводят.<br>"+
      "Пытаться обмануть техническую администрацию аналогично нету смысла, с данными игроками вы никогда не взаимодействовали и взаимодействовать не могли.<br>"+
      "Ваши действия противоречат основным принципам нашей игры, созданной для увлекательного и справедливого игрового опыта всех пользователей, которые присоединяются к нашему проекту чтобы получить незабываемые впечатления от игры.<br>"+
      "Технический специалист предоставил доказательства вашего нарушения.<br><br>"+
      'Наказание выдано верно. <br> Закрыто.[/I][/FONT][/SIZE][/CENTER]',
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
        title: 'Выдано верно, Покупка ИВ/Трейд',
  content:
  '[CENTER][I][FONT=georgia]Здравствуйте, уважаемый игрок<br><br>'+
  "Вы совершили трейд, в ходе которой вам была передана игровая валюта. Выше прикреплены доказательства в письменном виде от тех специалиста. Исходя из вышеперечисленного делаю вывод, что вы знали от кого и с какой целью вы совершили трейд с игроком. Соответственно вы предполагали тот вариант, что ваш игровой аккаунт может быть заблокированным, но почему-то сослались на некомпетентность технического специалиста или же, что данное действие Вам сойдёт с рук. Мы понимаем, что блокировка аккаунта приносит вам не самые лучшие эмоции, но хочу вам напомнить, что ваш аккаунт был заблокирован из-за ваших отрицательных действий, которые в дальнейшем могли испортить экономику сервера.<br>"+
  "Вы все сами прекрасно знаете, ведь игровую валюту просто так никому не дают. Пытаться обмануть техническую администрацию аналогично нету смысла, с данными игроками вы никогда не взаимодействовали и взаимодействовать не могли. Ваши действия противоречат основным принципам нашей игры, созданной для увлекательного и справедливого игрового опыта всех пользователей, которые присоединяются к нашему проекту чтобы получить незабываемые впечатления от игры.<br><br>"+
  "На основании имеющейся информации, решение технического специалиста признано корректным. Нарушений с его стороны нету. Доказательства на каждое слово и действие имеются."+
  "С учетом этого, решение технического специалиста выглядит обоснованным и справедливым, ссылаясь на правила проекта и попутно отвечая на Ваши вопросы.<br><br>"+
  "Наказание выдано верно <br>"+
  '[I][FONT=georgia]Закрыто[/FONT][/I][/CENTER]',
   prefix: CLOSE_PREFIX,
   status: false,
  },
    {
      title: 'Аккаунт будет разблокирован',
      content:
      '[CENTER][I][FONT=georgia]Доброго времени суток, уважаемый игрок<br><br>'+
      "Ваш аккаунт будет разблокирован, приносим свои извинения за доставленные неудобства. <br> С техническим специалистом будет проведена профилактическая работа и беседа.<br><br>"+
      '[I][FONT=georgia]Рассмотрено.[/FONT][/I][/CENTER]',
      prefix: WATCHED_PREFIX,
      status: false,
  },
  {
      title: 'IP адрес заблокирован',
  content:
  '[CENTER][I][FONT=georgia]'+
   "[FONT=georgia][I]Здравствуйте, уважаемый игрок.<br><br>"+
   "Вы попали на заблокированный айпи адрес. <br> Ваш аккаунт не находится в блокировке. Переживать не стоит.<br> Причиной попадания в данную ситуацию могло быть разное, например, смена мобильного интернета, переезд и тому подобное. Чтобы избежать данную ситуацию, вам необходимо перезагрузить телефон или воспользоваться услугами VPN. <br>Приносим свои извинения за доставленные неудобства."+ 
   "Желаем приятного времяпровождения на нашем проекте.<br><br>"+
  '[/I][/FONT]'+
  '[I][FONT=georgia]Рассмотрено[/FONT][/I][/CENTER]',
  prefix: WATCHED_PREFIX,
  status: false,
  },
  {
      title: 'Будете обжалованы',
      content:
      '[CENTER][SIZE=3][FONT=georgia][I]Доброго времени суток, уважаемый[B] игрок[/B][/I][/FONT][/SIZE][/CENTER]<br><br>'+
      '[SIZE=3][FONT=georgia][I]  [/I][/FONT][/SIZE]'+
      "[CENTER][SIZE=3][FONT=georgia][I]Ваш аккаунт будет разблокирован. Впредь попросим больше не нарушать правила проекта, иначе — второго шанса дано не будет.<br> Искренне надеемся, что Вы сделали правильные выводы.<br>"+
      "Настоятельно рекомендую ознакомиться с правилами проекта! 🙂<br>"+
      "Надеюсь, что данная ситуация станет для вас уроком, и в будущем, вы больше не будете нарушать правила проекта.<br><br>"+
      'Рассмотрено.[/I][/FONT][/SIZE][/CENTER]',
      prefix: WATCHED_PREFIX,
      status: false,
  },
  
   {
    title: 'В обжаловании отказано',
    content:
    '[CENTER][I][FONT=georgia]Здравствуйте, уважаемый игрок[/FONT][/I]<br><br>'+
    "[FONT=georgia][I]В обжаловании вашего наказания отказано.[/I][/FONT][/CENTER]<br>"+
    '[SPOILER="К ознакомлению"][FONT=georgia][I] 1.7. Оформленная заявка на обжалование не означает гарантированного одобрения со стороны руководства сервера, она может быть отклонена без объяснения причин.[/I][/FONT][/SPOILER]<br><br>'+
'[CENTER]'+
"[I][FONT=georgia]Отказано.[/FONT][/I][/CENTER]",
    prefix: UNACCEPT_PREFIX,
    status: false,
  },
    {
        title: 'Истекли сроки',
  content:
  '[CENTER][FONT=georgia][I]Здравствуйте, уважаемый игрок.<br><br> Благодарим за ваше обращение.<br>'+
  "Мы тщательно рассмотрели его. Проверили всевозможные варианты, которые могли привести к блокировке. После детальной проверки было вынесен следующий вердикт: "+
  "По истечению времени разблокировка аккаунта невозможна. "+
  "Аккаунт разблокировке не подлежит<br><br>"+
  'Рассмотрено.[/I][/FONT][/CENTER]',
  prefix: UNACCEPT_PREFIX,
  status: false,

  },
	{
		title: 'На рассмотрении',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ваша тема взята на рассмотрение, ожидайте ответ в ближайшее время<br>Зачастую рассмотрение темы может занять определенное время, поэтому просьба не создавать дублирующих тем, а так же не оффтопить в данной теме.<br>[CENTER][COLOR=rgb(255, 255, 255)]На рассмотрении[/COLOR][/CENTER][/FONT][/SIZE]',
		prefix: PIN_PREFIX,
		status: true,
	},
	];
	
	$(document).ready(() => {
	// Загрузка скрипта для обработки шаблонов
	$('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');
	
	// Добавление кнопок при загрузке страницы
    addButton('КУРАТОР', 'selectAnswer', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(0, 250, 154, 0.9);')
 
	
	// Поиск информации о теме
	const threadData = getThreadData();
	
	$(`button#ff`).click(() => pasteContent(8, threadData, true));
	$(`button#prr`).click(() => pasteContent(2, threadData, true));
	$(`button#zhb`).click(() => pasteContent(21, threadData, true));
	$('button#unaccept').click(() => editThreadData(UNACCEPT_PREFIX, false));
	$('button#pin').click(() => editThreadData(PIN_PREFIX, true));
	$('button#teamProject').click(() => editThreadData(COMMAND_PREFIX, true));
	$('button#watched').click(() => editThreadData(WATCHED_PREFIX, false));
	$('button#decided').click(() => editThreadData(DECIDED_PREFIX, false));
	$('button#closed').click(() => editThreadData(CLOSE_PREFIX, false));
	$('button#closed_complaint').click(() => editThreadData(CLOSE_PREFIX, false, false));
	$('button#techspec').click(() => editThreadData(TECHADM_PREFIX, true));
	$('button#closedd').click(() => editThreadData(false)); 
	
	$(`button#selectAnswer`).click(() => {
	XF.alert(buttonsMarkup(buttons), null, 'ВЫБЕРИТЕ ОТВЕТ');
	buttons.forEach((btn, id) => {
	if (id > 1 ) {
	$(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
	}
	else {
	$(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
	}
 
	});
	});
	});
	
	function addButton(name, id, style) {
         $('.button--icon--reply').before(
	`<button type="button" class="button--primary button rippleButton" id="${id}" style="${style}">${name}</button>`,
	);
	}
	function addAnswers() {
		$('.button--icon--reply').after(`<button type="button" class="button--cta uix_quickReply--button button button--icon button--icon--write rippleButton" id="selectAnswer" style="oswald: 3px; margin-left: 15px; border-radius: 25px;">ОТВЕТЫ</button>`,
	);
	}
	
	function buttonsMarkup(buttons) {
	return `<div class="select_answer">${buttons
	.map(
	(btn, i) =>
	`<button id="answers-${i}" class="button--primary button ` +
	`rippleButton" style="margin:4px"><span class="button-text">${btn.title}</span></button>`,
	)
	.join('')}</div>`;
	}
	
	function pasteContent(id, data = {}, send = false) {
	const template = Handlebars.compile(buttons[id].content);
	if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();
	
	$('span.fr-placeholder').empty();
	$('div.fr-element.fr-view p').append(template(data));
	$('a.overlay-titleCloser').trigger('click');
	
	if (send == true) {
	editThreadData(buttons[id].prefix, buttons[id].status);
	$('.button--icon.button--icon--reply.rippleButton').trigger('click');
	}
	}
	
	function getThreadData() {
	const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
	const authorName = $('a.username').html();
	const hours = new Date().getHours();
	return {
	user: {
	id: authorID,
	name: authorName,
	mention: `[USER=${authorID}]${authorName}[/USER]`,
	},
	greeting: () =>
	4 < hours && hours <= 11 ?
	'Доброе утро' :
	11 < hours && hours <= 15 ?
	'Добрый день' :
	15 < hours && hours <= 21 ?
	'Добрый вечер' :
	'Доброй ночи',
	};
	}
	
	function editThreadData(prefix, pin = false, may_lens = true) {
	// Получаем заголовок темы, так как он необходим при запросе
		const threadTitle = $('.p-title-value')[0].lastChild.textContent;
		if (prefix == closedANDzakrep) {
    moveThread(1841);
    } 
		if(pin == false){
			fetch(`${document.URL}edit`, {
			 method: 'POST',
			 body: getFormData({
				prefix_id: prefix,
				title: threadTitle,
				_xfToken: XF.config.csrf,
				_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
				_xfWithData: 1,
				_xfResponseType: 'json',
			 }),
			}).then(() => location.reload());
		}
		if(pin == true){
			fetch(`${document.URL}edit`, {
			 method: 'POST',
			 body: getFormData({
				prefix_id: prefix,
				title: threadTitle,
				discussion_open: 1,
				sticky: 1,
				_xfToken: XF.config.csrf,
				_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
				_xfWithData: 1,
				_xfResponseType: 'json',
			 }),
			}).then(() => location.reload());
		}
		if(may_lens === true) {
			if(prefix == UNACCEPT_PREFIX || prefix == WATCHED_PREFIX || prefix == CLOSE_PREFIX || prefix == DECIDED_PREFIX) {
				moveThread(prefix, 230); }
	
			if(prefix == WAIT_PREFIX) {
				moveThread(prefix, 917);
			}
		}
	}
	
	function moveThread(prefix, type) {
	// Перемещение темы
	const threadTitle = $('.p-title-value')[0].lastChild.textContent;
	
	fetch(`${document.URL}move`, {
	 method: 'POST',
	 body: getFormData({
		prefix_id: prefix,
		title: threadTitle,
		target_node_id: type,
		redirect_type: 'none',
		notify_watchers: 1,
		starter_alert: 1,
		starter_alert_reason: "",
		_xfToken: XF.config.csrf,
		_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
		_xfWithData: 1,
		_xfResponseType: 'json',
	 }),
	}).then(() => location.reload());
	}
	
	function getFormData(data) {
		const formData = new FormData();
		Object.entries(data).forEach(i => formData.append(i[0], i[1]));
		return formData;
	 }
	})();
(function () {
	'use strict';
	const UNACCEPT_PREFIX = 4; // префикс отказано
	const PIN_PREFIX = 2; // префикс закрепить
	const COMMAND_PREFIX = 10; // команде проекта
	const CLOSE_PREFIX = 7; // префикс закрыто
	const DECIDED_PREFIX = 6; // префикс решено
	const TECHADM_PREFIX = 13 // теху администратору
	const WATCHED_PREFIX = 9; // рассмотрено
	const WAIT_PREFIX = 14; // ожидание (для переноса в баг-трекер)
	const NO_PREFIX = 0;
	const closedANDzakrep = 0;
	const buttons = [
	{
		title: 'Приветствие',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] текст [/CENTER][/FONT][/SIZE]',
	},
	{
		title: 'На рассмотрении',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ваша тема взята на рассмотрение, ожидайте ответ в ближайшее время<br>Зачастую рассмотрение темы может занять определенное время, поэтому просьба не создавать дублирующих тем, а так же не оффтопить в данной теме.<br>[CENTER][COLOR=rgb(255, 255, 255)]На рассмотрении[/COLOR][/CENTER][/FONT][/SIZE]',
		prefix: PIN_PREFIX,
		status: true,
	},
	{
title: '41 жб тех',
content:
'Перемещаю тему в соотвествующий раздел',
prefix: closedANDzakrep,
status: false,
},
	{
		title: 'ФОРМА',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Пожалуйста, заполните форму, создав новую тему: <br>[CODE]01. Ваш игровой никнейм:<br>02. Сервер, на котором Вы играете:<br>03. Суть Вашей возникшей проблемы (описать максимально подробно и раскрыто): <br>04. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>05. Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):<br>06. Операционная система и версия:[/CODE]<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/CENTER][/I].[/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'ПРАВИЛА РАЗДЕЛА',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Пожалуйста, убедительная просьба, ознакомиться с назначением данного раздела в котором Вы создали тему, так как Ваш запрос не относится к технической проблеме.<br>Что принимается в тех разделе:<br>Если возникли технические проблемы, которые так или иначе связаны с игровым модом<br>Форма заполнения:<br>[QUOTE]<br>[FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]01.[/COLOR] Ваш игровой никнейм:<br>[COLOR=rgb(226, 80, 65)]02.[/COLOR] Сервер, на котором Вы играете:<br>[COLOR=rgb(226, 80, 65)]03.[/COLOR] Суть возникшей проблемы (описать максимально подробно и раскрыто):<br>[COLOR=rgb(226, 80, 65)]04.[/COLOR] Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>[COLOR=rgb(226, 80, 65)]05.[/COLOR] Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/SIZE][/FONT][/QUOTE]<br>[/CENTER]<br><br>[CENTER][FONT=verdana][SIZE=7][COLOR=rgb(226, 80, 65)][U]Если возникли технические проблемы, которые так или иначе связаны с вылетами из игры и любыми другими проблемами клиента[/U][/COLOR][/SIZE][/FONT][/CENTER]<br><br>[QUOTE]<br>[FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]01. [/COLOR]Ваш игровой ник:<br>[COLOR=rgb(226, 80, 65)]02. [/COLOR]Сервер:<br>[COLOR=rgb(226, 80, 65)]03.[/COLOR] Тип проблемы: Обрыв соединения | Проблема с ReCAPTCHA | Краш игры (закрытие игры) | Другое [Выбрать один вариант ответа]<br>[COLOR=rgb(226, 80, 65)]04. [/COLOR]Действия, которые привели к этому (при вылетах, по возможности предоставлять место сбоя):<br>[COLOR=rgb(226, 80, 65)]05.[/COLOR] Как часто данная проблема:<br>[COLOR=rgb(226, 80, 65)]06.[/COLOR] Полное название мобильного телефона:<br>[COLOR=rgb(226, 80, 65)]07.[/COLOR] Версия Android:<br>[COLOR=rgb(226, 80, 65)]08. [/COLOR]Дата и время (по МСК):<br>[COLOR=rgb(226, 80, 65)]09. [/COLOR]Связь с Вами по Telegram/VK:[/SIZE][/FONT][/QUOTE]" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Дубль',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Данная тема является <u>дубликатом вашей предыдущей темы</u>.<br>Пожалуйста, <u><b>прекратите создавать такие же или похожие темы - в противном случае, Ваш форумный аккаунт может быть заблокирован</b></u>.<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Восст.доступа к аккаунту',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к странице во ВКонтакте[/U], то сбросить пароль или пин-код Вы всегда сможете обратившись в официальное сообщество проекта - https://vk.com/blackrussia.online.<br> Либо в телеграмм бот - https://t.me/br_helper_bot.<br> Напишите «Начать» в личные сообщения группы/бота, затем выберите нужные Вам функции.<br><br>" +
		"[CENTER][FONT=Comfortaa]Подробнее в данной теме - [URL='https://forum.blackrussia.online/index.php?threads/lime-Защита-игрового-аккаунта.1201253/']клик[/URL][/center]<br><br>" +
		"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к почте[/U], то сбросить пароль или пин-код Вы всегда сможете при вводе пароля на сервере. После подключения к серверу нажмите на кнопку «Войти в аккаунт», затем выберите кнопку «Восстановить пароль», после чего на Вашу почту будет отправлено письмо с одноразовым кодом восстановления.<br><br>" +
		"[CENTER]Если Вы [U]не обезопасили свой аккаунт - его невозможно вернуть[/U]. Игрок самостоятельно несет отвественность за безопаность своего аккаунта.<br><br>" +
		'[CENTER]К сожалению, иногда решение подобных вопросов требует много времени. Надеемся, что Вы сможете восстановить доступ к аккаунту!<br>' +
		'[I][COLOR=rgb(255, 255, 255)]Рассмотрено[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
		{
		title: 'Переустановите игру',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Возможно в файлах вашей игры присутствуют постороннее оборудование(дополнения/изменения).<br>" +
		"[CENTER]Рекомендуется удалить полностью лаунчер и связанные с ним файлы и установить игру заново с официального сайта - [URL='https://blackrussia.online']перейти[/URL].<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Рассмотрено[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: DECIDED_PREFIX,
		status: false,
	},
	{
		title: 'Актуально?',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Ваше обращение актуально?[/CENTER][/FONT][/SIZE]",
		prefix: COMMAND_PREFIX,
		status: true,
	},
	
	{
		title: 'Передано логисту для проверки',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Ваша тема закреплена и передана <u>Техническому специалисту по логированию</u> для дальнейшего вердикта,ожидайте ответ в данной теме.<br><br>" +
		'[CENTER]Создавать новые темы с данной проблемой — не нужно.[/CENTER][/FONT][/SIZE]',
		prefix: TECHADM_PREFIX,
		status: true,
	},
	{
		title: 'Мало доквы(пропало имущка дом, скин, авто, акс)',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Для дальнейшего рассмотрения темы, предоставьте:<br><BR>[QUOTE][SIZE=5][FONT=Comfortaa]1. Скриншоты или видео, подтверждающие факт владения этим имуществом.<BR>2. Все детали пропажи: дата, время, после каких действий имущество пропало.<BR>3. Информация о том, как вы изначально получили это имущество:<BR>дата покупки<br>способ приобретения (у игрока, в магазине или через донат;<br>фрапс покупки (если есть);<br>никнейм игрока, у которого было приобретено имущество, если покупка была сделана не в магазине.[/QUOTE]<BR>[/CENTER]'+
		'[CENTER][COLOR=rgb(255, 255, 255)]На рассмотрении[/COLOR][/CENTER][/FONT][/SIZE]',
		prefix: PIN_PREFIX,
		status: true,
	},
	{
		title: 'Мало доквы(не пропажа)',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Для полного рассмотрения темы просим Вас предоставить более подробные доказательства, если таковые имеются.<br>Постарайтесь прикрепить все доказательства к этому моменту, какие у Вас есть.<br><br>На ответ в данную тему у вас имеется 24 часа.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]На рассмотрении[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: PIN_PREFIX,
		status: true,
	},
	{
		title: 'Законопослушность',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]К сожалению, администрация, технические специалисты и другие должностные лица BLACK RUSSIA не могут повлиять на законопослушность вашего аккаунта.<br>Повысить законопослушность можно двумя способами:<BR><BR>1. Каждый PayDay (00 минут каждого часа) вам начисляется одно очко законопослушности(Если только у вас нету PLATINUM VIP-статуса), если за прошедший час вы отыграли не менее 20 минут.<br>2. Приобрести законопослушность в /donate.<BR>[/CENTER]'+
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Антивирус при установке',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]При установке старого игрового клиента антивирусные программы вашего устройства могут ругаться, ничего в этом нету страшного.<br>Нажмите на "Дополнительно" и "Все равно установить" и наслаждайтесь игрой, либо установите Новый Клиент.<BR><BR>[/CENTER][/FONT][/SIZE]'+
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,	
	},
	{
		title: 'ЖБ на ТЕХОВ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Вы получили наказание от технического специалиста Вашего сервера.<br>Вам следует обратиться в раздел «Жалобы на технических специалистов» — в случае, если Вы не согласны с наказанием или хотите его обжаловать.<br><br>' +
		"[CENTER]Ссылка на раздел, где можно оформить жалобу на технического специалиста - [URL='https://forum.blackrussia.online/index.php?forums/Жалобы-на-технических-специалистов.490/']клик[/URL] <br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Команде проекта',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Ваша тема закреплена и находится на рассмотрении у команды проекта. Пожалуйста, ожидайте выноса вердикта разработчиков."+
		"[CENTER]Создавать новые темы с данной проблемой — не нужно, ожидайте ответа в данной теме. Если проблема решится - Вы всегда можете оставить своё сообщение в этой теме.<br>",
		prefix: COMMAND_PREFIX,
		status: true,
	},
	{
		title: 'Известно КП',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Команде проекта уже известно о данной проблеме, она обязательно будет рассмотрена и исправлена. Спасибо за Ваше обращение!<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'ОБТ АНДРОИД',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Если вы нашли какую-либо ошибку во время Открытого Бэта Тестирования то сделайте следующие действия.<br><br>1. Отправьте пожалуйста найденную недоработку в данную форму - [URL='https://docs.google.com/forms/d/e/1FAIpQLSexVwEcvQ9gI6KDjvb65M5A6Yoc5QLyVGWcHjBb21_4BKaX4w/viewform']клик[/URL]<br>2. Передайте данную форму своим друзьям, для ускорения процесса по сбору багов для их исправления.<br><br>Спасибо за ваш вклад в развитие игры!<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
		prefix: CLOSE_PREFIX,
		status: false,
	},
		{
		title: 'ОБТ ИОС',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Если вы нашли какую-либо ошибку во время Открытого Бэта Тестирования iOS то сделайте следующие действия.<br><br>1. Отправьте пожалуйста найденную недоработку в данную форму - [URL='https://forms.gle/4adcNvKisfKF59Fi8']клик[/URL]<br>2. Передайте данную форму своим друзьям, для ускорения процесса по сбору багов для их исправления.<br><br>Спасибо за ваш вклад в развитие игры!<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
		prefix: CLOSE_PREFIX,
		status: false,
	},
 
	{
		title: 'Почему у меня пропали все темы из раздела Жалобы?',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Раздел 'Жалобы' переведен в приватный режим, а именно:<br>Тему созданную пользователем пожет видеть <b>он сам</b> и <b>Администрация сервера</b>.<br>Ознакомиться с формой подачи тем в тот или иной раздел можно по данной ссылке: [URL='https://forum.blackrussia.online/index.php?forums/Правила-подачи-жалоб.202/']клик[/URL]<br>Приятного времяпрепровождения на нашем форуме<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
		prefix: CLOSE_PREFIX,
		status: false,
	},
{
		title: 'ИОС/АНДРОИД?',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Для решения вашего обращения, просьба уточнить операционную систему на которой вы столкнулись с данной проблемой (IOS / Android).[/CENTER][/FONT][/SIZE]",
		prefix: PIN_PREFIX,
		status: true,
	},
	{
		title: 'Не весь рейтинг за груз',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Наша система постоена следующим образом<br>Рейтинг зависит от поломки автомобиля чем серьёзнее поломка, тем меньше будет засчитан рейтинг.<br>Поломка учитывается вся за время рейса с грузом, в независимости от того если Вы почините Ваш автомобиль, поломка до, будет учтена.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	},
	{
		title: 'ТоСТЕРАМ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Ваша тема передана на тестирование.[/CENTER][/FONT][/SIZE]",
		 prefix: WAIT_PREFIX,
		 status: false,
	},
	{
		title: 'Ответ от ТоСТЕРОВ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ответ от тестерского отдела дан выше.<br><br>' +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,
	},
	{
		title: 'Пропали вещи с аукциона',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Если вы выставили свои вещи на аукцион а их никто не купил, то воспользуйтесь командой [COLOR=rgb(251, 160, 38)]/reward[/COLOR]<br> В случае отсутствии вещей там, приложите скриншоты с + /time в новой теме<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Если не работает ссылка в сообщении на форуме',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]По техническим причинам данное действие невозможно, пожалуйста воспользуйтесь копированием ссылки от сюда:<br>[img]https://i.ibb.co/SX77Fgw/photo-2022-08-20-16-31-57.jpg[/img]<br>Если данный способ не помогает, то используйте сервис сокращения ссылок https://clck.ru<br> Либо попробуйте вот так:<br>1) загрузка скриншота биографии на фотохостинг<br>2) в описание прикрепить ссылку с форума<br>3) скопировать пост с фотохостинга<br><br>2 способ:<br>Сократите ссылки для Ваших скриншотов и RP биографии, сделать можно тут goo.su также Iformation замените на русский текст, просмотрите еще текст полностью и постарайтесь уменьшить такие знаки как !?<br>goo.su[/CENTER]<br>"+
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'В раздел госс',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ваша тема не относится к техническому разделу, пожалуйста оставьте ваше заявление в соответствующем разделе государственной организации вашего сервера.[/CENTER]<br><br>'+
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'В раздел крайм',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Доброе время суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ваша тема не относится к техническому разделу, пожалуйста оставьте ваше заявление в соответствующем разделе Криминальных Организаций вашего сервера [/CENTER]'+
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Жб на адм',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Вы получили наказание от администратора вашего сервера.<br> Если вы с ним не согласны, обратитесь в раздел Жалобы на администрацию вашего сервера.<br>Так же, ознакомьтесь с формой для подачи жалобы - [URL='https://forum.blackrussia.online/index.php?threads/Правила-подачи-жалоб-на-администрацию.3429349/']тут[/URL]<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,
	},
	{
		title: 'Жб на игроков',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Данная тема не относится к техническому разделу.<br>Данное действие было совершено игроком и нарушает правила сервера, пожалуйста обратитесь в <br>'Жалобы на игроков'<br>Вашего сервера.<br>Форма подачи жалобы - [URL='https://forum.blackrussia.online/index.php?threads/Правила-подачи-жалоб-на-игроков.3429394/']тык[/URL]" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,
	},
{
		title: 'Жб на лидеров',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Данная тема не относится к техническому разделу.<br>Данное действие было совершено лидером, пожалуйста обратитесь в <br>'Жалобы на лидеровв'<br>Вашего сервера.<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,
	},
	{
		title: 'Обжалования',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Вы получили наказание от администратора своего сервера.<br> Для его снижения/обжалования обратитесь в раздел<br><<Обжалования>> вашего сервера.<br>Форма подачи темы - [URL='https://forum.blackrussia.online/index.php?threads/Правила-подачи-заявки-на-обжалование-наказания.3429398/']клик[/URL]" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,
	},
	{
		title: 'Сервер не отвечает',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Если у Вас встречаются такие проблемы, как «Сервер не отвечает», не отображаются сервера в лаунчере, не удаётся выполнить вход на сайт/форум, попробуйте совершить следующие действия: <br><br>" +
		"[LEFT]• Сменить IP-адрес любыми средствами; <br>" +
		"[LEFT]• Переключиться на Wi-Fi/мобильный интернет или на любую доступную сеть; <br>"+
		"[LEFT]• Использование VPN; <br>"+
		"[LEFT]• Перезагрузка роутера.<br><br>" +
	
		"[CENTER]Если методы выше не помогли, то переходим к следующим шагам: <br><br>" +
	
		'[LEFT]1. Устанавливаем приложение «1.1.1.1: Faster & Safer Internet» Ссылка: https://clck.ru/ZP6Av и переходим в него.<br>'+
		'[LEFT]2. Соглашаемся со всей политикой приложения.<br>'+
		'[LEFT]3. Нажимаем на ползунок и ждем, когда текст изменится на «Подключено».<br>'+
		'[LEFT]4. Проверяем: Отображаются ли серверы? Удается ли выполнить вход в игру? Работают ли другие источники (сайт, форум)? <br>' +
	
		"[CENTER]📹 Включение продемонстрировано на видео: https://youtu.be/Wft0j69b9dk<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title:'Кик за ПО(другое)' ,
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Во время игрового процесса у вас произошла потеря пакетов интернета, в следствие чего - вы были кикнуты из игры.[CENTER]"+
		"[CENTER]Настоятельно рекомендуем проверить стабильность и качество своего интернет-соединения.Благодарим за обращение, желаем приятного времяпровождения.<br>"+
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,},
  	{
		title: 'Кик за ПО(Дальнобой/стрельба)',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Если вы были кикнуты из игры за "Подозрительное ПО"<br>Это могло произойти по одной из причин:<br><b>Вы полностью не остановились на метке для разгрузки/загрузки на работе дальнобойщика</b><br>При стрельбе вы постоянно нажимали на кнопку стрельбы.<br>Старайтесь избегать данных действий.<br>[CENTER][COLOR=rgb(255, 255, 255)]Закрыто.[/COLOR][/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	}, 
	{
		title: 'Если не пришел донат',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Система построена таким образом, что <b>деньги не спишутся, пока наша платформа не уведомит платежную систему о зачислении BLACK COINS</b>. Для проверки зачисления BLACK COINS необходимо ввести в игре команду: <u>/donat</u>.<br>' +
		'[CENTER]В остальных же случаях, <b>если не были зачислены BLACK COINS — вероятнее всего, была допущена ошибка при вводе реквизитов</b>. К нашему сожалению, из-за большого количества попыток обмана, мы перестали рассматривать подобные жалобы.<br><i>Вам необходимо быть внимательными при осуществлении покупок</i>.<br>' +
		'[CENTER]Если Вы считаете, что ошибки быть не может и с момента оплаты не прошло более 14 дней, то в обязательном порядке обратитесь в данное сообщество для дальнейшего решения: https://vk.com/br_tech.<br>' +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Донат',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Мы рассмотрели ваш запрос о возврате денежных средств и сообщаем следующее.<br><br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Запуская игру, пользователь <u>соглашается с правилами её использования</u>, которые изложены в <u>Пользовательском соглашении</u>, что по смыслу ст. 435 и 438 Гражданского кодекса РФ является принятием (акцептом) оферты Компании https://blackrussia.online/oferta.php, а равно заключением договора.<br><br>Согласно Пользовательскому соглашению <u>«Внутриигровая валюта» – виртуальная внутриигровая валюта</u>, являющаяся неактивированными данными и командами, которая не имеет денежной стоимости и не подлежит денежной оценке, хотя и имеет цену на момент приобретения.<br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Согласно п. Политика возврата платежей, Пользовательского соглашения денежные средства за внутриигровые товары не подлежат возврату с момента появления Внутриигровой валюты на счете аккаунта.<br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Согласно п. Политика возврата платежей, Пользовательского соглашения пользователь самостоятельно следит за безопасностью своего аккаунта, сам несет ответственность за все действия, которые выполняются в сервисах с помощью его аккаунта, а также в нем самом.<br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Согласно п. Политика возврата платежей, Пользовательского соглашения пользователь гарантирует, что он имеет право использовать выбранные им платежные средства, не нарушая при этом законодательства РФ и/или законодательства иной страны, гражданином которой является пользователь, и прав третьих лиц.<br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Компания /u>не несет ответственности за возможный ущерб третьим лицам</u>, причиненный в результате использования пользователем не принадлежащих ему средств оплаты.<br><br> ' +
		'[SIZE=4][FONT=Comfortaa][CENTER]</u>Совершая покупки внутри игры</u>, а также предоставляя платежную информацию, Вы гарантируете, что являетесь законным владельцем платёжного средства и аккаунта, связанного с данным платежом.<br><br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Все действия с картой считаются совершенными с Вашего ведома и согласия, то есть лично владельцем карты.<br><br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Кроме того, в соответствии законодательством РФ родители несут имущественную ответственность по сделкам малолетнего, в том числе по сделкам, совершенным им самостоятельно.<br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Таким образом, если Вы являетесь законными представителем, Вы отвечаете за действия ребёнка внутри игры. Компания не может отслеживать действия несовершеннолетнего и нести за них ответственность.<br><br>' +
		'[SIZE=4][FONT=Comfortaa][CENTER]Таким образом основания для возврата денежных средств отсутствуют.<br>' +
		'[CENTER][I]Решено[/I].[/CENTER][/FONT][/SIZE]',
	 prefix: DECIDED_PREFIX,
	 status: false,
	},
	{
		title: 'Слетел аккаунт',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Аккаунт не может пропасть или аннулироваться просто так. Даже если Вы меняете ник, используете кнопки «починить игру» или «сброс настроек» - Ваш аккаунт не удаляется. Система работает иначе.<br><br>" +
		"[CENTER]Проверьте ввод своих данных: пароль, никнейм и сервер. Зачастую игроки просто забывают ввести актуальные данные и считают, что их аккаунт был удален. Будьте внимательны!" +
		'[CENTER]Как ввести никнейм (на случай, если сменили в игре, но не поменяли в клиенте): https://youtu.be/c8rhVwkoFaU [/CENTER] <br><br>' +
		'[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
	 prefix: CLOSE_PREFIX,
	 status: false,
	},
	{
		title: 'Если нет скринов/видео',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Без доказательств (в частности скриншоты или видео) – решить проблему не получится. Если доказательства найдутся - создайте новую тему, приложив доказательства с фото-хостинга<br>[URL='https://yapx.ru/']yapx.ru[/URL],<br>[URL='https://imgur.com/']imgur.com[/URL],<br>[URL='https://www.youtube.com/']youtube.com[/URL],<br>[URL='https://imgbb.com']ImgBB.com[/URL]<br>(все кликабельно).<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Будет исправлено',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Данная недоработка будет проверена и исправлена.<br> Спасибо, ценим Ваш вклад в развите проекта.<br>" +
		'[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
	{
		title: 'Правила восстановления',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений - [URL='https://forum.blackrussia.online/index.php?threads/В-каких-случаях-мы-не-восстанавливаем-игровое-имущество.25277/']клик[/URL].<br>Вы создали тему, которая не относится к технической проблеме.[/CENTER]<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/CENTER][/I].[/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'КРАШ/ВЫЛЕТ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]В том случае, если Вы вылетели из игры во время игрового процесса (произошел краш), в обязательном порядке необходимо обратиться в данную тему в любом техническом разделе [img]https://i.ibb.co/sPhBGjx/NVIDIA-Share-1-Tde-EHim0u.png[/img][/CENTER]<br>" +
		"[CENTER][CODE]01. Ваш игровой никнейм: <br> 02. Сервер: <br> 03. Тип проблемы: Обрыв соединения | Проблема с ReCAPTCHA | Краш игры (закрытие игры) | Другое [Выбрать один вариант ответа] <br> 04. Действия, которые привели к этому (при вылетах, по возможности предоставлять место сбоя): <br> 05. Как часто данная проблема: <br> 06. Полное название мобильного телефона: <br> 07. Версия Android: <br> 08. Дата и время (по МСК): <br> 09. Связь с Вами по Telegram/VK:[/CODE]<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/CENTER][/I].[/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Баг ФСИН(не выпустило)',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Скоро будете выпущены,ожидайте.[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'ХОЧУ СТАТЬ АДМ/ХЕЛПЕРОМ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Команда технических специалистов не решает назначение на какую-либо должность, которая присутствует на проекте.<br>Для этого существуют заявления в главном разделе Вашего игрового сервера, где Вы можете ознакомиться с открытыми должностями и формами подач.<br>Приятной игры и желаем удачи в карьерной лестнице!<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Улучшения для серверов',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ваша тема не относится к технической проблеме, если вы хотите предложить изменения в игровом моде - обратитесь в раздел <br> [URL="https://forum.blackrussia.online/index.php?categories/Предложения-по-улучшению.656/"] Предложения по улучшению → нажмите сюда[/URL].<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]' ,
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Вам нужны все прошивки',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Для активации какой либо прошивки необходимо поставить все детали данного типа "SPORT" "SPORT+" и т.п.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Гифки баннер/авы',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Временно, из-за большой нагрузки на форум возможность поставить анминированные аватары и баннеры отключена.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'в поддержку',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Пожалуйста, обратитесь в Техническую поддержку - @br_tech<br>ВКонтакте - http://vk.com/br_tech<br>Телеграм - https://t.me/br_techBot<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Рассмотрено[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
	{
		title: 'Нельзя чекнуть докву',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Доказательства, прикрепленные вами невозможно просмотреть. <br> Для полного рассмотрения вашей проблемы создайте новую тему, прикрепив рабочие доказательства.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
{
		title: 'Если доква из вк',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Доказательства из социальных сетей - не принимаются. Для рассмотрения, создайте новую тему, приложив доказательства с фото-хостинга<br>[URL='https://yapx.ru/']yapx.ru[/URL],<br>[URL='https://imgur.com/']imgur.com[/URL],<br>[URL='https://www.youtube.com/']youtube.com[/URL],<br>[URL='https://imgbb.com']ImgBB.com[/URL]<br>(все кликабельно).<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
    {
		title: 'Забаньте мультиакк',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Пожалуйста, ознакомьтесь с назначением технического раздела, в данном разделе рассматриваются темы с выявленными недоработками системы, проблемы, связанные с игровым процессом (технические).<br>Ваше обращение не входит в перечень рассматриваемых тем в данном разделе.<br><br>К тому же, хотим отметить, что при блокировке аккаунтов по данной причине основной аккаунт и 2 твинка останутся нетронутыми.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
        prefix: CLOSE_PREFIX,
		status: false,
	},
	{
		title: 'Привязки изменить/привязать',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Мы рассмотрели ваш запрос о изменении привязок.<br>Команда технических специалистов, администрация и другие дожностные лица не занимаются привязкой или же изменением дополнительной безопастности аккаунта.<br>[CENTER][I][COLOR=rgb(255, 255, 255)]Рассмотрено[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
	{
		title: 'Привязки отвязать чужие',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER] Мы рассмотрели ваш запрос о изменении привязок.<br>Команда технических специалистов, администрация и другие дожностные лица не занимаются привязкой или же изменением дополнительной безопастности аккаунта.<br>Дополнительно к этому, ваша тема передана техническому специалисту по логированию для проверки на взлом Вашего аккаунта.[CENTER][I][COLOR=rgb(255, 255, 255)][/COLOR][/I][/CENTER][/FONT][/SIZE]',
		prefix: TECHADM_PREFIX,
		status: true,
	},
	{
title: 'ᅠ ᅠᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ ᅠ Для жб техов ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ ᅠ',
	},
 
	{
		title: 'Форма подачи "ЖБ НА ТЕХ"',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Пожалуйста, заполните форму, создав новую тему: Название темы с NickName технического специалиста<br>Пример:<br> Lev_Kalashnikov | махинации<br>Форма заполнения темы:<br>[code]01. Ваш игровой никнейм:<br>02. Игровой никнейм технического специалиста:<br>03. Сервер, на котором Вы играете:<br>04. Описание ситуации (описать максимально подробно и раскрыто):<br>05. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>06. Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/code]<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'ПРАВИЛА РАЗДЕЛА ЖБ ТЕХ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Пожалуйста, убедительная просьба, ознакомиться с назначением данного раздела в котором Вы создали тему, так как Ваш запрос не относится к жалобам на технических специалистов.<br>Что принимается в данном разделе:<br>Жалобы на технических специалистов, оформленные по форме подачи и не нарушающие правила подачи:<br> [FONT=verdana][SIZE=7][COLOR=rgb(226, 80, 65)][U]Правила подачи жалобы на технических специалистов[/U][/COLOR][/SIZE][/FONT][/CENTER]<br><br>[QUOTE][FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]01.[/COLOR] Ваш игровой никнейм:[FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]<br>02.[/COLOR] Игровой никнейм технического специалиста:[COLOR=rgb(226, 80, 65)]<br>03.[/COLOR] Сервер, на котором Вы играете:[COLOR=rgb(226, 80, 65)]<br>04.[/COLOR] Описание ситуации (описать максимально подробно и раскрыто):[COLOR=rgb(226, 80, 65)]<br>05.[/COLOR] Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):[COLOR=rgb(226, 80, 65)]<br>06.[/COLOR] Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/SIZE][/FONT][/SIZE][/QUOTE]<br><br>[FONT=verdana][SIZE=4][FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]Примечание:[/COLOR] все оставленные заявки обращения в данный раздел обязательно должны быть составлены по шаблону предоставленному немного выше.<br>В ином случае, заявки обращения в данный раздел составленные не по форме — будут отклоняться.<br>Касательно названия заголовка темы — четких правил нет, но, желательно чтобы оно содержало лишь никнейм и сервер технического специалиста.<br>Заранее, настоятельно рекомендуем ознакомиться [U][B][URL='https://forum.blackrussia.online/index.php?forums/faq.231/']с данным разделом[/URL][/B][/U].[/SIZE][/FONT][/SIZE][/FONT]<br>[CENTER][FONT=verdana][SIZE=7][COLOR=rgb(226, 80, 65)][U]Какие жалобы не проверяются?[/U][/COLOR][/SIZE][/FONT][/CENTER]<br><br>[FONT=verdana][SIZE=4][COLOR=rgb(226, 80, 65)]—[/COLOR] Если в содержании темы присутствует оффтоп/оскорбления.<br>[SIZE=4][COLOR=rgb(226, 80, 65)]—[/COLOR] Если в заголовке темы отсутствует никнейм технического специалиста.<br>[COLOR=rgb(226, 80, 65)]—[/COLOR] С момента выдачи наказания прошло более 7 дней.[/SIZE][/SIZE][/FONT]<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Вам в Технический раздел',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Ваша тема не относится к жалобам на технических специалистов, обратитесь с данной темой в <u>технический раздел вашего сервера</u> - [URL='https://forum.blackrussia.online/index.php?forums/Технический-раздел.22/']клик[/URL]<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Восст.доступа к аккаунту',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к странице во ВКонтакте[/U], то сбросить пароль или пин-код Вы всегда сможете обратившись в официальное сообщество проекта - https://vk.com/blackrussia.online.<br> Либо в телеграмм бот - https://t.me/br_helper_bot.<br> Напишите «Начать» в личные сообщения группы/бота, затем выберите нужные Вам функции.<br><br>" +
		"[CENTER][FONT=Comfortaa]Подробнее в данной теме - [URL='https://forum.blackrussia.online/index.php?threads/lime-Защита-игрового-аккаунта.1201253/']клик[/URL][/center]<br><br>" +
		"[CENTER]Если Вы обезопасили Ваш аккаунт и [U]привязали его к почте[/U], то сбросить пароль или пин-код Вы всегда сможете при вводе пароля на сервере. После подключения к серверу нажмите на кнопку «Войти в аккаунт», затем выберите кнопку «Восстановить пароль», после чего на Вашу почту будет отправлено письмо с одноразовым кодом восстановления.<br><br>" +
		"[CENTER]Если Вы [U]не обезопасили свой аккаунт - его невозможно вернуть[/U]. Игрок самостоятельно несет отвественность за безопаность своего аккаунта.<br><br>" +
		'[CENTER]К сожалению, иногда решение подобных вопросов требует много времени. Надеемся, что Вы сможете восстановить доступ к аккаунту!<br>' +
		'[I][COLOR=rgb(255, 255, 255)]Рассмотрено[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: WATCHED_PREFIX,
		status: false,
	},
		{
		title: 'НЕ ОТНОСИТСЯ',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		'[CENTER]Ваше обращение не относится к жалобам на технических специалистов.<br>' +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
	{
		title: 'Правила восстановления',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений - [URL='https://forum.blackrussia.online/index.php?threads/В-каких-случаях-мы-не-восстанавливаем-игровое-имущество.25277/']клик[/URL].<br> Вы создали тему, которая не относится к технической проблеме.[/CENTER]<br><br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: UNACCEPT_PREFIX,
		status: false,
	},
{
		title: 'Отсутствие ответа',
		content:
		'[SIZE=4][FONT=Comfortaa][CENTER]Приветствую, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>' +
		"[CENTER]По техническими соображениям было принято решение закрыть данное обращение.<br><br>" +
		"[CENTER]Если данная проблема все ещё актуальна, пожалуйста оставьте новую заявку в данном разделе ещё раз.<br>" +
		'[CENTER][I][COLOR=rgb(255, 255, 255)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
		prefix: CLOSE_PREFIX,
		status: false,
	},
	];
	
	$(document).ready(() => {
	// Загрузка скрипта для обработки шаблонов
	$('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');
	
	// Добавление кнопок при загрузке страницы
	addButton('ТЕХ', 'selectAnswer1', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(0, 250, 154, 0.9);');
	addButton('На рассм.', 'pin', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(255, 173, 51, 0.5);');
	addButton('Команде проекта', 'teamProject', 'border-radius: 12px; margin-right: 5px; border: 2px solid;  border-color: rgb(255, 240, 110, 0.5);');
    addButton('Тех. спецу', 'techspec', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(17, 92, 208, 0.5);');
	addButton('Рассмотрено', 'watched', 'border-radius: 12px; margin-right: 5px; border: 2px solid;  border-color: rgb(110, 192, 113, 0.5)');
	addButton('Решено', 'decided', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(110, 192, 113, 0.5);');
    addButton('Отказано', 'unaccept', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(220, 89, 89, 0.5);');
	addButton('Закрыто', 'closed', 'border-radius: 12px; margin-right: 5px; border: 2px solid; border-color: rgb(220, 89, 89, 0.5);');
 
	
	// Поиск информации о теме
	const threadData = getThreadData();
	
	$(`button#ff`).click(() => pasteContent(8, threadData, true));
	$(`button#prr`).click(() => pasteContent(2, threadData, true));
	$(`button#zhb`).click(() => pasteContent(21, threadData, true));
	$('button#unaccept').click(() => editThreadData(UNACCEPT_PREFIX, false));
	$('button#pin').click(() => editThreadData(PIN_PREFIX, true));
	$('button#teamProject').click(() => editThreadData(COMMAND_PREFIX, true));
	$('button#watched').click(() => editThreadData(WATCHED_PREFIX, false));
	$('button#decided').click(() => editThreadData(DECIDED_PREFIX, false));
	$('button#closed').click(() => editThreadData(CLOSE_PREFIX, false));
	$('button#closed_complaint').click(() => editThreadData(CLOSE_PREFIX, false, false));
	$('button#techspec').click(() => editThreadData(TECHADM_PREFIX, true));
	$('button#closedd').click(() => editThreadData(false)); 
	
	$(`button#selectAnswer1`).click(() => {
	XF.alert(buttonsMarkup(buttons), null, 'ВЫБЕРИТЕ ОТВЕТ');
	buttons.forEach((btn, id) => {
	if (id > 1 ) {
	$(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
	}
	else {
	$(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
	}
 
	});
	});
	});
	
	function addButton(name, id, style) {
         $('.button--icon--reply').before(
	`<button type="button" class="button--primary button rippleButton" id="${id}" style="${style}">${name}</button>`,
	);
	}
	function addAnswers() {
		$('.button--icon--reply').after(`<button type="button" class="button--cta uix_quickReply--button button button--icon button--icon--write rippleButton" id="selectAnswer" style="oswald: 3px; margin-left: 15px; border-radius: 25px;">ОТВЕТЫ</button>`,
	);
	}
	
	function buttonsMarkup(buttons) {
	return `<div class="select_answer">${buttons
	.map(
	(btn, i) =>
	`<button id="answers-${i}" class="button--primary button ` +
	`rippleButton" style="margin:4px"><span class="button-text">${btn.title}</span></button>`,
	)
	.join('')}</div>`;
	}
	
	function pasteContent(id, data = {}, send = false) {
	const template = Handlebars.compile(buttons[id].content);
	if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();
	
	$('span.fr-placeholder').empty();
	$('div.fr-element.fr-view p').append(template(data));
	$('a.overlay-titleCloser').trigger('click');
	
	if (send == true) {
	editThreadData(buttons[id].prefix, buttons[id].status);
	$('.button--icon.button--icon--reply.rippleButton').trigger('click');
	}
	}
	
	function getThreadData() {
	const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
	const authorName = $('a.username').html();
	const hours = new Date().getHours();
	return {
	user: {
	id: authorID,
	name: authorName,
	mention: `[USER=${authorID}]${authorName}[/USER]`,
	},
	greeting: () =>
	4 < hours && hours <= 11 ?
	'Доброе утро' :
	11 < hours && hours <= 15 ?
	'Добрый день' :
	15 < hours && hours <= 21 ?
	'Добрый вечер' :
	'Доброй ночи',
	};
	}
	
	function editThreadData(prefix, pin = false, may_lens = true) {
	// Получаем заголовок темы, так как он необходим при запросе
		const threadTitle = $('.p-title-value')[0].lastChild.textContent;
		if (prefix == closedANDzakrep) {
    moveThread(1841);
    } 
		if(pin == false){
			fetch(`${document.URL}edit`, {
			 method: 'POST',
			 body: getFormData({
				prefix_id: prefix,
				title: threadTitle,
				_xfToken: XF.config.csrf,
				_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
				_xfWithData: 1,
				_xfResponseType: 'json',
			 }),
			}).then(() => location.reload());
		}
		if(pin == true){
			fetch(`${document.URL}edit`, {
			 method: 'POST',
			 body: getFormData({
				prefix_id: prefix,
				title: threadTitle,
				discussion_open: 1,
				sticky: 1,
				_xfToken: XF.config.csrf,
				_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
				_xfWithData: 1,
				_xfResponseType: 'json',
			 }),
			}).then(() => location.reload());
		}
		if(may_lens === true) {
			if(prefix == UNACCEPT_PREFIX || prefix == WATCHED_PREFIX || prefix == CLOSE_PREFIX || prefix == DECIDED_PREFIX) {
				moveThread(prefix, 230); }
	
			if(prefix == WAIT_PREFIX) {
				moveThread(prefix, 917);
			}
		}
	}
	
	function moveThread(prefix, type) {
	// Перемещение темы
	const threadTitle = $('.p-title-value')[0].lastChild.textContent;
	
	fetch(`${document.URL}move`, {
	 method: 'POST',
	 body: getFormData({
		prefix_id: prefix,
		title: threadTitle,
		target_node_id: type,
		redirect_type: 'none',
		notify_watchers: 1,
		starter_alert: 1,
		starter_alert_reason: "",
		_xfToken: XF.config.csrf,
		_xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
		_xfWithData: 1,
		_xfResponseType: 'json',
	 }),
	}).then(() => location.reload());
	}
	
	function getFormData(data) {
		const formData = new FormData();
		Object.entries(data).forEach(i => formData.append(i[0], i[1]));
		return formData;
	 }
	})();
