// ==UserScript==
// @name Скрипт for tech by d.pyatak
// @namespace https://forum.blackrussia.online
// @version 1.1
// @description лучший скрипт на georgia
// @author Danila_Pyatak
// @match https://forum.blackrussia.online/threads/*
// @include https://forum.blackrussia.online/threads/
// @grant none
// @license none
// @icon https://i.yapx.ru/ViO6c.png
// @downloadURL https://update.greasyfork.org/scripts/485725/%D0%A1%D0%BA%D1%80%D0%B8%D0%BF%D1%82%20for%20tech%20by%20dpyatak.user.js
// @updateURL https://update.greasyfork.org/scripts/485725/%D0%A1%D0%BA%D1%80%D0%B8%D0%BF%D1%82%20for%20tech%20by%20dpyatak.meta.js
// ==/UserScript==

(function () {
  "use strict";
  const UNACCEPT_PREFIX = 4; // префикс отказано
  const PIN_PREFIX = 2; //  префикс закрепить
  const COMMAND_PREFIX = 10; // команде проекта
  const CLOSE_PREFIX = 7; // префикс закрыто
  const DECIDED_PREFIX = 6; // префикс решено
  const TECHADM_PREFIX = 13; // теху администратору
  const WATCHED_PREFIX = 9; // рассмотрено
  const WAIT_PREFIX = 14; // ожидание (для переноса в баг-трекер)
  const NO_PREFIX = 0;
  const buttons = [
    {
      title: "Приветствие",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Здесь вставьте Ваш текст[/CENTER][/FONT][/SIZE]",
    },
    {
      title:
        "ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ⠀ᅠ ᅠ ᅠᅠДля специалистов в направлении логирования  ᅠᅠ ⠀ᅠᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ",
      dpstyle:
        "oswald: 3px;     color: #fff; background: #db2309; box-shadow: 0 0 2px 0 rgba(0,0,0,0.14),0 2px 2px 0 rgba(0,0,0,0.12),0 1px 3px 0 rgba(0,0,0,0.2); border: none; border-color: #f53317",
    },
    {
      title: "Взято на рассмотрение",
      content:
        "[CENTER][FONT=georgia][SIZE=4]Доброго времени суток, уважаемый {{ user.mention }}![/CENTER][/FONT][/SIZE]<br>" +
        "[CENTER][FONT=georgia][SIZE=4]Ваша тема взята на рассмотрение.[/CENTER][/FONT][/SIZE]<br>" +
        "[CENTER][FONT=georgia][SIZE=4]Часто, рассмотрение может занять некоторое время.[/CENTER][/FONT][/SIZE]<br>" +
        "[CENTER][FONT=georgia][SIZE=4]Пожалуйста, ожидайте вердикт в данной теме и не создавайте дубликаты.[/CENTER][/FONT][/SIZE]<br>" +
        "[CENTER][COLOR=rgb(255, 140, 0)][FONT=georgia][SIZE=4]На рассмотрении.[/COLOR][/SIZE][/FONT][/CENTER]",
      prefix: PINN_PREFIX,
      status: true,
    },

    //можно удалить в дальнейшем
    {
      title: "Не относится к жалобам на тех.",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваше обращение не относится к жалобам на технических специалистов.<br> Пожалуйста ознакомьтесь с правилами данного раздела: [URL='https://forum.blackrussia.online/forums/Информация-для-игроков.231/']клик[/URL] <br>" +
        "[CENTER][COLOR=rgb(255,0,0)]Отказано/[/COLOR][/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    //можно удалить в дальнейшем
    {
      title: "Игрок будет заблокирован",
      content:
      "[CENTER][FONT=georgia][SIZE=4]Доброго времени суток, уважаемый {{ user.mention }}![/CENTER][/FONT][/SIZE]<br>" +
      "[CENTER][FONT=georgia][SIZE=4]Спасибо за всю предоставленную информацию.[/CENTER][/FONT][/SIZE]<br>" +
      "[CENTER][FONT=georgia][SIZE=4]Игрок будет заблокирован по соответствующему пункту правил проекта.[/CENTER][/FONT][/SIZE]<br>" +
      "[CENTER][COLOR=rgb(124, 252, 0)][FONT=georgia][SIZE=4]Одобрено.[/COLOR][/SIZE][/FONT][/CENTER]",
    },
    {
      title: "Игрок не будет заблокирован",
      content:
      "[CENTER][FONT=georgia][SIZE=4]Доброго времени суток, уважаемый {{ user.mention }}![/CENTER][/FONT][/SIZE]<br>" +
      "[CENTER][FONT=georgia][SIZE=4]Проверил предоставленные Вами доказательства, а также систему логирования.[/CENTER][/FONT][/SIZE]<br>" +
      "[CENTER][FONT=georgia][SIZE=4]Оснований для блокировки игрока недостаточно.[/CENTER][/FONT][/SIZE]<br>" +
      "[CENTER][COLOR=rgb(255, 0, 0)][FONT=georgia][SIZE=4]Закрыто.[/COLOR][/SIZE][/FONT][/CENTER]",
    },
    {
      title:
        "ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ         ᅠ⠀⠀ ⠀⠀ᅠ ᅠᅠДля специалистов в направлении Форум  ᅠᅠ ᅠᅠ⠀⠀⠀ ⠀ᅠ     ᅠ ᅠ     ᅠ ᅠ ᅠ ",
      dpstyle:
        "oswald: 3px;     color: #fff; background: #db2309; box-shadow: 0 0 2px 0 rgba(0,0,0,0.14),0 2px 2px 0 rgba(0,0,0,0.12),0 1px 3px 0 rgba(0,0,0,0.2); border: none; border-color: #f53317",
    },
    {
      title: "Форма подачи",
      content:
        "[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Пожалуйста, заполните форму, создав новую тему: <br>[CODE]01. Ваш игровой никнейм:<br>02. Сервер, на котором Вы играете:<br>03. Суть Вашей возникшей проблемы (описать максимально подробно и раскрыто): <br>04. Любые скриншоты, которые могут помочь в решении проблемы (если таковые имеются):<br>05. Дата и время произошедшей технической проблемы (постарайтесь указать максимально точно):[/CODE]<br><br>" +
        "[CENTER][COLOR=rgb(255,0,0)]Отказано.[/COLOR][/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
        title: "Не относится к тех.раздел",
        content:
          "[CENTER][FONT=georgia][SIZE=4]Доброго времени суток, уважаемый {{ user.mention }}![/CENTER][/FONT][/SIZE]<br>" +
          "[CENTER][FONT=georgia][SIZE=4]Созданная Вами тема никак не относится к данному разделу.[/CENTER][/FONT][/SIZE]<br>" +
          "[CENTER][FONT=georgia][SIZE=4]Убедительная просьба не создавать дубликаты, иначе Ваш ФА может быть заблокирован.[/CENTER][/FONT][/SIZE]<br>" +
          "[CENTER][COLOR=rgb(255, 0, 0)][FONT=georgia][SIZE=4]Закрыто.[/COLOR][/SIZE][/FONT][/CENTER]",
        prefix: UNACCEPT_PREFIX,
        status: false,
      },
    {
      title: "Не относится к тех. разделу",
      content:
        "[SIZE=4][FONT=georgia][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваше обращение не относится к техничекому разделу.<br> Пожалуйста ознакомьтесь с правилами данного раздела: [URL='https://forum.blackrussia.online/forums/Информация-для-игроков.231/']клик[/URL] <br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Оффтоп",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваше обращение содержит контент, который нарушает правила пользования форумом. Пожалуйста, прекратите создавать подобные обращения, иначе Ваш форумный аккаунт может быть наделен статусом временной или постоянной блокировки.<br>Ознакомиться с правилами пользования форумом Вы можете здесь: [URL='https://forum.blackrussia.online/threads/%D0%9E%D0%B1%D1%89%D0%B8%D0%B5-%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BD%D0%B0%D1%85%D0%BE%D0%B6%D0%B4%D0%B5%D0%BD%D0%B8%D1%8F-%D0%BD%D0%B0-%D1%84%D0%BE%D1%80%D1%83%D0%BC%D0%B5.304564/']клик[/URL] <br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Проблема решилась",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Благодарим Вас за поддержание обратной связи! Мы искренне рады за то, что Ваша проблема была решена и мы смогли помочь Вам.<br>Если Вы вновь столкнетесь с той или иной проблемой или же недоработкой — обязательно обращайтесь в технический раздел. Приятной игры!<br><br>" +
        "[CENTER][I][COLOR=rgb(0,255,0)]Решено[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: DECIDED_PREFIX,
      status: false,
    },
    {
      title: "Отвязка привязок",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Удалить установленные на аккаунт привязки не представляется возможным. В том случае, если на Ваш игровой аккаунт были установлены привязки взломщиком — он будет перманентно заблокирован с причиной «Чужая привязка». В данном случае дальнейшая разблокировка игрового аккаунта невозможна во избежание повторных случаев взлома — наша команда не может быть уверена в том, что злоумышленник не воспользуется установленной им привязкой в своих целях. <br><br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Передано направлению логирования",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваша тема закреплена и передана <u>Техническому специалисту по логированию</u> для дальнейшего вердикта,ожидайте ответ в данной теме.<br><br>" +
        "[CENTER]Создавать новые темы с данной проблемой — не нужно.[/CENTER][/FONT][/SIZE]",
      prefix: TECHADM_PREFIX,
      status: true,
    },
    {
      title: "Запрос доп. информации",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER] Для дальнейшего рассмотрения темы, предоставьте:<br><BR>[QUOTE][SIZE=5][FONT=Veranda]1. Скриншоты или видео, подтверждающие факт владения этим имуществом.<BR>2. Все детали пропажи: дата, время, после каких действий имущество пропало.<BR>3. Информация о том, как вы изначально получили это имущество:<BR>дата покупки<br>способ приобретения (у игрока, в магазине или через донат;<br>фрапс покупки (если есть);<br>никнейм игрока, у которого было приобретено имущество, если покупка была сделана не в магазине.[/QUOTE]<BR>[/CENTER]" +
        "[CENTER][COLOR=rgb(255, 255, 0)]На рассмотрении[/COLOR][/CENTER][/FONT][/SIZE]",
      prefix: PIN_PREFIX,
      status: true,
    },
    {
      title: "Проблемы с загрузкой форума",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        '[center]Если вы столкнулись с проблемой загрузки страниц форума, пожалуйста, выполните следующие действия:<br><br>• Откройте "Настройки".<br>• Найдите во вкладке "Приложения" свой браузер, через который вы пользуетесь нашим сайтом форума.<br>• Нажмите на браузер, после чего внизу выберите "Очистить" -> "Очистить Кэш".<br><br>После следуйте данным инструкциям:<br>• Перейдите в настройки браузера.<br>• Выберите "Конфиденциальность и безопасность" -> "Очистить историю".<br>• В основных и дополнительных настройках поставьте галочку в пункте "Файлы cookie и данные сайтов".<br>После этого нажмите "Удалить данные".<br><br>Ниже прилагаем видео-инструкции описанного процесса для разных браузеров:<br>Для браузера CHROME: https://youtu.be/FaGp2rRru9s<br>Для браузера OPERA: https://youtube.com/shorts/eJOxkc3Br6A?feature=share' +
        "[CENTER][I][COLOR=rgb(255, 0, 0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Отказ в изменении законопослушности",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]К сожалению, администрация, технические специалисты и другие должностные лица на BLACK RUSSIA не могут повлиять на Вашу законопослушность.<br>Вы можете повысить свою законопослушность двумя способами:<BR><BR>1. Каждый PayDay (00 минут каждого часа) вам начисляется одно очко законопослушности(Если только у вас нету PLATINUM VIP-статуса), если за прошедший час вы отыграли не менее 20 минут.<br>2. Приобрести законопослушность в /donate.<BR>[/CENTER]" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Ошибка с отсутствием штрафов",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[center]У Вас произошла ошибка со штрафами. Чтобы ошибка была исключена — Вам необходимо совершить проезд на красный свет или переехать через сплошную, получить за это штраф и оплатить все штрафы в банке.<br>Команде Проекта известно о данной недоработке и активно ведется иправление.<br><br>" +
        "[CENTER][I][COLOR=rgb(255, 0, 0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Вам в жб на специалистов",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Вы получили наказание от технического специалиста Вашего сервера.<br>Вам следует обратиться в раздел «Жалобы на технических специалистов» — в случае, если Вы не согласны с наказанием.<br><br>" +
        "[CENTER]Ссылка на раздел, где можно оформить жалобу на технического специалиста - [URL='https://forum.blackrussia.online/index.php?forums/Жалобы-на-технических-специалистов.490/']клик[/URL] <br><br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Передано команде проекта",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваша тема закреплена и находится на рассмотрении у команды проекта. Пожалуйста, ожидайте выноса вердикта разработчиков." +
        "[CENTER]Создавать новые темы с данной проблемой — не нужно, ожидайте ответа в данной теме. Если проблема решится - Вы всегда можете оставить своё сообщение в этой теме.<br>",
      prefix: COMMAND_PREFIX,
      status: true,
    },
    {
      title: "Проблема известна команде проекта",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Команде проекта уже известно о данной проблеме, она обязательно будет рассмотрена и исправлена. Спасибо за Ваше обращение!<br><br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Форма для ошибок во время ОБТ на IOS",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Если вы нашли какую-либо ошибку во время Открытого Бэта Тестирования на IOS то сделайте следующие действия.<br><br>1. Отправьте пожалуйста найденную недоработку в данную форму - [URL='https://forms.gle/4adcNvKisfKF59Fi8']клик[/URL]<br>2. Передайте данную форму своим друзьям, для ускорения процесса по сбору багов для их исправления.<br><br>Спасибо за ваш вклад в развитие игры!<br>[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Приватный режим",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Раздел 'Жалобы' переведен в приватный режим.<br>Тему, созданную тем или иным пользователем, может видеть лишь <b>он сам</b> и <b>Администрация сервера</b>.<br>Ознакомиться с формой подачи тем в тот или иной раздел можно в данной теме: [URL='https://forum.blackrussia.online/index.php?forums/Правила-подачи-жалоб.202/']Клик[/URL]<br>Приятного времяпрепровождения на нашем форуме<br>[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Не начислили рейтинг за груз",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Наша система построена следующим образом:<br>Рейтинг зависит от поломки автомобиля чем серьёзнее поломка, тем меньше будет засчитан рейтинг.<br>Поломка учитывается вся за время рейса с грузом, в независимости от того если Вы почините Ваш автомобиль, поломка до, будет учтена.<br>[CENTER][I][COLOR=rgb(255, 0, 0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
    },
    {
      title: "Не является багом",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Проблема, с которой Вы столкнулись, не является багом/ошибкой сервера.<br><br>[CENTER][I][COLOR=rgb(255, 0, 0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Передача тестерам",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваша тема передана на тестирование.[/CENTER][/FONT][/SIZE]",
      prefix: WAIT_PREFIX,
      status: false,
    },
    {
      title: "Пропали вещи с аукциона",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Если вы выставили свои вещи на аукцион, а по истечении времени действия лота их никто не купил — воспользуйтесь командой [COLOR=rgb(251, 160, 38)]/reward[/COLOR]<br> В случае отсутствии вещей там — приложите видеофиксацию с использованием команды /time в данном обращении<br>[CENTER][I][COLOR=rgb(255,255,0)]На рассмотрении[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: PIN_PREFIX,
      status: false,
    },
    {
      title: "Если не работают ссылки",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]По техническим причинам данное действие невозможно, пожалуйста воспользуйтесь копированием ссылки от сюда:<br>[img]https://i.ibb.co/SX77Fgw/photo-2022-08-20-16-31-57.jpg[/img]<br>Если данный способ не помогает, то используйте сервис сокращения ссылок https://clck.ru<br> Либо попробуйте вот так:<br>1) загрузка скриншота биографии на фотохостинг<br>2) в описание прикрепить ссылку с форума<br>3) скопировать пост с фотохостинга<br><br>2 способ:<br>Сократите ссылки для Ваших скриншотов и RP биографии, сделать можно тут goo.su  также Iformation замените на русский текст, просмотрите еще текст полностью и постарайтесь уменьшить такие знаки как !?<br>goo.su[/CENTER]<br>" +
        "[CENTER][I][COLOR=rgb(255, 0, 0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Вам в раздел государственных орг.",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваша тема не относится к техническому разделу, пожалуйста оставьте ваше заявление в соответствующем разделе Государственных Организаций вашего сервера.[/CENTER]<br><br>" +
        "[CENTER][I][COLOR=rgb(255, 0, 0)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Вам в раздел криминальных орг.",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Ваша тема не относится к техническому разделу, пожалуйста оставьте ваше заявление в соответствующем разделе Криминальных Организаций вашего сервера [/CENTER]" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Вам в жб на адм.",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Вы получили наказание которое не относится к технической части, оно относится к Административной части.<br> Обратитесь в раздел Жалобы на администрацию вашего сервера.<br>Форма для подачи жалобы - [URL='https://forum.blackrussia.online/index.php?threads/Правила-подачи-жалоб-на-администрацию.3429349/']Клик[/URL]<br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Вам в жб на игроков",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Данная тема не относится к техническому разделу.<br>Данное действие было совершено игроком и нарушает правила сервера, пожалуйста обратитесь в <br>'Жалобы на игроков'<br>Вашего сервера.<br>Форма подачи жалобы - [URL='https://forum.blackrussia.online/index.php?threads/Правила-подачи-жалоб-на-игроков.3429394/']Клик[/URL]" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Вам в жб на лидеров",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Данная тема не относится к техническому разделу.<br>Данные действия были совершены лидером и нарушают регламент сервера, пожалуйста обратитесь в <br>'Жалобы на лидеров'<br>Вашего сервера.<br>Форма подачи жалобы - [URL='https://forum.blackrussia.online/threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1-%D0%BD%D0%B0-%D0%BB%D0%B8%D0%B4%D0%B5%D1%80%D0%BE%D0%B2.3429391/']Клик[/URL]" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Вам в обжалования",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Вы получили наказание от администратора своего сервера.<br> Для его снижения/обжалования обратитесь в раздел<br><<Обжалования>> вашего сервера.<br>Форма подачи темы - [URL='https://forum.blackrussia.online/index.php?threads/Правила-подачи-заявки-на-обжалование-наказания.3429398/']Клик[/URL]" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Сервер не отвечает",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Если у Вас встречаются такие проблемы, как «Сервер не отвечает», не отображаются сервера в лаунчере, не удаётся выполнить вход на сайт/форум, попробуйте совершить следующие действия: <br><br>" +
        "[LEFT]• Сменить IP-адрес любыми средствами; <br>" +
        "[LEFT]• Переключиться на Wi-Fi/мобильный интернет или на любую доступную сеть; <br>" +
        "[LEFT]• Использование VPN; <br>" +
        "[LEFT]• Перезагрузка роутера.<br><br>" +
        "[CENTER]Если методы выше не помогли, то переходим к следующим шагам: <br><br>" +
        "[LEFT]1. Устанавливаем приложение «1.1.1.1: Faster & Safer Internet» Ссылка: https://clck.ru/ZP6Av и переходим в него.<br>" +
        "[LEFT]2. Соглашаемся со всей политикой приложения.<br>" +
        "[LEFT]3. Нажимаем на ползунок и ждем, когда текст изменится на «Подключено».<br>" +
        "[LEFT]4. Проверяем: Отображаются ли серверы? Удается ли выполнить вход в игру? Работают ли другие источники (сайт, форум)? <br>" +
        "[CENTER]📹 Включение продемонстрировано на видео: https://youtu.be/Wft0j69b9dk<br>[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Кикнули за ПО",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Уважаемый игрок, если вы были отключены от сервера Античитом<br><br>[COLOR=rgb(255, 0, 0)]Пример[/COLOR]:<br><br> [IMG]https://i.ibb.co/FXXrcVS/image.png[/IMG],<br>пожалуйста, обратите внимания на значения PacketLoss и Ping.<br><br>PacketLoss - минимальное значение 0.000000, максимальное 1.000000. При показателе, выше нуля, это означает, что у вас происходит задержка/потеря передаваемых пакетов информации на сервер. Это означает, что ваш интернет не передает достаточное количество данных из вашего устройства на наш сервер, в следствие чего система отключает вас от игрового процесса.<br><br>Ping - Чем меньше значение в данном пункте, тем быстрее передаются данные на сервер, и наоборот. Если значение выше 100, вы можете наблюдать отставания в игровом процессе из-за нестабильности интернет-соединения.<br><br>Если вы не заметили проблем в данных пунктах, скорее всего - у вас произошел скачек пинга при выполнении действия в игре, в таком случае, античит также отключает игрока из-за подозрения в использовании посторонних программ.<br><br>Решение данной проблемы: постарайтесь стабилизировать ваше интернет-соединение, при необходимости - сообщите о проблемах своему провайдеру (поставщику услуг интернета).<br>[CENTER][COLOR=rgb(255, 0, 0)]Закрыто.[/COLOR][/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "По проблемам с донатом",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Если не были зачислены BLACK COINS — вероятнее всего, была допущена ошибка при вводе реквизитов. К нашему сожалению, из-за большого количества попыток обмана, мы перестали рассматривать подобные обращения. Для проверки зачисления BLACK COINS необходимо ввести в игре команду: /donat.<br><br>" +
        "[CENTER][I]Вам необходимо быть внимательными при осуществлении покупок.[/I]<br>" +
        "[CENTER]Если Вы считаете, что ошибки быть не может и с момента оплаты не прошло более 14 дней — в обязательном порядке обратитесь в службу поддержки для дальнейшего решения: На сайте через виджет обратной связи или посредством месенджеров: ВКонтакте: vk.com/br_tech, Telegram: t.me/br_techBot<br><br>" +
        "[CENTER][COLOR=rgb(255,0,0)]Закрыто[/COLOR].[/CENTER][/FONT][/SIZE]",
      prefix: DECIDED_PREFIX,
      status: false,
    },
    {
      title: "Исчезла статистика аккаунта",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Аккаунт не может пропасть или аннулироваться просто так. Даже если Вы меняете ник, используете кнопки «починить игру» или «сброс настроек» - Ваш аккаунт не удаляется. Система работает иначе.<br><br>" +
        "[CENTER]Проверьте ввод своих данных: пароль, никнейм и сервер. Зачастую игроки просто забывают ввести актуальные данные и считают, что их аккаунт был удален. Будьте внимательны!" +
        "[CENTER]Как ввести никнейм (на случай, если сменили в игре, но не поменяли в клиенте): https://youtu.be/c8rhVwkoFaU [/CENTER] <br><br>" +
        "[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Нет фото/видеофиксации",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Без доказательств (в частности скриншоты или видео) – решить проблему не получится. Если доказательства найдутся - создайте новую тему, приложив доказательства с фото-хостинга<br>[URL='https://yapx.ru/']yapx.ru[/URL],<br>[URL='https://imgur.com/']imgur.com[/URL],<br>[URL='https://www.youtube.com/']youtube.com[/URL],<br>[URL='https://imgbb.com']ImgBB.com[/URL]<br>(все кликабельно).<br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Баг будет исправлен",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Данная недоработка будет проверена и исправлена.<br> Спасибо, ценим Ваш вклад в развите проекта.<br>" +
        "[CENTER][I]Рассмотрено[/I].[/CENTER][/FONT][/SIZE]",
      prefix: WATCHED_PREFIX,
      status: false,
    },
    {
      title: "Ознакомьтесь с правилами восстановления",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Пожалуйста, убедительная просьба, ознакомьтесь с правилами восстановлений - [URL='https://forum.blackrussia.online/index.php?threads/В-каких-случаях-мы-не-восстанавливаем-игровое-имущество.25277/']клик[/URL].<br>Вы создали тему, которая не относится к технической проблеме.[/CENTER]<br><br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/CENTER][/I].[/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "По крашам/вылетам",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]В том случае, если Вы вылетели из игры во время игрового процесса (произошел краш), в обязательном порядке необходимо обратиться в данную тему в любом техническом разделе [img]https://i.ibb.co/sPhBGjx/NVIDIA-Share-1-Tde-EHim0u.png[/img][/CENTER]<br>" +
        "[CENTER][CODE]01. Ваш игровой никнейм: <br> 02. Сервер: <br> 03. Тип проблемы: Обрыв соединения | Проблема с ReCAPTCHA | Краш игры (закрытие игры) | Другое [Выбрать один вариант ответа] <br> 04. Действия, которые привели к этому (при вылетах, по возможности предоставлять место сбоя): <br> 05. Как часто данная проблема: <br> 06. Полное название мобильного телефона: <br> 07. Версия Android: <br> 08. Дата и время (по МСК): <br> 09. Связь с Вами по Telegram/VK:[/CODE]<br><br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/CENTER][/I].[/FONT][/SIZE]",
      prefix: UNACCEPT_PREFIX,
      status: false,
    },
    {
      title: "Не выпустило из ФСИН",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Скоро будете выпущены,ожидайте.[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Хочу занять должность",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        "[CENTER]Команда технических специалистов не решает назначение на какую-либо должность, которая присутствует на проекте.<br>Для этого существуют заявления в главном разделе Вашего игрового сервера, где Вы можете ознакомиться с открытыми должностями и формами подач.<br>Приятной игры и желаем удачи в карьерной лестнице!<br><br>" +
        "[CENTER][I][COLOR=rgb(255,0,0)]Отказано[/COLOR][/I].[/CENTER][/FONT][/SIZE]",
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "По предложениям по улучшению",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        '[CENTER]Ваша тема не относится к технической проблеме, если вы хотите предложить изменения в игровом моде - обратитесь в раздел <br> [URL="https://forum.blackrussia.online/index.php?categories/Предложения-по-улучшению.656/"] Предложения по улучшению → нажмите сюда[/URL].<br>[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
      prefix: CLOSE_PREFIX,
      status: false,
    },
    {
      title: "Нужны все детали для прошивки",
      content:
        "[SIZE=4][FONT=Veranda][CENTER]Доброго времени суток, уважаемый[B] {{ user.mention }}[/B]![/CENTER]<br><br>" +
        '[CENTER] Для активации какой либо прошивки необходимо поставить все детали данного типа "SPORT" "SPORT+" и т.п.<br>[CENTER][I][COLOR=rgb(255,0,0)]Закрыто[/COLOR][/I].[/CENTER][/FONT][/SIZE]',
      prefix: CLOSE_PREFIX,
      status: false,
    },
  ];

  $(document).ready(() => {
    // Загрузка скрипта для обработки шаблонов
    $("body").append(
      '<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>'
    );

    // Добавление кнопок при загрузке страницы
    addButton(
      "На рассмотрении",
      "pin",
      "border-radius: 13px; margin-right: 5px; border: 2px solid; border-color: rgb(255, 173, 51, 0.5);"
    );
    addButton(
      "Команде проекта",
      "teamProject",
      "border-radius: 13px; margin-right: 5px; border: 2px solid;  border-color: rgb(255, 240, 110, 0.5);"
    );
    addButton(
      "Техническому специалисту",
      "techspec",
      "border-radius: 13px; margin-right: 5px; border: 2px solid; border-color: rgb(17, 92, 208, 0.5);"
    );
    addButton(
      "Рассмотрено",
      "watched",
      "border-radius: 13px; margin-right: 5px; border: 2px solid;  border-color: rgb(110, 192, 113, 0.5)"
    );
    addButton(
      "Решено",
      "decided",
      "border-radius: 13px; margin-right: 5px; border: 2px solid; border-color: rgb(110, 192, 113, 0.5);"
    );
    addButton(
      "Отказано",
      "unaccept",
      "border-radius: 13px; margin-right: 5px; border: 2px solid; border-color: rgb(220, 89, 89, 0.5);"
    );
    addButton(
      "Закрыто",
      "closed",
      "border-radius: 13px; margin-right: 5px; border: 2px solid; border-color: rgb(220, 89, 89, 0.5);"
    );
    addAnswers();

    // Поиск информации о теме
    const threadData = getThreadData();

    $(`button#ff`).click(() => pasteContent(8, threadData, true));
    $(`button#prr`).click(() => pasteContent(2, threadData, true));
    $(`button#zhb`).click(() => pasteContent(21, threadData, true));
    $("button#unaccept").click(() => editThreadData(UNACCEPT_PREFIX, false));
    $("button#pin").click(() => editThreadData(PIN_PREFIX, true));
    $("button#teamProject").click(() => editThreadData(COMMAND_PREFIX, true));
    $("button#watched").click(() => editThreadData(WATCHED_PREFIX, false));
    $("button#decided").click(() => editThreadData(DECIDED_PREFIX, false));
    $("button#closed").click(() => editThreadData(CLOSE_PREFIX, false));
    $("button#closed_complaint").click(() =>
      editThreadData(CLOSE_PREFIX, false, false)
    );
    $("button#techspec").click(() => editThreadData(TECHADM_PREFIX, true));

    $(`button#selectAnswer`).click(() => {
      XF.alert(buttonsMarkup(buttons), null, "ВЫБЕРИТЕ ОТВЕТ");
      buttons.forEach((btn, id) => {
        if (id > 1) {
          $(`button#answers-${id}`).click(() =>
            pasteContent(id, threadData, true)
          );
        } else {
          $(`button#answers-${id}`).click(() =>
            pasteContent(id, threadData, false)
          );
        }
      });
    });
  });

  function addButton(name, id, style) {
    $(".button--icon--reply").before(
      `<button type="button" class="button--primary button rippleButton" id="${id}" style="${style}">${name}</button>`
    );
  }
  function addAnswers() {
    $(".button--icon--reply").after(
      `<button type="button" class="button--cta uix_quickReply--button button button--icon button--icon--write rippleButton" id="selectAnswer" style="oswald: 3px; margin-left: 5px; margin-top: 10px; border-radius: 13px;">ОТВЕТЫ</button>`
    );
  }

  function buttonsMarkup(buttons) {
    return `<div class="select_answer">${buttons
      .map(
        (btn, i) =>
          `<button id="answers-${i}" class="button--primary button ` +
          `rippleButton" style="margin:4px; ${btn.dpstyle}"><span class="button-text">${btn.title}</span></button>`
      )
      .join("")}</div>`;
  }

  function pasteContent(id, data = {}, send = false) {
    const template = Handlebars.compile(buttons[id].content);
    if ($(".fr-element.fr-view p").text() === "")
      $(".fr-element.fr-view p").empty();

    $("span.fr-placeholder").empty();
    $("div.fr-element.fr-view p").append(template(data));
    $("a.overlay-titleCloser").trigger("click");

    if (send == true) {
      editThreadData(buttons[id].prefix, buttons[id].status);
      $(".button--icon.button--icon--reply.rippleButton").trigger("click");
    }
  }

  function getThreadData() {
    const authorID = $("a.username")[0].attributes["data-user-id"].nodeValue;
    const authorName = $("a.username").html();
    const hours = new Date().getHours();
    return {
      user: {
        id: authorID,
        name: authorName,
        mention: `[USER=${authorID}]${authorName}[/USER]`,
      },
      greeting: () =>
        4 < hours && hours <= 11
          ? "Доброе утро"
          : 11 < hours && hours <= 15
          ? "Добрый день"
          : 15 < hours && hours <= 21
          ? "Добрый вечер"
          : "Доброй ночи",
    };
  }

  function editThreadData(prefix, pin = false, may_lens = true) {
    // Получаем заголовок темы, так как он необходим при запросе
    const threadTitle = $(".p-title-value")[0].lastChild.textContent;

    if (pin == false) {
      fetch(`${document.URL}edit`, {
        method: "POST",
        body: getFormData({
          prefix_id: prefix,
          title: threadTitle,
          _xfToken: XF.config.csrf,
          _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
          _xfWithData: 1,
          _xfResponseType: "json",
        }),
      }).then(() => location.reload());
    }
    if (pin == true) {
      fetch(`${document.URL}edit`, {
        method: "POST",
        body: getFormData({
          prefix_id: prefix,
          title: threadTitle,
          discussion_open: 1,
          sticky: 1,
          _xfToken: XF.config.csrf,
          _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
          _xfWithData: 1,
          _xfResponseType: "json",
        }),
      }).then(() => location.reload());
    }
    if (may_lens === true) {
      if (
        prefix == UNACCEPT_PREFIX ||
        prefix == WATCHED_PREFIX ||
        prefix == CLOSE_PREFIX ||
        prefix == DECIDED_PREFIX
      ) {
        moveThread(prefix, 230);
      }

      if (prefix == WAIT_PREFIX) {
        moveThread(prefix, 917);
      }
    }
  }

  function moveThread(prefix, type) {
    // Перемещение темы
    const threadTitle = $(".p-title-value")[0].lastChild.textContent;

    fetch(`${document.URL}move`, {
      method: "POST",
      body: getFormData({
        prefix_id: prefix,
        title: threadTitle,
        target_node_id: type,
        redirect_type: "none",
        notify_watchers: 1,
        starter_alert: 1,
        starter_alert_reason: "",
        _xfToken: XF.config.csrf,
        _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
        _xfWithData: 1,
        _xfResponseType: "json",
      }),
    }).then(() => location.reload());
  }

  function getFormData(data) {
    const formData = new FormData();
    Object.entries(data).forEach((i) => formData.append(i[0], i[1]));
    return formData;
  }
})();
