// ==UserScript==
// @name          标记起点中文网完本小说
// @description   标记已看起点中文网完本小说。
// @version       1.0.7
// @namespace     标记已看起点中文网完本小说
// @icon          data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==
// @author        会说话的鱼
// @include       *qidian.com*
// @require       https://cdnjs.cloudflare.com/ajax/libs/jquery/1.9.1/jquery.min.js
// @run-at        document-start
// @grant         none
// @rewritten_script_code javascript
// @license        GPLv3
// @downloadURL https://update.greasyfork.org/scripts/488035/%E6%A0%87%E8%AE%B0%E8%B5%B7%E7%82%B9%E4%B8%AD%E6%96%87%E7%BD%91%E5%AE%8C%E6%9C%AC%E5%B0%8F%E8%AF%B4.user.js
// @updateURL https://update.greasyfork.org/scripts/488035/%E6%A0%87%E8%AE%B0%E8%B5%B7%E7%82%B9%E4%B8%AD%E6%96%87%E7%BD%91%E5%AE%8C%E6%9C%AC%E5%B0%8F%E8%AF%B4.meta.js
// ==/UserScript==

(function () {
	'use strict';
	$(function () {
		init();
	});
})();

function init() {
    var books = [
        {
            id: 1017590932,
            name: '世子很凶',
        },
        {
            id: 18636,
            name: '知北游',
        },
        {
            id: 1012261200,
            name: '剑来',
        },
        {
            id: 1038168589,
            name: '临安不夜侯',
        },
        {
            id: 1013009467,
            name: '我的一天有48小时',
        },
        {
            id: 1039434041,
            name: '无上天尊',
        },
        {
            id: 1040146263,
            name: '绝境黑夜',
        },
        {
            id: 1038970972,
            name: '他们越反对，越是说明我做对了',
        },
        {
            id: 1040331625,
            name: '星空职业者',
        },
        {
            id: 1009817672,
            name: '轮回乐园',
        },
        {
            id: 1036504904,
            name: '谁让他修仙的！',
        },
        {
            id: 1037557322,
            name: '修仙：当你把事情做到极致',
        },
        {
            id: 1025331197,
            name: '九锡',
        },
        {
            id: 1037458978,
            name: '你这律师不对劲',
        },
        {
            id: 1037806577,
            name: '趋吉避凶，从天师府开始',
        },
        {
            id: 1036993574,
            name: '金丹是恒星，你管这叫修仙？',
        },
        {
            id: 1033280302,
            name: '苟在女魔头身边偷偷修炼',
        },
        {
            id: 1037188069,
            name: '灾变卡皇',
        },
        {
            id: 1039804333,
            name: '太平令',
        },
        {
            id: 1036370336,
            name: '宿命之环',
        },
        {
            id: 1011526746,
            name: '覆汉',
        },
        {
            id: 1014130981,
            name: '明日之劫',
        },
        {
            id: 1011335417,
            name: '深夜书屋',
        },
        {
            id: 1016560323,
            name: '魔临',
        },
        {
            id: 1038863996,
            name: '炮火弧线',
        },
        {
            id: 1012894975,
            name: '原来我是妖二代',
        },
        {
            id: 1037672981,
            name: '道长别打了，大道都快磨灭了',
        },
        {
            id: 1038362789,
            name: '这群玩家比诡更诡',
        },
        {
            id: 1036671375,
            name: '法力无边高大仙',
        },
        {
            id: 1032610158,
            name: '红楼之挽天倾',
        },
        {
            id: 1037919923,
            name: '海盗王权',
        },
        {
            id: 1025325411,
            name: '稳住别浪',
        },
        {
            id: 1033982111,
            name: '升格前夜',
        },
        {
            id: 1040984003,
            name: '在下欧阳锋',
        },
        {
            id: 1038421402,
            name: '致暗频率',
        },
        {
            id: 1037894397,
            name: '万古刀',
        },
        {
            id: 1038465154,
            name: '故障乌托邦',
        },
        {
            id: 63856,
            name: '神墓',
        },
        {
            id: 1037375481,
            name: '这个影帝只想考证',
        },
        {
            id: 1015192288,
            name: '霍格沃茨的渡鸦之爪',
        },
        {
            id: 1035595734,
            name: '厌女的我和美少女旅行日常',
        },
        {
            id: 1037417849,
            name: '季汉大司马',
        },
        {
            id: 2597043,
            name: '惊悚乐园',
        },
        {
            id: 1036282286,
            name: '北宋穿越指南',
        },
        {
            id: 1034476014,
            name: '秦功',
        },
        {
            id: 1031793925,
            name: '重生飞扬年代',
        },
        {
            id: 1030568772,
            name: '修复师',
        },
        {
            id: 1032575913,
            name: '从剧本杀店开始',
        },
        {
            id: 1036464012,
            name: '异兽迷城',
        },
        {
            id: 3258971,
            name: '帝霸',
        },
        {
            id: 1016649218,
            name: '又见九叔',
        },
        {
            id: 1033323037,
            name: '深渊专列',
        },
        {
            id: 1038184321,
            name: '什么叫红温型上单啊',
        },
        {
            id: 1034059872,
            name: '亚人娘补完手册',
        },
        {
            id: 1038167657,
            name: '古龙世界里的吃瓜剑客',
        },
        {
            id: 1038087169,
            name: '黄昏分界',
        },
        {
            id: 1036344735,
            name: '骂谁实力派呢',
        },
        {
            id: 1032693838,
            name: '龙虎道主',
        },
        {
            id: 1036341943,
            name: '霍格沃茨：我真是模范巫师',
        },
        {
            id: 3546912,
            name: '万古神帝',
        },
        {
            id: 1037551048,
            name: '逼我重生是吧',
        },
        {
            id: 1037068020,
            name: '不许没收我的人籍',
        },
        {
            id: 1037075059,
            name: '序列大明',
        },
        {
            id: 1038514258,
            name: '这个巫妖得加钱',
        },
        {
            id: 1040966818,
            name: '这很末世',
        },
        {
            id: 1038844311,
            name: '我的完美末世人生',
        },
        {
            id: 1010594608,
            name: '修神外传仙界篇',
        },
        {
            id: 1460788,
            name: '修神外传',
        },
        {
            id: 1037135031,
            name: '满唐华彩',
        },
        {
            id: 1037897214,
            name: '最后结局',
        },
        {
            id: 1034328271,
            name: '大苍守夜人',
        },
        {
            id: 1037762892,
            name: '天才俱乐部',
        },
        {
            id: 1035347647,
            name: '仙人只想躺着',
        },
        {
            id: 1017021237,
            name: '最初进化',
        },
        {
            id: 1037732511,
            name: '衣冠不南渡',
        },
        {
            id: 1010136878,
            name: '汉乡',
        },
        {
            id: 1037626931,
            name: '我的玩家好凶猛',
        },
        {
            id: 1039427973,
            name: '剑出衡山',
        },
        {
            id: 1031568231,
            name: '万道长途',
        },
        {
            id: 3569244,
            name: '我在末世有套房',
        },
        {
            id: 1033661355,
            name: '一个人的道门',
        },
        {
            id: 2718601,
            name: '进化的四十六亿重奏',
        },
        {
            id: 1016541766,
            name: '余烬之铳',
        },
        {
            id: 1037458244,
            name: '瞎编功法，徒儿你真练成了？',
        },
        {
            id: 1037112096,
            name: '重生09：合成系男神',
        },
        {
            id: 1036237650,
            name: '仙父',
        },
        {
            id: 1035239681,
            name: '从西周建立千年世家',
        },
        {
            id: 1021566237,
            name: '黑石密码',
        },
        {
            id: 1010734492,
            name: '凡人修仙之仙界篇',
        },
        {
            id: 107580,
            name: '凡人修仙传',
        },
        {
            id: 1036761933,
            name: '我的1991',
        },
        {
            id: 1038079835,
            name: '重启神话',
        },
        {
            id: 1037632698,
            name: '我的超能力每周刷新',
        },
        {
            id: 1037491938,
            name: '别人练级我修仙，苟到大乘再出山',
        },
        {
            id: 68223,
            name: '盗墓笔记',
        },
        {
            id: 1013607299,
            name: '无限血核',
        },
        {
            id: 1033544120,
            name: '大夏文圣',
        },
        {
            id: 1032622420,
            name: '回到古代当赘婿',
        },
        {
            id: 1030195954,
            name: '太监能有什么坏心思',
        },
        {
            id: 1034904261,
            name: '我的修仙游戏人生',
        },
        {
            id: 1038253868,
            name: '温暖的季风',
        },
        {
            id: 1033290458,
            name: '我的诡异人生',
        },
        {
            id: 1036010291,
            name: '乱世书',
        },
        {
            id: 1025901449,
            name: '我的治愈系游戏',
        },
        {
            id: 1033305657,
            name: '洛杉矶神探',
        },
        {
            id: 1036506211,
            name: '细说红尘',
        },
        {
            id: 3489766,
            name: '全职法师',
        },
        {
            id: 1034888747,
            name: '父可敌国',
        },
        {
            id: 1033914374,
            name: '唐人的餐桌',
        },
        {
            id: 3427715,
            name: '贞观大闲人',
        },
        {
            id: 1038034045,
            name: '桃李春风一杯酒',
        },
        {
            id: 1037068783,
            name: '都重生了谁谈恋爱啊',
        },
        {
            id: 1037333167,
            name: '速通修仙！',
        },
        {
            id: 1035282882,
            name: '神明模拟器',
        },
        {
            id: 1031743384,
            name: '走进不科学',
        },
        {
            id: 1036789359,
            name: '隐秘死角',
        },
        {
            id: 1035627273,
            name: '巫师！',
        },
        {
            id: 1036862774,
            name: '武侠：开局获得一甲子内力！',
        },
        {
            id: 1036804591,
            name: '天启之夜',
        },
        {
            id: 1015290632,
            name: '明末不求生',
        },
        {
            id: 84024,
            name: '回到明朝当王爷',
        },
        {
            id: 1028463573,
            name: '我用闲书成圣人',
        },
        {
            id: 1016660823,
            name: '我的徒弟都是大反派',
        },
        {
            id: 1029160231,
            name: '大魏读书人',
        },
        {
            id: 1028520538,
            name: '朕',
        },
        {
            id: 1032822816,
            name: '家父汉高祖',
        },
        {
            id: 118447,
            name: '星辰变',
        },
        {
            id: 1017176480,
            name: '平平无奇大师兄',
        },
        {
            id: 1025156541,
            name: '离婚后前妻成了债主',
        },
        {
            id: 1036660859,
            name: '末世：我的关键词比别人多一个',
        },
        {
            id: 1017266570,
            name: '重塑千禧年代',
        },
        {
            id: 1034167664,
            name: '我是导演，我不比烂',
        },
        {
            id: 1034360760,
            name: '深海余烬',
        },
        {
            id: 1005401501,
            name: '极道天魔',
        },
        {
            id: 1015179225,
            name: '玩家凶猛',
        },
        {
            id: 1011097497,
            name: '秦吏',
        },
        {
            id: 3242304,
            name: '异常生物见闻录',
        },
        {
            id: 1031732984,
            name: '光明壁垒',
        },
        {
            id: 1027669580,
            name: '星门：时光之主',
        },
        {
            id: 1032636821,
            name: '猎命人',
        },
        {
            id: 3676417,
            name: '玄界之门',
        },
        {
            id: 2494758,
            name: '武炼巅峰',
        },
        {
            id: 1012284323,
            name: '我有一座冒险屋',
        },
        {
            id: 1012584111,
            name: '神秘复苏',
        },
        {
            id: 1031794030,
            name: '道诡异仙',
        },
        {
            id: 1003541158,
            name: '我的1979',
        },
        {
            id: 1032569010,
            name: '武侠：开局奖励满级神功',
        },
        {
            id: 1035463998,
            name: '无限轮回荣光',
        },
        {
            id: 1034609549,
            name: '终末的绅士',
        },
        {
            id: 1012314633,
            name: '美漫丧钟',
        },
        {
            id: 1020180183,
            name: '半仙',
        },
        {
            id: 1004179514,
            name: '天道图书馆！',
        },
        {
            id: 1029247985,
            name: '我就是神！',
        },
        {
            id: 1026435537,
            name: '出笼记',
        },
        {
            id: 1026938964,
            name: '无尽债务',
        },
        {
            id: 1031940621,
            name: '灵境行者',
        },
        {
            id: 1029391348,
            name: '这游戏也太真实了',
        },
        {
            id: 1017596768,
            name: '数风流人物',
        },
        {
            id: 1031587468,
            name: '修仙就是这样子的',
        },
        {
            id: 1011486666,
            name: '大医凌然',
        },
        {
            id: 3513193,
            name: '雪鹰领主',
        },
        {
            id: 1010566688,
            name: '苍穹之上',
        },
        {
            id: 1115277,
            name: '斗罗大陆',
        },
        {
            id: 1017125042,
            name: '临渊行',
        },
        {
            id: 1005392714,
            name: '狂探',
        },
        {
            id: 1010737835,
            name: '大数据修仙',
        },
        {
            id: 1010496369,
            name: '大道朝天',
        },
        {
            id: 1011058239,
            name: '伏天氏',
        },
        {
            id: 1015499829,
            name: '沧元图',
        },
        {
            id: 1011282175,
            name: '天阿降临',
        },
        {
            id: 1003667321,
            name: '美食供应商',
        },
        {
            id: 1003307568,
            name: '不朽凡人',
        },
        {
            id: 3577214,
            name: '我从凡间来',
        },
        {
            id: 1011831961,
            name: '天下第九',
        },
        {
            id: 1035849533,
            name: '1980我的文艺时代',
        },
        {
            id: 1025461668,
            name: '每天都离现形更近一步',
        },
        {
            id: 1035319051,
            name: '渊天尊',
        },
        {
            id: 1034840014,
            name: '女侠且慢',
        },
        {
            id: 1010868264,
            name: '诡秘之主',
        },
        {
            id: 1036099286,
            name: '大明国师',
        },
        {
            id: 1029006481,
            name: '不科学御兽',
        },
        {
            id: 1019664125,
            name: '大奉打更人',
        },
        {
            id: 1036305137,
            name: '苟在妖武乱世修仙',
        },
        {
            id: 1032977639,
            name: '高天之上',
        },
        {
            id: 1735921,
            name: '遮天',
        },
        {
            id: 107580,
            name: '凡人修仙传',
        },
        {
            id: 1036170277,
            name: '我本无意成仙',
        },
        {
            id: 1027339371,
            name: '深空彼岸',
        },
        {
            id: 1032982789,
            name: '我家娘子，不对劲',
        },
        {
            id: 2952453,
            name: '完美世界',
        },
        {
            id: 1016150754,
            name: '亏成首富从游戏开始',
        },
        {
            id: 1639199,
            name: '吞噬星空',
        },
        {
            id: 1209977,
            name: '斗破苍穹',
        },
        {
            id: 1021617576,
            name: '夜的命名术',
        },
        {
            id: 1026957246,
            name: '火力为王',
        },
        {
            id: 1010400217,
            name: '黎明之剑',
        },
        {
            id: 1033830145,
            name: '重生之我要冲浪 ',
        },
        {
            id: 1032778366,
            name: '择日飞升',
        },
        {
            id: 1030870265,
            name: '明克街13号',
        },
        {
            id: 1036484427,
            name: '我为长生仙',
        },
        {
            id: 1015648531,
            name: '我真没想重生啊',
        },
        {
            id: 1016572786,
            name: '我师兄实在太稳健了',
        },
        {
            id: 1024868626,
            name: '从红月开始',
        },
        {
            id: 1014180485,
            name: '天启预报',
        },
        {
            id: 1264634,
            name: '仙逆',
        },
        {
            id: 1031148907,
            name: '大乘期才有逆袭系统',
        },
        {
            id: 1010191960,
            name: '大王饶命',
        },
        {
            id: 1004608738,
            name: '圣墟',
        },
        {
            id: 1009480992,
            name: '超神机械师',
        },
        {
            id: 3602691,
            name: '修真聊天群（聊天群的日常生活',
        },
        {
            id: 1036410434,
            name: '我在荒岛肝属性',
        },
        {
            id: 1033498464,
            name: '请公子斩妖',
        },
        {
            id: 1030453176,
            name: '终宋',
        },
        {
            id: 1012237441,
            name: '全球高武',
        },
        {
            id: 3249362,
            name: '一世之尊',
        },
        {
            id: 1018027842,
            name: '万族之劫',
        },
        {
            id: 1028365093,
            name: '晚唐浮生',
        },
        {
            id: 1013552688,
            name: '穹顶之上',
        },
        {
            id: 1017281778,
            name: '绍宋',
        },
        {
            id: 1009704712,
            name: '牧神记',
        },
        {
            id: 1025990049,
            name: '术师手册',
        },
        {
            id: 1015990091,
            name: '烂柯棋缘',
        },
        {
            id: 2048120,
            name: '武动乾坤',
        },
        {
            id: 1026722127,
            name: '镇妖博物馆',
        },
        {
            id: 2226569,
            name: '大道争锋',
        },
        {
            id: 1010426071,
            name: '诸界末日在线',
        },
        {
            id: 1024121691,
            name: '保护我方族长',
        },
        {
            id: 1029701421,
            name: '诸界第一因',
        },
        {
            id: 2517792,
            name: '斗罗大陆II绝世唐门',
        },
        {
            id: 1036056564,
            name: '让你当兵戒网瘾，你成军官了',
        },
        {
            id: 1003354631,
            name: '一念永恒',
        },
        {
            id: 1026694115,
            name: '我只想安静的做个苟道中人',
        },
        {
            id: 1003306811,
            name: '放开那个女巫',
        },
        {
            id: 1023422452,
            name: '长夜余火',
        },
        {
            id: 1010702900,
            name: '诸天尽头',
        },
        {
            id: 1011489683,
            name: '谍影风云',
        },
        {
            id: 2413595,
            name: '唐砖',
        },
        {
            id: 2750457,
            name: '大主宰',
        },
        {
            id: 1010399782,
            name: '太初',
        },
        {
            id: 1009265821,
            name: '无疆',
        },
        {
            id: 1016534035,
            name: '大梦主',
        },
        {
            id: 1010981643,
            name: '开天录',
        },
        {
            id: 1264634,
            name: '仙逆',
        },
        {
            id: 2070910,
            name: '求魔',
        },
        {
            id: 1003354631,
            name: '一念永恒',
        },
        {
            id: 1003723851,
            name: '天影',
        },
        {
            id: 1005238666,
            name: '万界天尊',
        },
        {
            id: 1010259609,
            name: '我是仙凡',
        },
        {
            id: 1005776750,
            name: '重生似水青春',
        },
        {
            id: 1005236478,
            name: '道君',
        },
        {
            id: 3173393,
            name: '儒道至圣',
        },
        {
            id: 1017141,
            name: '盘龙',
        },
        {
            id: 105199,
            name: '极品家丁',
        },
        {
            id: 1005986994,
            name: '我是至尊',
        },
        {
            id: 3106580,
            name: '我欲封天',
        },
        {
            id: 1009397018,
            name: '我修的可能是假仙',
        },
        {
            id: 2083259,
            name: '将夜',
        },
        {
            id: 1013432302,
            name: '九星毒奶',
        },
        {
            id: 1003683523,
            name: '最后一个使徒',
        },
        {
            id: 1015358161,
            name: '玄浑道章',
        },
        {
            id: 163560,
            name: '恶魔法则',
        },
        {
            id: 1010327039,
            name: '三寸人间',
        },
        {
            id: 1003694333,
            name: '斗战狂潮',
        },
        {
            id: 1010468795,
            name: '飞剑问道',
        },
        {
            id: 1021635590,
            name: '这个人仙太过正经',
        },
        {
            id: 1003578885,
            name: '超凡传',
        },
        {
            id: 1011576939,
            name: '同桌凶猛',
        },
        {
            id: 1020688719,
            name: '神魔书',
        },
    ];

    $.each(books, function(index, val) {
        $('*[data-bid="'+ val.id +'"]').css({'color': 'red', 'font-weight': 'bold'});
    });
}