// ==UserScript==
// @name         Русский Бот для MPP
// @namespace    http://tampermonkey.net/
// @version      1.0
// @description  Просто Русский бот для MPP
// @author       You
// @match        https://multiplayerpiano.net/
// @icon         https://www.google.com/s2/favicons?sz=64&domain=yandex.ru
// @grant        none
// @downloadURL https://update.greasyfork.org/scripts/490491/%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9%20%D0%91%D0%BE%D1%82%20%D0%B4%D0%BB%D1%8F%20MPP.user.js
// @updateURL https://update.greasyfork.org/scripts/490491/%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9%20%D0%91%D0%BE%D1%82%20%D0%B4%D0%BB%D1%8F%20MPP.meta.js
// ==/UserScript==

MPP.client.on('a', function(msg) {

let cmd = msg.a;

if (cmd == '!Помощь') {

MPP.chat.send('!!!Команды работают только с большой буквы!!! 📕Обычные Команды: !Помощь !Создатель !О боте | 🎮Игровые Команды: !Привет !Пока !Да !Нет !Амогус | Пока что команд не очень много но Обновления никто не отменял :)(Я Новичок в создание Скриптов) |');

};if (cmd == '!Создатель') {

MPP.chat.send('Создатель бота: ʬʘɭf');

};
    
    if (cmd == '!О боте') {

MPP.chat.send('Дата Создания Бота: 21 Марта 2024 года, Версия: 1.0 ');

};
    
    if (cmd == '!Привет') {

MPP.chat.send('Приветики :) ')

};
    
    if (cmd == '!Пока') {

MPP.chat.send('Пока :(');

};
    
    if (cmd == '!Да') {

MPP.chat.send('Дя :3');

};
    
    if (cmd == '!Нет') {

MPP.chat.send('НЕТЬ!');

};
    
    if (cmd == '!Амогус') {

MPP.chat.send('ඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞඞ');

};
})