// ==UserScript==
// @name         lib2024
// @version      2024
// @description  2024年版 
// @author       zhanzhan2020
// @grant        none
// ==/UserScript==

const libs = {
	// 支持的期末考试
	supportedFinal: {
		五年级: "FinalExamGrade5_12",
		六年级: "FinalExamGrade5_12",

		七年级: "FinalExamGrade5_12",
		八年级: "FinalExamGrade5_12",
		九年级: "FinalExamGrade5_12",

		初一: "FinalExamGrade5_12",
		初二: "FinalExamGrade5_12",
		初三: "FinalExamGrade5_12",

		高一: "FinalExamGrade5_12",
		高二: "FinalExamGrade5_12",
	},
	// 支持的知识竞赛
	supportedCompetition: {
		小学组: "",//PrimarySchoolCompetition未完工
		中学组: "MiddleSchoolCompetition", 
	},
	
	// 期末考试五年级到高二
	FinalExamGrade5_12: [
		{
			question: "注意用眼卫生要做到连续看书写字()左右休息片刻或向远处眺望。",
			answer: "A",
		},
		{
			question: "可卡因是从()植株的树叶中提取的。",
			answer: "A",
		},
		{
			question: "可卡因长期大量使用，易造成()。",
			answer: "A",
		},
		{
			question: '你知道"恶之花"是什么吗?()',
			answer: "A",
		},
		{
			question: "对鸦片颜色描述正确的是()。",
			answer: "A",
		},
		{
			question: "发现吸、贩毒情况，向公安机关举报应拔打的电话号码是()",
			answer: "C",
		},
		{
			question: "如果有同学或好朋友吃了一些东西以后，发生昏厥、呕吐或是抽搐等不适症状，我们可以拨打()急救电话。",
			answer: "A",
		},
		{
			question: "第一次鸦片战争发生的时间是：()",
			answer: "B",
		},
		{
			question: '联合国那一年确定了"有效减少毒品需求"的禁毒战略?',
			answer: "A",
		},
		{
			question: "在药理上，海洛因的镇痛效力是吗啡的几倍?",
			answer: "C",
		},
		{
			question: "一般吸食海洛因成瘾的人，()开始死亡",
			answer: "D",
		},
		{
			question: "有调查表明，在青少年吸毒者中，有()以上是在不知道毒品的危害的情况下吸食的。",
			answer: "D",
		},
		{
			question: "保持充分的睡眠、营养与体育锻练有助于预防近视，小学生每天睡眠时间应不少于()。",
			answer: "C",
		},
		{
			question: "大麻的有毒成分为四氢大麻酚，英文缩写是()",
			answer: "B",
		},
		{
			question: "吸食毒品因共用针具容易导致()等类疾病的传播。",
			answer: "C",
		},
		{
			question: "可卡因的颜色通常是。()",
			answer: "A",
		},
		{
			question: "氯胺酮，属于()类新型毒品",
			answer: "B",
		},
		{
			question: "大麻是()年生草本植物。",
			answer: "B",
		},
		{
			question: "学生发生脊柱弯曲异常的原因有长期以来：()",
			answer: "B",
		},
		{
			question: "当吸毒人员诱惑我们吸毒时，我们应该()",
			answer: "B",
		},
		{
			question: "毒品的心理依赖是指人在多次用药后所产生的在心理上、精神上对所用药物的()或强制性觅药的心理倾向。",
			answer: "C",
		},
		{
			question: "海洛因、吗啡、杜冷丁同属于()。",
			answer: "C",
		},
		{
			question: "()是兴奋剂。",
			answer: "A",
		},
		{
			question: "以下哪类是新精神活性物质()",
			answer: "B",
		},
		{
			question: "可卡因的化学名为()",
			answer: "A",
		},
		{
			question: '()俗称白面、白粉、四号等，是阿片类毒品中危害最大的品种，目前被世界各国列为"头号毒品"。',
			answer: "B",
		},
		{
			question: "()俗称大烟、烟土，其原植物是罂粟，是我国法律严禁非法种植的植物。",
			answer: "C",
		},
		{
			question: "青少年远离毒品，以下错误的做法是()",
			answer: "B",
		},
		{
			question: "青少年远离毒品，以下错误的做法是()",
			answer: "B",
		},
		{
			question: "摇头丸是毒品吗?()",
			answer: "C",
		},
		{
			question: "为预防近视，下列措施中()项是错误的。",
			answer: "C",
		},
		{
			question: "吸毒成瘾人员应当()。",
			answer: "C",
		},
		{
			question: "我国《禁毒法》明确的禁毒方针第一句话是?",
			answer: "B",
		},
		{
			question: "关于营养，正确的说法是：()",
			answer: "B",
		},
		{
			question: "外出回家，你应该()",
			answer: "B",
		},
		{
			question: "预防食物中毒的措施有：()",
			answer: "C",
		},
		{
			question: "长期吸食鸦片会使人丧失。()",
			answer: "D",
		},
		{
			question: "摇头丸的危害有()",
			answer: "C",
		},
		{
			question: "新精神活性物质又称为()",
			answer: "C",
		},
		{
			question: '2011年国家禁毒办将()确定为全国"不让毒品进校园"活动项目试点?',
			answer: "D",
		},
		{
			question: "()类毒品主要的化学成分包括：大麻烟、大麻脂、大麻油等，吸食大麻制品初期，会产生错觉、思维混乱，发出咯咯咯的傻笑。",
			answer: "A",
		},
		{
			question: "毒品原植物是指罂粟、()和古柯树。",
			answer: "A",
		},
		{
			question: "我国目前的吸毒人员主要以吸食()为主，大约占50%以上",
			answer: "B",
		},
		{
			question: "()将成为本世纪的主要毒品。",
			answer: "C",
		},
		{
			question: "以下是毒品的是()",
			answer: "B",
		},
		{
			question: "合成毒品直接作用于人的。()",
			answer: "C",
		},
		{
			question: '不属于"摇头丸"危害的是()',
			answer: "C",
		},
		{
			question: "()经过加工可以得到吗啡和海洛因",
			answer: "A",
		},
		{
			question: "以下不是毒品的是()",
			answer: "C",
		},
		{
			question: "人体必需的营养物质包括()",
			answer: "A",
		},
		{
			question: "摇头丸对身体的危害有()",
			answer: "A",
		},
		{
			question: "毒品有可能会出现在以下哪个场所()",
			answer: "C",
		},
		{
			question: "新精神活性物质是()",
			answer: "A",
		},
		{
			question: "大麻属于()毒品。",
			answer: "A",
		},
		{
			question: "毒品有那些危害呢?()",
			answer: "C",
		},
		{
			question: "青少年应当远离()场所",
			answer: "C",
		},
		{
			question: "预防碘缺乏病最简单、经济的方法是：()",
			answer: "C",
		},
		{
			question: "当小学生独自一人出门上学时，应该注意什么?()",
			answer: "B",
		},
		{
			question: "冰毒最早是哪个国家科学家发明的()",
			answer: "C",
		},
		{
			question: "以下不属于毒品的有()",
			answer: "A",
		},
		{
			question: "哪种做法可能引起病从口入：()",
			answer: "B",
		},
		{
			question: "毒品区别于其他毒物的自然特征是。()",
			answer: "B",
		},
		{
			question: "氯胺酮的别称的是()",
			answer: "C",
		},
		{
			question: "以下哪种行为是吸食毒品的行为()",
			answer: "A",
		},
		{
			question: "老鼠能传播哪些疾病?()",
			answer: "B",
		},
		{
			question: "如果感觉自己发烧或者浑身疼，正确的做法是。()",
			answer: "A",
		},
		{
			question: "毒品预防教育重点对象是()",
			answer: "C",
		},
		{
			question: "毒品违法犯罪活动通常会在某些特定场所进行。青少年远离以下场所(),可以有效预防毒品违法犯罪活动的侵害。",
			answer: "C",
		},
		{
			question: "少年儿童维生素A缺乏，会影响()的发育。",
			answer: "B",
		},
		{
			question: "当陌生人主动给你饮料和水时，你应该怎么做?()",
			answer: "B",
		},
		{
			question: "下列不属于新型毒品的是()",
			answer: "A",
		},
		{
			question: "吗啡一般是从那种植物中提炼出来的?()",
			answer: "B",
		},
		{
			question: "根据我国相关规定，以下不属于毒品的是。()",
			answer: "C",
		},
		{
			question: "根据相关规定，以下不属于毒品的是()。",
			answer: "C",
		},
		{
			question: "()是吸毒人群中初次吸毒比例最高的原因。",
			answer: "A",
		},
		{
			question: "青少年最容易因为哪些原因而染上毒品?()",
			answer: "D",
		},
		{
			question: "青少年最容易因为哪些原因而染上毒品?()",
			answer: "C",
		},
		{
			question: "以下哪种行为是吸食毒品的行为()",
			answer: "B",
		},
		{
			question: "以下哪类是新精神活性物质()",
			answer: "B",
		},
		{
			question: "你觉得以下哪项不是保持身体健康的行为?()",
			answer: "C",
		},
		{
			question: "请给胖墩开1张减肥处方：()",
			answer: "C",
		},
		{
			question: "你朋友向你推荐一种神奇的香烟，你会()",
			answer: "C",
		},
		{
			question: "海洛因多数为()结晶粉末",
			answer: "B",
		},
		{
			question: "毒品的危害可以概括为()",
			answer: "A",
		},
		{
			question: "吸食、注射毒品严重破坏人体的生理机能和免疫机能，引起各种并发症，最终导致()。",
			answer: "C",
		},
		{
			question: "冰毒在()比较常见",
			answer: "B",
		},
		{
			question: "吸毒者不仅摧残人的身心健康，还造成一系列的家庭问题。表现为()",
			answer: "D",
		},
		{
			question: "吗啡有，()、盐酸吗啡阿托品液，盐酸吗啡注射液",
			answer: "B",
		},
		{
			question: "朋友递烟给你，你不要，他们说连烟都不敢抽没出息，偶尔体验一下没关系，你最好的应对方式应该是：()",
			answer: "A",
		},
		{
			question: "以下哪种行为是违法行为：()",
			answer: "B",
		},
		{
			question: "安全用电应做到：()",
			answer: "C",
		},
		{
			question: "当发现有人可能正在吸毒或实施涉及毒品的违法犯罪行为时，应该()",
			answer: "A",
		},
		{
			question: "我们在交友，选择活动场所时应注意什么?()",
			answer: "D",
		},
		{
			question: "按照《禁毒法》的规定，下面表述正确、完整的是：()",
			answer: "A",
		},
		{
			question: "可卡因长期大量使用，易造成。()",
			answer: "A",
		},
		{
			question: "吸毒成瘾作为一种疾病。以下哪个表述是正确。()",
			answer: "C",
		},
		{
			question: "吸毒成瘾作为一种疾病。以下哪个表述是正确。()",
			answer: "C",
		},
		{
			question: "冰毒具有强烈的()。",
			answer: "A",
		},
		{
			question: '人对学生说："现在的学习都很紧张，想不想减轻学习的压力?"学生说：想。路人说：那我想向你推荐一种药。学生应该()',
			answer: "C",
		},
		{
			question: "慎重交友是有效防止青少年被毒品侵害的行为准则之一。对此，正确的理解是：()",
			answer: "A",
		},
		{
			question: "西方国家吸食的最普遍的毒品是()",
			answer: "B",
		},
		{
			question: '预防"流感"的错误做法是：()',
			answer: "C",
		},
		{
			question: '(),即甲基苯丙胺，外观为纯白结晶体，晶莹剔透，故被吸毒、贩毒者称为"冰"',
			answer: "B",
		},
		{
			question: "以下哪个毒品是目前世界上吸食人群最多的()",
			answer: "C",
		},
		{
			question: "小学生可以为禁毒做些什么?()",
			answer: "C",
		},
		{
			question: "当有人以各种借口引诱你吸食毒品或者尝试一些可能是毒品的药丸时，你应该怎么办?()",
			answer: "B",
		},
		{
			question: "在长跑时应注意调整速度，正确的做法是：()",
			answer: "C",
		},
		{
			question: '拒绝接受陌生人的"馈赠"是良好的行为习惯。正确的理解是?()',
			answer: "B",
		},
		{
			question: "()使用止咳水，是具有临床治疗价值的药品",
			answer: "C",
		},
		{
			question: "广大青少年防止毒品侵害的最有效、最积极的办法就是：()",
			answer: "A",
		},
		{
			question: "虎门硝烟是由()主持的",
			answer: "B",
		},
		{
			question: "如被猫、狗等动物咬伤或抓伤，应如何处理()",
			answer: "A",
		},
		{
			question: "冬季锻炼活动量最好是：()",
			answer: "A",
		},
		{
			question: "1839年3月，清朝道光皇帝派哪一位钦差大臣到广州进行禁烟运动。()",
			answer: "A",
		},
		{
			question: "保持环境整洁应做到的是：()",
			answer: "B",
		},
		{
			question: "爱护公共场所卫生应做到：()",
			answer: "B",
		},
		{
			question: "可卡因是一种()类的毒品，广泛流行于欧美。",
			answer: "C",
		},
		{
			question: "海洛因属于哪种毒品?()",
			answer: "A",
		},
		{
			question: "医学上习惯称吸毒为()、精神药品的滥用。",
			answer: "A",
		},
		{
			question: "《禁毒法》所称的毒品，是指鸦片、海洛因、甲基苯丙胺(冰毒)、吗啡、大麻、可卡因，以及国家规定管制的其他能够使人形成瘾癖的。()",
			answer: "D",
		},
		{
			question: "海洛因是()经化学提纯后所得的产物",
			answer: "A",
		},
		{
			question: "()能产生镇咳效果，但因毒性反应严重、成瘾性大，在临床上早已不再用于镇咳。",
			answer: "A",
		},
		{
			question: "下列选项中对毒品的描述正确的是?",
			answer: "B",
		},
		{
			question: '吸毒者最初"品尝"第一口毒品时，或多或少是受到一种不健康心理的驱动。那么，吸毒者都有什么样的不健康心理呢?()',
			answer: "C",
		},
		{
			question: "吸毒对女性怀孕后胎儿的影响是()",
			answer: "C",
		},
		{
			question: '()是"金三角"地区罂粟种植面积最大、产量最多的国家。',
			answer: "C",
		},
		{
			question: "当你的朋友或毒贩逼你吸毒时，你应该怎么办?()",
			answer: "A",
		},
		{
			question: "()规定了吸毒是违法行为，要受到行政处罚",
			answer: "C",
		},
		{
			question: "以下不属于吸毒违法行为的是?()",
			answer: "C",
		},
		{
			question: "毒品的法律特征是。()",
			answer: "B",
		},
		{
			question: "全世界每年有()万人因吸毒而死亡",
			answer: "B",
		},
		{
			question: "吗啡和海洛因，如果采用静脉注射的方式即可上瘾。()",
			answer: "A",
		},
		{
			question: "下列选项中属于吸毒成瘾的表现的是。()",
			answer: "A",
		},
		{
			question: "青少年远离毒品，以下正确的做法是。()",
			answer: "A",
		},
		{
			question: "青少年远离毒品，以下错误的做法是。()",
			answer: "B",
		},
		{
			question: "如何加强自我保护意识?()",
			answer: "B",
		},
		{
			question: "吸毒中最容易导致艾滋病病毒交叉感染的危险行为是。()",
			answer: "C",
		},
		{
			question: '吸毒，也称"药物滥用",就是出于()目的，通过注射、口服、鼻吸或其他方式将毒品摄入人体的行为。',
			answer: "A",
		},
		{
			question: "一人吸毒，全家遭殃说明了毒品的什么危害?()",
			answer: "B",
		},
		{
			question: "毒品对家庭的危害体现为。()",
			answer: "B",
		},
		{
			question: "小学生如何预防吸毒?()",
			answer: "A",
		},
		{
			question: "广大青少年防止毒品侵害的最有效、最积极的办法就是。()",
			answer: "A",
		},
		{
			question: "氯胺酮一般以盐酸盐形式存在，盐酸氯胺酮为()结晶性粉末",
			answer: "A",
		},
		{
			question: "古柯主要种植在哪里?()",
			answer: "B",
		},
		{
			question: '毒贩出售呈块状的(),称为"滚石"',
			answer: "C",
		},
		{
			question: "摇头丸属于()",
			answer: "D",
		},
		{
			question: "冰毒的主要化学成分为()",
			answer: "A",
		},
		{
			question: "麻古是泰语的音译，其主要成分是",
			answer: "A",
		},
		{
			question: "海洛因是属于哪类毒品?()",
			answer: "B",
		},
		{
			question: "古柯是一种常绿灌木植物，叶子中含有生物碱()",
			answer: "D",
		},
		{
			question: "可卡因是()白色薄片状的结晶体。",
			answer: "C",
		},
		{
			question: "据国外有关部门统计，吸毒者多短命，平均寿命只有()多岁",
			answer: "C",
		},
		{
			question: "亲戚递烟给你，以下最好的应对方式应该是：()",
			answer: "B",
		},
		{
			question: "以下哪种做法不会引起近视?()",
			answer: "C",
		},
		{
			question: "关于跑步，错误的做法是：()",
			answer: "C",
		},
		{
			question: "青少年怎样做才能远离毒品，健康的生活?()",
			answer: "D",
		},
		{
			question: "()是毒品预防教育的重点对象。",
			answer: "A",
		},
		{
			question: "禁毒是()的共同责任。",
			answer: "A",
		},
		{
			question: "吸毒者在今后的人生道路上应选择的正确生活态度是()",
			answer: "C",
		},
		{
			question: "正确的刷牙方法应是：()",
			answer: "A",
		},
		{
			question: "青少年要远离毒品，增强自我保护意识，其中最重要的因素是()",
			answer: "C",
		},
		{
			question: "()是学生成长的重要场所，在毒品早期预防教育中，具有不可替代的作用。",
			answer: "B",
		},
		{
			question: "生理脱毒只是戒毒过程的第一步，最根本的是要彻底摆脱()才能达到彻底康复。",
			answer: "C",
		},
		{
			question: "鸦片可以分为和。()",
			answer: "A",
		},
		{
			question: "在小学普遍开展毒品预防教育的主要目的是提高他们的()意识。",
			answer: "D",
		},
		{
			question: "在小学生中普遍开展毒品预防教育的主要目的是提高他们的()意识",
			answer: "A",
		},
		{
			question: "冰毒属于()",
			answer: "B",
		},
		{
			question: "鸦片属于()",
			answer: "B",
		},
		{
			question: "吗啡属于()",
			answer: "B",
		},
		{
			question: "杜冷丁属于()",
			answer: "B",
		},
		{
			question: "曲马多属于()",
			answer: "B",
		},
		{
			question: "以下不属于毒品危害的是()",
			answer: "C",
		},
		{
			question: "教室不经常开窗的坏处是：()",
			answer: "B",
		},
		{
			question: "每年的6月26日是()。",
			answer: "B",
		},
		{
			question: "当毒品在你面前出现时，正确的选择是()",
			answer: "C",
		},
		{
			question: "摇头丸是毒品吗?()",
			answer: "B",
		},
		{
			question: '关于"摇头丸"以下正确的是()',
			answer: "C",
		},
		{
			question: "使用小手帕时应该做到：()",
			answer: "B",
		},
		{
			question: "蛋白质的食物来源是：()",
			answer: "A",
		},
		{
			question: "对待吸毒人员的错误态度是：()。",
			answer: "A",
		},
		{
			question: "课间10分钟适合做的事是：()",
			answer: "C",
		},
		{
			question: "当意外捡到类似毒品的物品时，正确的做法是()",
			answer: "C",
		},
		{
			question: "海洛因吸食者不会出现以下体貌特征：()",
			answer: "B",
		},
		{
			question: "长期服用毒品会()",
			answer: "A",
		},
		{
			question: "长期服用毒品不会()",
			answer: "B",
		},
		{
			question: "金三角是指位于东南亚的()边境地区的三角地带。",
			answer: "A",
		},
		{
			question: "小学生有效的远离毒品，自我保护的方法是。()",
			answer: "D",
		},
		{
			question: "下面哪些吐痰的方法是正确的?()",
			answer: "A",
		},
		{
			question: "下面哪项不是吸毒的危害?()",
			answer: "C",
		},
		{
			question: "毒品的自然特征是。()",
			answer: "C",
		},
		{
			question: ".吸食毒品是()。",
			answer: "A",
		},
		{
			question: "李某为了吸引顾客，在火锅里加入罂粟壳的行为()",
			answer: "A",
		},
		{
			question: "吸食新型毒品是()",
			answer: "A",
		},
		{
			question: "毒品的特征包括()、危害性和非法性",
			answer: "B",
		},
		{
			question: "吸食毒品的人数多达2.48亿人，其中大多数是()",
			answer: "C",
		},
		{
			question: "吗啡是鸦片中最主要的生物碱，从鸦片提取而成。纯净的吗啡为()或白色的粉末或结晶。",
			answer: "A",
		},
		{
			question: "关于对毒品的危害认识错误的是。()",
			answer: "B",
		},
		{
			question: "关于对毒品的危害认识错误的是。()",
			answer: "B",
		},
		{
			question: "关于对吸毒的认识，说法错误的是?()",
			answer: "C",
		},
		{
			question: "于吸毒的认识错误的是。()",
			answer: "A",
		},
		{
			question: "青少年应当避免与()种人交往",
			answer: "A",
		},
		{
			question: "关于对吸毒费用的认识，正确的是。()",
			answer: "A",
		},
		{
			question: "()问题已经成为当今世界公害",
			answer: "C",
		},
		{
			question: "以下哪种行为是违法行为：()",
			answer: "C",
		},
		{
			question: "我国法律规定，毒品主要是指鸦片、海洛因、()、吗啡、大麻、可卡因",
			answer: "B",
		},
		{
			question: "我国法律规定，毒品主要是指鸦片、海洛因、吗啡及那一种()",
			answer: "B",
		},
		{
			question: "我国法律规定，毒品主要是指鸦片、海洛因、吗啡及以下物品()",
			answer: "B",
		},
		{
			question: "在中国下列哪一种物品是毒品?()",
			answer: "C",
		},
		{
			question: "()是毒品成瘾的病理学特征",
			answer: "B",
		},
		{
			question: "吗啡对呼吸中枢神经有极强的()。",
			answer: "C",
		},
		{
			question: "毒瘾的戒除关键在于()",
			answer: "B",
		},
		{
			question: "以下哪种行为不应该做()",
			answer: "A",
		},
		{
			question: "小学生在现实生活中，应该远离的特殊人群是。()",
			answer: "D",
		},
		{
			question: "导致青少年吸毒最重要的原因是。()",
			answer: "B",
		},
		{
			question: '我国近代史上著名的"虎门销烟"中销毁的是()',
			answer: "A",
		},
		{
			question: '我们在电视和书本上看到的"大烟"指的是什么?()',
			answer: "A",
		},
		{
			question: "目前，全世界滥用最为广泛的毒品是()",
			answer: "B",
		},
		{
			question: "()服用后，会出现幻听、幻觉、幻视，精神分裂和神经中毒的反应。",
			answer: "B",
		},
		{
			question: "我国2014年以前，吸毒人员吸食的毒品以()为主?",
			answer: "C",
		},
		{
			question: "麻古呈片剂状，是()片剂。",
			answer: "C",
		},
		{
			question: '我们从电视或书本上读到的"叶子"(毒品)指什么()',
			answer: "C",
		},
		{
			question: "人工合成的毒品是()",
			answer: "C",
		},
		{
			question: "摇头丸是()的衍生物",
			answer: "C",
		},
		{
			question: "麻古呈片剂状，是()片剂。",
			answer: "C",
		},
		{
			question: "海洛因，俗称()、白面。",
			answer: "B",
		},
		{
			question: "吸食()后驾驶车辆，容易造成情绪冲动及过度兴奋，从而极易引发超速而造成的严重交通事故。",
			answer: "C",
		},
		{
			question: "为了预防近视，看电视时眼与屏幕的高度最好是()。",
			answer: "A",
		},
		{
			question: "青春期的健康往往影响一个人的一辈子的生活，所以在青春期应：()",
			answer: "C",
		},
		{
			question: "MDMA是()的缩写",
			answer: "A",
		},
		{
			question: "小强和小辉是好朋友，看到小辉成天在网吧中吞云吐雾，小强很羡慕，瞒着父母也跟着小辉去黑网吧，不久小强也沾染了毒品。这个故事告诉了我们什么道理?()",
			answer: "A",
		},
		{
			question: '小贝一直都是班上的好学生，学习成绩优秀。但最近一次考试成绩不理想，怕被父母责备，于是一个人在电玩室，沉醉在游戏中。一位"大哥"主动给了小贝一种让人忘记烦恼的"糖",后来才发现是经过伪装的合成毒品。这案例主要说明了什么道理?()',
			answer: "C",
		},
		{
			question: '下列关于"摇头丸"叙述正确的是()',
			answer: "A",
		},
		{
			question: "以下不属于毒品的基本特征的是。()",
			answer: "B",
		},
		{
			question: "毒品的特征不包括。()",
			answer: "D",
		},
		{
			question: "毒品的特征是：()",
			answer: "C",
		},
		{
			question: "李某发现儿子小强吸毒后，便将其关在家中，并与家人轮流看守令其戒毒。起初，断了毒品的小强呼天喊地，半个月后，小强又恢复了正常。试问小强是否已全部戒除毒瘾()",
			answer: "B",
		},
		{
			question: "毒品原植物是指()、大麻和古柯树。",
			answer: "A",
		},
		{
			question: "以下原植物可以用于提炼毒品的是()",
			answer: "A",
		},
		{
			question: "下列不属于毒品原植物的是()",
			answer: "C",
		},
		{
			question: "下列不是毒品的是()",
			answer: "C",
		},
		{
			question: "下列物质中，属于毒品的是",
			answer: "A",
		},
		{
			question: "鸦片，又叫阿片，俗称大烟，源于()葫果，其所含主要生物碱是吗啡。",
			answer: "A",
		},
		{
			question: "鸦片，又叫阿片，俗称大烟，源于()葫果，其所含主要生物碱是吗啡。",
			answer: "A",
		},
		{
			question: "对预防沙眼来说哪种做法是正确的?()",
			answer: "C",
		},
		{
			question: "如果有人触电，正确的抢救方法是：()",
			answer: "B",
		},
		{
			question: "眼睛进了灰尘和小虫等，正确的做法是：()",
			answer: "C",
		},
		{
			question: ".正确用药应做到：()",
			answer: "C",
		},
		{
			question: "青少年应当避免与()交往",
			answer: "C",
		},
		{
			question: "以下哪个是当前我国的禁毒工作方针()",
			answer: "A",
		},
		{
			question: "小强今年上六年级，学习压力大。最近十分沮丧和郁闷，于是跟着小王去了电子游戏室和舞厅，不小心服用了合成毒品摇头丸，最后被警察抓获。这个故事说明了什么?()",
			answer: "A",
		},
		{
			question: "新精神活性物质是()",
			answer: "C",
		},
		{
			question: "过度使用止疼药也会产生严重的药物依赖，所以止疼药也要严格遵医嘱服用。以上说法()。",
			answer: "A",
		},
		{
			question: "大麻在部分欧美国家和地区很流行，所以它不算是毒品。这种说法：()",
			answer: "B",
		},
		{
			question: "吸毒如果仅仅偶尔吸一两次，一般都不会上瘾。这种说法()",
			answer: "C",
		},
		{
			question: "广大青少年在日常生活中防毒要做到四点：一是不要听人蛊惑，受人引诱；二是不要与吸毒者、贩毒者为伍；三是不要接受有吸毒劣迹的人送的香烟、酒精、饮料；四是()。",
			answer: "B",
		},
		{
			question: "人对毒品产生的依赖性是指。()",
			answer: "C",
		},
		{
			question: "阅读时要尽可能使书本平面与视线成()。",
			answer: "B",
		},
		{
			question: "路人问学生甲想不想尝试一下快乐的感觉?路人见学生甲没有表态，就拿出了一包白粉状的物品倒在锡纸上用火点着，随即就看到缕缕白烟升起。路人让学生甲用鼻子闻一闻，这时如果你是学生甲你会怎么办?()",
			answer: "A",
		},
		{
			question: "当有人向提供毒品时，你会怎样做?()",
			answer: "C",
		},
		{
			question: "毒品最早来源于一些()",
			answer: "A",
		},
		{
			question: "鸦片是罂粟植物的()",
			answer: "B",
		},
		{
			question: "作为一名小学生，可以为禁毒工作做些什么?()",
			answer: "C",
		},
		{
			question: "吗啡成瘾者常用吸食方式是()。",
			answer: "A",
		},
		{
			question: "长期或吸食大麻会有什么反应?",
			answer: "A",
		},
		{
			question: "当自己的好朋友吸毒后，不正确的做法是什么?()",
			answer: "A",
		},
		{
			question: "吸毒者在今后的人生道路上应选择的正确生活态度是()",
			answer: "C",
		},
		{
			question: "摇头丸服用后表现为()",
			answer: "B",
		},
		{
			question: "《中华人民共和国刑法》规定了。()",
			answer: "A",
		},
		{
			question: "《中华人民共和国禁毒法》规定了。()",
			answer: "A",
		},
		{
			question: "《中华人民共和国禁毒法》规定了。()",
			answer: "A",
		},
		{
			question: "《禁毒法》规定，教育行政部门、()应当将禁毒知识纳入教育、教学内容，对学生进行禁毒宣传教育。公安机关、司法行政部门和卫生行政部门应当予以协助。",
			answer: "A",
		},
		{
			question: "毒品对吸食者本人的危害表现为。()",
			answer: "D",
		},
		{
			question: "当发现自己居住的楼群中，有吸毒者正确的做法是?()",
			answer: "C",
		},
		{
			question: "吸毒者的行事诡异，表现往往与普通人不一样，表现在哪个方面?()",
			answer: "C",
		},
		{
			question: "如何判断身边的同学是否吸毒?吸毒有什么征兆?()",
			answer: "D",
		},
		{
			question: "吸毒危害人体的正常生理机能，易感染和传播多种疾病，吸毒过量还会造成什么后果?()",
			answer: "A",
		},
		{
			question: "毒品的危害有。()",
			answer: "D",
		},
		{
			question: "如果你在治安复杂场所时遇到陌生人递过来的饮料，正确的做法是()",
			answer: "A",
		},
		{
			question: "如何判断他人染上毒瘾?()",
			answer: "D",
		},
		{
			question: "毒品的后果特征表现为。()",
			answer: "B",
		},
		{
			question: "下列关于毒品成瘾性的说法，正确的选项是。()",
			answer: "D",
		},
		{
			question: "毒品滥用的危害体现在对吸毒者本人、家庭和()三方面的危害",
			answer: "D",
		},
		{
			question: "关于禁毒，下面表述错误的是。()",
			answer: "C",
		},
		{
			question: "毒品对社会的危害主要表现为。()",
			answer: "A",
		},
		{
			question: "下列选项中关于吸毒人员成瘾时间快慢的说法正确的是。()",
			answer: "B",
		},
		{
			question: "预防吸毒的有效措施有。()",
			answer: "D",
		},
		{
			question: "以下选项中不能有效的防范毒品是。()",
			answer: "A",
		},
		{
			question: "吗啡是鸦片中最主要的生物碱，从鸦片提取而成。纯净的吗啡为()或白色的粉末或结晶。",
			answer: "B",
		},
		{
			question: "摇头丸是属于哪类毒品?()",
			answer: "C",
		},
		{
			question: "下列物品中不属于毒品的是。()",
			answer: "C",
		},
		{
			question: "冰毒的衍生物是()",
			answer: "C",
		},
		{
			question: "古柯是一种()",
			answer: "B",
		},
		{
			question: "刘德华主演的电影《门徒》反映了()地区制造毒品的情况。",
			answer: "A",
		},
		{
			question: "强制隔离戒毒和社区戒毒的时间分别是多久?()",
			answer: "C",
		},
		{
			question: "据联合国有关部门统计，全球每年因吸毒死亡，吸毒丧失劳动能力的人数分别为(),其中绝大多数为青少年。",
			answer: "A",
		},
		{
			question: '氟硝安定俗称"十字架"、"FM2"、又被称为"约会强暴丸",属于抑制剂类药物，是一种镇静催眠药，可让人持续睡眠()小时。',
			answer: "B",
		},
		{
			question: "世界艾滋病日是每年的何月何日?()",
			answer: "C",
		},
		{
			question: '艾滋病，全称是"获得性免疫缺陷综合症",是一种由于机体感染了人类免疫缺陷病毒而发生的传染病，它的英文简称是()。',
			answer: "D",
		},
		{
			question: "众多种类的毒品之中有很多的致幻类药品，这其中()是已知药力最强的致幻剂。",
			answer: "C",
		},
		{
			question: "()俗称K粉，也称为开他命。",
			answer: "C",
		},
		{
			question: "生理脱毒阶段的时间大约为多久?()",
			answer: "B",
		},
		{
			question: "中学生参与禁毒的主要目的是通过学习禁毒知识，使自己增强()的能力。",
			answer: "B",
		},
		{
			question: "社区康复是对被解除强制隔离戒毒的人员进行带有强制性，不得限制人身自由，按本人自愿的原则在一定场所接受身体和心理康复的一种戒毒措施。此措施的期限为。()",
			answer: "B",
		},
		{
			question: "下列属于良好的生活习惯表现的是。()",
			answer: "D",
		},
		{
			question: "毒品对吸食者的身心具有严重的损害，以下属于毒品对人身心危害的是。()",
			answer: "D",
		},
		{
			question: "47、曲马多属于()物质，主要用作镇痛药。",
			answer: "D",
		},
		{
			question: "吸毒成瘾者怀孕，对婴儿有什么影响?()",
			answer: "A",
		},
		{
			question: "苟利国家生死以，岂因祸福避趋之是我国著名历史人物()写的诗句，充分体现了他的爱国主义情怀。",
			answer: "B",
		},
		{
			question: "造成吸毒人群中艾滋病流行的主要原因是。()",
			answer: "C",
		},
		{
			question: "近年来，一些犯罪分子常用()来实施麻醉抢劫。",
			answer: "C",
		},
		{
			question: '人们常说"毒品猛于虎",毒品的危害除了对身心的危害，严重摧残吸毒者的身体之外，还包括。()',
			answer: "D",
		},
		{
			question: "第一次将毒品犯罪规定为国际犯罪的公约是。()",
			answer: "A",
		},
		{
			question: "学校按照()有关要求，有针对性的进行毒品预防教育。",
			answer: "D",
		},
		{
			question: "中国是世界上禁毒立法最早的国家之一，以下哪一部法律是中国和全世界第一部比较完整的禁毒法规?()",
			answer: "B",
		},
		{
			question: "已满()周岁的人犯贩卖毒品罪，应当负刑事责任。",
			answer: "A",
		},
		{
			question: "为进一步推进和深化禁毒教育，帮助学生树立远离毒品、健康成长的观念，国家禁毒办等11个部门于()联合制定了《关于深化全民禁毒宣传教育的指导意见》。",
			answer: "C",
		},
		{
			question: "国家禁毒办等11个部门为加强全民禁毒教育，于()年联合制定了《全民禁毒教育实施意见》。",
			answer: "A",
		},
		{
			question: "强制隔离戒毒是我国目前现有禁毒模式中唯一限制人身自由的行政强制措施，其期限为。()",
			answer: "A",
		},
		{
			question: "社区戒毒为我国现有禁毒模式之一，其属于虽具有强制性但却不得限制人身自由的禁毒模式，此模式期限为。()",
			answer: "B",
		},
		{
			question: '《预防未成年人犯罪法》把"吸食、注射毒品"列为严重不良行为。()',
			answer: "C",
		},
		{
			question: "《中华人民共和国禁毒法》已由中华人民共和国第十届全国人民代表大会常务委员会第三十一次会议于2007年12月29日通过，并自2008年()起施行。",
			answer: "B",
		},
		{
			question: "()应当制定和实施禁毒公益宣传教育方案，安排宣传版面和时段，定期刊登、播放禁毒宣传广告和内容，并将相关情况报行业主管部门。",
			answer: "A",
		},
		{
			question: "根据《中华人民共和国禁毒法》之规定，我国的禁毒方针是。()",
			answer: "D",
		},
		{
			question: "《禁毒法》规定的禁毒工作机制是：()",
			answer: "B",
		},
		{
			question: "毒驾引发的恶性交通事故不断增多，我国对查出毒后驾驶的驾驶者一律()",
			answer: "C",
		},
		{
			question: "我国对娱乐场所涉嫌毒品违法行为时，处罚的形式有警告，罚款和()。",
			answer: "B",
		},
		{
			question: '2015年6月习近平总书记在接见全国禁毒工作先进集体代表和先进个人时明确提出"禁毒工作要从青少年抓起",国家禁毒委员会在全国范围内开展了以青少年毒品预防教育，特别是在校学生的毒品预防教育为主题的宣传教育活动，此项工程被命名为()',
			answer: "B",
		},
		{
			question: '1990年2月20日召开的"国际合作取缔麻醉药品和精神药物非法生产、供应、需求、贩运和分销的联大特别会议"上通过了《政治宣言》和《全球行动纲领》,确立了()两大禁毒战略。',
			answer: "A",
		},
		{
			question: '林则徐"虎门销烟"发生在哪一年()',
			answer: "A",
		},
		{
			question: '为全面禁绝毒品危害，联合国于()年确立了"有效减少毒品需求"的禁毒战略。',
			answer: "A",
		},
		{
			question: "1949年中华人民共和国成立后，仅仅()时间，中国共产党就一举扫除了贻害中国200年的烟毒。",
			answer: "B",
		},
		{
			question: "第一个国际禁毒会议是()。",
			answer: "C",
		},
		{
			question: "毒品问题在我国的产生和发展大体可分为两个阶段：第一阶段是1978年至1990年，为毒品()阶段。",
			answer: "B",
		},
		{
			question: "目前受毒品危害最严重的年龄组是()。",
			answer: "B",
		},
		{
			question: "安纳咖的化学名称为。()",
			answer: "C",
		},
		{
			question: "当不法分子诱惑我们吸毒时，我们应该()。",
			answer: "B",
		},
		{
			question: "小王长期吸食一种毒品已经严重上瘾，并且现在正使用美沙酮门诊作为替代治疗。忽然有一天小王意外发生了车祸受伤严重，医生需要给他做外科手术缝合伤口。但在手术过程中，医生给小王打了常规剂量的麻醉药竟然毫无效果。请你判断小王是以下哪一种毒品的成瘾者：()。",
			answer: "B",
		},
		{
			question: "在中小学生中普遍开展毒品预防教育的主要目的是提高他们的()意识。",
			answer: "C",
		},
		{
			question: "以下哪一种行为是防卫毒品侵害的正确行为：()",
			answer: "A",
		},
		{
			question: "吸毒是时髦的，是有钱人的标志。这种不正确的认识，其本质是：()",
			answer: "A",
		},
		{
			question: "染上毒瘾的人会出现一些与吸毒行为相关的迹象。以下哪一个不属于吸毒成瘾人员会出现的迹象：()。",
			answer: "D",
		},
		{
			question: "替代种植是一种针对毒品原植物产区的经济政策，主要是以科技为依托，积极帮助周边国家和地区利用农经作物及其他产业替代罂粟种植、毒品生产，以逐步削弱这些地区对毒品经济的依赖。在金三角地区主要替代种植的作物是()",
			answer: "D",
		},
		{
			question: '对于毒贩引诱吸毒的伎俩，比如"吸食后可以治病，可以减肥"之类的谎言，正确的理解是()',
			answer: "C",
		},
		{
			question: "社区戒毒的期限为(),强制隔离戒毒的期限为()。",
			answer: "C",
		},
		{
			question: "人们平时喝的咖啡、茶叶及可乐等饮料中均含有一定量的咖啡因，一般每天摄入咖啡因总量在()毫克内不会出现不良反应。",
			answer: "B",
		},
		{
			question: "研究表明，80%以上的苯丙胺滥用者即使停止滥用最长达(),仍然有一些精神病症状，乃至精神分裂，一遇刺激便会发作。",
			answer: "D",
		},
		{
			question: "下列属于兴奋剂的是()",
			answer: "B",
		},
		{
			question: "粗制吗啡称为()",
			answer: "C",
		},
		{
			question: "以下哪类是新精神活性物质()",
			answer: "B",
		},
		{
			question: "以下不属于阿片类毒品。()",
			answer: "A",
		},
		{
			question: "下列不属于阿片类毒品的是()",
			answer: "A",
		},
		{
			question: "以下属于常见毒品中天然类毒品的是。()",
			answer: "C",
		},
		{
			question: "下列选项中属于致幻剂类毒品的是。()",
			answer: "D",
		},
		{
			question: '麦角酰二乙胺，俗称"摇脚丸",吸食后会存在以下反应。()',
			answer: "D",
		},
		{
			question: "下列选项中属于毒品的基本特征的是?()",
			answer: "D",
		},
		{
			question: "新精神活性物质又称为()",
			answer: "C",
		},
		{
			question: "下列属于合成毒品的是()",
			answer: "C",
		},
		{
			question: "吗啡是从()提炼出来的",
			answer: "D",
		},
		{
			question: "大麻类毒品主要包括：()等",
			answer: "D",
		},
		{
			question: "以下不属于毒品的是()",
			answer: "D",
		},
		{
			question: "合成毒品直接作用于人的()",
			answer: "C",
		},
		{
			question: "新精神活性物质是()",
			answer: "A",
		},
		{
			question: '某种鸦片类毒品，极具成瘾性，因其具有强烈成瘾性和巨大危害性的吗啡类衍生毒品，被世界各国列为"头号毒品"。它是()。',
			answer: "C",
		},
		{
			question: "以下毒品中属于中枢兴奋剂类的是。()",
			answer: "B",
		},
		{
			question: "下列选项中属于禁毒志愿者组织的任务的是。()",
			answer: "C",
		},
		{
			question: "青少年为避免染毒悲剧的发生，要构筑起良好的心理防线。下列选项中关于构筑心理防线的认识正确的是?()",
			answer: "C",
		},
		{
			question: "下列选项中，属于吸食海洛因危害表现的是。()",
			answer: "C",
		},
		{
			question: "王某在自家阳台上悄悄种植了几盆罂粟，罂粟花开时，被放学回家的几个中学生发现后检举。公安机关责令王某铲除罂粟，并处罚了王某。王某的行为是?()",
			answer: "B",
		},
		{
			question: "《中华人民共和国禁毒法》第13条规定，()和学校应当将禁毒知识纳入教育、教学内容，对学生进行禁毒宣传教育。",
			answer: "C",
		},
		{
			question: "《禁毒法》规定，国务院设立(),负责组织、协调、指导全国的禁毒工作。",
			answer: "D",
		},
		{
			question: "对自愿接受戒毒治疗的吸毒人员，公安机关对其原吸毒行为可。()",
			answer: "B",
		},
		{
			question: "按照《禁毒法》的规定，下面表述正确、完整的是：()",
			answer: "A",
		},
		{
			question: "我国禁毒工作的治本之策是以下哪个选项?()",
			answer: "A",
		},
		{
			question: "李某在自己土地里种植罂粟，但在收获前意识到可能会涉嫌违法，并将所有罂粟铲除，对于李某可以。()",
			answer: "C",
		},
		{
			question: "《禁毒法》规定，娱乐场所应当建立()制度，发现娱乐场所内有毒品违法犯罪活动的，应当立即向公安机关报告。",
			answer: "C",
		},
		{
			question: '《全民禁毒教育实施意见》规定，各级各类学校要根据学生的不同特点分阶段(),切实做到计划、教学材料、课时、师资"四到位"。使广大在校学生从小树立"珍爱生命，拒绝毒品"意识，努力实现"学生不吸毒，校园无毒品"的目标。',
			answer: "B",
		},
		{
			question: "《禁毒法》所称的毒品，是指鸦片、海洛因、甲基苯丙胺(冰毒)、吗啡、大麻、可卡因，以及国家规定管制的其他能够使人形成瘾癖的()。",
			answer: "D",
		},
		{
			question: "中华人民共和国根据缔结或者参加的国际条约或者按照(),开展禁毒国际合作。",
			answer: "D",
		},
		{
			question: "禁毒是全社会的。()",
			answer: "A",
		},
		{
			question: "下列原因中，吸毒人群中初次吸毒比例最高的是()。",
			answer: "A",
		},
		{
			question: "强制隔离戒毒场所应当根据戒毒人员的性别、年龄、患病等情况，对戒毒人员实行()",
			answer: "D",
		},
		{
			question: "()是预防毒品的三道防线。",
			answer: "A",
		},
		{
			question: "当发现有人可能正在吸毒或实施涉及毒品的违法犯罪行为时，应该()",
			answer: "A",
		},
		{
			question: "吸毒者极易感染各种疾病，包括性病，造成后代先天性畸形、缺陷。注射毒品是传染()的主要途径。",
			answer: "B",
		},
		{
			question: "在成瘾者吸食某毒品一个月以后，通过以下那种检测方式依然还能检测出来?()",
			answer: "B",
		},
		{
			question: "吸毒成瘾人员应当进行()。",
			answer: "B",
		},
		{
			question: '吸毒，也称"药物滥用",就是出于()目的，通过注射、口服、鼻吸或其他方式将毒品摄入人体的行为。',
			answer: "A",
		},
		{
			question: '在众多毒品中，有很多抑制剂类药物，被不法之徒用来对女性实施性侵犯，它们也被称之为"约会迷奸药"。以下属于此类毒品的是?()',
			answer: "A",
		},
		{
			question: "可卡因是从()植株的树叶中提取的。",
			answer: "A",
		},
		{
			question: "根据相关规定，不属于毒品的是()",
			answer: "D",
		},
		{
			question: '()俗名"可可精",是从古柯叶中分离出来的一种最主要的生物碱，属中枢神经兴奋剂，呈白色晶体状，无气味，味略苦而麻，兴奋作用强。',
			answer: "B",
		},
		{
			question: "以下哪三种毒品属于麻醉剂类毒品()",
			answer: "A",
		},
		{
			question: "以下哪类是新精神活性物质()",
			answer: "B",
		},
		{
			question: "氯胺酮一般以盐酸盐的形式存在，多为()结晶性粉末",
			answer: "D",
		},
		{
			question: "合成类毒品是指用有机合成的方法制造的毒品。以下属于合成类毒品的是。",
			answer: "B",
		},
		{
			question: "服用下列那种毒品后表现为：活动过度，情感冲动，性欲亢进，嗜舞，偏执，妄想，自我约束力下降以及出现幻觉和暴力倾向等。()",
			answer: "C",
		},
		{
			question: '摇头丸是苯丙胺类的衍生物，是亚甲基二氧甲基苯丙胺的片剂，属中枢神经(),是我国规定管制的精神药品。"摇头丸"是其俗称，意为会使人摇头的药丸，吸食者易处于幻觉状态，有暴力攻击倾向。',
			answer: "B",
		},
		{
			question: "目前最常用的脱毒药物(),适用于海洛因毒瘾较深者。",
			answer: "B",
		},
		{
			question: '我们从电视或书本上读到的"大烟"指的是()',
			answer: "B",
		},
		{
			question: "属于古柯类毒品的是()",
			answer: "B",
		},
		{
			question: "麻古的主要成份是()",
			answer: "C",
		},
		{
			question: "小燕同学考试成绩下降了就到酒吧解闷，一名男子看小燕一个人就过来搭话，请小燕喝了一杯橙汁，喝完橙汁5分钟后，小燕就昏睡过去，对外界毫无知觉。醒来后发现钱包和该名男子都已经不见。这说明该名男子有可能在橙汁里加了什么毒品?()",
			answer: "B",
		},
		{
			question: "吸毒成瘾的三个身体特征是药物耐受性、生理依赖性和。()",
			answer: "B",
		},
		{
			question: "曲马多主要用作镇痛药，大剂量服用可在短期内上瘾，而它的危害主要表现为。()",
			answer: "D",
		},
		{
			question: "不良家庭环境对青少年沾染毒品有很大影响，在吸毒人员中，很多家庭存在较多的问题。这句话表述较为符合吸毒行为产生的环境因素中的。()",
			answer: "B",
		},
		{
			question: "根据(),毒品可以分为天然类毒品和合成类毒品。",
			answer: "B",
		},
		{
			question: "小明最初接触毒品是因为跟他交往的人中有好几个都在吸毒，而且都显得很酷的样子，后来小明也跟着吸毒。这说明了吸毒行为产生的环境因素中的那个因素?()",
			answer: "C",
		},
		{
			question: "吸毒行为产生的环境因素有很多，而这里的环境指的是。()",
			answer: "D",
		},
		{
			question: "某村寨，家家都有吸毒者。这反应的是吸毒行为产生之环境因素中的。()",
			answer: "A",
		},
		{
			question: "长期吸毒会使吸毒者沉溺于虚幻的自我体验中而不能自拔，使其丧失对生活的热爱、丧失对人际交往的兴趣，而这反映毒品对青少年的危害。()",
			answer: "B",
		},
		{
			question: "在对众多吸毒者进行调查时发现，占据第一位的吸毒原因是。()",
			answer: "D",
		},
		{
			question: "下列哪个选项属于鸦片成瘾症状表现?()",
			answer: "B",
		},
		{
			question: '为了使"拒绝毒品"的理念传播到千家万户，下列哪种方式是可以采用的?()',
			answer: "A",
		},
		{
			question: "李某为了吸引顾客，在火锅里加入罂粟壳的行为是()",
			answer: "A",
		},
		{
			question: '吸这玩意儿有个性、"吸毒是身份的象征，是时髦"、"有钱，才有本事吸这个",以上三句话反映的是吸毒者吸食毒品原因中的。()',
			answer: "B",
		},
		{
			question: "青少年阶段正体验着人际冲突、情感困扰、升学压力或就业挫折等人生最激烈情绪变化，很多人就会试图在毒品中寻找慰籍、忘却烦恼。以上描述反映的是以下吸毒原因中的。()",
			answer: "B",
		},
		{
			question: "以下属于青少年所面临的毒品陷阱是。()",
			answer: "D",
		},
		{
			question: "毒贩子编造各种谎言骗青少年吸毒甚至是贩毒，毒贩子常用的谎言陷阱有。()",
			answer: "D",
		},
		{
			question: "要成为禁毒志愿者，首先应向团组织、禁毒志愿组织提交申请书。()",
			answer: "B",
		},
		{
			question: "鸦片是一种传统的。()",
			answer: "B",
		},
		{
			question: '麦角酰二乙胺(LSD)俗称"摇脚丸",是()药物的代表。',
			answer: "B",
		},
		{
			question: "海洛因的外观为白色块状或粉末，属于()毒品。",
			answer: "A",
		},
		{
			question: "常见的传统毒品有海洛因、鸦片、大麻、可卡因。()",
			answer: "C",
		},
		{
			question: "下列选项中属于中枢抑制剂类毒品的是。()",
			answer: "C",
		},
		{
			question: "学生李某在迪厅玩耍，在朋友的劝说下服用了摇头丸，之后无法控制自己的行为，摇头不止，整夜狂舞，直到呼吸困难，全身抽搐，最后导致死亡。这故事说明了什么?()",
			answer: "C",
		},
		{
			question: "现代戒毒治疗的完整过程它包括三个连续和不可分割的阶段，即生理脱毒、心理康复治疗和()。",
			answer: "B",
		},
		{
			question: "若是根据()需要，生产、经营、使用、储存、运输麻醉药品和精神药品则就是合法的。",
			answer: "A",
		},
		{
			question: "下列那个选项属于禁毒志愿者义务?()",
			answer: "B",
		},
		{
			question: "以下哪种行为有可能会导致艾滋病的感染()",
			answer: "D",
		},
		{
			question: "要构筑拒毒心理防线，我们需要做到。()",
			answer: "D",
		},
		{
			question: "以下属于生活技能教育主要内容的是。()",
			answer: "D",
		},
		{
			question: "我们除了要知道什么是毒品、知道毒品极易成瘾、知道毒品的危害，还要。()",
			answer: "C",
		},
		{
			question: "加速和增强中枢神经系统活动，使人处于强烈亢奋具有成瘾性的精神药品是()。",
			answer: "D",
		},
		{
			question: "以下属于毒品对青少年心理健康造成损害的是。()",
			answer: "C",
		},
		{
			question: "摇头丸，外观多呈片剂，其具有兴奋及致幻的双重作用。以下不属于摇头丸兴奋作用表现的是。()",
			answer: "C",
		},
		{
			question: "社区戒毒的决定主体是。()",
			answer: "B",
		},
		{
			question: "作为一名中学生我们应该怎样来参与禁毒活动?()",
			answer: "D",
		},
		{
			question: "我国现行的禁毒方针是()。",
			answer: "D",
		},
		{
			question: "《中华人民共和国刑法》规定，走私、贩卖、运输、制造鸦片一千克以上、海洛因或者甲基苯丙胺()克以上或者其他毒品数量大的，处十五年有期徒刑、无期徒刑或者死刑，并处没收财产。",
			answer: "C",
		},
		{
			question: "教唆、引诱、欺骗他人吸食、注射毒品的。处()。",
			answer: "C",
		},
		{
			question: "容留他人吸食、注射毒品或者介绍买卖毒品，构成犯罪的，依法追究刑事责任；尚不构成犯罪的，由公安机关处()以上十五日以下拘留，可以并处罚款。",
			answer: "C",
		},
		{
			question: "《中华人民共和国禁毒法》规定：禁毒是。()",
			answer: "C",
		},
		{
			question: "《禁毒法》规定，强制隔离戒毒的期限为(),最长可以延长()。",
			answer: "B",
		},
		{
			question: "国家对麻醉药品药用原植物种植实行管制。禁止非法种植()以及国家规定管制的可以用于提炼加工毒品的其他原植物。",
			answer: "D",
		},
		{
			question: "非法种植罂粟或其他毒品原植物，在收获前自动铲除的。()",
			answer: "B",
		},
		{
			question: "以下哪种行为可以免予处罚。()",
			answer: "C",
		},
		{
			question: "鼓励、支持()参与禁毒宣传教育和戒毒社会服务。",
			answer: "D",
		},
		{
			question: "在我国目前现有的几种戒毒模式中，具有限制人身自由的行政强制措施的是。()",
			answer: "C",
		},
		{
			question: "根据我国《禁毒法》之有关规定，以下属于我国目前禁毒模式的是。()",
			answer: "D",
		},
		{
			question: "县级以上各级人民政府应当将禁毒工作纳入()规划，并将禁毒经费列入本级财政预算。",
			answer: "A",
		},
		{
			question: "()曾经说过：鸦片为中国之巨害，其杀吾国民，甚于干戈、瘟疫、饥谨之患!",
			answer: "A",
		},
		{
			question: "1909年2月1日，中、美、法、德、日、荷、巴、俄等13个国家的41名代表，在上海召开了(),这是世界近代史上第一次禁毒大会。",
			answer: "A",
		},
		{
			question: "虎门硝烟是由()主持的",
			answer: "B",
		},
		{
			question: "鸦片之害甚于洪水猛兽，此祸不除，10年后中原无可御敌之兵，且无可以充饷之粮这句话是()说的。",
			answer: "B",
		},
		{
			question: "吸毒一旦成瘾就很难戒断，因此最好的办法就是。()",
			answer: "A",
		},
		{
			question: "学生吸毒，会有什么症状?()",
			answer: "D",
		},
		{
			question: "下列说法正确的是：()",
			answer: "A",
		},
		{
			question: "严格遵守中学生日常行为规范，有助于远离毒品。以下行为正确的是：()",
			answer: "D",
		},
		{
			question: "从医学角度看，吸毒成瘾作为一种疾病。以下哪个表述是正确的()。",
			answer: "D",
		},
		{
			question: "十年戒毒、一口还原是对()的描述。",
			answer: "B",
		},
		{
			question: "毒品的危害可用哪十二个字来形容()?",
			answer: "B",
		},
		{
			question: "你的同学或者好朋友把你介绍给他的朋友们，这些人私密的聚在某人家里或者类似娱乐场所的地方，使用一些粉末、片剂或者类似香烟的东西。还请你品尝，你恰当的拒绝方式应该是：()",
			answer: "D",
		},
		{
			question: "构筑拒毒心理防线一定要从以下方面着手：()。",
			answer: "D",
		},
		{
			question: "毒品的依赖分为()和精神依赖性两个方面。",
			answer: "A",
		},
		{
			question: '有这么一句话"一日吸毒，十年戒毒，终生想毒"用以表明毒品的()。',
			answer: "C",
		},
		{
			question: "在迪厅、酒吧、KTV等娱乐场所，如果你看到了一种红色药丸(或药片)状的东西，那你可能就是看到了(),千万小心不要沾染。",
			answer: "C",
		},
		{
			question: "毒品是使用后能够产生()的物质。",
			answer: "B",
		},
		{
			question: "毒品犯罪的特征是。()",
			answer: "D",
		},
		{
			question: "吗啡是鸦片中最主要的生物碱，从鸦片提取而成。纯净的吗啡为()或白色的粉末或结晶。",
			answer: "A",
		},
		{
			question: "以下属于吸毒者吸食毒品原因的是。()",
			answer: "D",
		},
		{
			question: "吸食方式中危害最大的是。()",
			answer: "D",
		},
		{
			question: '被著名心理学家弗洛伊德称为"富有魔力的物质"是。()',
			answer: "B",
		},
		{
			question: '合成毒品"麻古"是泰语的音译，实际是缅甸产的()。',
			answer: "B",
		},
		{
			question: "摇头丸是()衍生物",
			answer: "C",
		},
		{
			question: "以下()不属于天然类毒品。",
			answer: "D",
		},
		{
			question: "()不是毒品的原料和半成品。",
			answer: "D",
		},
		{
			question: "在毒品分类中，杜冷丁属于。()",
			answer: "A",
		},
		{
			question: "以下不是合成毒品是。()",
			answer: "B",
		},
		{
			question: "吸毒成瘾一般具有的特征。()",
			answer: "D",
		},
		{
			question: "毒品区别于毒物的自然特征是()",
			answer: "A",
		},
		{
			question: "新精神活性物质是()",
			answer: "C",
		},
		{
			question: "吸毒如果仅仅偶尔吸一两次，一般都不会上瘾。这种说法()",
			answer: "C",
		},
		{
			question: "毒品最早来源于一些()",
			answer: "A",
		},
		{
			question: "冰毒属于。()",
			answer: "C",
		},
		{
			question: "甲基苯丙胺的吸食成瘾者容易造成。()",
			answer: "A",
		},
		{
			question: "对鸦片颜色描述正确的是()。",
			answer: "A",
		},
		{
			question: "止咳水通常含有可待因、麻黄碱等成分，()服用可形成心理依赖，戒断症状类似海洛因毒品。",
			answer: "B",
		},
		{
			question: "以下行为属于青少年容易出现的毒品违法犯罪行为是。()",
			answer: "D",
		},
		{
			question: '禁毒志愿者的行动宗旨是："友爱、互助、进步。"()',
			answer: "A",
		},
		{
			question: "在容易接触的毒品中，有一种属于荨麻目大麻科草本植物，其主要化学成分为四氢大麻酚(THC),它是()。",
			answer: "B",
		},
		{
			question: '少女小彭结识了无业人员张某等3人，在游玩时小彭喝下张某等人给她的"饮料"后昏睡不醒，结果被张某等人轮奸，并抢走手机等。根据描述，张某等人可能在饮料里放入了什么?()',
			answer: "C",
		},
		{
			question: "它是目前国际危害最大的毒品之一，其纯品为白色结晶体，晶莹剔透，由于对人体中枢神经系统具有极强刺激作用，且毒性剧烈，它是()。",
			answer: "C",
		},
		{
			question: "对合成毒品依照其毒理学性质进行分类，其中有一类毒品既有兴奋作用又有致幻作用，以下是这类毒品代表的是。()",
			answer: "D",
		},
		{
			question: '我国在地里上毗邻毒品两大主要产地"金三角"和()',
			answer: "C",
		},
		{
			question: "以下属于毒品泛滥的高危场所的是。()",
			answer: "A",
		},
		{
			question: "以下哪个部门应当加强对强制隔离戒毒场所执业医师的业务指导和监督管理?()",
			answer: "D",
		},
		{
			question: "银三角地区盛产()。",
			answer: "A",
		},
		{
			question: "()无色无味，可以伴随着酒精共同服用，也可溶于水及饮料中。",
			answer: "A",
		},
		{
			question: "你觉得以下哪项不是保持身体健康的必要项?()",
			answer: "D",
		},
		{
			question: "海洛因外观为()块状或粉末。",
			answer: "C",
		},
		{
			question: "吸食、注射毒品严重破坏人体的生理机能和免疫机能，引起各种并发症，过量吸食毒品最终会导致()。",
			answer: "C",
		},
		{
			question: "()的精神依赖性极强，已经成为目前国际上危害最大的毒品之一。",
			answer: "A",
		},
		{
			question: "根据我们的生活常识，以下不属于我们所认知的传统毒品的是?()",
			answer: "A",
		},
		{
			question: "15岁的小陈跟着朋友到酒吧去玩，在朋友的示范下跟着吸食了某种毒品。之后小陈经常吸食。一段时间后小陈的思维反应迟钝、逻辑混乱、记忆力下降、有时发出咯咯咯的傻笑，学习成绩急剧下降。根据描述，小陈吸食的毒品最有可能是什么?()",
			answer: "B",
		},
		{
			question: "当朋友递给你毒品时，你应该怎么做?()",
			answer: "B",
		},
		{
			question: '世界上有三个最主要的毒源地，即"金三角"、"银三角"和()。',
			answer: "A",
		},
		{
			question: "心理康复阶段主要解决的问题是什么?()",
			answer: "B",
		},
		{
			question: "以下合成类毒品中属于中枢抑制剂的是。()",
			answer: "C",
		},
		{
			question: "滥用海洛因那种情形最容易经血液感染艾滋病?()",
			answer: "C",
		},
		{
			question: "海洛因俗称四号、白粉，属鸦片类毒品，其滥用方式有。()",
			answer: "D",
		},
		{
			question: "银三角是指拉丁美洲毒品产量集中的()等国家和巴西所在的安第斯山和亚马逊地区，该地区主要出产的毒品原植物是古柯和大麻。",
			answer: "D",
		},
		{
			question: '毒源地之一的"金三角"地区毗邻我国，位于()三国交界处。',
			answer: "A",
		},
		{
			question: '毒源地之一的"金新月"地区位于()三国交界地带。',
			answer: "C",
		},
		{
			question: "中学生应该怎样做才能远离毒品、拒绝毒品?()",
			answer: "D",
		},
		{
			question: "中学生通过学习是参与禁毒的方法与手段，具体的学习方法有。()",
			answer: "D",
		},
		{
			question: "一名男子吸食某种毒品后，一开始非常兴奋，过了一会儿产生幻觉，怀疑有人要追杀他，为了躲避追杀，从六楼的落水管道往下爬，不幸坠楼身亡。根据描述行为的特征，这名男子吸食的毒品最有可能是什么?()",
			answer: "A",
		},
		{
			question: '()最大的特点是使用一两次便会上瘾，毫无办法解脱，因此，它被称为"毒品之王"。它能大量耗尽人的体力和免疫功能，长期服用会导致幻听、幻视，精神失常，损害心脏、肾和肝，严重者甚至死亡。',
			answer: "C",
		},
		{
			question: '下列不属于世界"三大毒源"的是。()',
			answer: "C",
		},
		{
			question: "下列有关世界三大毒源地叙述正确的是。()",
			answer: "B",
		},
		{
			question: '在中国，大约一直到()开始使用"毒品"一词，到第二次世界大战前后才逐渐流行起来。',
			answer: "D",
		},
		{
			question: "()帝国主义用鸦片打开了中国的大门，鸦片的毒害严重消弱了中国的社会生产力和中国军队的战斗力。",
			answer: "A",
		},
		{
			question: "强制隔离戒毒的期限为。()",
			answer: "B",
		},
		{
			question: "社区戒毒的期限为。()",
			answer: "C",
		},
		{
			question: "强制隔离戒毒和社区戒毒的时间分别是多久?()",
			answer: "C",
		},
		{
			question: "氯胺酮自20世纪90年代后期首先在西方社会被使用，后来在全球范围被广为滥用，被我国列为一类精神药品进行管制。()",
			answer: "D",
		},
		{
			question: "在中国海洛因滥用者占吸毒者总数的()",
			answer: "A",
		},
		{
			question: "我国列管的麻醉药品一共有多少种?()",
			answer: "D",
		},
		{
			question: '()又称为"液体迷魂药",主要是青少年和青年人在夜总会、狂欢舞会上使用，以获得轻松愉悦的感觉。小剂量可引起镇静、欣快效应。',
			answer: "B",
		},
		{
			question: "大麻类毒品主要的活性成分是。()",
			answer: "A",
		},
		{
			question: "全球头号鸦片生产基地是在哪里?()",
			answer: "A",
		},
		{
			question: "从毒品对人的中枢神经的作用看，可分为抑制剂、致幻剂和兴奋剂等，其中属于抑制剂的毒品种类是。()",
			answer: "A",
		},
		{
			question: '毒源地之一的"金新月"地区，位于三国交界处。()',
			answer: "A",
		},
		{
			question: "海洛因俗称。()",
			answer: "A",
		},
		{
			question: "从生理脱瘾到彻底戒断毒瘾一般需要(),甚至是更长的时间。",
			answer: "C",
		},
		{
			question: "如果身边有朋友同学亲人吸毒，不正确的做法是。()",
			answer: "B",
		},
		{
			question: "抑制剂能抑制中枢神经系统，具有镇静和放松作用。如。()",
			answer: "B",
		},
		{
			question: "经鸦片提炼出吗啡，吗啡经与醋酸酐反应制得。()",
			answer: "B",
		},
		{
			question: "下列选项中符合全球毒品消费趋势的是。()",
			answer: "B",
		},
		{
			question: "染上毒瘾的人会出现一些与吸毒行为相关的迹象。以下哪一个不属于吸毒成瘾人员会出现的迹象：()。",
			answer: "D",
		},
		{
			question: "对人体主要以麻醉、抑制等作用为主，破坏人体免疫系统的是。()",
			answer: "A",
		},
		{
			question: "()在我国主要从上世纪90年代开始在歌舞娱乐场所中流行。",
			answer: "B",
		},
		{
			question: "新精神活性物质又称为()",
			answer: "C",
		},
		{
			question: "从毒品的自然属性看，毒品可以分为。()",
			answer: "B",
		},
		{
			question: "合成毒品是完全用有机合成的方法制造出来的毒品，如。()",
			answer: "C",
		},
		{
			question: "可以用于提炼加工毒品的原植物不包括以下哪项?()",
			answer: "D",
		},
		{
			question: "下列选项中对全球毒品消费趋势表述不正确的是。()",
			answer: "B",
		},
		{
			question: "苟利国家生死以，岂因祸福避趋之是我国著名历史人物()写的诗句，充分体现了他的爱国主义情怀。",
			answer: "B",
		},
		{
			question: "青少年吸毒的表现是。()",
			answer: "D",
		},
		{
			question: "新精神活性物质是()",
			answer: "A",
		},
		{
			question: "为了从源头上遏制毒品，我国2005年11月1日(),实施了从生产、销售和运输等各个环节加强对易制毒化学品的管控。",
			answer: "A",
		},
		{
			question: "《中华人民共和国禁毒法》已由中华人民共和国第十届全国人民代表大会常务委员会第三十一次会议于2007年12月29日通过，并自2008年()起施行。",
			answer: "B",
		},
		{
			question: "《禁毒法》规定的禁毒工作机制是：()",
			answer: "B",
		},
		{
			question: "我国《刑法》()规定了毒品的定义?",
			answer: "A",
		},
		{
			question: "()是一种冰毒片剂，具有很强的成瘾性。吸食此药可以使吸食者将自己的秘密和隐私通过交谈等方式随意告诉他人。",
			answer: "B",
		},
		{
			question: "以下哪类是新精神活性物质()",
			answer: "B",
		},
		{
			question: "由吗啡和醋酸酐的反应而制成，医学上曾广泛用于麻醉镇痛，也就是人们所说的“白粉”()。",
			answer: "C",
		},
		{
			question: "三唑仑又名海乐神、酣乐欣，()片剂，是一种强烈的麻醉药品。",
			answer: "A",
		},
		{
			question: "大麻的滥用者在中国主要集中在。()",
			answer: "C",
		},
		{
			question: "下列选项中对我国毒品消费形势表述正确的是。()",
			answer: "B",
		},
		{
			question: "吸毒成瘾的三个基本过程包括：耐药作用的形成，(),强化的形成。",
			answer: "B",
		},
		{
			question: "社区戒毒的期限为(),强制隔离戒毒的期限为()。",
			answer: "C",
		},
		{
			question: "长期吸食()会破坏人体的免疫功能，并导致心、肝、肾等主要器官的损害。",
			answer: "A",
		},
		{
			question: "在有些国家和地区，毒品犯罪集团或者是直接参与政治活动，影响政府决策。甚至有的犯罪集团还建立国中之国，占据了国家大片土地与政府分庭抗礼。这说明了毒品的什么危害?()",
			answer: "D",
		},
		{
			question: "世界上最大的可卡因产地是哪里?()",
			answer: "A",
		},
		{
			question: "世界上最大的亚麻产地在哪里?()",
			answer: "A",
		},
		{
			question: "禁毒是全社会的。()",
			answer: "A",
		},
		{
			question: "()又叫阿片，俗称大烟，源于罂粟植物萌果，其所含主要生物碱是吗啡。呈黑色或褐色；有氨味或陈旧尿味，味苦，气味强烈。",
			answer: "B",
		},
		{
			question: "大学生吸毒成瘾的内在原因有()",
			answer: "D",
		},
		{
			question: "以下说法正确的是()①有人在娱乐场所“嗨”气球，里面填充的是俗称为“笑气”的一氧化二氮，是具有一定麻醉作用的气体，一次性大量吸入可致窒息。长期吸食可能引起高血压、晕厥，甚至心脏病发作，还可引起贫血及中枢神经系统损害等 ②许多新精神活性物质的毒理作用比鸦片、吗啡更强 ③甲卡西酮能使人产生幻觉等精神症状，近年来常有滥用者伤人或自伤的案例 ④吸毒成瘾只是身体上会对毒品产生依赖，在心理上不会对毒品产生依赖",
			answer: "A",
		},
		{
			question: "跟踪检测是对吸食者的督促措施，需要进行定期尿检，由()督促其接受检测。",
			answer: "B",
		},
		{
			question: "()是预防毒品的三道防线。",
			answer: "A",
		},
		{
			question: "常见的传统毒品有鸦片、吗啡、()、大麻、古柯和可卡因等。",
			answer: "C",
		},
		{
			question: "下列关于戒毒说法正确的是()。",
			answer: "C",
		},
		{
			question: "我国云南、新疆等地紧邻哪两大毒品产地?()",
			answer: "A",
		},
		{
			question: "下列哪项不是社区戒毒工作小组对社区戒毒人员实施的管理、帮助措施?()",
			answer: "B",
		},
		{
			question: "大学生参与禁毒志愿者活动的途径有()",
			answer: "D",
		},
		{
			question: "服用K粉(氯胺酮)后，服用者不会出现的状况。()",
			answer: "A",
		},
		{
			question: "在植物古柯树叶中提取的一种生物碱是一种中枢神经系统的兴奋剂，叫做()。",
			answer: "A",
		},
		{
			question: "19世纪的很多战争中，()作为止痛药解除很多伤病员的剧痛。",
			answer: "D",
		},
		{
			question: "银三角是指拉丁美洲毒品产量集中的()等国家和巴西所在的安第斯山和亚马逊地区，该地区主要出产的毒品原植物是古柯和大麻。",
			answer: "D",
		},
		{
			question: "毒驾引发的恶性交通事故不断增多，我国对查出毒后驾驶的驾驶者一律()",
			answer: "C",
		},
		{
			question: "我国对娱乐场所涉嫌毒品违法行为时，处罚的形式有警告，罚款和()。",
			answer: "B",
		},
		{
			question: "《禁毒法》规定，国务院设立(),负责组织、协调、指导全国的禁毒工作。",
			answer: "D",
		},
		{
			question: "强制隔离戒毒场所应当根据戒毒人员的性别、年龄、患病等情况，对戒毒人员实行()",
			answer: "D",
		},
		{
			question: "对自愿接受戒毒治疗的吸毒人员，公安机关对其原吸毒行为可。()",
			answer: "B",
		},
		{
			question: "李某在自己土地里种植罂粟，但在收获前意识到可能会涉嫌违法，并将所有罂粟铲除，对于李某可以。()",
			answer: "C",
		},
		{
			question: "《禁毒法》规定，娱乐场所应当建立()制度，发现娱乐场所内有毒品违法犯罪活动的，应当立即向公安机关报告。",
			answer: "C",
		},
		{
			question: '《全民禁毒教育实施意见》规定，各级各类学校要根据学生的不同特点分阶段，切实做到计划、教学材料、课时、师资"四到位"。使广大在校学生从小树立"珍爱生命，拒绝毒品"意识，努力实现"学生不吸毒，校园无毒品"的目标。()',
			answer: "B",
		},
		{
			question: "《禁毒法》规定，以下选项属于国家采取的禁毒形式的是。()",
			answer: "D",
		},
		{
			question: "()是从古柯叶中分离出来的一种最主要的生物碱，属中枢神经兴奋剂，呈白色晶体状，无气味，味略苦而麻，兴奋作用强。",
			answer: "B",
		},
		{
			question: '()又称"狂欢丸"、"狂喜丸"等，指的是致幻型苯丙胺类兴奋剂的统称。服用后，摇头不止、行为失控，极易诱发精神分裂症，引发对自身的伤害。',
			answer: "B",
		},
		{
			question: "以下哪类是新精神活性物质()",
			answer: "B",
		},
		{
			question: "大麻是一种。()",
			answer: "B",
		},
		{
			question: "半合成毒品是由()与化学物质合成而得。",
			answer: "C",
		},
		{
			question: '()即甲基苯丙胺，外观为纯白结晶体，晶莹剔透，故被吸毒、贩毒者称为"冰"(Ice)。',
			answer: "B",
		},
		{
			question: "()是被滥用最早的毒品，历史悠久，地域广泛，滥用者众多。",
			answer: "B",
		},
		{
			question: "下列选项中属于合成毒品的是。()",
			answer: "C",
		},
	],


	// 初中组知识竞赛
	MiddleSchoolCompetition: [
		{
			"question": "根据《中华人民共和国禁毒法》，毒品是指鸦片、海洛因、甲基苯丙胺（冰毒）、吗啡、大麻、可卡因，以及国家规定管制的其他能够使人形成瘾癖的()。",
			"answer": "C"
		},
		{
			"question": "《中华人民共和国禁毒法》第四条规定：禁毒工作实行()为主，综合治理，禁种、禁制、禁贩、禁吸并举的方针。",
			"answer": "A"
		},
		{
			"question": "《中华人民共和国禁毒法》规定，教育行政部门、()应当将禁毒知识纳入教育、教学内容，对学生进行禁毒宣传教育。公安机关、司法行政部门和卫生行政部门应当予以协助。",
			"answer": "A"
		},
		{
			"question": "《中华人民共和国刑法》规定，走私、贩卖、运输、制造鸦片一千克以上、海洛因或者甲基苯丙胺()克以上或者其他毒品数量大的，处十五年有期徒刑、无期徒刑或者死刑，并处没收财产。",
			"answer": "C"
		},
		{
			"question": "按照《中华人民共和国刑法》对刑事责任年龄的规定，已满14周岁不满16周岁的人犯贩卖毒品罪的，应当()。",
			"answer": "A"
		},
		{
			"question": "以下哪个法令中第一次明确了保护青少年不受毒品危害的规定。()",
			"answer": "C"
		},
		{
			"question": "根据我国《机动车驾驶证申领和使用规定》，吸食、注射毒品、长期服用依赖性精神药品成瘾尚未戒除的，可申请机动车驾驶证，但须定期接受检测。这种说法()。",
			"answer": "B"
		},
		{
			"question": "国家鼓励公民、组织开展公益性的禁毒宣传活动。()",
			"answer": "A"
		},
		{
			"question": "县级以上各级人民政府()将禁毒工作纳入国民经济和社会发展规划，并将禁毒经费列入本级财政预算。",
			"answer": "B"
		},
		{
			"question": "根据()需要，依法可以生产、经营、使用、储存、运输麻醉药品和精神药品。",
			"answer": "A"
		},
		{
			"question": "毒品预防教育的重点对象是()。",
			"answer": "A"
		},
		{
			"question": "我国禁毒工作的治本之策是()。",
			"answer": "A"
		},
		{
			"question": "下面表述正确的是()。",
			"answer": "D"
		},
		{
			"question": "学校毒品预防教育的目标是校园无毒品，学生不吸毒。这种说法",
			"answer": "A"
		},
		{
			"question": "未成年人的父母或者其他监护人()对未成年人进行毒品危害的教育，防止其吸食、注射毒品或者进行其他毒品违法犯罪活动。",
			"answer": "B"
		},
		{
			"question": "我国的“毒品”一词有着深远的历史渊源，是中华民族百年来与毒品不懈抗争中的创造成果。我国首次对 “毒品”一词作出清晰定义的法律文本是：",
			"answer": "A"
		},
		{
			"question": "()要依法加强涉毒演艺人员参加演出管理，推进娱乐服务场所毒品预防工作，支持创作优秀禁毒文化作品。",
			"answer": "B"
		},
		{
			"question": "吸食毒品是违法行为，但持有毒品达到一定数量将构成非法持有毒品罪。这种说法()。",
			"answer": "A"
		},
		{
			"question": "对下列涉毒人员，可以不予处罚的是()。",
			"answer": "B"
		},
		{
			"question": "朋友们多次聚集在小李家里吸毒，虽然小李知道吸毒是违法行为，但小李本人没有吸毒，所以小李不需要承担任何法律责任。这种说法()。",
			"answer": "B"
		},
		{
			"question": "1987年12月，第42届联合国大会决议，正式将每年()定为“国际禁毒日”。2023年6月26日是第()个国际禁毒日。",
			"answer": "C"
		},
		{
			"question": "世界卫生组织将每年()定为“世界艾滋病日”。 吸毒人员的毒品滥用方式多样，有更大的艾滋病传播风险。",
			"answer": "D"
		},
		{
			"question": "“金三角”是指泰国、缅甸、()三国交界的区域。",
			"answer": "A"
		},
		{
			"question": "“金新月”国际毒源地是指以下哪几个国家的交界地带？",
			"answer": "B"
		},
		{
			"question": "南美的()、秘鲁、玻利维亚是可卡因的最大生产基地，俗称“银三角”。",
			"answer": "C"
		},
		{
			"question": "目前，()地区是对我国危害最大的毒品来源地。",
			"answer": "A"
		},
		{
			"question": "180多年前，民族英雄林则徐发起了震惊中外的虎门销烟，开启了中国近代史上轰轰烈烈的禁烟运动，发出了中国人民对毒品的怒吼，展示了中华民族反对帝国主义侵略的决心、勇气和意志。“虎门销烟”是哪一天开始的()。",
			"answer": "A"
		},
		{
			"question": "1909年2月1日，中、日、英、法、俄、德、美、葡等国召开禁毒会议，拉开了国际性禁毒活动的序幕，这次会议的举办地是()。",
			"answer": "A"
		},
		{
			"question": "医学上，习惯称吸毒为药物滥用，也就是出于非医疗的目的，通过注射、口服、鼻吸或其他方式将毒品摄入人体的行为。吸毒成瘾是一种()。",
			"answer": "D"
		},
		{
			"question": "二十世纪()，中国获得“无毒国”美誉近三十年。",
			"answer": "B"
		},
		{
			"question": "1982年，云南()成立第一支专业缉毒队伍，掀开了我国禁毒事业的新篇章。",
			"answer": "A"
		},
		{
			"question": "第一届全国青少年禁毒知识竞赛于()年举办。",
			"answer": "B"
		},
		{
			"question": "毒品问题不是一个国家、一个民族的问题，而是全人类所面临的挑战。各国应当紧密团结在一起，携手应对毒品问题。目前，我国已加入的三大禁毒国际公约是：",
			"answer": "D"
		},
		{
			"question": "世界上第一个国际禁毒公约是()。",
			"answer": "B"
		},
		{
			"question": "第一次将毒品犯罪规定为国际犯罪的公约是()。",
			"answer": "D"
		},
		{
			"question": "毒品区别于其他毒物的自然属性是()。",
			"answer": "B"
		},
		{
			"question": "毒品是使用后能够产生依赖性的物质。这种说法()。",
			"answer": "A"
		},
		{
			"question": "毒品与药品，往往具有双重属性，具有医疗价值、从合法渠道获得并为人解除病痛的就是药品。这种说法()",
			"answer": "A"
		},
		{
			"question": "所有药品均可以随意购买和服用，不需要遵医嘱。这种说法()。",
			"answer": "B"
		},
		{
			"question": "下列选项中属于毒品的是()。",
			"answer": "D"
		},
		{
			"question": "截至2023年10月，我国列管麻精药品有()种、整类列管的物质有()类，是世界上列管毒品最多、管制最严的国家之一。",
			"answer": "D"
		},
		{
			"question": "列入下列哪个目录的物质，如果被滥用就是吸毒()",
			"answer": "D"
		},
		{
			"question": "传统毒品一般是指鸦片、海洛因、大麻等流行较早的毒品。这种说法()。",
			"answer": "A"
		},
		{
			"question": "鸦片，又叫阿片，俗称大烟，源于罂粟植物的()。鸦片最初是作为药用，主要用于镇咳、止泻等。吸食者初吸时会感到头晕目眩、恶心或头痛，多次吸食就会上瘾。",
			"answer": "B"
		},
		{
			"question": "海洛因的化学名称是()，呈白色粉末状，俗称“白粉”“白面”“四号”。 如采取静脉注射的方式吸食海洛因，1至2次就可能成瘾。",
			"answer": "C"
		},
		{
			"question": "()是鸦片中最主要的生物碱，其中毒症状、成瘾症状及戒断症状多与鸦片相似。",
			"answer": "A"
		},
		{
			"question": "下列关于大麻的说法，哪个是错误的？()",
			"answer": "D"
		},
		{
			"question": "可卡因的原植物是()，曾经是古代美洲原住民的提神草。",
			"answer": "D"
		},
		{
			"question": "甲基苯丙胺因其纯品无色透明，像冰一样，故俗称“冰毒”。 这种说法()",
			"answer": "A"
		},
		{
			"question": "合成毒品“麻古”是泰语的音译，其主要成分是()。",
			"answer": "A"
		},
		{
			"question": "20世纪末的奥林匹克竞技比赛中，为了赢得更好的比赛成绩，曾经一度被美国短跑、拳击等项目的运动员广泛滥用，并造成部分运动员最终患上急性心脏病或脑血管疾病引发猝死的物质是()。",
			"answer": "B"
		},
		{
			"question": "麦角二乙胺（LSD），俗称“邮票”“贴纸”，于1938年被首次合成，是一种强效()。",
			"answer": "C"
		},
		{
			"question": "丧尸药、浴盐、土冰，这些都是同一类毒品的俗称，它的真正名称是()。",
			"answer": "B"
		},
		{
			"question": "合成毒品直接作用于人的()，其危害比传统毒品更大。",
			"answer": "C"
		},
		{
			"question": "吸食以后情绪容易激昂冲动，成瘾后就算是停止复吸，很久以后还会出现幻听、幻觉、被害妄想等精神病稽延症状。这是()类毒品的精神病态特征。",
			"answer": "C"
		},
		{
			"question": "新精神活性物质（New Psychoactive Substances，简称NPS），是不法分子为逃避打击而对列管毒品进行化学结构修饰所得到的毒品类似物，具有与管制毒品相似或更强的兴奋、致幻、麻醉等效果。这种说法()。",
			"answer": "A"
		},
		{
			"question": "下列属于我国整类列管的非药用类麻醉药品和精神药品的有()。",
			"answer": "C"
		},
		{
			"question": "K粉（氯胺酮）呈白色结晶粉末状，易溶于水，不法分子经常将其勾兑进饮料和酒水中。这种说法()。",
			"answer": "A"
		},
		{
			"question": "芬太尼是一种具有强效镇痛作用的麻醉药品，但具有呼吸抑制、心动过缓和成瘾性的副作用，使用不当会导致昏迷甚至死亡。这种说法()。",
			"answer": "A"
		},
		{
			"question": "俗称为“小树枝”“上头电子烟油”“娜塔莎”等的物质，其成分往往含有我国列管的()物质。",
			"answer": "B"
		},
		{
			"question": "()是迷幻蘑菇中的主要成分，这种物质是一种血清素受体激动剂，食用后可使人激动、焦虑、意识模糊和精神障碍。",
			"answer": "A"
		},
		{
			"question": "()，又称“阿拉伯茶”“东非罂粟”等。原产于非洲及阿拉伯半岛，主要活性成分为卡西酮、去甲伪麻黄碱等，具有兴奋和轻微致幻作用。滥用会出现抑郁、烦躁等症状。",
			"answer": "A"
		},
		{
			"question": "杜冷丁是医院里常用的麻药，可用于止痛治疗。我们只要感觉疼痛，就可以随意使用，不需要医生指导。这种说法()",
			"answer": "A"
		},
		{
			"question": "止咳水是一种常见的中成药，我国已将其列入第二类精神药品管理，其通常含有可待因、麻黄碱等成分，大量服用会形成药物依赖，戒断症状类似海洛因。因此，止咳水不能随便乱用，需要严格遵照医嘱服用。这种说法()。",
			"answer": "A"
		},
		{
			"question": "氟硝安定属于抑制剂类药物，是一种镇静催眠药，与酒精或其他镇静催眠药合用后可导致中毒死亡。这种说法()。",
			"answer": "A"
		},
		{
			"question": "安定类药物有助于睡眠，可以随意服用，不需医生指导使用，也不会对身体造成什么危害。这种说法()。",
			"answer": "B"
		},
		{
			"question": "咖啡因是从茶叶、咖啡果中提炼出来的一种生物碱，是国家管制的精神药品，所以人们喝茶、喝咖啡的行为是吸毒。这种说法()。",
			"answer": "A"
		},
		{
			"question": "曲马多是一种中枢镇痛药品，长期或过量滥用会产生类似于海洛因的依赖症状，我国目前已将曲马多和曲马多复方制剂列入精神药品目录，滥用曲马多会被认定为吸毒。这种说法()",
			"answer": "A"
		},
		{
			"question": "被俗称为“上头电子烟”“烟粉”的依托咪酯是一种()处方药品，临床主要用于全身麻醉诱导。大剂量吸食会引起偏执、焦虑、恐慌、被害妄想症等，严重的会导致精神错乱甚至中风死亡。",
			"answer": "A"
		},
		{
			"question": "我国已将依托咪酯药物列入第二类精神药品管理，滥用含有依托咪酯的“烟粉”可认定为吸毒。这种说法()。",
			"answer": "A"
		},
		{
			"question": "所谓“聪明药”，多数是指()等精神药品，本用于治疗儿童多动症等疾病。正常人长期服用不仅不会变聪明，还会产生药物依赖，断药后会出现注意力涣散、精神萎靡、暴躁抓狂等精神症状，甚至出现幻觉、妄想等药物戒断反应。",
			"answer": "D"
		},
		{
			"question": "“笑气”是一种无色有甜味气体，具有轻微麻醉作用，能使人发笑。“笑气”不是毒品，但同样具有成瘾性。这种说法()。",
			"answer": "A"
		},
		{
			"question": "有人劝说小明一起“嗨气球”，并且告诉小明吸了之后会有“上头”的感觉。对于该案例，下列说法正确的是()。",
			"answer": "D"
		},
		{
			"question": "关于所谓的“特效减肥药”“网红减肥药”，下列说法正确的是",
			"answer": "D"
		},
		{
			"question": "γ-羟基丁酸，又称GHB，常被称为“液体迷魂药”“神仙水”，是一种无色无味的液体，对中枢神经系统有强烈的抑制作用，是我国规定管制的第一类精神药品。()",
			"answer": "A"
		},
		{
			"question": "小明发现，在美国留学期间结识的朋友经常在朋友圈出售一些号称化学合成的糖果、巧克力和“叶子”味的烟弹。这些东西很有可能含有毒品()。",
			"answer": "D"
		},
		{
			"question": "毒贩经常会把毒品伪装成“跳跳糖、奶茶、咖啡包”等，我们要保持警惕。这种说法()。",
			"answer": "A"
		},
		{
			"question": "关于未列管成瘾物质，下列说法正确的是()。",
			"answer": "C"
		},
		{
			"question": "吸毒如果仅仅偶尔吸一两次，一般都不会上瘾。这种说法()。",
			"answer": "B"
		},
		{
			"question": "吸食合成毒品危害比传统毒品要小，只吸几次也不会上瘾。这种说法()。",
			"answer": "B"
		},
		{
			"question": "吸毒会损害人的呼吸系统、消化系统、心血管系统、免疫系统和神经系统，感染各种疾病。吸毒人群的意外死亡率较一般人群高。这种说法()。",
			"answer": "A"
		},
		{
			"question": "吸毒者不健康的心理有盲目从众、好奇、爱慕虚荣、赶时髦、追求刺激和享乐、赌气或逆反、无知和轻信、自暴自弃等。这种说法()。",
			"answer": "A"
		},
		{
			"question": "吸食冰毒以后容易造成情绪冲动及过度兴奋，驾驶车辆极易引发严重交通事故。这种说法()。",
			"answer": "A"
		},
		{
			"question": ".研究表明，80%以上的苯丙胺滥用者即使停止滥用最长达8—12年 ，仍有一些精神病症状，乃至精神分裂，一遇刺激便会发作。这种说法()。",
			"answer": "A"
		},
		{
			"question": "人们常说“毒品猛于虎”，毒品祸害无穷，不仅严重损害吸毒者本人的身体健康，对吸毒者的家庭和整个社会秩序都造成了严重的打击，吸毒的危害包括：()",
			"answer": "D"
		},
		{
			"question": "青少年吸毒的主要原因是什么？()",
			"answer": "D"
		},
		{
			"question": "你的同学或者好朋友把你介绍给他的朋友们，这些人私密地聚在某人家里或者类似娱乐场所的地方，使用一些粉末、片剂，或者是来历不明的小零食、饮料等三无产品，或者是不明液体，说“不是毒品”“比较刺激”“不会上瘾”“特别好玩”，还请你品尝，你正确的做法是()。",
			"answer": "D"
		},
		{
			"question": "当发现有人可能正在吸毒或实施涉及毒品的违法犯罪行为时，应该()。",
			"answer": "A"
		},
		{
			"question": "当有人威胁我们吸毒时，要将情况主动告知家长和学校，或者打110报警，寻求帮助。这种说法()",
			"answer": "A"
		},
		{
			"question": "中学生应该怎样做才能远离毒品、拒绝毒品？()。",
			"answer": "D"
		},
		{
			"question": "作为中学生，不仅自己要学习禁毒知识、树立防毒意识，还要向父母和亲属介绍毒品常识，提醒他们千万不要尝试毒品。这种说法()。",
			"answer": "A"
		},
		{
			"question": "要拒绝毒品，我们除了要知道什么是毒品、知道毒品极易成瘾、知道毒品的危害，还要()。",
			"answer": "D"
		},
		{
			"question": "禁毒是全社会的共同责任。对于中学生而言，下列做法正确的是：",
			"answer": "B"
		},
		{
			"question": "小明随家人出国旅游，在国外的时候，有人邀请小明一起抽大麻烟，并且告诉小明在国外抽大麻是合法的。对于该案例，下列说法不正确的是()。",
			"answer": "D"
		},
		{
			"question": "小明随家人搭乘飞机外出旅游，进机场的时候，有陌生人请小明帮忙，让小明偷偷把一小包“小树枝”贴身隐藏带过安检，并承诺事后给小明一大笔钱。对于该案例，下列说法错误的是()。",
			"answer": "D"
		},
		{
			"question": "下列选项中属于吸毒成瘾表现的是()。",
			"answer": "D"
		},
		{
			"question": "下列关于戒毒说法正确的是()。",
			"answer": "C"
		},
		{
			"question": "戒毒人员在入学、就业、享受社会保障等方面不受歧视。有关部门、组织和人员应当对戒毒人员给予必要的指导和帮助。这种说法()。",
			"answer": "A"
		},
		{
			"question": "李某发现儿子小强吸毒后，便将其关在家中，并与家人轮流看守令其戒毒。起初，断了毒品的小强呼天喊地，半个月后，小强又恢复了正常。但实际上小强此时只是戒断生理毒瘾，并未全部戒除毒瘾。这种说法()。",
			"answer": "A"
		},
		{
			"question": "身体脱毒只是戒毒过程的第一步，最根本上的是要彻底摆脱()，才能达到彻底康复，最终真正回归社会。",
			"answer": "C"
		},
		{
			"question": "吸毒行为可以通过采集吸毒嫌疑人的血液、尿液、毛发等检测出来。这种说法()",
			"answer": "A"
		},
		{
			"question": "吸毒人员是违法者，也是病人。这种说法()",
			"answer": "A"
		},
		{
			"question": "以下选项中，不是艾滋病的传播途径的是()。",
			"answer": "D"
		},
		{
			"question": "易制毒化学品的生产、经营、购买、运输无须经过许可即可开展。这种说法()",
			"answer": "B"
		},
		{
			"question": "禁毒部门充分运用现代科技成果，可以通过()手段进行毒情监测预警。",
			"answer": "A"
		},
		{
			"question": "生活中，经常可以看到亲戚朋友吸烟，他们递烟给你，说偶尔体验一下没关系，你最好的应对方式应该是()。",
			"answer": "D"
		},
		{
			"question": "为防范利用寄递渠道贩毒问题，国家邮政局要求物流寄递企业严格落实“()、寄件验视、过机安检”三项制度。",
			"answer": "C"
		},
		{
			"question": "右美沙芬全称()，是具有镇咳效果的右旋性吗啡衍生物，具有和吗啡相似的特性，为中枢性镇咳药，大量服用会有致幻性。",
			"answer": "A"
		},
		{
			"question": "1839年6月，林则徐采用()把收缴来的一千多吨鸦片当众销毁。",
			"answer": "C"
		},
		{
			"question": "新中国第一部全面规范禁毒工作的法律《中华人民共和国禁毒法》于()颁布实施。",
			"answer": "A"
		},
		{
			"question": "康康在暑假到某国旅游，该国家推行大麻合法化政策。康康凭借一些英文辨别出了添加有大麻成分的食物，这些英文不包括()。",
			"answer": "D"
		},
		{
			"question": "进入冬季以后流感、呼吸道疾病高发。小明不慎“中招，便准备自行服药治疗。但是由于看错药物剂量，过量服用，导致吃药后头晕，出现幻觉、精神异常，毒品尿检呈阳性。小明这种情况很可能是所服用药物中含有()。",
			"answer": "A"
		},
		{
			"question": "长期吸食笑气对身体危害极大，笑气会阻碍人体对于维生素B12的吸收，从而导致人()。",
			"answer": "B"
		},
		{
			"question": "以下关于易制毒化学品的说法错误的是()。",
			"answer": "A"
		},	
		{
			"question": "莹莹听说有一种麻精药品在国内被严格管控，但是国外未经列管，所以托朋友从国外购买该种药品大量邮寄回国。莹莹收货后将此药品出售，累计获利五万元，莹莹的这种行为可能构成何种犯罪()。",
			"answer": "B"
		},
		{
			"question": "依据现行的法律，对下列涉毒人员，可以不予处罚的是()。",
			"answer": "B"
		},
		{
			"question": "依据《禁毒法》，国家对易制毒化学品的生产、经营、购买、运输实行()制度。",
			"answer": "A"
		},
		{
			"question": "下列属于毒品原植物的是()。",
			"answer": "A"
		},
		{
			"question": "戒毒是一个长期的过程，包括生理脱毒与医学治疗、()、善后辅导与回归社会三个阶段。",
			"answer": "B"
		},	
		{
			"question": "吸毒会导致身体哪些系统的损害？()",
			"answer": "D"
		},	
		{
			"question": "吸毒人员滥用“依托咪酯”，主要把“依托咪酯”添加在香烟的烟丝中，或者是添加在电子烟油中，以()的形式吸食。",
			"answer": "D"
		},
		{
			"question": "“摇头丸”的主要活性成分是什么，属于哪一类精神药物？()",
			"answer": "C"
		},
		{
			"question": "林则徐在广东虎门集中销毁鸦片的历史事件被称为“虎门销烟”，该历史事件发生在哪一年？()",
			"answer": "B"
		},
		{
			"question": "近年来，有不法分子将含有()成分的“烟粉”或“烟油”放进电子烟进行销售或吸食，并把它作为海洛因、冰毒、K粉等毒品替代品。因吸食后，像醉酒状态、头晕、走路摇晃、身体震颤等，并伴随着一些快感。所以，形象地称为“上头”电子烟。",
			"answer": "D"
		},	
		{
			"question": "以下关于右美沙芬说法错误的是()。",
			"answer": "D"
		},
		{
			"question": "下列说法错误的是()。",
			"answer": "B"
		},
		{
			"question": "“不用节食，不用运动”“躺着就能快速减肥”如今网上很多“网红减肥药”，打着“轻松减肥”的幌子吸引眼球。然而，这些所谓的“减肥药”，可能隐藏着“美丽陷阱”，大多含有()等国家管制的麻精药品或违禁药品成分。",
			"answer": "C"
		},
		{
			"question": "国家()公民举报毒品违法犯罪行为。",
			"answer": "C"
		},
		{
			"question": "非法种植罂粟达到()构成犯罪。",
			"answer": "A"
		},	
		{
			"question": "根据我国《机动车驾驶证申领和使用规定》，吸食、注射毒品、长期服用依赖性精神药品成瘾尚未戒除的，一律注销机动车驾驶证。这种说法()。",
			"answer": "A"
		},	
		{
			"question": "合成毒品直接作用于人的()，其危害比传统毒品更大。",
			"answer": "C"
		},
		{
			"question": "2024年国际禁毒日的宣传主题是“防范青少年药物滥用”。这种说法()。",
			"answer": "A"
		},
		{
			"question": "以下说法正确的是()。",
			"answer": "C"
		},
		{
			"question": "有一种物质被称为快乐递质，吸毒后人体会大量产生，从而使人体感受到强烈快感，吸毒行为打乱了人体正常分泌水平，一旦停止吸食毒品，副作用也呈现出来，请问这种物质是()。",
			"answer": "C"
		},	
		{
			"question": "《易制毒化学品管理条例规定》，第二类易制毒化学品大多是可以用于()。",
			"answer": "C"
		},
		{
			"question": "以下哪种情形可能存在毒品威胁？()",
			"answer": "D"
		},
		{
			"question": "为什么毒品预防教育的重点是青少年？()",
			"answer": "D"
		},
		{
			"question": "地芬诺酯是哌替啶（杜冷丁）的衍生物，该成分为人工合成的阿片受体激动剂，属于苯基哌啶衍生物，是一种临床应用的合成镇痛药，具有中枢神经系统抑制作用，具有解痉止痛作用，大剂量使用能给人带来欣快感，长期服用后可形成依赖。()",
			"answer": "A"
		},
		{
			"question": "小李通过医生开具的处方帮父母购买第二类精神药品，准备通过快递方式给父母寄过去，以下做法正确的是()。",
			"answer": "D"
		},	
		{
			"question": "以下关于毒品在人体内代谢过程的描述，错误的是()。",
			"answer": "B"
		},	
		{
			"question": "某地一家医院医生李某违反国家规定，向多名吸毒人员提供麻醉药品，应当予以刑事处罚，并处罚金。()",
			"answer": "A"
		},
		{
			"question": "以下哪个机构在我国负责组织和协调全国的禁毒工作？()",
			"answer": "B"
		},
		{
			"question": "向走私、贩卖毒品的犯罪分子或以牟利为目的向吸食、注射毒品的人非法提供国家规定管制的能够使人形成瘾癖的麻醉药品、精神药品的行为，以下说法正确的是()。",
			"answer": "B"
		},
		{
			"question": "毒品被不法分子掺入饮料中危险性很高，因此不要饮用()饮料。",
			"answer": "D"
		},	
		{
			"question": "近年来，随着毒品违法犯罪持续受到高压严打，海洛因、冰毒等常规主流毒品获取难度大，一些人开始寻求()等其它的替代滥用。",
			"answer": "D"
		},
		{
			"question": "近几年来，依托咪酯多被不法分子作为“烟粉”被添加到香烟或者电子烟中诱骗青少年和广大烟民进行吸食。自2023年10月1日起，“依托咪酯”已经正式列入第二类精神药品目录进行管制。自管制之日起，滥用“依托咪酯”就是吸食毒品。此说法()。",
			"answer": "A"
		},
		{
			"question": "止痛药是家家户户的常备药之一，但有些“止痛药”，如曲马多等，不能乱吃，要当心药物上瘾。在我国，曲马多和曲马多复方制剂都属于管制的药品。如过量使用可导致抑郁、成瘾和癫痫发作。这种说法()。",
			"answer": "A"
		},
		{
			"question": "只要意志坚定，就能戒断毒瘾，所以沾染毒瘾不可怕。()。",
			"answer": "B"
		},
		{
			"question": "某校一名大学生，20岁时因失眠医生给予艾司唑仑（国家规定管制的第二类精神药品）治疗1-2片/天。大学毕业后自觉失眠严重，自行加服15-20片/天，停药后突出现人事不省，手足抽搐，最后导呼吸停止死亡。此案例告诉我们，麻精药品必须由医生根据患者病情开具处方才能购买，麻精药品不是“解药”，绝不能擅自服用。此种说法()。",
			"answer": "A"
		},	
		{
			"question": "地西泮属国家管制的第二类精神药品，即常见的“安定”。1963年该药被批准上市以来，成为全世界处方用量最大的药物之一。可用于抗焦虑、镇定催眠、抗癫痫、抗惊厥、缓解肌肉痉挛等多种疾病治疗。但过量服用地西泮药片，药性发挥后将导致人长期昏睡，甚至死亡。这种说法()。",
			"answer": "A"
		},	
		{
			"question": "我国是全球第()个整类列管合成大麻素类新精神活性物质的国家。",
			"answer": "A"
		},
		{
			"question": "如何预防成瘾性物质滥用？广大青少年应该做到()。",
			"answer": "D"
		},
		{
			"question": "要避免药物成瘾，广大青少年应注意的事项有()。",
			"answer": "D"
		},
		{
			"question": "日常安全用药口诀有()。",
			"answer": "D"
		},	
		{
			"question": "预防青少年滥用药物，要通过()多方的共同努力，才能达到良好的效果。",
			"answer": "D"
		},
		{
			"question": "主要用于抑制干咳，包括上呼吸道感染、支气管炎等引起的咳嗽，一般治疗剂量不抑制呼吸，如果大剂量使用，会有成瘾性，常被滥用者称为“上头糖”“红魔”“维他命D”等，该物质是指()。",
			"answer": "A"
		},
		{
			"question": "下列关于“毒驾”说法错误的是()。",
			"answer": "D"
		},
		{
			"question": "新型毒品会被伪装成()。",
			"answer": "D"
		},
		{
			"question": "毒品对人的神经系统会产生()。",
			"answer": "D"
		},	
		{
			"question": "在网络上散布毒品制作方法属于违法行为。()。",
			"answer": "A"
		},	
		{
			"question": "小伙伴说有能让人“飞起来”的“彩虹糖”，这时你应该？()",
			"answer": "B"
		},
		{
			"question": "当在你身边出现毒品时，正确的做法是()。",
			"answer": "C"
		},
		{
			"question": "从外观看，化学合成毒品常以香料、花瓣、烟草及电子烟油等形态出现，具有极强的伪装性。()。",
			"answer": "A"
		},
		{
			"question": "精神药品是直接作用于中枢神经系统，使之兴奋或抑制，连续使用产生依赖性的药品。()。",
			"answer": "A"
		},	
		{
			"question": "学生小美，因为肥胖的缘故而常常对自己的身材相貌感到自卑，抱着试一试的心态，通过网络购物的方式购买了进口减肥药，长期使用后出现失眠、浑身无力、焦虑、暴躁等严重不良反应。请判断小美购买的减肥药里很有可能存在()成分。",
			"answer": "C"
		},
		{
			"question": "学生小明，通过某社交平台的“附近”的功能加入了一个同城群聊，发现有几位网友时不时的在群内讨论着“O多了”“昨天怒O20t”等内容，通过这些敏感词，接受过毒品预防教育的小明立即意识到这几位网友很可能是吸食()人员。",
			"answer": "D"
		},
		{
			"question": "戒毒人员在()等方面不受歧视。有关部门、组织和人员应当在这些方面对戒毒人员给予必要的指导和帮助。",
			"answer": "D"
		},
		{
			"question": "下列说法中错误的是()？",
			"answer": "C"
		},
		{
			"question": "毒品对青少年的危害特别大，这主要是因为青少年时期是()。",
			"answer": "A"
		},	
		{
			"question": "大麻二酚，是一种天然存在于大麻植物中的大麻素，不具有精神活性和成瘾性，但具有抗炎、抗氧化、镇痛、抗焦虑、保护神经等作用，但其也属于易制毒化学品。()",
			"answer": "A"
		},	
		{
			"question": "兽用麻醉药品和兽用精神药品纳入兽用处方药管理，仍可以进行网络销售和广告宣传。()。",
			"answer": "B"
		},
		{
			"question": "下列哪项不是评估麻醉药品和精神药品滥用风险的因素()。",
			"answer": "B"
		},
		{
			"question": "精神药品管理应遵循()原则。",
			"answer": "D"
		},
		{
			"question": "下列()项不是麻醉药品和精神药品的共同特征。",
			"answer": "C"
		},	
		{
			"question": "以下说法正确的是()",
			"answer": "A"
		},
		{
			"question": "为加强兽用麻醉药品和兽用精神药品管理，农业农村部、公安部于2024年7月5日联合发布公告，明确兽用麻醉药品和兽用精神药品应当在其标签和说明书右上角以()字体标注“兽用麻醉药品”或“兽用精神药品”，以及“兽用处方药”字样。",
			"answer": "A"
		},
		{
			"question": "含合成大麻素类新精神活性物质的电子烟，下列说法正确的是()。",
			"answer": "B"
		},
		{
			"question": "国家鼓励志愿人员参与禁毒宣传教育和戒毒社会服务工作。()应当对志愿人员进行指导、培训，并提供必要的工作条件。",
			"answer": "B"
		},
		{
			"question": "吗啡是鸦片中最主要的生物碱，从鸦片提取而成。纯净的吗啡为()或白色的粉末或结晶。",
			"answer": "A"
		},	
		{
			"question": "毒品和毒物的最大区别在于()。",
			"answer": "C"
		},	
		{
			"question": "关于药物滥用，哪个说法是正确的()。",
			"answer": "A"
		},
		{
			"question": "为加强麻黄草资源管理，制止滥挖麻黄草，合理规划利用麻黄草资源，严防麻黄草流入制毒渠道具有重要作用。下列关于麻黄草说法错误的是()。",
			"answer": "C"
		},
		{
			"question": "民警工作发现，辖区一男子与多名“瘾君子”往来，有贩毒嫌疑。经5小时蹲守，民警成功将赵某抓获，当场查获毒品安钠咖37块，共计1171.76克、制毒工具一套。下列关于安钠咖的说法不正确的是()。",
			"answer": "C"
		},
		{
			"question": "参与禁毒，人人有责。公民、法人和其他组织均可举报毒品违法犯罪行为，且经查证属实国家予以奖励。下列属于举报范围的是()。",
			"answer": "D"
		},	
		{
			"question": "联合国禁毒署确定的“世界毒品问题报告”每年发布一次，其主要目的是什么？()",
			"answer": "B"
		},
		{
			"question": "利用远程视频教唆他人吸毒，将受到()。",
			"answer": "B"
		},
		{
			"question": "下列哪项是正确的禁毒观念？()",
			"answer": "C"
		},
		{
			"question": "三唑仑俗称“迷药、蒙汗药”，又名海乐神、酣乐欣，是一种镇静、催眠药物。因其具有无色、无味、可溶于水及各种饮料的特点，常被不法分子用作“迷药”或从事其他违法犯罪活动。长期服用极易导致药物依赖，能够让人产生头晕、困倦等症状。该说法()。",
			"answer": "A"
		},
		{
			"question": "艾司唑仑，又名舒乐安定，是一种新的苯二氮䓬类催眠药，是国家规定管制的第二类精神药品。滥用后会使人易怒、沮丧、人格改变、头晕、惊恐发作、幻觉、记忆丧失、视野模糊、言语不清、缺乏判断力、运动协调问题、反弹失眠焦虑等。该说法()。",
			"answer": "A"
		},	
		{
			"question": "毒品“忽悠悠”中含有的主要成分安眠酮，是国家严格管制的第一类精神药品，作用于大脑皮层，具有镇静和催眠作用。滥用此类药物可产生耐受性和依赖性，会引起神经、感觉运动、肌肉骨骼等系统的不良反应，还会引起血管破裂、视网膜、消化道出血、紫癜等中毒症状。该说法()。",
			"answer": "A"
		},	
		{
			"question": "美沙酮，一种阿片类镇痛药，被普遍用作镇痛药物和阿片类药物成瘾的治疗药物。适用于慢性、中度至重度剧烈疼痛和剧烈咳嗽病人，主要用于癌症病人镇痛，药效与吗啡类似。滥用可导致呼吸抑制，血压下降，甚至休克，严重者可因呼吸抑制而死亡。该说法()。",
			"answer": "A"
		},
		{
			"question": "复方地芬诺酯，又名苯乙哌啶、氰苯哌酯，用于急慢性功能性腹泻及慢性肠炎的治疗，有止泻的作用，如果长期服用复方地芬诺酯可致依赖性。停药后产生烦躁不安、打呵欠、心慌、心跳加快、呼吸不畅、关节疼痛和失眠等躯体依赖症状。该说法()。",
			"answer": "A"
		},	
		{
			"question": "号称“改良K粉”的氟胺酮，是氯胺酮的氟代衍生物，滥用可诱发暴力犯罪、自伤自残自杀等行为，出现幻觉或妄想、意识丧失、抽搐、躁动、行为异常、运动抑制、高血压、心动过速等症状。该说法()。",
			"answer": "A"
		},				
		{
			"question": "2018年以来，国家禁毒委员会在全国组织开展了禁毒示范城市创建活动，有力推进了市域毒品治理，充分发挥了禁毒示范地区引领作用，以点带面促进了全国禁毒工作深入开展。目前，全国已有()个地区被命名为“全国禁毒示范城市”。",
			"answer": "B"
		},
		{
			"question": "2011年起，由()定期开展的()，有力打击了流域跨国犯罪，维护了湄公河安全稳定，促进了当地经济社会发展，被誉为国际执法安全合作的典范，成为我国在禁毒斗争中加强国际执法合作的生动注脚。",
			"answer": "B"
		},
		{
			"question": "2023年9月6日，第14届大湄公河次区域禁毒合作谅解备忘录（MOU）签约方部长级会议在北京举行。此次部长级会议正值该机制成立()周年，对确定机制未来走向、深化区域禁毒合作、促进全球毒品共治具有重要意义。",
			"answer": "C"
		},
		{
			"question": "《中华人民共和国禁毒法》规定，根据医疗、教学、科研的需要，依法可以()、经营、使用、储存、运输麻醉药品和精神药品。",
			"answer": "B"
		},	
		{
			"question": "下列关于麻黄草说法错误的是()。",
			"answer": "C"
		},		
	],
};