// ==UserScript==
// @name         offline
// @description  右键启动脚本,移到题干显示答案
// @license      abyEqual
// @namespace    http://tampermonkey.net/
// @match        https://learn.cscec83.cn/*
// @icon         data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==
// @grant        none
// @run-at context-menu

// @version 0.0.1.20241112003827
// @downloadURL https://update.greasyfork.org/scripts/516923/offline.user.js
// @updateURL https://update.greasyfork.org/scripts/516923/offline.meta.js
// ==/UserScript==
var FAQ = [
    {
        "ANS": "ABCD",
        "Q": "工程造价咨询人收集鉴定项目的鉴定依据时应向鉴定项目委托人提出具体书面要求其内容包括",
        "TYPE": "多选题",
        "A": "与鉴定项目相关的合同协议及其附件",
        "B": "相应的施工图纸等技术经济文件",
        "C": "施工过程中的施工组织质量工期和造价等工程资料",
        "D": "存在争议的事实及各方当事人的理由",
        "E": "项目人员组成情况"
    },
    {
        "ANS": "B",
        "Q": "2009公司参建的京沪高铁南京南站站房工程开工29个月完成站房总建筑面积458万平方米被誉为为亚洲第一大火车站2011年投入使用古都新站率先成为中国第一个通过垂直换乘的交通枢纽南京南站南北入口14根大立柱寓意六朝古都文脉笑迎八方宾朋",
        "TYPE": "单选题",
        "A": "中国第一个通过水平换乘的交通枢纽",
        "B": "中国第一个通过垂直换乘的交通枢纽",
        "C": "中国第一个通过平行换乘的交通枢纽",
        "D": "中国第一个通过跨越换乘的交通枢纽"
    },
    {
        "ANS": "B",
        "Q": "II类潜亏项目指经过一段时问治理履约满一年或主体封顶或产值利润率为负的项目",
        "TYPE": "单选题",
        "A": "初始预计总毛利率",
        "B": "预计总毛利",
        "C": "总毛利",
        "D": "实际毛利率"
    },
    {
        "ANS": "B",
        "Q": "报价最低的标底其评定价格也最低",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "关于预应力混凝土说法正确的",
        "TYPE": "单选题",
        "A": "按清单规范钢绞线应当以图示延长米计量",
        "B": "低合金钢筋一端使用帮条锚具一端使用墩头锚具钢筋按孔道长度加035m计算",
        "C": "低合金钢筋两端螺丝端杆锚具钢筋按孔道长度减015m计算",
        "D": "低合金钢筋使用XM锚具孔道长度18m钢筋应计算为19m"
    },
    {
        "ANS": "A",
        "Q": "项目需分析潜亏原因制定问题销项清单落实扭亏举措及责任人明确扭亏时间严控底线目标",
        "TYPE": "单选题",
        "A": "每季度次月10日前",
        "B": "每季度次月20日前",
        "C": "每季度首月10日前",
        "D": "每季度首月20日前"
    },
    {
        "ANS": "A",
        "Q": "是本单位的清欠第一责任人",
        "TYPE": "单选题",
        "A": "单位负责人",
        "B": "总会计师",
        "C": "各项目项目经理"
    },
    {
        "ANS": "A",
        "Q": "有责任发起提出签证索赔负责签证索赔报告的起草工程量的计算跟踪和办理项目商务经理负责工程量的复核和计价",
        "TYPE": "单选题",
        "A": "项目总工各专业工程师",
        "B": "项目经理",
        "C": "项目生产经理",
        "D": "项目商务经理"
    },
    {
        "ANS": "C",
        "Q": "组织总包结算评审与竣工成本对比若发现未达到上缴利润率情况则立即组织相关部门研究分析原因依据初审结果调整结算后由项目经理商务经理项目总工签字确认结算目标值报二级单位商务法务部时间要求",
        "TYPE": "单选题",
        "A": "项目商务经理工程竣工验收申请提交前15天内",
        "B": "项目经理工程竣工验收申请提交前15天内",
        "C": "项目经理工程竣工验收申请提交前21天内",
        "D": "项目商务经理工程竣工验收申请提交前21天内"
    },
    {
        "ANS": "D",
        "Q": "牵头商务策划管理指导参与和督促项目部进行商务策划对项目策划情况进行审核跟踪和检查",
        "TYPE": "单选题",
        "A": "项目部",
        "B": "工程管理部",
        "C": "科技部设计管理中心",
        "D": "商务管理部"
    },
    {
        "ANS": "B",
        "Q": "具有抗冲击性好破碎时产生辐射状裂纹不伤人的特点",
        "TYPE": "单选题",
        "A": "钢化玻璃",
        "B": "夹丝玻璃",
        "C": "夹层玻璃",
        "D": "彩色玻璃"
    },
    {
        "ANS": "B",
        "Q": "类潜亏项目为局重点督导项目",
        "TYPE": "单选题",
        "A": "Ⅰ类B级",
        "B": "Ⅰ类A级",
        "C": "Ⅱ类B级",
        "D": "Ⅲ类"
    },
    {
        "ANS": "B",
        "Q": "需按季度全面盘点项目成本情况对比分析相关数值动态更新潜亏项目清单",
        "TYPE": "单选题",
        "A": "每季度次月10日前",
        "B": "每季度次月5日前",
        "C": "每季度首月10日前",
        "D": "每季度首月5日前"
    },
    {
        "ANS": "D",
        "Q": "施工单位超越本单位资质等级许可的业务范围或者以其他施工单位的名义承揽施工",
        "TYPE": "单选题",
        "A": "许可",
        "B": "在建设主管部门许可下可以",
        "C": "在某些特殊情况下许可",
        "D": "禁止"
    },
    {
        "ANS": "A",
        "Q": "公司首次荣获中国建筑500强称号",
        "TYPE": "单选题",
        "A": "1992年",
        "B": "1993年",
        "C": "1994年",
        "D": "1995年"
    },
    {
        "ANS": "D",
        "Q": "公司再次进入中建号码公司十强之列",
        "TYPE": "单选题",
        "A": "2010年",
        "B": "2011年",
        "C": "2013年",
        "D": "2015年"
    },
    {
        "ANS": "D",
        "Q": "公司在全局二级单位中率先成立基础设施事业部开拓基础设施业务品类后改为基础设施公司",
        "TYPE": "单选题",
        "A": "2004年",
        "B": "2005年",
        "C": "2006年",
        "D": "2007年"
    },
    {
        "ANS": "D",
        "Q": "基建工程兵211大队奉命集体改编为中国建筑第八工程局第三建筑公司",
        "TYPE": "单选题",
        "A": "9180",
        "B": "9181",
        "C": "9182",
        "D": "9183"
    },
    {
        "ANS": "A",
        "Q": "中国建筑第八工程局第三建筑公司整体改制为中建八局第三建设有限公司注册资本金6000万元",
        "TYPE": "单选题",
        "A": "200712",
        "B": "200711",
        "C": "20081",
        "D": "200710"
    },
    {
        "ANS": "A",
        "Q": "必须参与主体结构二次结构实地考察出题来源采购管理部施工生产管理手册",
        "TYPE": "单选题",
        "A": "二级单位生产副总经理",
        "B": "二级单位施工管理部经理",
        "C": "公司工程管理部经理",
        "D": "公司生产副总经理"
    },
    {
        "ANS": "C",
        "Q": "采购管理人员签订廉洁从业承诺出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "单选题",
        "A": "项目",
        "B": "机关",
        "C": "所有"
    },
    {
        "ANS": "B",
        "Q": "负责整理经监理单位设计单位发包人共同确认的加盖竣工图章的完整竣工图纸",
        "TYPE": "单选题",
        "A": "项目商务经理",
        "B": "项目总工程师",
        "C": "项目经理",
        "D": "项目商务工程师"
    },
    {
        "ANS": "A",
        "Q": "根据表达方式分为时间定额和产量定额两种",
        "TYPE": "单选题",
        "A": "劳动定额",
        "B": "施工定额",
        "C": "材料消耗定额",
        "D": "施工机械台班消耗定额"
    },
    {
        "ANS": "C",
        "Q": "工程是公司在南京市承接的第一个包含隧道主线的市政基础设施工程",
        "TYPE": "单选题",
        "A": "南京石杨路",
        "B": "南京扬子江大道快速路",
        "C": "南京红山南路工程",
        "D": "南京江东南路工程"
    },
    {
        "ANS": "A",
        "Q": "是公司承建的首个市政道路综合性工程于2014年6月30日竣工",
        "TYPE": "单选题",
        "A": "南京市江东南路建设工程二标段",
        "B": "绿都大道",
        "C": "红山南路工程",
        "D": "扬子江大道工程"
    },
    {
        "ANS": "A",
        "Q": "是国家对每个从业人员的基本要求也是职工对国家对企业必须履行的任务出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "忠于职守热爱本职",
        "B": "遵纪守法安全生产",
        "C": "质量第一信誉至上",
        "D": "诚实守停实践合同"
    },
    {
        "ANS": "A",
        "Q": "是项目商务策划的第一责任人全面负责项目商务策划的方案制定责任分解措施落实与动态调整对项目商务策划的执行情况进行反馈考核",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "商务经理",
        "C": "项目副经理",
        "D": "项目总工"
    },
    {
        "ANS": "A",
        "Q": "为组长项目总工商务经理全程参与结算工作制定结算计划分工明确责任到人结算资料不齐全结算书未上报前项目主要管理人员不得调离",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "工程部经理",
        "C": "商务法务部经理",
        "D": "财务经理"
    },
    {
        "ANS": "A",
        "Q": "组织对形象部位材料库存半成品等进行盘点",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "项目总工",
        "C": "物资经理",
        "D": "商务经理"
    },
    {
        "ANS": "A",
        "Q": "组织总包结算评审与交竣工成本对比若发现未达到上缴利润率情况则立即组织相关部门研究分析原因",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "项目总工",
        "C": "项目商务经理",
        "D": "生产经理"
    },
    {
        "ANS": "ABCDEF",
        "Q": "16多选为落实落细各项清欠工作各单位应建立哪些台账",
        "TYPE": "多选题",
        "A": "工信部投诉平台台账",
        "B": "国务院互联网督查投诉线索台账",
        "C": "清欠台账",
        "D": "连环清台账",
        "E": "项目经理限制从业台账",
        "F": "分包分供商投诉限制合作台账"
    },
    {
        "ANS": "CD",
        "Q": "和必须按国家或省级行业建设主管部门的规定计算不得作为竞争性费用",
        "TYPE": "多选题",
        "A": "管理费",
        "B": "利润",
        "C": "规费",
        "D": "税金",
        "E": "其他"
    },
    {
        "ANS": "B",
        "Q": "1SC战略中的S是指",
        "TYPE": "单选题",
        "A": "本部地区",
        "B": "战略市场",
        "C": "核心城市市场",
        "D": "本埠市场"
    },
    {
        "ANS": "A",
        "Q": "661163即收到图纸后60天内完成施工图预算竣工前6个月开展结算策划竣工前一个月签订竣工后一个月报出结算竣工6个月内完成总包结算3个月内完成分包结算",
        "TYPE": "单选题",
        "A": "结算责任状",
        "B": "结算责任书",
        "C": "结算目标责任书",
        "D": "总结算责任书"
    },
    {
        "ANS": "B",
        "Q": "EPCPPP等项目收到初步设计图纸天内完成工程概算控制在可行性研究的投资估算总额以下正式施工图纸收到后60天内完成施工图预算",
        "TYPE": "单选题",
        "A": "20",
        "B": "30",
        "C": "40",
        "D": "50"
    },
    {
        "ANS": "C",
        "Q": "EPCPPP等项目收到初步设计图纸多少天内完成工程概算控制在可行性研究的投资估算总额以下正式施工图纸收到后多少天内完成施工图预算",
        "TYPE": "单选题",
        "A": "2040",
        "B": "2060",
        "C": "3060",
        "D": "3070"
    },
    {
        "ANS": "B",
        "Q": "地下连续墙工程量按设计墙外边线乘以厚度乘以槽深以体积计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "泥浆护壁成孔灌注桩的特征描述应包括的内容有",
        "TYPE": "多选题",
        "A": "空桩长度桩长",
        "B": "桩径",
        "C": "泥浆池槽的砌筑",
        "D": "成孔方法",
        "E": "混凝土养护"
    },
    {
        "ANS": "ACDE",
        "Q": "墙面镶贴块料项目的工作内容应包括",
        "TYPE": "多选题",
        "A": "基层清理",
        "B": "抹灰",
        "C": "面层挂贴",
        "D": "嵌缝",
        "E": "磨光酸洗打蜡"
    },
    {
        "ANS": "ACDE",
        "Q": "清单防水排水工程量计算规则中以面积为单位的有",
        "TYPE": "多选题",
        "A": "屋面镀锌铁皮檐沟",
        "B": "屋面排水管",
        "C": "墙基砂浆防水",
        "D": "屋面卷材天沟",
        "E": "屋面细石砼防水"
    },
    {
        "ANS": "B",
        "Q": "清单防水排水工程量计算规则中以长度为单位的有",
        "TYPE": "单选题",
        "A": "屋面镀锌铁皮檐沟",
        "B": "屋面排水管",
        "C": "墙基砂浆防水带",
        "D": "屋面卷材天沟"
    },
    {
        "ANS": "B",
        "Q": "清单防水排水工程量计算规则中以长度为单位的有",
        "TYPE": "单选题",
        "A": "屋面镀锌铁皮檐沟",
        "B": "屋面排水管",
        "C": "墙基砂浆防水带",
        "D": "屋面卷材天沟"
    },
    {
        "ANS": "B",
        "Q": "清单现浇砼挑檐工程量按计算",
        "TYPE": "单选题",
        "A": "挑出墙外水平投影面积",
        "B": "挑出墙外砼体积",
        "C": "挑檐延长米",
        "D": "墙外挑檐水平竖直展开面积"
    },
    {
        "ANS": "B",
        "Q": "清单现浇砼挑檐工程量按计算",
        "TYPE": "单选题",
        "A": "挑出墙外水平投影面积",
        "B": "挑出墙外砼体积",
        "C": "挑檐延长米",
        "D": "墙外挑檐水平竖直展开面积"
    },
    {
        "ANS": "D",
        "Q": "清单在计算卷材防水屋面工程量时遇女儿墙处弯起部分工程量",
        "TYPE": "单选题",
        "A": "单独列项计算",
        "B": "应考虑在报价中",
        "C": "一律按弯起250mm高度计算",
        "D": "并入屋面工程量计算"
    },
    {
        "ANS": "D",
        "Q": "清单在计算卷材防水屋面工程量时遇女儿墙处弯起部分工程量",
        "TYPE": "单选题",
        "A": "单独列项计算",
        "B": "应考虑在报价中",
        "C": "一律按弯起250mm高度计算",
        "D": "并入屋面工程量计算"
    },
    {
        "ANS": "D",
        "Q": "清单中对现浇钢砼柱的分类为",
        "TYPE": "单选题",
        "A": "矩形柱圆形柱",
        "B": "矩形柱异形柱",
        "C": "矩形柱圆形柱异形柱",
        "D": "矩形柱异形柱构造柱"
    },
    {
        "ANS": "D",
        "Q": "清单中对现浇钢砼柱的分类为",
        "TYPE": "单选题",
        "A": "矩形柱圆形柱",
        "B": "矩形柱异形柱",
        "C": "矩形柱圆形柱异形柱",
        "D": "矩形柱异形柱构造柱"
    },
    {
        "ANS": "BC",
        "Q": "清单中下列各项按砌体体积计算的有",
        "TYPE": "多选题",
        "A": "砖散水",
        "B": "空花墙",
        "C": "附墙垃圾道",
        "D": "砖检查井",
        "E": "砖砌地沟"
    },
    {
        "ANS": "B",
        "Q": "清单中下列各项按实砌体积计算的有",
        "TYPE": "单选题",
        "A": "砖检查井",
        "B": "砖烟囱",
        "C": "砖散水",
        "D": "砖砌地沟"
    },
    {
        "ANS": "B",
        "Q": "清单中下列各项按实砌体积计算的有",
        "TYPE": "单选题",
        "A": "砖检查井",
        "B": "砖烟囱",
        "C": "砖散水",
        "D": "砖砌地沟"
    },
    {
        "ANS": "A",
        "Q": "清单中油漆装饰工程量计算中表达不正确的是",
        "TYPE": "单选题",
        "A": "门窗油漆按展开面积计",
        "B": "门窗油漆按数量樘计",
        "C": "金属面油漆按金属构件重量计",
        "D": "喷塑涂抹墙面按面积计"
    },
    {
        "ANS": "A",
        "Q": "清单中油漆装饰工程量计算中表达不正确的是",
        "TYPE": "单选题",
        "A": "门窗油漆按展开面积计",
        "B": "门窗油漆按数量樘计",
        "C": "金属面油漆按金属构件重量计",
        "D": "喷塑涂抹墙面按面积计"
    },
    {
        "ANS": "ABCDE",
        "Q": "竖井开挖项目的工作内容应包括",
        "TYPE": "多选题",
        "A": "爆破或机械开挖",
        "B": "施工面排水",
        "C": "出碴",
        "D": "弃碴场堆放运输",
        "E": "弃碴外运"
    },
    {
        "ANS": "D",
        "Q": "水泥砂浆楼面面层的工程内容中不包括",
        "TYPE": "单选题",
        "A": "材料运输",
        "B": "垫层铺设",
        "C": "找平层",
        "D": "酸洗打蜡"
    },
    {
        "ANS": "D",
        "Q": "水泥砂浆楼面面层的工程内容中不包括",
        "TYPE": "单选题",
        "A": "材料运输",
        "B": "垫层铺设",
        "C": "找平层",
        "D": "酸洗打蜡"
    },
    {
        "ANS": "B",
        "Q": "砼智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "挖基础土方项目内容中不包括",
        "TYPE": "单选题",
        "A": "基础降水",
        "B": "基底钎探",
        "C": "土方外运",
        "D": "挡土板支拆"
    },
    {
        "ANS": "A",
        "Q": "挖基础土方项目内容中不包括",
        "TYPE": "单选题",
        "A": "基础降水",
        "B": "基底钎探",
        "C": "土方外运",
        "D": "挡土板支拆"
    },
    {
        "ANS": "ACD",
        "Q": "挖基础土方项目内容中综合了",
        "TYPE": "多选题",
        "A": "排地表水",
        "B": "基础回填土",
        "C": "土方外运",
        "D": "挡土板支拆",
        "E": "场地找平"
    },
    {
        "ANS": "BD",
        "Q": "现浇混凝土板项目的特征描述应表示",
        "TYPE": "多选题",
        "A": "板厚度",
        "B": "混凝土强度等级",
        "C": "板的面积",
        "D": "混凝土类别",
        "E": "钢筋种类"
    },
    {
        "ANS": "A",
        "Q": "医智维是智慧科技公司自主研发的医院后勤保障系统在线问诊平台",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "安装工程计量规范附录中给出的是一个清单项目可能发生的工作内容在编制综合单价时其确定的依据有",
        "TYPE": "多选题",
        "A": "清单项目特征中的要求",
        "B": "具体的施工方案",
        "C": "具体的施工组织设计",
        "D": "具体的施工图纸"
    },
    {
        "ANS": "A",
        "Q": "电气设备安装工程计价定额中规定低压开关柜安装时如是车间的低压柜执行第四章",
        "TYPE": "单选题",
        "A": "落地式成套配电箱",
        "B": "低压开关柜",
        "C": "控制台",
        "D": "低压配电屏"
    },
    {
        "ANS": "B",
        "Q": "电气设备安装工程计价定额中规定照明线路中的导线截面大于或等于时应执行动力线路穿线相应项目",
        "TYPE": "单选题",
        "A": "4mm",
        "B": "6mm",
        "C": "10mm",
        "D": "16mm"
    },
    {
        "ANS": "D",
        "Q": "电气设备安装工程计价定额中绝缘导线主材损耗率是",
        "TYPE": "单选题",
        "A": "016",
        "B": "01",
        "C": "003",
        "D": "0018"
    },
    {
        "ANS": "A",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013中按设计图示尺寸以长度计算油漆工程量的是",
        "TYPE": "单选题",
        "A": "窗帘盒",
        "B": "木墙裙",
        "C": "踢脚线",
        "D": "木栏杆"
    },
    {
        "ANS": "C",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013中楼地面防水反边高度mm时算作地面防水",
        "TYPE": "单选题",
        "A": "200",
        "B": "250",
        "C": "300",
        "D": "400"
    },
    {
        "ANS": "C",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013中楼梯台阶牵边和侧面镶贴块料面层不大于的少量分散的楼地面镶贴块料面层应按零星装饰项目工程量清单执行",
        "TYPE": "单选题",
        "A": "01",
        "B": "03",
        "C": "05",
        "D": "10"
    },
    {
        "ANS": "DE",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013中屋面防水及其他中按设计图示尺寸以面积计算的项目是",
        "TYPE": "多选题",
        "A": "屋面排水管",
        "B": "屋面天沟檐沟",
        "C": "屋面吐水管",
        "D": "屋面刚性防水",
        "E": "屋面卷材防水"
    },
    {
        "ANS": "C",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013中下面哪种不属于保温隔热方式",
        "TYPE": "单选题",
        "A": "内保温",
        "B": "外保温",
        "C": "夹层保温",
        "D": "夹心保温"
    },
    {
        "ANS": "ADE",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013中有关墙柱面工程工程量计算说法正确的有",
        "TYPE": "多选题",
        "A": "柱面抹灰按设计图示柱断面周长乘以高度以面积计算",
        "B": "柱面镶贴块料按设计图示尺寸以实贴面积计算",
        "C": "墙饰面按设计图示墙外围尺寸乘以净高以面积计算",
        "D": "柱梁面按设计图示饰面外围尺寸以相应面积计算",
        "E": "隔断按设计图示框外围尺寸以面积计算"
    },
    {
        "ANS": "ACDE",
        "Q": "工程量清单计价规范的特点是",
        "TYPE": "多选题",
        "A": "强制性",
        "B": "市场性",
        "C": "实用性",
        "D": "竞争性",
        "E": "通用性"
    },
    {
        "ANS": "D",
        "Q": "工业管道安装防水套管定额是依据S131标准图结构形式编制的适用于储水池套管安装定额中的公称直径是指",
        "TYPE": "单选题",
        "A": "套管的公称直径",
        "B": "套管的外径",
        "C": "管道的外径",
        "D": "管道的公称直径"
    },
    {
        "ANS": "CD",
        "Q": "建设工程工程量清单计价规范GB505002013适用于建设工程阶段的计价活动",
        "TYPE": "多选题",
        "A": "设计",
        "B": "规划",
        "C": "发承包",
        "D": "实施",
        "E": "决策"
    },
    {
        "ANS": "ABCD",
        "Q": "建设工程工程量清单计价规范GB505002013中分部分项工程量清单应载明",
        "TYPE": "多选题",
        "A": "项目编码",
        "B": "项目名称",
        "C": "项目特征",
        "D": "计量单位",
        "E": "综合单价"
    },
    {
        "ANS": "ABDE",
        "Q": "建设工程工程量清单计价规范GB505002013中下列属于招标控制价的编制依据的是",
        "TYPE": "多选题",
        "A": "建设工程设计文件",
        "B": "拟定的招标文件",
        "C": "企业定额",
        "D": "与建设项目相关的标准规范技术资料",
        "E": "工程造价管理机构发布的工程造价信息"
    },
    {
        "ANS": "BCD",
        "Q": "建设工程工程量清单计价规范GB505002013中以下属于规费的有",
        "TYPE": "多选题",
        "A": "环境保护",
        "B": "工程排污费",
        "C": "住房公积金",
        "D": "工伤保险",
        "E": "二次搬运"
    },
    {
        "ANS": "ACE",
        "Q": "建设工程工程量清单计价规范GB505002013中以下属于暂估价的有",
        "TYPE": "多选题",
        "A": "材料暂估单价",
        "B": "暂列金额",
        "C": "工程设备暂估单价",
        "D": "计日工",
        "E": "专业工程暂估价"
    },
    {
        "ANS": "C",
        "Q": "建设工程工程量清单计价规范GB505002013中规定投标报价不得低于",
        "TYPE": "单选题",
        "A": "招标控制价",
        "B": "结算价",
        "C": "工程成本",
        "D": "工程收入"
    },
    {
        "ANS": "BCDE",
        "Q": "建设工程工程量清单计价规范规定其他项目清单组成的内容有",
        "TYPE": "多选题",
        "A": "规费",
        "B": "预留金",
        "C": "材料购置费",
        "D": "设备购置费",
        "E": "总包服务费"
    },
    {
        "ANS": "B",
        "Q": "建筑法规定大型建筑工程或结构复杂的建筑工程可以由2个以上的承包单位联合共同承包共同承包的各方对承包合同的履行",
        "TYPE": "单选题",
        "A": "独立承担各自的责任",
        "B": "承担连带责任",
        "C": "不承担责任",
        "D": "承担适当的责任"
    },
    {
        "ANS": "A",
        "Q": "商标注册申请报告经局总经济师审批同意后个工作日内报股份公司法律部审核",
        "TYPE": "单选题",
        "A": "1",
        "B": "3",
        "C": "5",
        "D": "7"
    },
    {
        "ANS": "B",
        "Q": "通用安装工程工程量计算规范GB508562013中规定电线管垂直敷设中管内导线截面为120mm240mm长度超过应增设固定导线用拉线盒",
        "TYPE": "单选题",
        "A": "15m",
        "B": "18m",
        "C": "20m",
        "D": "30m"
    },
    {
        "ANS": "ABD",
        "Q": "通用安装工程工程量计算规范GB508562013中规定附录中成品卫生器具项目中的给水附件包括",
        "TYPE": "多选题",
        "A": "水嘴",
        "B": "阀门",
        "C": "支架",
        "D": "喷头"
    },
    {
        "ANS": "ABCD",
        "Q": "项目采购策划管理指引的管理原则是",
        "TYPE": "多选题",
        "A": "全面覆盖",
        "B": "目标引领",
        "C": "系统联动",
        "D": "全程精益",
        "E": "价值创造"
    },
    {
        "ANS": "ABDE",
        "Q": "项目采购策划管理指引中在组织实施阶段选择采购模式过程中需要项目哪些部门联动",
        "TYPE": "多选题",
        "A": "工程部",
        "B": "技术部",
        "C": "安监部",
        "D": "商务部",
        "E": "物资部"
    },
    {
        "ANS": "B",
        "Q": "项目目标管理责任书签订后14天内预留风险金",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "项目商务策划书在项目管理目标责任书签订后天内编制完成",
        "TYPE": "单选题",
        "A": "14天",
        "B": "30天",
        "C": "60天",
        "D": "90天"
    },
    {
        "ANS": "D",
        "Q": "消防工程计价定额中点型探测器按线制的不同分为多线制与总线制两种套用定额时点型探测器哪一种说法不正确",
        "TYPE": "单选题",
        "A": "不分规格型号",
        "B": "不分安装方式位置",
        "C": "以单个为计算单位",
        "D": "不包括本体调试"
    },
    {
        "ANS": "ADE",
        "Q": "承包人索赔要求赔偿时可以选择下列一项或几项方式获得赔偿",
        "TYPE": "多选题",
        "A": "延长工期",
        "B": "延长质量缺陷修复期限",
        "C": "要求承包人按合同约定支付违约金",
        "D": "要求发包人支付实际发生的额外费用",
        "E": "要求发包人支付合理的预期利润"
    },
    {
        "ANS": "ACE",
        "Q": "对清单中等项目投标人可不单列项目计算工程量而在报价中考虑",
        "TYPE": "多选题",
        "A": "土石方工程中的放坡操作工作面支挡土板",
        "B": "基础施工时的明沟排水井点降水",
        "C": "桩基工程中的送桩桩孔填料",
        "D": "灌注桩中的钢筋笼制作安装",
        "E": "充盈量"
    },
    {
        "ANS": "ABCE",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013门窗工程中以米计量按设计图示尺寸以延长米计算的项目包括",
        "TYPE": "多选题",
        "A": "木窗帘盒",
        "B": "金属门窗套",
        "C": "门窗木贴脸",
        "D": "铝塑窗台板",
        "E": "窗帘轨"
    },
    {
        "ANS": "CDE",
        "Q": "关于清单门窗计量单位下列说法不正确的是",
        "TYPE": "多选题",
        "A": "卷帘门按设计数量计算",
        "B": "窗帘盒按设计长度计算",
        "C": "门窗套按设计长度计算",
        "D": "钢窗按砖口面积计算",
        "E": "窗帘轨以设计数量计算"
    },
    {
        "ANS": "AD",
        "Q": "关于楼梯装饰工程量计算规则正确的说法是",
        "TYPE": "多选题",
        "A": "按设计图示尺寸以楼梯水平投影面积计算",
        "B": "踏步休息平台应单独另行计算",
        "C": "踏步应单独另行计算休息平台不应单独另行计算",
        "D": "踏步休息平台不单独另行计算",
        "E": "休息平台应单独另行计算而踏步不应单独计算"
    },
    {
        "ANS": "ABCE",
        "Q": "其他项目清单与计价汇总表由组成",
        "TYPE": "多选题",
        "A": "暂列金额",
        "B": "暂估价",
        "C": "计日工",
        "D": "人工费",
        "E": "索赔与现场签证"
    },
    {
        "ANS": "A",
        "Q": "030101001001中的前两位表示的是",
        "TYPE": "单选题",
        "A": "工程分类码",
        "B": "专业工程顺序码",
        "C": "分部工程顺序码",
        "D": "分项工程项目名称顺序码"
    },
    {
        "ANS": "ABCE",
        "Q": "1编制分部分项工程量清单时应依据",
        "TYPE": "多选题",
        "A": "建设工程工程量清单计价规范",
        "B": "建设项目招标文件",
        "C": "建设项目设计文件",
        "D": "建设项目可行性研究报告",
        "E": "拟采用的施工组织设计和施工技术方案"
    },
    {
        "ANS": "A",
        "Q": "16G剪力墙基础插筋弯折长度以下说法正确的是",
        "TYPE": "单选题",
        "A": "当基础厚度满足直锚时插筋弯折长度为max6d150",
        "B": "当基础厚度满足直锚时插筋弯折长度为6d",
        "C": "当基础厚度不满足直锚时插筋弯折长度为12d",
        "D": "当基础厚度不满足直锚时插筋弯折长度为150"
    },
    {
        "ANS": "B",
        "Q": "16G平法中梁上柱LZ纵筋构造柱纵筋伸入梁底弯折弯折长度为",
        "TYPE": "单选题",
        "A": "12d",
        "B": "15d",
        "C": "150",
        "D": "6d"
    },
    {
        "ANS": "A",
        "Q": "16G中连梁LLK纵向配筋构造非贯通筋伸入跨内的长度",
        "TYPE": "单选题",
        "A": "第一排伸入跨内13ln",
        "B": "第一排伸入跨内14ln",
        "C": "第二排伸入跨内13ln",
        "D": "第二排伸入跨内15ln"
    },
    {
        "ANS": "C",
        "Q": "16G中剪力墙上起边缘构件纵筋构造下插纵筋设有箍筋其箍筋间距为",
        "TYPE": "单选题",
        "A": "max5d100",
        "B": "min5d100",
        "C": "100",
        "D": "5d"
    },
    {
        "ANS": "AB",
        "Q": "16G1011中无梁楼盖平法施工图中板带编号有",
        "TYPE": "多选题",
        "A": "ZSB",
        "B": "KZB",
        "C": "ZBD",
        "D": "KBD",
        "E": "ZSD"
    },
    {
        "ANS": "C",
        "Q": "16G规定柱在变截面的时候下层柱钢筋无法通到上层的时候需要弯折按照平法图集要求弯折长度为",
        "TYPE": "单选题",
        "A": "200",
        "B": "保护层200",
        "C": "12d",
        "D": "15d"
    },
    {
        "ANS": "A",
        "Q": "16G平法规定柱基础插筋弯折长度取值Hj大于等于LaEla时弯折长度为",
        "TYPE": "单选题",
        "A": "MAX1506d",
        "B": "Min1506d",
        "C": "MAX15010d",
        "D": "Min15010d"
    },
    {
        "ANS": "AB",
        "Q": "16G平法规定了非框架梁以及不考虑地震作用的悬挑梁箍筋及拉筋弯钩平直段的长度为",
        "TYPE": "多选题",
        "A": "5d",
        "B": "当其受扭时应为10d",
        "C": "75",
        "D": "max10d75"
    },
    {
        "ANS": "ABC",
        "Q": "16G平法规范中保护层的一系列变化对钢筋的计算产生的影响有",
        "TYPE": "多选题",
        "A": "单根箍筋的长度变小",
        "B": "多肢箍计算公式变复杂",
        "C": "梁等构件的箍筋计算影响很大",
        "D": "没有太大的影响"
    },
    {
        "ANS": "BC",
        "Q": "16G平法规范中当箍筋沿柱高为一种间距时说法正确的是",
        "TYPE": "多选题",
        "A": "可不注写",
        "B": "不使用线",
        "C": "表示为10100",
        "D": "不使用线"
    },
    {
        "ANS": "ABCD",
        "Q": "16G平法规范中规定了钢筋种类下面那些是属于规范规定的",
        "TYPE": "多选题",
        "A": "HRBF335",
        "B": "HRB400",
        "C": "RRB400",
        "D": "HRBF500"
    },
    {
        "ANS": "BCD",
        "Q": "16G平法规范中针对保护层的说法哪些是正确的",
        "TYPE": "多选题",
        "A": "构件中的受力钢筋的保护层厚度可以小于钢筋的工程直径",
        "B": "按照平面构件和杆状构件两类确定保护层厚度",
        "C": "图集中罗列的是混凝强度等级大于25的值如果混凝强度等级大于25的时表中的保护层厚度数字应该增加5mm",
        "D": "混凝土保护层厚度指最外层钢筋的外边缘至混凝土表面的距离"
    },
    {
        "ANS": "A",
        "Q": "16G平法规范中柱变截面一侧有梁的构造弯折长度为",
        "TYPE": "单选题",
        "A": "保护层lae",
        "B": "15lae",
        "C": "lae",
        "D": "12lae"
    },
    {
        "ANS": "AB",
        "Q": "16G平法规范中柱插筋弯折长度不再判断a值下列哪项是正确的",
        "TYPE": "多选题",
        "A": "当基础的厚度HjLae时柱插筋弯折长度为max6d150",
        "B": "当基础的厚度HjLae时柱插筋的弯折长度为15d",
        "C": "当基础的厚度HjLae时柱插筋弯折长度为max15d150",
        "D": "当基础的厚度HjLae时柱插筋的弯折长度为6d"
    },
    {
        "ANS": "ABCD",
        "Q": "16G平法图集标准结构详图主要设计的依据有",
        "TYPE": "多选题",
        "A": "高层建筑混凝土结构技术规程",
        "B": "混凝土结构设计规范",
        "C": "建筑结构制图标准",
        "D": "中国地震动参数区划图"
    },
    {
        "ANS": "B",
        "Q": "16G平法中当基础厚度不满足直锚时柱插筋的弯折长度为",
        "TYPE": "单选题",
        "A": "12d",
        "B": "15d",
        "C": "10d",
        "D": "max6d150"
    },
    {
        "ANS": "C",
        "Q": "16G平法中设置基础梁的独立基础配筋构造独立基础钢筋距基础梁边的起步距离为",
        "TYPE": "单选题",
        "A": "50",
        "B": "100",
        "C": "s2",
        "D": "bhc"
    },
    {
        "ANS": "B",
        "Q": "16G平法中边框梁代号是BKL它属于构件",
        "TYPE": "单选题",
        "A": "梁",
        "B": "墙",
        "C": "连梁",
        "D": "圈梁"
    },
    {
        "ANS": "ABC",
        "Q": "16G平法中的嵌固部位要区分有无地下室下列哪项说明是正确的",
        "TYPE": "多选题",
        "A": "无地下室的时候嵌固部位在基础的顶面",
        "B": "有地下室的时候嵌固在地下室顶面首层地面",
        "C": "有地下室的时候基础顶面是否嵌固需要由设计者表明",
        "D": "无地下室的时候嵌固部位在首层地面"
    },
    {
        "ANS": "C",
        "Q": "16G平法中规定板分布筋与支座负筋的搭接长度为",
        "TYPE": "单选题",
        "A": "ll",
        "B": "100mm",
        "C": "150mm",
        "D": "la"
    },
    {
        "ANS": "D",
        "Q": "16G平法中规定抗裂构造钢筋抗温度筋自身及其与受力主筋的搭接长度为",
        "TYPE": "单选题",
        "A": "150mm",
        "B": "200mm",
        "C": "300mm",
        "D": "Ll"
    },
    {
        "ANS": "B",
        "Q": "16G平法中基础主梁底部非贯通纵筋过柱节点向跨内的延伸长度",
        "TYPE": "单选题",
        "A": "Lo3",
        "B": "Ln3",
        "C": "Lo312LaHb05Hc取大值",
        "D": "Ln312LaHb05Hc取大值"
    },
    {
        "ANS": "ABCDE",
        "Q": "16G平法中梁分为那些类型",
        "TYPE": "多选题",
        "A": "楼层框架梁",
        "B": "屋面框架梁",
        "C": "框支梁",
        "D": "非框架梁",
        "E": "托柱转换梁"
    },
    {
        "ANS": "AB",
        "Q": "16G平法中下列标注表示带悬挑的梁是",
        "TYPE": "多选题",
        "A": "KL75A",
        "B": "L97B",
        "C": "Lg75",
        "D": "XL84"
    },
    {
        "ANS": "A",
        "Q": "16G平法中注明板端部为梁时上部受力筋伸入支座的长度为",
        "TYPE": "单选题",
        "A": "能直锚时直锚否则伸入支座宽保护层15d",
        "B": "支座宽25d15d",
        "C": "支座宽25d",
        "D": "La"
    },
    {
        "ANS": "D",
        "Q": "16G平法中注明有梁楼面板和屋面板下部受力筋伸入支座的长度为",
        "TYPE": "单选题",
        "A": "支座宽保护层",
        "B": "5d",
        "C": "支座宽25d",
        "D": "max支座宽25d"
    },
    {
        "ANS": "B",
        "Q": "16G平法中柱上板带暗梁的箍筋加密区范围是",
        "TYPE": "单选题",
        "A": "3b",
        "B": "3h",
        "C": "ln3",
        "D": "lo3"
    },
    {
        "ANS": "D",
        "Q": "16G新平法中规定梁上柱板上柱柱全部纵筋伸至梁底或板底弯折弯折长度为",
        "TYPE": "单选题",
        "A": "10d",
        "B": "lae",
        "C": "150",
        "D": "15d"
    },
    {
        "ANS": "B",
        "Q": "16G中剪力墙变截面处竖向钢筋不能贯通时需弯折长度为",
        "TYPE": "单选题",
        "A": "10d",
        "B": "12d",
        "C": "15d",
        "D": "lae"
    },
    {
        "ANS": "B",
        "Q": "16G中剪力墙竖向分布钢筋锚入连梁的长度为",
        "TYPE": "单选题",
        "A": "5d",
        "B": "lae",
        "C": "12lae",
        "D": "15lae"
    },
    {
        "ANS": "C",
        "Q": "16系新平法规范中当有地下室时嵌固部位有几个",
        "TYPE": "单选题",
        "A": "1个",
        "B": "2个",
        "C": "1个或2个",
        "D": "0个"
    },
    {
        "ANS": "A",
        "Q": "1952年4月公司前身中国人民解放军第90师在安徽省寿县城隍庙集体改编为",
        "TYPE": "单选题",
        "A": "水利工程第一师",
        "B": "水利工程第二师",
        "C": "水利工程第三师",
        "D": "水利工程第四师"
    },
    {
        "ANS": "A",
        "Q": "1954年1月水利工程一师师部和两个团改编组成建筑工程第四师后进驻上海市增补了施工技术力量对原部队官兵进行了技术培训",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1955年4月在西安奉命撤销改编与华东建筑工程局土木工程处原西北第四土建公司合并组建成为原国家建工部西北第二工程公司",
        "TYPE": "单选题",
        "A": "建筑工程第四师",
        "B": "水利工程第一师",
        "C": "基建工程兵211大队",
        "D": "解放军第90师"
    },
    {
        "ANS": "A",
        "Q": "1958年数百名技术骨干赴北京援建的项目是",
        "TYPE": "单选题",
        "A": "人民大会堂",
        "B": "中国人民革命军事博物馆",
        "C": "民族文化宫",
        "D": "工人体育场"
    },
    {
        "ANS": "A",
        "Q": "1966年8月至1973年7月211大队先后隶属基建工程兵整编办公室和基建工程兵西安指挥所承担了陕西地区的三线建设重任",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1973年8月至1978年6月211大队随基建工程兵22指挥部调驻辽宁省辽阳市参加国家特大型重点工程辽阳石油化学纤维总厂的建设",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1977年1982年建设南京烷基苯厂年产烷基苯72万吨合成洗衣粉25万吨为当时我国最大的烷基苯生产基地",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "1977年4月后公司前身211大队分批挥师南下部队改编为企业之前在南京及其周边地区建设了一批工程包括",
        "TYPE": "多选题",
        "A": "南京炼油厂扩建工程",
        "B": "南京烷基苯厂",
        "C": "仪征中转油港",
        "D": "华东电子管厂"
    },
    {
        "ANS": "A",
        "Q": "1978年1979年建设的工程为我国四大油港之一",
        "TYPE": "单选题",
        "A": "南京中转油港",
        "B": "大连中转油港",
        "C": "上海中转油港",
        "D": "连云港中转油港"
    },
    {
        "ANS": "ABCD",
        "Q": "1979年7月1983年10月承建的四栋高层建筑成为南京第一批高层建筑",
        "TYPE": "多选题",
        "A": "江苏省煤炭局科研办公大楼",
        "B": "江苏省电力局调度办公楼",
        "C": "江苏省化学工业厅办公设计楼",
        "D": "南京自动化研究所科研楼",
        "E": "金陵饭店"
    },
    {
        "ANS": "D",
        "Q": "1983年兵改工之后作为中国建筑行业国家队的三公司艰苦创业开拓经营截止2015年创造了个八局乃至中建系统第一",
        "TYPE": "单选题",
        "A": "8",
        "B": "10",
        "C": "12",
        "D": "15"
    },
    {
        "ANS": "A",
        "Q": "1983年9月南京军区党委授予抗洪抢险英雄称号追记一等功批准为烈士该同志于7月24日牺牲在大厂区三合圩距离211团集体转业仅仅54天史称基建工程兵最后一位烈士",
        "TYPE": "单选题",
        "A": "杨太平",
        "B": "阳太平",
        "C": "熊学贵",
        "D": "葛洪业"
    },
    {
        "ANS": "C",
        "Q": "1983年9月22日公司组织机构完成架设当时设有个工程处",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "C",
        "Q": "1984年公司开始围绕创建开展活动开展企业整顿补课",
        "TYPE": "单选题",
        "A": "四好企业",
        "B": "五好企业",
        "C": "六好企业",
        "D": "先进企业"
    },
    {
        "ANS": "ABC",
        "Q": "1988年公司经过努力开拓当年在注册成立了3个分公司",
        "TYPE": "多选题",
        "A": "徐州市",
        "B": "金昌市",
        "C": "海口市",
        "D": "郑州市"
    },
    {
        "ANS": "B",
        "Q": "1988年公司提出的战略决策方针是",
        "TYPE": "单选题",
        "A": "扎根江苏走向全国",
        "B": "立足南京开拓经营",
        "C": "开拓西部全力发展",
        "D": "开拓海外多点开发"
    },
    {
        "ANS": "D",
        "Q": "1990年公司经过不懈努力打进了上海建筑市场承接了工程",
        "TYPE": "单选题",
        "A": "魏公村小区项目",
        "B": "张府园456高层",
        "C": "上海珠江玫瑰花园2号楼",
        "D": "上海工业大学联建住宅B型楼"
    },
    {
        "ANS": "A",
        "Q": "1990年9月26日中国建筑第八工程局第三建筑公司成立是三公司第一次开拓上海市场",
        "TYPE": "单选题",
        "A": "上海分公司",
        "B": "华中分公司",
        "C": "徐州分公司",
        "D": "北京分公司"
    },
    {
        "ANS": "D",
        "Q": "1991年12月8日1993年4月30日建设的项目是海南省建省以来第一个鲁班奖工程",
        "TYPE": "单选题",
        "A": "青奥会议中心",
        "B": "酒泉卫星发射中心总装测试厂房",
        "C": "南京奥体中心",
        "D": "海口财盛大厦"
    },
    {
        "ANS": "A",
        "Q": "1992年我公司荣获文明单位称号是八局第一个荣获省级文明单位称号的子公司",
        "TYPE": "单选题",
        "A": "江苏省",
        "B": "南京市",
        "C": "栖霞区",
        "D": "山东省"
    },
    {
        "ANS": "A",
        "Q": "1993年4月东海三公司承建的海口市体育馆举行竣工典礼海南省省长阮崇武副省长毛志君江啸风海口市市长曾浩荣等领导出席",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "1993年8月至1995年8月公司承建了时为全国最大的钢结构轻型汽车厂房项目",
        "TYPE": "单选题",
        "A": "上海大众汽车车间",
        "B": "武汉神龙汽车总装车间",
        "C": "一汽集团车间",
        "D": "广汽集团车间"
    },
    {
        "ANS": "D",
        "Q": "1994年时任三公司经理梁新向提出的战略部署",
        "TYPE": "单选题",
        "A": "沿江一线连沿海一片片",
        "B": "沿江都有点沿海连成片",
        "C": "沿江一条线沿海一片片",
        "D": "沿江一条线沿海连成片"
    },
    {
        "ANS": "A",
        "Q": "1994年12月公司被江苏省委省政府授予19931994年文明单位称号公司被江苏省建筑协会评为江苏省建筑业最佳企业",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1994年3月31日建设部原部长萧桐在湖北省武汉市建委领导的陪同下视察神龙汽车总装车间工程对总装车间的建设速度和工程质量表示满意5月29日国务院副总理李岚清视察公司承建的武汉神龙汽车有限公司工地对施工速度和质量表示满意7月7日法国工业部长视察公司承建的武汉神龙汽车有限公司工地称赞中国工人好样的9月28日中建总公司副总经理孟广水等视察公司承建的武汉神龙汽车有限公司总装车间对参加施工的职工给予表扬10月18日上午10时中共中央总书记国家主席江泽民视察公司承建的武汉神龙汽车有限公司总装车间对工程建设表示满意",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1994年6月27日无锡市陈林荣副市长视察无锡商贸中心工地无锡八佰伴称赞这个工地现场管理好进度快7月公司承建的金川公司多功能厅造矿厂尾矿车间浓密池被评为甘肃省优质样板工程",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1994年8月18日公司承建的中国水泥厂2000吨熟料生产线技改工程开工典礼举行江苏省副省长王荣南京市委书记顾浩出席并为工程奠基",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1995年11月3日13日公司对质量体系实施情况进行内部审核12月中旬北京ISO9000认证中心专家对公司进行模拟审核顺利通过了北京ISO9000质量认证中心的质量体系认证成为建筑行业首批获取9000认证的企业",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1995年12月公司被评为江苏省建筑业最佳企业江苏省建设系统19941995年文明建设先进单位南京市19941995年文明单位",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1995年12月17日中建总公司总经理马挺贵到公司视察工作并为公司题词创辉煌业绩争同行第一广招人才发展科技再铸辉煌争创第一",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "1995年4月26日公司施工的南京禄口新机场航站楼地下室提前2天完工工期共计79天创造了用最短的工期完成华东地区最大地下室的奇迹新机场建设指挥部向南京公司颁发奖金20万元",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "1999年公司承建的甘肃金川有色金属公司综合办公楼荣获和两项奖项",
        "TYPE": "多选题",
        "A": "甘肃省飞天奖",
        "B": "江苏省扬子杯",
        "C": "南京市金陵杯",
        "D": "上海市白玉兰奖"
    },
    {
        "ANS": "A",
        "Q": "2001年公司中标承建了航天工程这是公司承接的第二个航天基地工程",
        "TYPE": "单选题",
        "A": "太原卫星发射中心35厂房",
        "B": "西昌卫星发射中心",
        "C": "酒泉卫星发射中心总装测试厂房",
        "D": "文昌卫星发射中心"
    },
    {
        "ANS": "A",
        "Q": "2002年公司中标建筑面积14万平方米是公司承接的特大型体育设施工程",
        "TYPE": "单选题",
        "A": "南京奥林匹克体育中心主体育场工程",
        "B": "苏州奥体中心",
        "C": "滁州奥体中心",
        "D": "蚌埠体育中心"
    },
    {
        "ANS": "A",
        "Q": "2002年4月撤销南京公司南京及其周边地区项目归公司直接管辖实现公司扁平化管理",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "2002年6月公司中标的是公司当年承揽的最大标的258亿元人民币工程",
        "TYPE": "单选题",
        "A": "唐家沱污水处理厂",
        "B": "江心洲污水处理厂",
        "C": "大厂污水处理厂",
        "D": "江北新区污水处理厂"
    },
    {
        "ANS": "A",
        "Q": "2002年7月30日中建总公司总经理孙文杰一行在中建八局局长梁新向等的陪同下来到公司施工的山西太原卫星发射中心厂房建设工地进行慰问孙文杰勉励大家八局是由基建工程兵改编的企业在巴丹吉林沙漠优质高速建成的火箭垂直总装测试厂房为神舟飞船的胜利腾飞做出了贡献今天又在为中华建造射天之箭其创造之功彪炳千秋希望你们发扬大漠精神和解放军的光荣传统把这个工程建成名留青史的精品工程",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "2007年5月公司中标公路土建工程施工项目第3B合同段该工程工程总造价334亿元时为八局承建的最长的高速公路该项目的承接标志着公司结构调整进入基础设施领域取得了突破性的进展",
        "TYPE": "单选题",
        "A": "湖南省衡绍高速",
        "B": "湖南省衡湘高速",
        "C": "湖南省苏绍高速",
        "D": "湖南省衡宗高速"
    },
    {
        "ANS": "D",
        "Q": "2008年公司承建的中国矿业大学信息管理学院江苏连徐高速超市荣获",
        "TYPE": "单选题",
        "A": "东方杯",
        "B": "浦江杯",
        "C": "鲁班奖",
        "D": "扬子杯"
    },
    {
        "ANS": "B",
        "Q": "2009年10月18日公司承建的开工地下3层地上57层将公司承建制高点刷新至24210米",
        "TYPE": "单选题",
        "A": "平安幸福中心",
        "B": "南京新金陵饭店",
        "C": "江苏大剧院",
        "D": "酒泉卫星发射中心总装测试厂房"
    },
    {
        "ANS": "A",
        "Q": "2009年4月1日南京南站站房工程开工工程于2011年8月20日竣工",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "2010年10月公司承建的相城水厂一期工程被评为国家市政金杯奖",
        "TYPE": "单选题",
        "A": "上海",
        "B": "南京",
        "C": "无锡",
        "D": "苏州"
    },
    {
        "ANS": "A",
        "Q": "2010年3月3日公司基础设施事业部更名为",
        "TYPE": "单选题",
        "A": "基础设施公司",
        "B": "基础公司",
        "C": "基础分公司",
        "D": "基础预应力公司"
    },
    {
        "ANS": "B",
        "Q": "2010年7月公司被江苏省纪委江苏省委宣传部联合授予",
        "TYPE": "单选题",
        "A": "江苏省文明单位",
        "B": "江苏省廉政文化示范点",
        "C": "江苏省宣传先进单位",
        "D": "江苏省纪检先进单位"
    },
    {
        "ANS": "A",
        "Q": "2012年4月2日李国被中华全国总工会授予",
        "TYPE": "单选题",
        "A": "全国五一劳动奖章",
        "B": "生产系统先进个人",
        "C": "江苏省五一劳动奖章",
        "D": "安康杯优胜个人"
    },
    {
        "ANS": "A",
        "Q": "2014年10月公司承建的被评为国家改革开放三十五周年百项经典精品工程",
        "TYPE": "单选题",
        "A": "中国载人航天发射工程",
        "B": "南京奥林匹克体育中心主体育场工程",
        "C": "苏州奥体中心",
        "D": "滁州奥体中心"
    },
    {
        "ANS": "D",
        "Q": "2014年11月18日国际奥委会主席巴赫视察了公司承建的项目",
        "TYPE": "单选题",
        "A": "南京奥林匹克体育中心主体育场工程",
        "B": "苏州奥体中心",
        "C": "滁州奥体中心",
        "D": "青奥村项目"
    },
    {
        "ANS": "B",
        "Q": "2014年12月公司承建的重庆轨道三号线红旗河沟车站及区间隧道工程荣获重庆市市政工程金杯奖该工程在同类工程中为属于特大断面超浅埋隧道",
        "TYPE": "单选题",
        "A": "中国第一",
        "B": "亚洲第一",
        "C": "亚洲第三",
        "D": "世界第三"
    },
    {
        "ANS": "D",
        "Q": "2014年8月开幕的南京青年奥林匹克运动会是中国首次举办的青奥会22项青奥重大工程中公司承建了项",
        "TYPE": "单选题",
        "A": "3",
        "B": "5",
        "C": "7",
        "D": "9"
    },
    {
        "ANS": "A",
        "Q": "2015年公司再次进入中建号码公司十强之列",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "2015年11月公司被中国建筑业协会授予和称号",
        "TYPE": "多选题",
        "A": "全国竞争力百强企业",
        "B": "全国建筑业AAA级信用企业",
        "C": "江苏省竞争力百强企业",
        "D": "江苏省安康杯优胜企业"
    },
    {
        "ANS": "C",
        "Q": "2015年9月16日公司总部乔迁至办公",
        "TYPE": "单选题",
        "A": "尧化门大院",
        "B": "江北新区",
        "C": "仙林文澜路6号中建大厦",
        "D": "南部新城"
    },
    {
        "ANS": "D",
        "Q": "2017年11月公司以南京市第一顺位被中央文明委授予荣誉该奖项是物质文明政治文明精神文明建设综合性评价的国家级最高荣誉称号",
        "TYPE": "单选题",
        "A": "全国保障性安居工程建设劳动竞赛先进单位",
        "B": "江苏省竞争力百强企业",
        "C": "江苏省安康杯优胜企业",
        "D": "全国文明单位"
    },
    {
        "ANS": "B",
        "Q": "2019年公司在文化领域再获殊荣荣获称号",
        "TYPE": "单选题",
        "A": "全国企业文化建设先进单位",
        "B": "新中国70年企业文化建设优秀单位",
        "C": "全国企业文化优秀单位",
        "D": "全国先进文化企业"
    },
    {
        "ANS": "D",
        "Q": "2020年以来面对突发疫情公司全力以赴参与全国个集中隔离点和方舱医院等应急设施建设累计建设隔离病房近2万间方舱隔离床位22万个",
        "TYPE": "单选题",
        "A": "22",
        "B": "24",
        "C": "26",
        "D": "27"
    },
    {
        "ANS": "A",
        "Q": "2021年公司项目荣获詹天佑优秀住宅小区金奖",
        "TYPE": "单选题",
        "A": "北京魏公村佳苑项目",
        "B": "汇杰文庭项目",
        "C": "北京安立路一号项目",
        "D": "青白江项目"
    },
    {
        "ANS": "ABCDE",
        "Q": "2021年公司建设工程入选南京市十三五十大优秀公共建筑工程",
        "TYPE": "多选题",
        "A": "江苏大剧院",
        "B": "南京市公共卫生医疗中心",
        "C": "溧水区市民中心",
        "D": "国际青年文化中心",
        "E": "侵华日军南京大屠杀遇难同胞纪念馆三期"
    },
    {
        "ANS": "A",
        "Q": "2021年公司建设的江苏大剧院国际青年文化中心南京市公共卫生医疗中心溧水区市民中心侵华日军南京大屠杀遇难同胞纪念馆三期五大工程入选南京市十三五十大优秀公共建筑工程",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "2021年5月公司智能装配造桥机10在项目成功运行",
        "TYPE": "单选题",
        "A": "宁洛高速",
        "B": "盐洛高速",
        "C": "绍兴越东路北延智慧快速路项目",
        "D": "宁连高速"
    },
    {
        "ANS": "B",
        "Q": "2021年5月公司智能装配造桥机10在盐洛高速项目成功运行",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "2021年两岸企业家峰会于2021年12月7日在公司承建的扬子江国际会议中心举办",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "2021年夏为应对突发的新冠疫情三公司130小时在南京建成座消杀站",
        "TYPE": "单选题",
        "A": "3",
        "B": "4",
        "C": "7",
        "D": "9"
    },
    {
        "ANS": "D",
        "Q": "2022年公司荣获该奖项为南京市人民政府设立的最高质量荣誉",
        "TYPE": "单选题",
        "A": "南京市质量先进企业",
        "B": "南京市优质施工企业",
        "C": "南京市金质奖",
        "D": "南京市市长质量奖"
    },
    {
        "ANS": "B",
        "Q": "2022年公司荣获江苏省建筑百强企业总承包类第五名",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "2022年公司在中斩获中建集团唯一金奖",
        "TYPE": "单选题",
        "A": "振兴杯全国青年职业技能大赛",
        "B": "安康杯竞赛",
        "C": "创新创效大赛",
        "D": "科技创新大赛"
    },
    {
        "ANS": "A",
        "Q": "2022年公司在企业社会责任领域再获殊荣代表八局荣获",
        "TYPE": "单选题",
        "A": "企业社会责任中国榜ESG竞争力永续发展企业",
        "B": "企业社会责任榜",
        "C": "企业社会责任优秀案例",
        "D": "ESG优秀案例"
    },
    {
        "ANS": "B",
        "Q": "2022年11月公司智能装配造桥机20在项目成功运行",
        "TYPE": "单选题",
        "A": "宁洛高速",
        "B": "盐洛高速项目宿城至泗洪段",
        "C": "绍兴越东路北延智慧快速路项目",
        "D": "宁连高速"
    },
    {
        "ANS": "A",
        "Q": "2022年8月10日中建集团党组书记董事长郑学选来三公司调研时指出八局的开拓精神最能在八局三身上体现对此我有两个印象深刻的地方一是新的八局三经过一轮磨砺又发展壮大了起来八局三百折不挠求变图强的开拓精神和韧性让人钦佩二是承建阿尔及利亚松树俱乐部喜来登大酒店这个项目是中国公司在海外第一个总承包的五星级酒店工程承建方八局三和安装能打硬仗攻坚克难仅用1年零8个月时间完成了施工任务",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "2023版采购管理手册要求公司所有的EPC项目部分专业板块全部由公司采购管理部统一负责采购公司采购管理部负责牵头组织分公司和项目部需全力配合这四个专业板块是出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "金属屋面工程",
        "B": "体育工艺工程",
        "C": "医疗专项工程",
        "D": "学校专项工程",
        "E": "航站楼工程"
    },
    {
        "ANS": "B",
        "Q": "2023年公司荣获2022年度江苏省建筑百强企业总承包类第名",
        "TYPE": "单选题",
        "A": "二",
        "B": "三",
        "C": "五",
        "D": "六"
    },
    {
        "ANS": "C",
        "Q": "2023年9月23日公司在南京举行中建八局第三建设有限公司成立周年庆典仪式",
        "TYPE": "单选题",
        "A": "20",
        "B": "25",
        "C": "40",
        "D": "35"
    },
    {
        "ANS": "A",
        "Q": "2023年管理要求从招标发起到合同签订完成全链条总用时不高于40天力争天内出题来源采购管理部2023年工作会行政工作报告",
        "TYPE": "单选题",
        "A": "35天",
        "B": "36天",
        "C": "37天",
        "D": "38天"
    },
    {
        "ANS": "A",
        "Q": "2023年要不断压缩采购全过程时间不同项目业态要采取针对性招标方案和招标流程确保从招标发起至合同签订平均用时控制在40天以内力争35天以内出题来源采购管理部2023年工作会行政工作报告",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "2023年要抓好集采成果落地各单位加强过程中监督力度物资要扎实做好验收工作确保集采物资样品与送货质量无偏差不合格品100退场出题来源采购管理部2023年工作会行政工作报告",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "2024年公司的年度发展主题词是",
        "TYPE": "多选题",
        "A": "夯基提质",
        "B": "担当奋进",
        "C": "实干奋斗争先",
        "D": "砥砺前行"
    },
    {
        "ANS": "A",
        "Q": "Ⅱ类项目按照潜亏金额大小分别划分为ABC三个风险等级其中A级为潜亏金额亿元土建项目",
        "TYPE": "单选题",
        "A": "05",
        "B": "06",
        "C": "02",
        "D": "1"
    },
    {
        "ANS": "D",
        "Q": "Ⅲ类项目为工程计量确权率小于自施利润率为值的项目",
        "TYPE": "单选题",
        "A": "100负",
        "B": "102正",
        "C": "105负",
        "D": "100正"
    },
    {
        "ANS": "BCD",
        "Q": "EPC项目采购如何拓展盈利空间",
        "TYPE": "多选题",
        "A": "减少隐蔽验收采购",
        "B": "推行概算定成本",
        "C": "加快推进自主采购",
        "D": "建立组价模型"
    },
    {
        "ANS": "A",
        "Q": "EPC项目采购经理配置出题来源采购管理部人力资源管理手册",
        "TYPE": "单选题",
        "A": "最多1人项目",
        "B": "不少于2人",
        "C": "不少于1人项目",
        "D": "不少于3人"
    },
    {
        "ANS": "A",
        "Q": "EPC项目采购中下面哪项不是拓展盈利空间的方法",
        "TYPE": "单选题",
        "A": "减少隐蔽验收采购",
        "B": "推行概算定成本",
        "C": "加快推进自主采购",
        "D": "建立组价模型"
    },
    {
        "ANS": "A",
        "Q": "EPC项目的设计策划目标为优化设计效益率EPC",
        "TYPE": "单选题",
        "A": "5",
        "B": "3",
        "C": "2",
        "D": "10"
    },
    {
        "ANS": "ABCDE",
        "Q": "GTJ2021筏板基础遇到什么构件会进行扣减",
        "TYPE": "多选题",
        "A": "独立基础",
        "B": "承台",
        "C": "柱墩",
        "D": "承台梁",
        "E": "条基"
    },
    {
        "ANS": "A",
        "Q": "I类潜亏项目指或标价差率为负的项目",
        "TYPE": "单选题",
        "A": "初始预计总毛利率",
        "B": "预计总毛利率",
        "C": "总毛利率",
        "D": "实际毛利率"
    },
    {
        "ANS": "A",
        "Q": "KL2的净跨长为7200mm梁截面尺寸为300700箍筋的集中标注为101002002一级抗震求箍筋的非加密区长度",
        "TYPE": "单选题",
        "A": "4400",
        "B": "4300",
        "C": "4200",
        "D": "D2800"
    },
    {
        "ANS": "D",
        "Q": "KZ边角柱柱顶等截面伸出构造中当柱伸出长度从梁顶算起满足直锚长度lae柱内外侧钢筋如何处理",
        "TYPE": "单选题",
        "A": "伸至柱顶弯折12d",
        "B": "伸至柱顶加锚头锚板",
        "C": "伸至柱顶弯折15d",
        "D": "伸至柱顶截断"
    },
    {
        "ANS": "B",
        "Q": "KZ边角柱柱顶等截面伸出构造中针对柱纵筋计算以下说法不正确的是",
        "TYPE": "单选题",
        "A": "伸出长度满足lae时纵筋伸到柱顶",
        "B": "伸出长度不满足lae时纵筋伸到柱顶弯折15d",
        "C": "伸出长度不满足lae时外侧纵筋伸到柱顶弯折15d",
        "D": "伸出长度不满足lae时内侧纵筋伸到柱顶弯折12d"
    },
    {
        "ANS": "B",
        "Q": "KZ边角柱柱顶等截面伸出构造中针对柱纵筋计算以下说法正确的是",
        "TYPE": "单选题",
        "A": "当柱顶突出屋面的长度04lae时柱纵筋伸至柱顶截断",
        "B": "当柱顶突出屋面的长度lae时柱纵筋伸至柱顶截断",
        "C": "当柱顶突出屋面的长度lae时柱内外侧钢筋均伸至柱顶弯折12d",
        "D": "当柱顶突出屋面的长度lae时柱外侧钢筋伸至柱顶弯折12d内侧钢筋伸至柱顶弯折12d"
    },
    {
        "ANS": "B",
        "Q": "WDZCYJV表示电缆的型号出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "铝芯交联电缆",
        "B": "低烟无卤铜芯交联电缆",
        "C": "耐火交联电力电缆",
        "D": "耐火低烟无卤电力电缆"
    },
    {
        "ANS": "ABD",
        "Q": "WKL下通筋端支座钢筋构造不包含下列哪种情况",
        "TYPE": "多选题",
        "A": "当hcbhclae时直锚锚固长度为lae",
        "B": "当hcbhclae时直锚锚固长度为05hc5d",
        "C": "当hcbhclae时弯锚钢筋伸至梁上部纵筋弯钩段内侧弯折15d",
        "D": "当hcbhclae时弯锚钢筋伸至梁上部纵筋弯钩段内侧弯折至梁顶"
    },
    {
        "ANS": "D",
        "Q": "Y系列电动机型号表示由六个部分组成包括产品代号机座中心高度机座长度代号铁芯长度代号及",
        "TYPE": "单选题",
        "A": "极数额定功率",
        "B": "极数电动机容量",
        "C": "环境代号电动机容量",
        "D": "环境代号极数"
    },
    {
        "ANS": "ABCD",
        "Q": "安全文明施工措施费包括哪些内容",
        "TYPE": "多选题",
        "A": "承包人对安全文明施工费应专款专用在财务账目中应单独列项备查不得挪作他用否则发包人有权要求其限期改正逾期未改正的造成的损失和延误的工期应由承包人承担",
        "B": "楼梯口电梯口通道口预留洞口阳台周边楼层周边屋面周边基坑周边卸料平台两侧以及上下通道等临边安全防护设施",
        "C": "安全标志标牌及安全宣传栏",
        "D": "符合规范要求的临时用电系统标准化电箱电器保护装置电源线路的敷设外电防护措施等",
        "E": "外脚手架结构模板的支撑杆件"
    },
    {
        "ANS": "ABC",
        "Q": "安全文明施工措施项目的工作内容中包括",
        "TYPE": "多选题",
        "A": "生活垃圾清理外运",
        "B": "现场防扰民措施",
        "C": "现场操作场地硬化",
        "D": "大口径管道内施工时的通风措施"
    },
    {
        "ANS": "A",
        "Q": "安全文明施工费由承担不得以任何形式扣减该部分费用",
        "TYPE": "单选题",
        "A": "发包人",
        "B": "承包人",
        "C": "监理人",
        "D": "个人"
    },
    {
        "ANS": "BD",
        "Q": "安装工程工程量是根据按照有关工程量计算规则计算得到的",
        "TYPE": "多选题",
        "A": "工程量清单",
        "B": "审定的工程图纸",
        "C": "工程图纸",
        "D": "施工组织设计"
    },
    {
        "ANS": "AD",
        "Q": "按出水口形式划分室内消火栓可分为",
        "TYPE": "多选题",
        "A": "单出口室内消火栓",
        "B": "单栓阀室内消火栓",
        "C": "旋转型室内消火栓",
        "D": "双出口室内消火栓"
    },
    {
        "ANS": "ABCD",
        "Q": "按定额的编制程序和用途分类可以把工程定额划分为",
        "TYPE": "多选题",
        "A": "施工定额",
        "B": "预算定额",
        "C": "概算定额",
        "D": "概算指标",
        "E": "行业定额"
    },
    {
        "ANS": "D",
        "Q": "按费用构成要素划分建筑安装工程费下列费用不属于劳动保险和职工福利费范围的是",
        "TYPE": "单选题",
        "A": "职工退职金",
        "B": "冬季取暖补贴",
        "C": "夏季防暑降温费用",
        "D": "防暑降温饮料费用"
    },
    {
        "ANS": "ABC",
        "Q": "按设计图示尺寸以钢材重量计算不扣除孔眼切边切肢的重量焊条铆钉螺栓等重量不另增加的金属结构工程有",
        "TYPE": "多选题",
        "A": "钢屋架钢网架",
        "B": "钢托架钢桁架",
        "C": "钢柱钢梁",
        "D": "压型钢板楼板墙板",
        "E": "金属网"
    },
    {
        "ANS": "ABCD",
        "Q": "按水平投影面积的一半计算建筑面积的有",
        "TYPE": "多选题",
        "A": "独立柱的雨蓬",
        "B": "无围护结构凹阳台",
        "C": "挑阳台",
        "D": "室外楼梯",
        "E": "地面抹灰"
    },
    {
        "ANS": "B",
        "Q": "按照通用安装工程工程量计算规范GB508562013的规定气体灭火系统中的贮存装置安装项目包括存储器驱动气瓶支框架减压装置压力指示仪等安装但不包括",
        "TYPE": "单选题",
        "A": "集流阀",
        "B": "选择阀",
        "C": "容器阀",
        "D": "单向阀"
    },
    {
        "ANS": "D",
        "Q": "按照通用安装工程工程量计算规范GB508562013的规定消防安装计量单位正确的为",
        "TYPE": "单选题",
        "A": "末端试水装置按规格组装形式按设计图示数量以套计算",
        "B": "灭火器按型号和规格按设计图示数量以只计算",
        "C": "消防水泵接合器按安装部位型号和规格按设计图示数量以组计算",
        "D": "泡沫发生器泡沫比例混合器泡沫液贮罐按设计图示数量以台计算"
    },
    {
        "ANS": "BCD",
        "Q": "按照传热方式的不同过热器可分为",
        "TYPE": "多选题",
        "A": "高温对流过热器",
        "B": "低温对流过热器",
        "C": "屏式过热器",
        "D": "高温辐射过热器"
    },
    {
        "ANS": "B",
        "Q": "按照气体灭火系统中储存装置的安装要求下列选项表述正确的是",
        "TYPE": "单选题",
        "A": "容器阀和集流管之间应采用镀锌钢管连接",
        "B": "储存装置的布置应便于操作维修操作面距墙面不宜小于10m且不小于储存容器外径15倍",
        "C": "在储存容器上不得设置安全阀",
        "D": "当保护对象是可燃液体时喷头射流方向应朝向液体表面"
    },
    {
        "ANS": "ABCE",
        "Q": "按照用途的不同建设工程造价指标可分为",
        "TYPE": "多选题",
        "A": "工料价格指标",
        "B": "工程经济指标",
        "C": "工程量指标",
        "D": "单位工程造价指标",
        "E": "消耗量指标"
    },
    {
        "ANS": "CDE",
        "Q": "按照造价形成属于措施项目费的有",
        "TYPE": "多选题",
        "A": "工程排污费",
        "B": "检验试验费",
        "C": "大型机械设备进出场及安拆费",
        "D": "施工排水降水费",
        "E": "安全施工费"
    },
    {
        "ANS": "B",
        "Q": "暗挖土方的项目特征不考虑运距",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "板带中用b表示",
        "TYPE": "单选题",
        "A": "板带厚",
        "B": "板带宽",
        "C": "板带长",
        "D": "板带高"
    },
    {
        "ANS": "ABCD",
        "Q": "板的纵筋表示正确的有",
        "TYPE": "多选题",
        "A": "BXC10100YC10120",
        "B": "TXC10100YC10120",
        "C": "BTXC10100YC10120",
        "D": "BTXYC10100"
    },
    {
        "ANS": "ABCD",
        "Q": "板的纵筋分为",
        "TYPE": "多选题",
        "A": "上部贯通纵筋",
        "B": "下部纵筋",
        "C": "X向纵筋",
        "D": "Y向纵筋"
    },
    {
        "ANS": "D",
        "Q": "板端部支座为梁时下部贯通筋在端支座处的构造为",
        "TYPE": "单选题",
        "A": "伸至梁边弯折15d",
        "B": "伸入梁内h",
        "C": "伸入梁内max12d梁宽2",
        "D": "伸入梁内max5d梁宽2"
    },
    {
        "ANS": "ABCD",
        "Q": "板块集中标注内容包含",
        "TYPE": "多选题",
        "A": "编号",
        "B": "贯通筋",
        "C": "板厚",
        "D": "板面标高高差"
    },
    {
        "ANS": "ACD",
        "Q": "板类型包含",
        "TYPE": "多选题",
        "A": "LB",
        "B": "YXB",
        "C": "XB",
        "D": "WB"
    },
    {
        "ANS": "C",
        "Q": "板在端部支座为剪力墙中间层时下部钢筋伸入支座的长度为",
        "TYPE": "单选题",
        "A": "10d",
        "B": "支座宽25d",
        "C": "Max支座宽25d",
        "D": "5d"
    },
    {
        "ANS": "C",
        "Q": "板支座负筋的起步距离为",
        "TYPE": "单选题",
        "A": "50mm",
        "B": "s",
        "C": "s2",
        "D": "100mm"
    },
    {
        "ANS": "ABC",
        "Q": "板支座原位标注包含内容为",
        "TYPE": "多选题",
        "A": "钢筋编号",
        "B": "配筋信息",
        "C": "连续布置的跨数",
        "D": "布置长度"
    },
    {
        "ANS": "C",
        "Q": "包工包料工程的预付款按合同约定拨付原则上预付比例",
        "TYPE": "单选题",
        "A": "为合同金额的25",
        "B": "不高于工程价款的60",
        "C": "不低于合同金额的10不高于合同金额的30",
        "D": "不低于金额的15不高于合同金额的30"
    },
    {
        "ANS": "A",
        "Q": "包工包料工程的预付款的支付比例不得低于签约合同价的比例和不宜高于签约合同价的比例分别是",
        "TYPE": "单选题",
        "A": "1030",
        "B": "1530",
        "C": "2050",
        "D": "3050"
    },
    {
        "ANS": "A",
        "Q": "保障制度落实完善海外管运分离高效运行机制健全海外制度建设体系建设",
        "TYPE": "单选题",
        "A": "海外优先",
        "B": "保障海外",
        "C": "内抓外学",
        "D": "内外一体"
    },
    {
        "ANS": "A",
        "Q": "被本单位标记不良行为的分供方一律不予通过资审出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "被南京军区党委授予抗洪抢险英雄称号追记一等功批准为烈士的是",
        "TYPE": "单选题",
        "A": "杨太平",
        "B": "闫学义",
        "C": "杨广义",
        "D": "邹成平"
    },
    {
        "ANS": "B",
        "Q": "被其他工程局标记不良行为的分供方一律不予通过资审出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "本人提出项目人员风险金返还审批表申请由分公司总会计师负责核算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "边坡土钉支护工程量应按",
        "TYPE": "单选题",
        "A": "设计图示尺寸以支护面积计算",
        "B": "设计土钉数量以根数计算",
        "C": "设计土钉数量以质量计算",
        "D": "设计支护面积X土钉长度以体积计算"
    },
    {
        "ANS": "ABCE",
        "Q": "编制分部分项工程量清单时应依据",
        "TYPE": "多选题",
        "A": "建设工程工程量清单计价规范",
        "B": "建设项目招标文件",
        "C": "建设项目设计文件",
        "D": "建设项目可行性研究报告",
        "E": "拟采用的施工组织设计和施工技术方案"
    },
    {
        "ANS": "ABCD",
        "Q": "编制工程计价总说明应按下列那些内容填写",
        "TYPE": "多选题",
        "A": "承包人工期延误后的价格调整",
        "B": "自然地理条件",
        "C": "编制依据",
        "D": "施工现场及变化情况",
        "E": "业主资信情况"
    },
    {
        "ANS": "ABCD",
        "Q": "编制工程计价总说明应按下列那些内容填写",
        "TYPE": "多选题",
        "A": "工程特点",
        "B": "自然地理条件",
        "C": "编制依据",
        "D": "施工现场及变化情况",
        "E": "业主资信情况"
    },
    {
        "ANS": "D",
        "Q": "编制工程量清单时下列费用属于总承包服务费考虑范围的是",
        "TYPE": "单选题",
        "A": "总包人对专业工程的投标费",
        "B": "承包人自行采购工程设备的保护费",
        "C": "p承包人施工现场的管理费p",
        "D": "p总包人施工现场的管理费p"
    },
    {
        "ANS": "D",
        "Q": "编制基本直接费单价时不包括",
        "TYPE": "单选题",
        "A": "人工费",
        "B": "材料费",
        "C": "机械台班使用费",
        "D": "临时设施费"
    },
    {
        "ANS": "B",
        "Q": "编制结算初稿及成本分析在工程交竣工验收申请提交之前根据施工合同及相关文件编制交竣工结算初稿项目商务经理牵头组织项目相关人员核定项目交竣工成本",
        "TYPE": "单选题",
        "A": "14天",
        "B": "28天",
        "C": "30天",
        "D": "60天"
    },
    {
        "ANS": "B",
        "Q": "编制依法必须进行招标的项目的资格预审文件和招标文件应当使用会同有关行政监督部门制定的标准文本",
        "TYPE": "单选题",
        "A": "商务部门",
        "B": "国务院发展改革部门",
        "C": "住房城乡建设部门",
        "D": "行政管理机构"
    },
    {
        "ANS": "ABD",
        "Q": "编制议标文件的管理要求",
        "TYPE": "多选题",
        "A": "议标文件的编制应使用公司示范文本如有修改需对差异化部分单独摘录描述",
        "B": "招标项目须在经评审的招采总计划范围内物资和园林绿化类标的物的数量和技术要求必须与经审批的物资需求计划相同",
        "C": "根据审批权限对评定标报告进行审批",
        "D": "工程总分包招标需在招标文件中要求投标单位提供委托人拟任项目主要负责人社保缴纳证明",
        "E": "向中标单位发送中标通知"
    },
    {
        "ANS": "C",
        "Q": "变截面墙中的水平分布钢筋不能贯通时需伸至对边纵筋内侧弯折",
        "TYPE": "单选题",
        "A": "10d",
        "B": "12d",
        "C": "15d",
        "D": "20d"
    },
    {
        "ANS": "D",
        "Q": "标价差率中标利润率",
        "TYPE": "单选题",
        "A": "标价差率中标利润率合同额计划成本合同额",
        "B": "标价差率中标利润率合同额责任成本成本合同额",
        "C": "标价差率中标利润率合同额标准成本标准成本",
        "D": "标价差率中标利润率合同额标准成本合同额"
    },
    {
        "ANS": "A",
        "Q": "标价分离是按照一定方法将中标价合同价与实现分离的过程标是指自行完成部分的中标价合同价价是指",
        "TYPE": "单选题",
        "A": "标准成本",
        "B": "责任成本",
        "C": "预计总成本",
        "D": "实际成本"
    },
    {
        "ANS": "D",
        "Q": "标价分离是指",
        "TYPE": "单选题",
        "A": "指按照一定方法将中标价与标准成本实现分离的过程标是指自行完成部分的中标价不含税合同价价是指标准成本",
        "B": "指按照一定方法将中标价不含税合同价与实际成本实现分离的过程标是指自行完成部分的中标价不含税合同价价是指标准成本",
        "C": "指按照一定方法将中标价不含税合同价与标准成本实现分离的过程标是指自行完成部分的中标价不含税合同价价是指实际成本",
        "D": "指按照一定方法将中标价不含税合同价与标准成本实现分离的过程标是指自行完成部分的中标价不含税合同价价是指标准成本"
    },
    {
        "ANS": "B",
        "Q": "标准成本是指",
        "TYPE": "单选题",
        "A": "指在既定的市场环境下根据企业管理水平按企业费用支出标准资源市场价格信息和工程实际情况测算的项目各项费用支出总额",
        "B": "指在既定的市场环境下根据企业管理水平和管理特点按企业费用支出标准资源市场价格信息和工程实际情况测算的项目各项费用支出总额",
        "C": "指在既定的市场环境下根据企业管理水平和管理特点按市场费用支出标准价格信息和工程实际情况测算的项目各项费用支出总额",
        "D": "指在既定的市场环境下按企业费用支出标准资源市场价格信息和工程实际情况测算的项目各项费用支出总额"
    },
    {
        "ANS": "A",
        "Q": "玻璃隔断按设计图示框以面积计算单个03m2的孔洞所占面积",
        "TYPE": "单选题",
        "A": "外围尺寸不扣除",
        "B": "外围尺寸扣除",
        "C": "轴线尺寸不扣除",
        "D": "轴线尺寸扣除"
    },
    {
        "ANS": "ACE",
        "Q": "不得在下列墙体或部位设置脚手眼",
        "TYPE": "多选题",
        "A": "梁垫下及其左右500mm范围内",
        "B": "门窗洞口两侧石砌体400mm范围内",
        "C": "夹心复合墙外叶墙",
        "D": "宽度小于12m的窗间墙",
        "E": "附墙柱"
    },
    {
        "ANS": "B",
        "Q": "不断优化融资结构大力发展直接融资持续提供更加优质高效的金融服务持续提升水平降低企业融资成本",
        "TYPE": "单选题",
        "A": "两规划",
        "B": "三集中",
        "C": "四集中",
        "D": "五筹划"
    },
    {
        "ANS": "A",
        "Q": "不计入人工单价的费用是",
        "TYPE": "单选题",
        "A": "劳动保险费",
        "B": "职工福利费",
        "C": "劳动保护费",
        "D": "工资性津贴"
    },
    {
        "ANS": "A",
        "Q": "不计算建筑面积的有",
        "TYPE": "单选题",
        "A": "舞台及后台悬挂的幕布布景天桥挑台",
        "B": "独立柱雨蓬",
        "C": "两个建筑物间有顶盖的架空通廊",
        "D": "建筑物内的门厅大厅"
    },
    {
        "ANS": "B",
        "Q": "不可抗力解除后复工的若不能按期交工发包人可以要求赶工承包人应采取必要的赶工措施并承担相应费用",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "不满足竞争性谈判采购方式要求与单一的分供方谈判确定报价及相关合同条款的采购方式是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "单一来源采购",
        "B": "邀请招标",
        "C": "询价采购",
        "D": "竞争性谈判"
    },
    {
        "ANS": "B",
        "Q": "不属于16G平法规范中的柱编号是",
        "TYPE": "单选题",
        "A": "KZ",
        "B": "TZ",
        "C": "ZHZ",
        "D": "XZ"
    },
    {
        "ANS": "D",
        "Q": "不属于采购人员主要应对风险的是哪项出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "采购计划风险",
        "B": "成本控制风险",
        "C": "廉洁管控风险",
        "D": "业主违约风险"
    },
    {
        "ANS": "A",
        "Q": "不同投标单位的投标报价呈明显比例或梯队可以认定为围标串标出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "材料采购加工的成交形式中一手付钱一手取货银货两讫的成交形式属于出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "订货形式",
        "B": "提货形式",
        "C": "现货现购",
        "D": "加工形式"
    },
    {
        "ANS": "C",
        "Q": "材料采购批量与保管费用成关系与采购费用成关系出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "反比例正比例",
        "B": "反比例反比例",
        "C": "正比例反比例",
        "D": "正比例正比例"
    },
    {
        "ANS": "A",
        "Q": "材料采购批量指的是一次采购材料的出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "数量",
        "B": "质量",
        "C": "可完成的工作量",
        "D": "占用资金量"
    },
    {
        "ANS": "A",
        "Q": "材料二次搬运费属于定额直接费",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABDE",
        "Q": "材料计划在实施过程中常受到干扰的因素有",
        "TYPE": "多选题",
        "A": "施工任务的改变",
        "B": "设计变更",
        "C": "领导意志",
        "D": "采购情况变化",
        "E": "施工进度变化"
    },
    {
        "ANS": "C",
        "Q": "材料生产销售运输管理方法属于材料采购信息中的出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "供应信息",
        "B": "市场信息",
        "C": "政策信息",
        "D": "价格信息"
    },
    {
        "ANS": "B",
        "Q": "采购策划不全面风险点亏损点利润点辨识不全导致的结果是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "影响现金流",
        "B": "影响工期效益",
        "C": "影响质量",
        "D": "造成安全事故"
    },
    {
        "ANS": "AC",
        "Q": "采购策划的目标是采购成本降低率采购效益率",
        "TYPE": "多选题",
        "A": "05",
        "B": "1",
        "C": "8",
        "D": "85"
    },
    {
        "ANS": "A",
        "Q": "采购策划对风险点亏损点赢利点进行辨识出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "采购策划对什么方面进行辨识出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "风险点",
        "B": "亏损点",
        "C": "盈利点",
        "D": "有益点",
        "E": "有弊点"
    },
    {
        "ANS": "ABD",
        "Q": "采购策划阶段主责部门应完成哪些策划工作",
        "TYPE": "多选题",
        "A": "分供采购与管理策划",
        "B": "物资设备消耗策划",
        "C": "合同谈判策划",
        "D": "设计策划",
        "E": "材料设备规格品牌策划"
    },
    {
        "ANS": "A",
        "Q": "采购成本降低率为采购成本降低额与标准成本金额的比值出题来源采购管理部局P报表",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCDE",
        "Q": "采购方式主要包括等出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "邀请招标",
        "B": "竞争性谈判",
        "C": "单一来源采购",
        "D": "询价采购",
        "E": "公开招标",
        "F": "MRO采购云筑电商"
    },
    {
        "ANS": "A",
        "Q": "采购方式主要有出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "公开招标邀请招标竞争性谈判采购单一来源采购询价采购",
        "B": "公开招标单一来源采购云筑电商采购邀请招标竞争性谈判采购",
        "C": "公开招标单一来源采购邀请招标竞争性谈判采购集中采购云筑电商采购",
        "D": "公开招标邀请招标集中采购询价采购竞争性谈判采购单一来源采购"
    },
    {
        "ANS": "B",
        "Q": "采购管理的三个领先是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "高效高质高速",
        "B": "效率效益品质",
        "C": "智慧化数字化规范化",
        "D": "集约化国际化品牌化"
    },
    {
        "ANS": "A",
        "Q": "采购管理廉洁从业履职准则三主动包括主动公开合法依规公平公正主动回避公私分明克己奉公主动作为规范操作坚守底线出题来源采购管理部中建八局采购管理廉洁从业准则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "采购管理人员签订廉洁从业承诺出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "单选题",
        "A": "98以上",
        "B": "95以上",
        "C": "100",
        "D": "90以上"
    },
    {
        "ANS": "C",
        "Q": "采购管理手册2023版中2000万元以上的砼及砼构件定标审批流应是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "分公司采购并审批",
        "B": "公司采购并审批",
        "C": "分公司采购公司审批"
    },
    {
        "ANS": "A",
        "Q": "采购管理手册2023版中2000万元以上的砼及砼构件资审审批流应是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "分公司采购并审批",
        "B": "公司采购并审批",
        "C": "分公司采购公司审批"
    },
    {
        "ANS": "A",
        "Q": "采购管理手册2023版中开标人一般设置出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "采购业务经理",
        "B": "项目经理",
        "C": "招采中心经理",
        "D": "总经济师"
    },
    {
        "ANS": "C",
        "Q": "采购管理手册2023版中项目采购策划的时间要求是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "中标后30日内",
        "B": "中标后60日内",
        "C": "开工后40日内",
        "D": "开工后60日内"
    },
    {
        "ANS": "BCDE",
        "Q": "采购管理手册的管理原则包括出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "盈利优先原则",
        "B": "公平公正原则",
        "C": "诚信履约原则",
        "D": "阳光高效原则",
        "E": "智慧采购原则"
    },
    {
        "ANS": "B",
        "Q": "采购管理手册中的诚信履约原则指的是坚持质量第一效益优先营造公平竞争的市场环境强化采购前置提升采购时效助力高效建造出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "采购管理手册中的分级管理原则指的是实行局总部公司总部二级单位项目部四级管控构建纵向分级横向分权的体系架构出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "采购管理手册中的公平公正原则指的是要做到机会公平过程公正结果公开尊重并保护相关方利益出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "采购管理手册中的阳光高效原则指的是必须遵守国家法律法规及企业规章制度恰当的行使权利诚信履约重视和维护八局企业品牌及合法权益出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "采购管理手册中的战略采购是公司总部及二级单位在战略合作层面上以框架协议的形式与国内或国际上知名的大型高端分供方建立的战略合作关系选择战略分供方与之签订框架协议的采购模式",
        "TYPE": "多选题",
        "A": "深层次",
        "B": "多维度",
        "C": "多角度",
        "D": "全方位",
        "E": "全过程"
    },
    {
        "ANS": "A",
        "Q": "采购管理手册中的智慧采购原则指的是全面推行电子招标电子评标电子签约实现采购管理大数据支撑网络化共享智能化协作出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "采购管理手册中所指二次结构劳务分包是包含砌筑工程的非主体结构工程劳务分包出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "采购管理文化的核心是出题来源采购管理部中建八局采购管理价值创造能力提升实施方案",
        "TYPE": "单选题",
        "A": "价值创造",
        "B": "创新驱动",
        "C": "智慧采购",
        "D": "诚信共赢"
    },
    {
        "ANS": "A",
        "Q": "采购管理文化的核心是价值创造出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "采购管理文化的核心是智慧采购出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACD",
        "Q": "采购管理原则中公平公正原则包括出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "机会公平",
        "B": "履约公开",
        "C": "过程公正",
        "D": "结果公开",
        "E": "结算公开"
    },
    {
        "ANS": "B",
        "Q": "采购管理展望是大数据共享网络化协作智能化支撑出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "采购管理展望是大数据支撑网络化共享智能化协作出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "采购管理展望是什么出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "大数据共享网络化支撑智能化协作",
        "B": "大数据共享网络化协作智能化支撑",
        "C": "大数据支撑网络化共享可视化协作",
        "D": "大数据支撑网络化共享智能化协作"
    },
    {
        "ANS": "ABCDEF",
        "Q": "采购管理主要应对的风险出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "采购计划风险",
        "B": "成本控制风险",
        "C": "合同履约风险",
        "D": "集中采购风险",
        "E": "制度体系风险",
        "F": "廉洁管理风险"
    },
    {
        "ANS": "B",
        "Q": "采购及保管费指为组织采购供应和保管材料工程设备的过程中所需要的各项费用不包括",
        "TYPE": "单选题",
        "A": "采购费",
        "B": "工艺设备费",
        "C": "工地保管费",
        "D": "仓储损耗"
    },
    {
        "ANS": "D",
        "Q": "采购计划按时进场率",
        "TYPE": "单选题",
        "A": "85",
        "B": "90",
        "C": "95",
        "D": "100"
    },
    {
        "ANS": "A",
        "Q": "采购效益率为收入总额与采购总额差值与收入总额比值出题来源采购管理部局P报表",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BCD",
        "Q": "采用碱性焊条焊接的主要优点有",
        "TYPE": "多选题",
        "A": "对铁锈不敏感",
        "B": "能有效清除焊缝金属中的硫",
        "C": "合金元素烧损少",
        "D": "脱氧较完全"
    },
    {
        "ANS": "B",
        "Q": "采用欺诈威协等手段订立的劳动合同为劳动合同",
        "TYPE": "单选题",
        "A": "有效",
        "B": "无效",
        "C": "可变更",
        "D": "可撤销"
    },
    {
        "ANS": "C",
        "Q": "策划目标的分解应根据不同类型策划明确主责部门差异化设定策划目标其中结算策划效益率应不小于多少",
        "TYPE": "单选题",
        "A": "2",
        "B": "3",
        "C": "4",
        "D": "5"
    },
    {
        "ANS": "B",
        "Q": "策划目标的分解应根据不同类型策划明确主责部门差异化设定策划目标其中施工策划的工期成本降低率应不小于多少",
        "TYPE": "单选题",
        "A": "03",
        "B": "05",
        "C": "1",
        "D": "2"
    },
    {
        "ANS": "B",
        "Q": "策划预计创效金额指一体化创效策划立项过程中根据测算该项策划完成后的盈亏数减去策划实施前的盈亏数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "策划预计创效金额指一体化创效策划立项过程中根据测算该项策划完成后的预计盈亏数减去策划实施前的预计盈亏数每项创效策划立项金额合计为整个项目创效策划预计创效金额",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "曾当选党的十大代表并到获邀出席建国25周年国庆招待会的是",
        "TYPE": "单选题",
        "A": "王家平",
        "B": "陆锦康",
        "C": "陈锦绣",
        "D": "陆长义"
    },
    {
        "ANS": "A",
        "Q": "产值利润率产值成本产值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "产值确权率实际产值业主确认产值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "产值确权率业主确认产值同期产值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "产值确权率指同期业主确认产值与产值的比值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "产值确权率指业主确认产值与产值的比值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "厂区内一幢独立的办公楼属于",
        "TYPE": "单选题",
        "A": "建设项目",
        "B": "单项工程",
        "C": "单位工程",
        "D": "分部工程"
    },
    {
        "ANS": "C",
        "Q": "超过基本高度时应在项目特征中描述对于附录G通风空调工程其基本安装高度为m",
        "TYPE": "单选题",
        "A": "36",
        "B": "5",
        "C": "6",
        "D": "10"
    },
    {
        "ANS": "A",
        "Q": "沉井下沉工程量按设计井壁外围面积乘以下沉深度以体积计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "成本管理的管理原则",
        "TYPE": "多选题",
        "A": "履约为先",
        "B": "系统联动",
        "C": "价值创造",
        "D": "各方共赢"
    },
    {
        "ANS": "ABC",
        "Q": "成本基础数据核算的主责部门为",
        "TYPE": "多选题",
        "A": "商务经理",
        "B": "物资工程师",
        "C": "专业工程师",
        "D": "项目经理"
    },
    {
        "ANS": "A",
        "Q": "成本锁定指项目竣工后自施部分实际成本已办理结算性文件锁定项目投入",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "承包人采购的材料和工程设备应保证产品质量合格材料和工程设备到场后必须通知监理人检验",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "承包人对安全文明施工费应专款专用在财务账目中应单独列项备查不得挪作他用否则发包人有权要求其限期改正",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ADE",
        "Q": "承包人索赔要求赔偿时可以选择下列一项或几项方式获得赔偿勘误答案为ADE",
        "TYPE": "多选题",
        "A": "延长工期",
        "B": "延长质量缺陷修复期限",
        "C": "要求承包人按合同约定支付违约金",
        "D": "要求发包人支付实际发生的额外费用",
        "E": "要求发包人支付合理的预期利润"
    },
    {
        "ANS": "A",
        "Q": "承包人未在合同约定的时间内提交竣工结算文件经发包人催告后14天内仍未提交或没有明确答复的发包人有权根据已有资料编制竣工结算文件作为办理竣工结算和支付结算款的依据承包人应予以认可",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BCD",
        "Q": "承包人向发包人提出工期索赔的具体依据主要包括",
        "TYPE": "多选题",
        "A": "施工单位的施工总进度规划",
        "B": "施工日志气象资料",
        "C": "影响工期的干扰事件",
        "D": "受干扰后的实际工程进度"
    },
    {
        "ANS": "A",
        "Q": "承包人应当按照合同约定的计量周期和时间向发包人提交当期已完工程量报告发包人应在收到报告后天内核实并将核实计量结果通知承包人",
        "TYPE": "单选题",
        "A": "7",
        "B": "10",
        "C": "14",
        "D": "28"
    },
    {
        "ANS": "D",
        "Q": "承包人应根据办理的竣工结算文件向发包人提交竣工结算款支付申请该申请不包括",
        "TYPE": "单选题",
        "A": "竣工结算总额",
        "B": "已支付的合同价款",
        "C": "应扣留的质量保证金",
        "D": "本期间应支付的安全文明施工费"
    },
    {
        "ANS": "ACDE",
        "Q": "承包人应根据办理的竣工结算文件向发包人提交竣工结算款支付申请申请应包括",
        "TYPE": "多选题",
        "A": "竣工结算合同价款总额",
        "B": "签证部分价款总额",
        "C": "应预留的质量保证金",
        "D": "累计已实际支付的合同价款",
        "E": "实际应支付的竣工结算款金额"
    },
    {
        "ANS": "ACDE",
        "Q": "承包人应根据办理的竣工结算文件向发包人提交竣工结算款支付申请申请应包括",
        "TYPE": "多选题",
        "A": "由发包人承担的费用",
        "B": "签证部分价款总额",
        "C": "应预留的质量保证金",
        "D": "累计已实际支付的合同价款",
        "E": "实际应支付的竣工结算款金额"
    },
    {
        "ANS": "D",
        "Q": "承包人应在知道或应该知道索赔事件发生后内向发包人提交索赔意向通知书说明发生索赔事件的事由承包人逾期未发出索赔意向通知书的丧失索赔的权利",
        "TYPE": "单选题",
        "A": "3天",
        "B": "7天",
        "C": "14天",
        "D": "28天"
    },
    {
        "ANS": "C",
        "Q": "承受内压的埋地铸铁管道进行水压试验当设计压力为050MPa时水压试验压力为",
        "TYPE": "单选题",
        "A": "060MPa",
        "B": "075MPa",
        "C": "100MPa",
        "D": "150MPa"
    },
    {
        "ANS": "D",
        "Q": "承台下部钢筋端部到桩里皮小于35d时承台钢筋需向上弯折多少",
        "TYPE": "单选题",
        "A": "15d",
        "B": "12d",
        "C": "承台厚2",
        "D": "10d"
    },
    {
        "ANS": "ACD",
        "Q": "持续推进集约化智慧化数字化规范化国际化进程实现采购管理向转变",
        "TYPE": "多选题",
        "A": "供应链",
        "B": "信息链",
        "C": "产业链",
        "D": "价值链",
        "E": "区域链"
    },
    {
        "ANS": "ABC",
        "Q": "持续筑牢建造业务盈利优势提升业务盈利水平增强专业工程设计采购金融等业务盈利能力",
        "TYPE": "多选题",
        "A": "投资",
        "B": "开发",
        "C": "海外",
        "D": "施工",
        "E": "维保"
    },
    {
        "ANS": "A",
        "Q": "持续做强做优A类基础设施项目强化履约创效能力发挥规模效益优势将的管理理念和项目日常管控紧密衔接",
        "TYPE": "单选题",
        "A": "技术牵头设计入手系统联动全程精益",
        "B": "两条线两位数铁三角系统联动",
        "C": "强化品质保障质量",
        "D": "争创效率提高效益"
    },
    {
        "ANS": "B",
        "Q": "充分发挥锁定前端效益的牵引作用扩大专业设备设施的采购范围打造专业工程特色盈利模式",
        "TYPE": "单选题",
        "A": "采购",
        "B": "设计",
        "C": "策划",
        "D": "施工"
    },
    {
        "ANS": "ABCDEF",
        "Q": "充分发挥房建业务全生命周期内等各环节的低成本运营优势探索价值创造新增长极",
        "TYPE": "多选题",
        "A": "设计引领",
        "B": "合同优化",
        "C": "履约管控",
        "D": "科技创效",
        "E": "采购降本",
        "F": "结算收款"
    },
    {
        "ANS": "A",
        "Q": "出现合同价款调减事项不含工程量偏差索赔后的14天内应提交合同价款调减报告并附相关资料未提交的应视为其对该事项不存在调整价款请求",
        "TYPE": "单选题",
        "A": "发包人",
        "B": "承包人",
        "C": "监理人",
        "D": "代理人"
    },
    {
        "ANS": "B",
        "Q": "出现合同价款调增事项后的7天内承包人应向发包人提交合同价款调增报告并附相关资料",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BCD",
        "Q": "除合同另有约定外合同中综合单价可以调整的包括",
        "TYPE": "多选题",
        "A": "材料价格变化",
        "B": "工程量清单漏项",
        "C": "设计变更引起新的工程量清单项目",
        "D": "工程量清单的工程数量误差超出合同约定幅度以外的",
        "E": "政策性调整"
    },
    {
        "ANS": "A",
        "Q": "除区域联采集中采购以外的招标采购由在约标前出具招标控制价出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "物资管理部",
        "C": "采购管理部",
        "D": "总经济师"
    },
    {
        "ANS": "A",
        "Q": "纯悬挑梁下部带肋钢筋伸入支座长度为",
        "TYPE": "单选题",
        "A": "15d",
        "B": "12d",
        "C": "Lae",
        "D": "支座宽"
    },
    {
        "ANS": "B",
        "Q": "此管多用于输送耐腐蚀介质管道输送的介质温度应在200以下当温度高于160时不宜在压力下使用具有重量轻不生锈不耐碱等特点该管为",
        "TYPE": "单选题",
        "A": "铅及铅合金管",
        "B": "铝及铝合金管",
        "C": "镍及镍合金管",
        "D": "钛及钛合金管"
    },
    {
        "ANS": "ABD",
        "Q": "从1998年2月中建八局资产重组三公司被整体吸纳所属分公司变为局直营区域公司同年10月三公司重新整合三公司仍有三个区域公司划归局直管",
        "TYPE": "多选题",
        "A": "中南公司",
        "B": "上海公司",
        "C": "西北公司",
        "D": "东海总公司"
    },
    {
        "ANS": "C",
        "Q": "从投资者业主角度分析工程造价是指建设一项工程预期或实际开支的",
        "TYPE": "单选题",
        "A": "全部建筑安装工程费用",
        "B": "建设工程总费用",
        "C": "全部固定资产投资费用",
        "D": "建设工程动态投资费用"
    },
    {
        "ANS": "B",
        "Q": "存在缺项控制价的需审批至出题来源采购管理部商务管理手册",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "分公司总经理",
        "D": "分公司总经济师"
    },
    {
        "ANS": "B",
        "Q": "存在缺项控制价的需审批至分公司总经济师",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "存在缺项控制价的需审批至分公司总经济师出题来源采购管理部商务管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCDEF",
        "Q": "存在重大风险或存在临近不合规时应及时有效开展改进提升商务系统重点关注以下方面",
        "TYPE": "多选题",
        "A": "商务管理体系建设",
        "B": "项目目标管理",
        "C": "项目商务策划",
        "D": "项目经济运营分析",
        "E": "总分包结算管理",
        "F": "主要成本指标管控"
    },
    {
        "ANS": "A",
        "Q": "措施项目清单以项为计量单位相应数量为l",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "措施项目中的所有费用必须按照国家或省级行业建设主管部门的规定计算不得作为竞争性费用",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "大管道如城市供热管网供水管网等的冲洗方法为",
        "TYPE": "单选题",
        "A": "闭式循环冲洗技术",
        "B": "空气爆破法冲洗",
        "C": "分段进行高压水冲洗",
        "D": "油清洗"
    },
    {
        "ANS": "B",
        "Q": "单层建筑物不论其高度如何均按一层计算建筑面积其建筑面积按建筑物水平面积计算",
        "TYPE": "单选题",
        "A": "外墙外围",
        "B": "外墙勒脚以上外围",
        "C": "外墙勒脚以上结构外围",
        "D": "屋顶外围"
    },
    {
        "ANS": "A",
        "Q": "单独装饰工程20米以上超高部分人工降效应按超过20米部分的人工费分段计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "单份单项额度10万元以上或超过分包合同额的经济签证须签订补充协议",
        "TYPE": "单选题",
        "A": "005",
        "B": "01",
        "C": "015",
        "D": "02"
    },
    {
        "ANS": "B",
        "Q": "单份一次性零星用工超过400小时或增加工作内容改变合同单价合同单价没有涉及额度4000元以上8000元以下的经济签证由进行审批",
        "TYPE": "单选题",
        "A": "二级单位总经理",
        "B": "二级单位总经济师",
        "C": "二级单位商务部经理",
        "D": "项目经理"
    },
    {
        "ANS": "C",
        "Q": "单份一次性零星用工超过400小时或增加工作内容改变合同单价合同单价没有涉及额度5000元以上1万元以下的经济签证由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "ABC",
        "Q": "单模光纤主要缺点有",
        "TYPE": "多选题",
        "A": "光纤与光源以及光纤与光纤之间的接口比多模光纤难",
        "B": "芯线细耦合光能量较小",
        "C": "传输设备较贵",
        "D": "传输距离比较近一般只有几千米"
    },
    {
        "ANS": "ABD",
        "Q": "单位工程投标报价汇总表中工程量清单由组成",
        "TYPE": "多选题",
        "A": "分部分项工程",
        "B": "措施项目",
        "C": "实体项目清单",
        "D": "其他项目清单",
        "E": "非实体项目清单"
    },
    {
        "ANS": "ABD",
        "Q": "单位工程投标报价汇总表中工程量清单由组成",
        "TYPE": "多选题",
        "A": "暂列金额",
        "B": "措施项目",
        "C": "实体项目清单",
        "D": "其他项目清单",
        "E": "非实体项目清单"
    },
    {
        "ANS": "B",
        "Q": "单项采购控制价应在完成出题来源采购管理部采购全链条指导手册",
        "TYPE": "单选题",
        "A": "约标前5天",
        "B": "约标前",
        "C": "开标前",
        "D": "招标完成前"
    },
    {
        "ANS": "B",
        "Q": "单项工程费汇总表中的金额应分别按照分部分项工程量清单计价表措施项目清单计价表和其他项目清单计价表的合计金额和按有关规定计算的规费税金填写",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "单项招标公开招标采购报名时长不得小于小时出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "24",
        "B": "48",
        "C": "72",
        "D": "96"
    },
    {
        "ANS": "A",
        "Q": "单项招标任务分供方报价不得短于72小时集采报价时间不得短于5天出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "单一来源采购云筑网选择询价易模块中功能发起出题来源采购管理部采购全链条指导手册",
        "TYPE": "单选题",
        "A": "招标采购",
        "B": "竞争性谈判",
        "C": "询价采购",
        "D": "单一来源采购"
    },
    {
        "ANS": "A",
        "Q": "单一来源采购结算与总包关联的分包控制价审批最终审批人总经济师",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "单一来源采购必须保证原有采购项目一致性或服务配套的要求需要继续从原分供方处添购且添购资金总额不超过原合同金额的出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "5",
        "B": "10",
        "C": "15",
        "D": "20"
    },
    {
        "ANS": "B",
        "Q": "单一来源采购必须保证原有采购项目一致性或服务配套的要求需要继续从原分供方处添购且添购资金总额不超过原合同金额30的出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "单一来源采购准备工作中需要的文件包括",
        "TYPE": "多选题",
        "A": "单一来源采购申请",
        "B": "招标控制价审批表",
        "C": "询价记录表",
        "D": "评标报告"
    },
    {
        "ANS": "C",
        "Q": "当板的端支座为梁时底筋伸进支座的长度为",
        "TYPE": "单选题",
        "A": "10d",
        "B": "支座宽25d",
        "C": "Max支座宽25d",
        "D": "5d"
    },
    {
        "ANS": "C",
        "Q": "当板支座为剪力墙时板负筋伸入支座内平直段长度为",
        "TYPE": "单选题",
        "A": "5d",
        "B": "墙厚2",
        "C": "墙厚保护层墙外侧竖向分布筋直径",
        "D": "04Lab"
    },
    {
        "ANS": "C",
        "Q": "当承台梁需要在端部弯折时其弯折长度为",
        "TYPE": "单选题",
        "A": "15d",
        "B": "12d",
        "C": "10d",
        "D": "La"
    },
    {
        "ANS": "A",
        "Q": "当顶板作为地下室外墙的弹性嵌固支承进行搭接连接墙外侧钢筋弯折长度为",
        "TYPE": "单选题",
        "A": "15d",
        "B": "12d",
        "C": "10d",
        "D": "20d"
    },
    {
        "ANS": "B",
        "Q": "当顶板作为地下室外墙的简支支承进行搭接连接墙外侧钢筋弯折长度为",
        "TYPE": "单选题",
        "A": "15d",
        "B": "12d",
        "C": "10d",
        "D": "20d"
    },
    {
        "ANS": "A",
        "Q": "当洞口连梁截面宽度不小于250时可采用",
        "TYPE": "单选题",
        "A": "交叉斜筋配筋",
        "B": "集中对角斜筋配筋",
        "C": "对角暗撑配筋",
        "D": "交叉暗撑配筋"
    },
    {
        "ANS": "A",
        "Q": "当独立基础底板长度时除外侧钢筋外底板配筋长度可取相应长度的09倍交错放置",
        "TYPE": "单选题",
        "A": "2500",
        "B": "2600",
        "C": "2700",
        "D": "2800"
    },
    {
        "ANS": "C",
        "Q": "当发承包双方或一方对工程造价咨询人出具的竣工结算文件有异议时可向投诉申请对其进行执业质量鉴定",
        "TYPE": "单选题",
        "A": "总监理工程师",
        "B": "建设行政主管部门",
        "C": "工程造价管理机构",
        "D": "人民法院"
    },
    {
        "ANS": "B",
        "Q": "当梁腹板高度450时在梁的两个侧面应沿高度配置纵向构造钢筋间距为",
        "TYPE": "单选题",
        "A": "a150",
        "B": "a200",
        "C": "a250",
        "D": "a300"
    },
    {
        "ANS": "C",
        "Q": "当梁腹板高度满足需配置纵向构造钢筋",
        "TYPE": "单选题",
        "A": "hw400mm",
        "B": "hw400mm",
        "C": "hw450mm",
        "D": "hw450mm"
    },
    {
        "ANS": "A",
        "Q": "当梁配置侧面构造钢筋时其搭接与锚固长度可取值为",
        "TYPE": "单选题",
        "A": "15d",
        "B": "12d",
        "C": "10d",
        "D": "6d"
    },
    {
        "ANS": "ABCD",
        "Q": "当梁配置侧面受扭纵向钢筋时其搭接与锚固长度可能是",
        "TYPE": "多选题",
        "A": "llla",
        "B": "lllae",
        "C": "llela",
        "D": "llelae"
    },
    {
        "ANS": "ABCD",
        "Q": "当梁配置侧面受扭纵向钢筋时其搭接与锚固长度可能是",
        "TYPE": "多选题",
        "A": "llla",
        "B": "lllae",
        "C": "llela",
        "D": "llelae"
    },
    {
        "ANS": "BCD",
        "Q": "当锚固钢筋的保护层不大于5d时锚固钢筋长度范围内说法正确的是",
        "TYPE": "多选题",
        "A": "不应设置横向构造钢筋",
        "B": "应设置横向钢筋",
        "C": "设置横向构造钢筋的直径不应小于d4",
        "D": "说明中d为锚固钢筋的最大直径"
    },
    {
        "ANS": "B",
        "Q": "当墙身水平分布钢筋不能满足梁侧面纵向构造钢筋的要求时需要单独列出表示为",
        "TYPE": "单选题",
        "A": "G10150",
        "B": "N10150",
        "C": "10150",
        "D": "210150"
    },
    {
        "ANS": "A",
        "Q": "当燃气管道的焊缝无损探伤检测无设计规定时应对每一焊工所焊焊缝焊口进行抽查检测抽查数量应不小于焊口总数的",
        "TYPE": "单选题",
        "A": "015",
        "B": "03",
        "C": "05",
        "D": "1"
    },
    {
        "ANS": "A",
        "Q": "当事人既约定违约金又约定定金的一方违约时这两种违约责任",
        "TYPE": "单选题",
        "A": "只能选择其一",
        "B": "可合并使用",
        "C": "适用数值较大者",
        "D": "适用数值较小者"
    },
    {
        "ANS": "C",
        "Q": "当事人一方违约时该合同是否继续履行取决于",
        "TYPE": "单选题",
        "A": "违约方是否已经承担违约金",
        "B": "违约方是否已经赔偿损失",
        "C": "对方是否要求继续履行",
        "D": "违约方是否愿意继续履行"
    },
    {
        "ANS": "C",
        "Q": "当为环氧树脂涂层带肋钢筋时锚固长度查表数据应乘以系数",
        "TYPE": "单选题",
        "A": "11",
        "B": "12",
        "C": "125",
        "D": "13"
    },
    {
        "ANS": "A",
        "Q": "当小规模纳税人采用简易计税方法计算增值税时建筑业增值税的征收率是",
        "TYPE": "单选题",
        "A": "003",
        "B": "006",
        "C": "009",
        "D": "01"
    },
    {
        "ANS": "C",
        "Q": "当支座两边梁宽不同或错开布置时将无法直通的纵筋弯锚入梁内那么锚入梁的距离是",
        "TYPE": "单选题",
        "A": "lab",
        "B": "labe",
        "C": "06lab",
        "D": "06labe"
    },
    {
        "ANS": "C",
        "Q": "当柱变截面需要设置插筋时插筋应该从变截面处节点顶向下插入的长度为",
        "TYPE": "单选题",
        "A": "16Lae",
        "B": "15Lae",
        "C": "12Lae",
        "D": "05Lae"
    },
    {
        "ANS": "B",
        "Q": "道路工程中的临时设施费中不包括施工现场的",
        "TYPE": "单选题",
        "A": "临时宿舍",
        "B": "道路护栏",
        "C": "文化福利",
        "D": "临时给水"
    },
    {
        "ANS": "B",
        "Q": "地面面层垫层都是按面积计算工程量",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "地面砂浆防水防潮不应扣除面积",
        "TYPE": "单选题",
        "A": "突出地面构造物",
        "B": "设备基础",
        "C": "间壁墙",
        "D": "截面尺寸05独立柱柱"
    },
    {
        "ANS": "D",
        "Q": "地下室外墙的外侧贯通筋如何表示",
        "TYPE": "单选题",
        "A": "OBH18200V20200",
        "B": "ISH18200V20200",
        "C": "TBH18200V20200",
        "D": "OSH18200V20200"
    },
    {
        "ANS": "AC",
        "Q": "地下一层增加钢筋在嵌固部位的锚固构造描述正确的是",
        "TYPE": "多选题",
        "A": "弯锚时伸至梁顶弯折12d",
        "B": "弯锚时伸至梁顶弯折15d",
        "C": "直锚时伸至梁顶截断",
        "D": "直锚时伸过梁顶12lae"
    },
    {
        "ANS": "B",
        "Q": "点焊缝焊和对焊是某种压力焊的三个基本类型这种压力焊是",
        "TYPE": "单选题",
        "A": "电渣压力焊",
        "B": "电阻焊",
        "C": "摩擦焊",
        "D": "超声波焊"
    },
    {
        "ANS": "AB",
        "Q": "电动机控制和保护设备安装中应符合的要求有",
        "TYPE": "多选题",
        "A": "每台电动机均应安装控制和保护设备",
        "B": "电动机控制和保护设备一般设在电动机附近",
        "C": "采用熔丝的过流和短路保护装置保护整定值一般为电动机额定电流的11125倍",
        "D": "采用热元件的过流和短路保护装置保护整定值一般为电动机额定电流的1525倍"
    },
    {
        "ANS": "A",
        "Q": "电力电缆型号很多电缆型号为NHVV22325116表示的是",
        "TYPE": "单选题",
        "A": "铜芯聚氯乙烯绝缘和护套双钢带铠装三芯25mm2一芯16mm2耐火电力电缆",
        "B": "铜芯聚氯乙烯绝缘和护套钢带铠装三芯25mm2一芯16mm2阻燃电力电缆",
        "C": "铜芯聚乙烯绝缘和护套双钢带铠装三芯25mm2一芯16mm2耐火电力电缆",
        "D": "铜芯聚乙烯绝缘和护套钢带铠装三芯25mm2一芯16mm2阻燃电力电缆"
    },
    {
        "ANS": "ABC",
        "Q": "电气配管配线工程中导线的连接方式可采用",
        "TYPE": "多选题",
        "A": "铰接",
        "B": "焊接",
        "C": "压接",
        "D": "插接"
    },
    {
        "ANS": "D",
        "Q": "电气设备安装工程计价定额中120m2以下1V以下户内干包式电力电缆终端头制作安装综合单价为0500元个现有户内YJ1KV110的电力电缆终端头安装换算后综合单价为元个不考虑人工费价差调整",
        "TYPE": "单选题",
        "A": "205",
        "B": "246",
        "C": "1025",
        "D": "123"
    },
    {
        "ANS": "A",
        "Q": "顶层中柱纵筋长度弯锚计算式为",
        "TYPE": "单选题",
        "A": "层高当前层底部非连接区Hbc12d",
        "B": "层高当前层底部非连接区Hbc",
        "C": "层高当前层底部非连接区12d",
        "D": "层高12d"
    },
    {
        "ANS": "A",
        "Q": "定标金额不能超过招标概算额的10是指的上下浮动都不能超过10出题来源采购管理部采购合规宣贯培训课件",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "定点分包缴纳总包管理费指总承包人依据定点分包合同及分包与承包人办理的竣工结算或产值确权与分包人办理结算或产值确权时扣取的金额此部分金额可计入总包方的自施产值或冲减自施成本",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "定点分包缴纳总包管理费指总承包人依据定点分包合同及分包与发包人办理的竣工结算或产值确权与分包人办理结算或产值确权时扣取的金额此部分金额可计入总包方的自施产值或冲减自施成本",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "定额具有地区性时间性的特点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "定额直接费由人工费材料费机械使用费组成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "定额中其他天棚吊顶综合后设置项目",
        "TYPE": "多选题",
        "A": "龙骨",
        "B": "基层",
        "C": "面层",
        "D": "找平层",
        "E": "结合层"
    },
    {
        "ANS": "A",
        "Q": "冬雨季施工增加费指在冬雨季施工期间所增加的费用包括冬季作业临时取暖建筑物门窗洞口封闭及防雨措施排水工效降低等费用不包括的费用",
        "TYPE": "单选题",
        "A": "设计要求混凝土内添加防冻剂",
        "B": "防冻",
        "C": "雨衣雨靴",
        "D": "雨季水泵抽水"
    },
    {
        "ANS": "A",
        "Q": "董事会是全面风险与合规管理的决策机构负责批准全面风险管理议案相关机构设置重特大风险事项研判与决策风险评估报告审批考核与追责事项审核等",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "独立基础底板y向配筋的起步距离为",
        "TYPE": "单选题",
        "A": "s",
        "B": "s2",
        "C": "75",
        "D": "mins275"
    },
    {
        "ANS": "A",
        "Q": "独立柱雨蓬按顶盖水平面积的一半计算建筑面积",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "端支座非框架梁下部纵筋弯锚时弯钩为135度说法错误的是",
        "TYPE": "单选题",
        "A": "伸至支座对边弯折",
        "B": "带肋钢筋75d",
        "C": "光圆钢筋9d",
        "D": "12d"
    },
    {
        "ANS": "ACD",
        "Q": "端柱转角墙中内外侧钢筋说法正确的是",
        "TYPE": "多选题",
        "A": "外侧钢筋伸至端柱角筋内侧弯折15d",
        "B": "外侧钢筋伸至对边弯折12d",
        "C": "内侧钢筋伸至对边弯折15d",
        "D": "外侧钢筋伸入端柱的长度不小于06lae"
    },
    {
        "ANS": "ACE",
        "Q": "对清单中等项目投标人可不单列项目计算工程量而在报价中考虑勘误答案提示ACE",
        "TYPE": "多选题",
        "A": "土石方工程中的放坡操作工作面支挡土板",
        "B": "基础施工时的明沟排水井点降水",
        "C": "桩基工程中的送桩桩孔填料",
        "D": "灌注桩中的钢筋笼制作安装",
        "E": "充盈量"
    },
    {
        "ANS": "ABCD",
        "Q": "对承包人已经完成的合格工程进行计量并予以确认是发包人支付工程价款的前提工作工程计量的原则包括",
        "TYPE": "多选题",
        "A": "不符合合同文件要求的工程不予计量",
        "B": "按合同文件所规定的方法范围内容和单位计量",
        "C": "因承包人原因造成的超出合同工程范围施工的工程量不予计量",
        "D": "因承包人原因造成的返工的工程量不予计量"
    },
    {
        "ANS": "ABCE",
        "Q": "对地面装饰工程不应列项计算的清单项目有",
        "TYPE": "多选题",
        "A": "垫层铺设",
        "B": "水泥砂浆找平",
        "C": "木搁珊",
        "D": "硬木企口板",
        "E": "楼梯扶手弯头"
    },
    {
        "ANS": "D",
        "Q": "对地面装饰工程应列项计算的清单项目有",
        "TYPE": "单选题",
        "A": "垫层铺设",
        "B": "水泥砂浆找平",
        "C": "木搁珊",
        "D": "细石砼加浆随捣随抹"
    },
    {
        "ANS": "D",
        "Q": "对地面装饰工程应列项计算的清单项目有",
        "TYPE": "单选题",
        "A": "垫层铺设",
        "B": "水泥砂浆找平",
        "C": "木搁珊",
        "D": "细石砼加浆随捣随抹"
    },
    {
        "ANS": "D",
        "Q": "对发包人结算定案用印完成后天内完成内部协同专业分包结算",
        "TYPE": "单选题",
        "A": "21",
        "B": "15",
        "C": "14",
        "D": "7"
    },
    {
        "ANS": "B",
        "Q": "对工人工作时间消耗的分类中属于必需消耗时间而被计入时间定额的是",
        "TYPE": "单选题",
        "A": "偶然工作时间",
        "B": "工人休息时间",
        "C": "施工本身造成的停工时间",
        "D": "非施工本身造成的停工时间"
    },
    {
        "ANS": "B",
        "Q": "对工人工作时间消耗的分类中属于必需消耗时间而被计入时间定额的是",
        "TYPE": "单选题",
        "A": "偶然工作时间",
        "B": "工人休息时间",
        "C": "施工本身造成的停工时间",
        "D": "非施工本身造成的停工时间"
    },
    {
        "ANS": "AB",
        "Q": "对技术复杂或招标人对技术性能标准有特殊要求的分包招标招标人对采购标的物有特殊要求如特定的工艺设备装饰材料桥梁定制构件或装备等的物资招标应选择哪种评标方法",
        "TYPE": "多选题",
        "A": "综合评标法技术商务综合评标",
        "B": "综合评标法技术优先综合评标",
        "C": "最低投标价法",
        "D": "合理低价投标法"
    },
    {
        "ANS": "C",
        "Q": "对价格浮动材料进行供应链情势分析选择最佳时点采购属于项目采购策划管理活动出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "整合分供资源",
        "B": "采购履约管控",
        "C": "错峰采购",
        "D": "调差策划"
    },
    {
        "ANS": "D",
        "Q": "对建筑工程一切险而言保险人对造成的物质损失不承担赔偿责任",
        "TYPE": "单选题",
        "A": "自然灾害",
        "B": "意外事故",
        "C": "突发事件",
        "D": "自然磨损"
    },
    {
        "ANS": "ABCDEF",
        "Q": "对三级单位招标合规性管理的主责指标是",
        "TYPE": "多选题",
        "A": "招标时限是否符合要求",
        "B": "云筑网操作流程合规性",
        "C": "是否存在围标串标的情形",
        "D": "公开招标率",
        "E": "招采数据的真实性完整性和有效性检查采购数据的收集",
        "F": "废标率"
    },
    {
        "ANS": "D",
        "Q": "对投保建筑工程一切险的工程保险人应承担赔偿责任的是",
        "TYPE": "单选题",
        "A": "因暴雨造成的物质损失",
        "B": "发生火灾引起的场地清理费用",
        "C": "工程设计错误引起的损失",
        "D": "因地面下沉引起的物质损失"
    },
    {
        "ANS": "ABC",
        "Q": "对项目部招标合规性管理的主责指标是",
        "TYPE": "多选题",
        "A": "是否按照手册要求参与招标工作遵守招标纪律",
        "B": "先进场后招标补录招标流程",
        "C": "招标过程中与投标人串通泄露投标数据等有损公司利益情形",
        "D": "公开招标率废标率"
    },
    {
        "ANS": "ABC",
        "Q": "对形状复杂污垢黏附严重清洗要求高的装配件宜采用",
        "TYPE": "多选题",
        "A": "溶剂油",
        "B": "清洗汽油",
        "C": "碱液",
        "D": "蒸汽"
    },
    {
        "ANS": "C",
        "Q": "对严重锈蚀和污染的液体管道当使用一般清洗方法未能达到要求时可采取将管道分段进行",
        "TYPE": "单选题",
        "A": "高压空气吹扫",
        "B": "高压蒸汽吹扫",
        "C": "高压水冲洗",
        "D": "酸洗"
    },
    {
        "ANS": "A",
        "Q": "对于粗骨料来说拌制的混凝土流动性和粘聚性均较好",
        "TYPE": "单选题",
        "A": "连续级配",
        "B": "间断级配",
        "C": "颗粒级配",
        "D": "粒径级配"
    },
    {
        "ANS": "B",
        "Q": "对于地基承载力较低台身较高跨径较大的梁桥应优先选用的桥台形式是",
        "TYPE": "单选题",
        "A": "轻型桥台",
        "B": "框架式桥台",
        "C": "重力式桥台",
        "D": "柱式桥台"
    },
    {
        "ANS": "ABC",
        "Q": "对于机械设备的润滑润滑油的适用场合有",
        "TYPE": "多选题",
        "A": "散热要求高",
        "B": "密封好",
        "C": "设备润滑剂起冲刷作用",
        "D": "经常间歇或往复运动的轴承"
    },
    {
        "ANS": "A",
        "Q": "对于评标参考价单项劳务及专业分包招标不做强制要求出题来源采购管理部采购合规宣贯培训课件",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "对于实行项目法人责任制项目项目董事会应负责",
        "TYPE": "单选题",
        "A": "组织编制初步设计文件",
        "B": "控制工程投资工期和质量",
        "C": "组织工程设计招标",
        "D": "筹措建设资金"
    },
    {
        "ANS": "A",
        "Q": "对于实行招标的建设工程一般以前的第28天作为基准日",
        "TYPE": "单选题",
        "A": "投标截止时间",
        "B": "招标截止日",
        "C": "中标通知书发出",
        "D": "合同签订"
    },
    {
        "ANS": "B",
        "Q": "对预制钢砼方桩的接桩费用应另列项目计价",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "多家中标的情况生成所有合同的合同额累计不超过概算额10集采除外出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BC",
        "Q": "多模光纤与单模光纤相比其主要缺点表现在",
        "TYPE": "多选题",
        "A": "对光源要求高只能与激光二极管光源配合使用",
        "B": "传输频带较窄",
        "C": "传输距离较近",
        "D": "芯线细耦合光能量小"
    },
    {
        "ANS": "ABC",
        "Q": "恶劣天气包括",
        "TYPE": "多选题",
        "A": "暴雨",
        "B": "寒潮",
        "C": "环保污染",
        "D": "连续降雨7天"
    },
    {
        "ANS": "A",
        "Q": "二三级单位管理职责中部门负责组织实施投标报价阶段商务策划及时按示范格式模板进行投标报价商务策划交底并移交相应投标报价资料",
        "TYPE": "单选题",
        "A": "市场部投标报价中心",
        "B": "采购中心",
        "C": "商务管理部",
        "D": "法律合规与风险管理部"
    },
    {
        "ANS": "AB",
        "Q": "二级单位管理时限要求661163中1分别是哪些内容",
        "TYPE": "多选题",
        "A": "竣工前一个月签订结算责任状",
        "B": "竣工后一个月报出结算",
        "C": "结算前一个月报出分包结算",
        "D": "竣工后一个月报出物资结算"
    },
    {
        "ANS": "C",
        "Q": "二级单位管理时限要求661163中3分别是哪些内容",
        "TYPE": "单选题",
        "A": "60天内完成施工图预算",
        "B": "竣工6个月内完成总包结算",
        "C": "3个月内完成分包结算",
        "D": "总包结算完成6个月内完成竣工项目考核兑现",
        "E": "竣工6个月内完成全部分包分供结算"
    },
    {
        "ANS": "ABC",
        "Q": "二级单位管理时限要求661163中6分别是哪些内容",
        "TYPE": "多选题",
        "A": "收到图纸后60天内完成施工图预算竣工前6个月开展结算策划",
        "B": "竣工前6个月开展结算策划",
        "C": "竣工6个月内完成总包结算",
        "D": "总包结算完成3个月内完成竣工项目考核兑现",
        "E": "竣工后3个月内完成总包结算"
    },
    {
        "ANS": "A",
        "Q": "二级单位商务法务部计量中心参照图纸说明及相关图集对竣工结算初稿复核工程量准确性并对项目清单组价进行指导",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "二级单位商务法务部收到项目部初审结算报告后天内组织相关部门根据会签表要求进行会审会签",
        "TYPE": "单选题",
        "A": "30",
        "B": "15",
        "C": "14",
        "D": "3"
    },
    {
        "ANS": "C",
        "Q": "二级单位总经济师对当期项目商务策划情况经济活动情况进行分析总结评审项目成本分析报告制定纠偏措施提出改进方案",
        "TYPE": "单选题",
        "A": "1次周",
        "B": "1次月",
        "C": "1次季",
        "D": "1次半年"
    },
    {
        "ANS": "B",
        "Q": "发包人不能及时组织审价和办理完成结算的情况下发函催办率达到100并做好收发文记录当出现工程造价超过以上的大幅度审减或者审价拖延项目商务经理应及时报告二级单位商务法务部",
        "TYPE": "单选题",
        "A": "3",
        "B": "5",
        "C": "8",
        "D": "10"
    },
    {
        "ANS": "A",
        "Q": "发包人不能及时组织审价和办理完成结算的情况下发函催办率达到100并做好收发文记录当出现工程造价超过5以上的大幅度审减或者审价拖延项目商务经理应及时报告",
        "TYPE": "单选题",
        "A": "二级单位商务法务部",
        "B": "三级单位商务法务部",
        "C": "项目经理",
        "D": "董事长"
    },
    {
        "ANS": "B",
        "Q": "发包人不能及时组织审价和办理完成结算的情况下发函催办率达到100并做好收发文记录当出现工程造价超过百分之多少以上的大幅度审减或者审价拖延项目商务经理应及时报告二级单位商务法务部",
        "TYPE": "单选题",
        "A": "10",
        "B": "5",
        "C": "8",
        "D": "9"
    },
    {
        "ANS": "B",
        "Q": "发包人和监理人对承包人提交的施工进度计划的确认可以免除承包人根据法律规定和合同约定应承担的任何责任或义务",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "发包人批价与实际采购价对比计算采购效益认价采购效益率超过5的按超额部分效益的5给予奖励认价采购效益率计算公式是",
        "TYPE": "单选题",
        "A": "收入单价采购数量采购单价采购数量收入单价采购数量100",
        "B": "发包人批价认价采购效益率55",
        "C": "收入单价采购数量物资设备采购效益率采购效益率8125",
        "D": "发包人批价采购价发包人批价100"
    },
    {
        "ANS": "A",
        "Q": "发包人提供的材料或工程设备不符合合同要求的承包人有权拒绝并可要求发包人更换由此增加的费用和或延误的工期由发包人承担并支付承包人合理的利润",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "发包人委托工程造价咨询人核对竣工结算的工程造价咨询人应在内核对完毕",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "28",
        "D": "30"
    },
    {
        "ANS": "ABE",
        "Q": "发包人未按规定程序支付竣工结算款项的承包人可以",
        "TYPE": "多选题",
        "A": "催发包人支付",
        "B": "获得延迟支付利息的权利",
        "C": "直接将工程折价",
        "D": "直接将工程拍卖",
        "E": "就工程拍卖价获得优先受偿权"
    },
    {
        "ANS": "B",
        "Q": "发包人应在工程开工后的28天内向承包人预付总承包服务费的分包进场后其余部分与进度款同期支付",
        "TYPE": "单选题",
        "A": "15",
        "B": "20",
        "C": "25",
        "D": "30"
    },
    {
        "ANS": "D",
        "Q": "发包人应在工程开工后的28天内预付不低于当年施工进度计划的安全文明施工费总额的其余部分应按照提前安排的原则进行分解并应与进度款同期支付",
        "TYPE": "单选题",
        "A": "20",
        "B": "30",
        "C": "50",
        "D": "60"
    },
    {
        "ANS": "B",
        "Q": "发包人应在签发进度款支付证书后的天内按照支付证书列明的金额向承包人支付进度款",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "21",
        "D": "28"
    },
    {
        "ANS": "A",
        "Q": "发包人应在收到承包人提交竣工结算款支付申请后天内予以核实向承包人签发竣工结算支付证书",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "21",
        "D": "28"
    },
    {
        "ANS": "B",
        "Q": "发包人应在收到最终结清支付申请后的天内予以核实向承包人签发最终结清证书",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "21",
        "D": "28"
    },
    {
        "ANS": "A",
        "Q": "发包人在安全文明施工费付款期满后7天内仍未支付的若发生安全事故有承担相应责任",
        "TYPE": "单选题",
        "A": "发包方",
        "B": "承包方",
        "C": "监理方",
        "D": "发承包各承担50"
    },
    {
        "ANS": "B",
        "Q": "发包人在付款期满后的天内仍未支付的承包人可在付款期满后的第天起暂停施工",
        "TYPE": "单选题",
        "A": "77",
        "B": "78",
        "C": "714",
        "D": "1414"
    },
    {
        "ANS": "B",
        "Q": "发包人在收到承包人竣工结算文件后的30天内不审核竣工结算或未提出审核意见的视为承包人提交的竣工结算文件已被发包人认可竣工结算办理完毕",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "发包人在招标工程量清单中给定暂估价的材料工程设备属于依法必须招标的应当由以招标方式选择供应商确定价格并以此为依据取代暂估价调整合同价款",
        "TYPE": "单选题",
        "A": "招标代理人",
        "B": "发包人",
        "C": "承包人",
        "D": "发承包双方"
    },
    {
        "ANS": "A",
        "Q": "发包人在总包结算中直接扣减工程维修费用如果有应通知二级单位施工管理部确认",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "项目生产经理",
        "C": "项目商务经理",
        "D": "二级单位副总经理"
    },
    {
        "ANS": "C",
        "Q": "发包人在总包结算中直接扣减工程维修费用如果有项目经理应通知确认",
        "TYPE": "单选题",
        "A": "二级单位商务管理部",
        "B": "二级单位总经济师",
        "C": "二级单位施工管理部",
        "D": "二级单位副总经理"
    },
    {
        "ANS": "ABCE",
        "Q": "发承包双方送达书面文件的方法有",
        "TYPE": "多选题",
        "A": "挂号邮寄",
        "B": "特快专递",
        "C": "现场签收",
        "D": "不记名投递",
        "E": "使用双方指定的电子邮箱发送电子邮件"
    },
    {
        "ANS": "B",
        "Q": "发承包双方在收到总监理工程师或造价工程师的暂定结果通知之后的天内未对暂定结果予以确认也未提出不同意见的视为发承包双方已认可该暂定结果",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "28",
        "D": "30"
    },
    {
        "ANS": "ACD",
        "Q": "发光二极管LED是电致发光的固体半导体高亮度点光源其特点有",
        "TYPE": "多选题",
        "A": "使用寿命长",
        "B": "显色指数高",
        "C": "无紫外和红外辐射",
        "D": "能在低电压下工作"
    },
    {
        "ANS": "ABCE",
        "Q": "发生下列事项发承包双方应当按照合同约定调整合同价款",
        "TYPE": "多选题",
        "A": "工程变更和现场签证",
        "B": "工程量清单缺项和工程量偏差",
        "C": "不可抗力",
        "D": "承包人项目亏损",
        "E": "计日工"
    },
    {
        "ANS": "B",
        "Q": "法兰密封面形式为O形圈面型其使用特点为",
        "TYPE": "单选题",
        "A": "O形密封圈是非挤压型密封",
        "B": "O形圈截面尺寸较小消耗材料少",
        "C": "结构简单不需要相配合的凸面和槽面的密封面",
        "D": "密封性能良好但压力使用范围较窄"
    },
    {
        "ANS": "ABCDE",
        "Q": "法务管理的管理原则是",
        "TYPE": "多选题",
        "A": "一体管理",
        "B": "服务中心",
        "C": "体系融合",
        "D": "强化预控",
        "E": "重点突出",
        "F": "严肃追责"
    },
    {
        "ANS": "B",
        "Q": "凡工程类别标准中有两个指标控制的必须要满足两个指标即可按该指标确定的工程类别",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "反映热水锅炉工作强度的指标是",
        "TYPE": "单选题",
        "A": "受热面发热率",
        "B": "受热面蒸发率",
        "C": "额定热功率",
        "D": "额定热水温度"
    },
    {
        "ANS": "A",
        "Q": "房建基础设施专业板块成本控制主要目标临时设施费临时设施临水临电费用1",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "房建项目项目目标管理责任书必须在中标后个月签订完毕",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "C",
        "Q": "房建项目项目目标管理责任书的存档备案时间要求是",
        "TYPE": "单选题",
        "A": "签订岗位责任书后1天内",
        "B": "签订岗位责任书后2天内",
        "C": "签订岗位责任书后3天内",
        "D": "签订岗位责任书后4天内"
    },
    {
        "ANS": "A",
        "Q": "房建项目项目目标管理责任书起草的时间要求是",
        "TYPE": "单选题",
        "A": "标价分离完成后2天内",
        "B": "标价分离完成后3天内",
        "C": "标价分离完成后5天内",
        "D": "标价分离完成后7天内"
    },
    {
        "ANS": "A",
        "Q": "房建项目项目目标管理责任书签订的时间要求是",
        "TYPE": "单选题",
        "A": "确定项目部经理且责任书审批后2天内",
        "B": "确定项目部经理且责任书审批后3天内",
        "C": "确定项目部经理且责任书审批后5天内",
        "D": "确定项目部经理且责任书审批后7天内"
    },
    {
        "ANS": "A",
        "Q": "房建项目编制标价分离书的时间要求",
        "TYPE": "单选题",
        "A": "中标后5天内",
        "B": "中标后7天内",
        "C": "中标后10天内",
        "D": "中标后15天内"
    },
    {
        "ANS": "A",
        "Q": "房建项目标价分离书审批由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "C",
        "Q": "房建项目成本还原在结算定案后天内完成",
        "TYPE": "单选题",
        "A": "10",
        "B": "12",
        "C": "14",
        "D": "16"
    },
    {
        "ANS": "C",
        "Q": "房建项目成本总结在结算定案后天内完成",
        "TYPE": "单选题",
        "A": "10",
        "B": "12",
        "C": "14",
        "D": "16"
    },
    {
        "ANS": "B",
        "Q": "房建项目单份单项额度1万元以上5万元以下的经济签证由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "A",
        "Q": "房建项目单份单项额度5万元以上10万元以下的经济签证由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "C",
        "Q": "房建项目单份一次性零星用工超过400小时或增加工作内容改变合同单价合同单价没有涉及额度5000元以上1万元以下的经济签证由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "A",
        "Q": "房建项目分包结算审批由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "C",
        "Q": "房建项目分包签证累计额度超过分包产值13由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "B",
        "Q": "房建项目分包签证累计额度超过分包产值的3由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "C",
        "Q": "房建项目分供方价格中超控制价审批补充协议价格审批单一来源采购结算与总包关联的分包控制价审批由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务管理部经理",
        "C": "公司总经济师",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "房建项目钢筋损耗率",
        "TYPE": "单选题",
        "A": "1",
        "B": "05",
        "C": "15",
        "D": "2"
    },
    {
        "ANS": "ABCDE",
        "Q": "房建项目管理风险有及运营风险理赔风险不可抗力风险恶劣天气",
        "TYPE": "多选题",
        "A": "征地拆迁风险",
        "B": "设计管理风险",
        "C": "项目履约风险",
        "D": "成本控制风险",
        "E": "工程索赔风险变更补差"
    },
    {
        "ANS": "AB",
        "Q": "房建项目建立完善商务管理体系的职责单位是",
        "TYPE": "多选题",
        "A": "公司",
        "B": "二级单位",
        "C": "项目部"
    },
    {
        "ANS": "A",
        "Q": "房建项目结算利润率计算公式是",
        "TYPE": "单选题",
        "A": "结算利润额结算值",
        "B": "商务策划效益值自施产值",
        "C": "商务策划立项值自施合同额",
        "D": "结算值结算利润额"
    },
    {
        "ANS": "B",
        "Q": "房建项目每月日前项目商务经理审核供应方月度统计",
        "TYPE": "单选题",
        "A": "20",
        "B": "23",
        "C": "24",
        "D": "25"
    },
    {
        "ANS": "B",
        "Q": "房建项目起草项目岗位责任书的时间要求是",
        "TYPE": "单选题",
        "A": "签订项目目标管理责任书后2天内",
        "B": "签订项目目标管理责任书后3天内",
        "C": "签订项目目标管理责任书后5天内",
        "D": "签订项目目标管理责任书后7天内"
    },
    {
        "ANS": "D",
        "Q": "房建项目签订岗位责任书的时间要求是",
        "TYPE": "单选题",
        "A": "签订项目目标管理责任书后2天内",
        "B": "签订项目目标管理责任书后3天内",
        "C": "签订项目目标管理责任书后5天内",
        "D": "签订项目目标管理责任书后7天内"
    },
    {
        "ANS": "C",
        "Q": "房建项目商务策划立项率",
        "TYPE": "单选题",
        "A": "5",
        "B": "10",
        "C": "15",
        "D": "20"
    },
    {
        "ANS": "B",
        "Q": "房建项目商务策划效益率",
        "TYPE": "单选题",
        "A": "5",
        "B": "10",
        "C": "15",
        "D": "20"
    },
    {
        "ANS": "C",
        "Q": "房建项目施工图预算编制完成后日内提供完整物资需求总计划施工过程中根据设计变更等进行调整",
        "TYPE": "单选题",
        "A": "3",
        "B": "5",
        "C": "7",
        "D": "9"
    },
    {
        "ANS": "D",
        "Q": "房建项目收到施工图纸天内编制施工图预算",
        "TYPE": "单选题",
        "A": "30",
        "B": "40",
        "C": "50",
        "D": "60"
    },
    {
        "ANS": "C",
        "Q": "房建项目所有项目分包经济签证实行月清月结制度当月日前上交二级单位商务法务部存档封存周期为上月21日至本月20日",
        "TYPE": "单选题",
        "A": "20",
        "B": "21",
        "C": "25",
        "D": "3031"
    },
    {
        "ANS": "B",
        "Q": "房建项目项目风险金预留返还由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "房建项目项目目标管理考核兑现由审批",
        "TYPE": "单选题",
        "A": "公司总经理董事长",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "C",
        "Q": "房建项目项目目标管理责任书签订由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "房建项目项目目标管理责任书由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "D",
        "Q": "房建项目项目投标阶段商务策划的审批由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "房建项目项目物资工程师每月收到供应方核对资料天内与供应方办理月度统计时间点为上月21日至本月20日供应方按统计单数额开具发票安全生产物资要单独开具发票单独办理",
        "TYPE": "单选题",
        "A": "3",
        "B": "5",
        "C": "6",
        "D": "7"
    },
    {
        "ANS": "C",
        "Q": "房建项目项目资产标准化配置率不低于",
        "TYPE": "单选题",
        "A": "60",
        "B": "70",
        "C": "80",
        "D": "90"
    },
    {
        "ANS": "C",
        "Q": "房建项目协商标准成本降低率的时间要求是",
        "TYPE": "单选题",
        "A": "标价分离编制完成后3天内",
        "B": "标价分离编制完成后5天内",
        "C": "标价分离编制完成后7天内",
        "D": "标价分离编制完成后10天内"
    },
    {
        "ANS": "A",
        "Q": "房建项目行业风险有工程总承包项目结算超概风险及风险",
        "TYPE": "单选题",
        "A": "债权",
        "B": "履约",
        "C": "诚信",
        "D": "合规"
    },
    {
        "ANS": "BDE",
        "Q": "房建项目优化效益率基础设施项目优化效益率专业工程优化效益率分别为多少",
        "TYPE": "多选题",
        "A": "8",
        "B": "9",
        "C": "10",
        "D": "12",
        "E": "14"
    },
    {
        "ANS": "AB",
        "Q": "房建项目预结算指导监督检查的职责单位是",
        "TYPE": "多选题",
        "A": "公司",
        "B": "二级单位",
        "C": "项目部"
    },
    {
        "ANS": "A",
        "Q": "房建项目制定商务管理制度的职责单位是",
        "TYPE": "单选题",
        "A": "公司",
        "B": "二级单位",
        "C": "项目部"
    },
    {
        "ANS": "AB",
        "Q": "房建项目制定商务管理中长期工作规划和年度工作目标计划的职责单位是",
        "TYPE": "多选题",
        "A": "公司",
        "B": "二级单位",
        "C": "项目部"
    },
    {
        "ANS": "C",
        "Q": "房建项目制定项目商务人员工作目标计划的职责单位是",
        "TYPE": "单选题",
        "A": "公司",
        "B": "二级单位",
        "C": "项目部"
    },
    {
        "ANS": "A",
        "Q": "房建项目智慧工地费用自施合同额",
        "TYPE": "单选题",
        "A": "01",
        "B": "02",
        "C": "03",
        "D": "04"
    },
    {
        "ANS": "A",
        "Q": "房建项目自施合同额10亿元以上项目商务策划书由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务管理部经理",
        "C": "公司总经济师",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "房建项目自施合同额10亿元以上项目总包结算相关资料由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "D",
        "Q": "房建项目自施合同额10亿元以下项目商务策划书由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务管理部经理",
        "C": "公司总经济师",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "B",
        "Q": "房建项目自施合同额10亿元以下项目总包结算相关资料由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "ABCDE",
        "Q": "房建项目自施合同额不含",
        "TYPE": "多选题",
        "A": "专业暂估价",
        "B": "暂列金额",
        "C": "指定分包",
        "D": "独立分包",
        "E": "内部配合"
    },
    {
        "ANS": "B",
        "Q": "房建项目总包结算定案交竣工验收之日起个月内合同有约定的按约定完成",
        "TYPE": "单选题",
        "A": "3",
        "B": "6",
        "C": "9",
        "D": "12"
    },
    {
        "ANS": "D",
        "Q": "房建项目总包签证索赔50万元以上的单项签证由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "B",
        "Q": "房建项目总包签证索赔涉及补偿的函件或者1000万元以上的补偿报告由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "D",
        "Q": "房建项目总包签证索赔涉及补偿的函件或者500万元以上的补偿报告由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "ABD",
        "Q": "房屋建筑与装饰工程工程量计算规范GB508542013工程计量中以下工程内容以立方米为计量单位的是",
        "TYPE": "多选题",
        "A": "垫层",
        "B": "有梁板",
        "C": "散水",
        "D": "后浇带",
        "E": "细石砼楼地面"
    },
    {
        "ANS": "D",
        "Q": "非工程实体采购招采流程采用原则出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "统一由采购管理部约标",
        "B": "谁用谁发起",
        "C": "谁用谁定标",
        "D": "谁用谁发起谁用谁定标"
    },
    {
        "ANS": "B",
        "Q": "非工程实体采购招采流程统一由采购中心约标出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "非框架梁下部钢筋当支座不满足直锚长度小于时可以弯锚",
        "TYPE": "单选题",
        "A": "lae",
        "B": "la",
        "C": "lle",
        "D": "15d或者12d"
    },
    {
        "ANS": "B",
        "Q": "分包单位可以将其承包的工程再分包",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "分包单位引进较少投标竞争力欠缺对分包商考察把关不严对负责人经营理念了解不深尤其存在资质不符劳务人员技术不过关挂靠等情况导致的结果是出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "进场后坐地涨价出现工期质量及安全问题分包退场",
        "B": "资源未形成竞争价格高履约能力差",
        "C": "价格偏高或经常性资源断供导致项目工期滞后"
    },
    {
        "ANS": "AD",
        "Q": "分包结算项目部初审项目商务经理组织相关部门会审会签不符合条件退回分包商收到后天内与总包结算关联的分包结算在总包结算定案后天内完成",
        "TYPE": "多选题",
        "A": "20",
        "B": "22",
        "C": "10",
        "D": "7"
    },
    {
        "ANS": "D",
        "Q": "分包结算会审会签单初审计算底稿由我方人员提交收到后天内二级单位商务法务部组织进行复审",
        "TYPE": "单选题",
        "A": "35",
        "B": "40",
        "C": "45",
        "D": "30"
    },
    {
        "ANS": "A",
        "Q": "分包签证管控方面质量问题返工修补谁施工谁负责返修并承担返修材料费用损失不允许签点工或费用",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "分包签证管理要求项目专业工程师负责组织项目相关部门进行会审会签专业工程师对分包指令完成情况进行初步审核项目总工项目副经理确认签证实事项目商务经理审核签证合理性及价款",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "分包签证累计额度超过分包产值13由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "B",
        "Q": "分包签证累计额度超过分包产值的3由审批",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "B",
        "Q": "分包商报量的时间点为必须有分包商签字盖章不能盖章时分包签字代表人必须取得分包单位的授权委托书",
        "TYPE": "单选题",
        "A": "上月26日至本月25日",
        "B": "每月20日前",
        "C": "本月1日30日",
        "D": "上月6日至本月5日"
    },
    {
        "ANS": "B",
        "Q": "分包施工内容验收合格后5天内分包商需提交的结算书必须签字盖章与合同一致",
        "TYPE": "单选题",
        "A": "附分供方进场记录",
        "B": "附分供方进退场记录",
        "C": "附分供方退场记录",
        "D": "附分供方营业执照"
    },
    {
        "ANS": "A",
        "Q": "分部分项工程量清单包括的内容应满足两方面的要求其一要满足规范管理方便管理的要求其二要满足计价的要求",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "分部分项工程量清单的项目编码中位由清单编制人设置",
        "TYPE": "单选题",
        "A": "810",
        "B": "911",
        "C": "912",
        "D": "1012"
    },
    {
        "ANS": "D",
        "Q": "分部分项工程量清单的项目编码中位由清单编制人设置",
        "TYPE": "单选题",
        "A": "810",
        "B": "911",
        "C": "912",
        "D": "1012"
    },
    {
        "ANS": "ABD",
        "Q": "分部分项工程量清单的项目名称应包括的内容为",
        "TYPE": "多选题",
        "A": "项目名称",
        "B": "项目特征",
        "C": "工程内容",
        "D": "拟建工程的实际情况"
    },
    {
        "ANS": "B",
        "Q": "分部分项工程量清单的综合单价不包括招标人自行采购材料的价款",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABE",
        "Q": "分部分项工程量清单应包括等",
        "TYPE": "多选题",
        "A": "项目名称",
        "B": "项目编码",
        "C": "清单说明",
        "D": "工程内容",
        "E": "计量单位"
    },
    {
        "ANS": "B",
        "Q": "分部分项工程量清单综合单价分析表和措施项目费分析表必须要填写",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "分部分项工程项目清单必须根据各专业工程工程量计算规范规定的和计算规则进行编制",
        "TYPE": "多选题",
        "A": "项目编码",
        "B": "项目名称",
        "C": "项目特征",
        "D": "计量单位",
        "E": "工程数量"
    },
    {
        "ANS": "B",
        "Q": "分公司成立在建项目季度目标考核小组考核小组包括分公司经理人力资源岗总经济师总会计师商务法务部财务部",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "分公司的集中采购战略采购定标环节只需在分公司审批出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "分公司集中采购和2000万元以上的砼及砼构件的定标由分公司进行审批出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "分公司没有独立法人地位无法成为民事诉讼的被告因此在合同上加盖分公司印章一般认定为合同无效",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "分公司牵头组织对一般项目进行采购策划一般项目指合同额项目出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "小于5亿元",
        "B": "小于8亿元",
        "C": "小于10亿元",
        "D": "小于12亿元"
    },
    {
        "ANS": "A",
        "Q": "分公司商务法务部牵头负责本辖区的生产经营合规和项目风险管理设立兼职风险联络员牵头组织本辖区风险信息识别督导风险应对方案的制定和实施落实风险动态预警及管控流程",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "分公司授权外的定标需要审批至出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "分公司经理",
        "B": "公司商务管理部经理",
        "C": "公司总经济师",
        "D": "公司采购管理部经理"
    },
    {
        "ANS": "A",
        "Q": "分公司主体二次结构劳务分包资格审查定标由公司进行审批出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "分供方价格中超控制价审批补充协议价格审批单一来源采购结算与总包关联的分包控制价审批由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务管理部经理",
        "C": "公司总经济师",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "C",
        "Q": "分供方价格中超控制价审批补充协议价格审批单一来源采购结算与总包关联的分包控制价审批由审批其余由公司商务管理部经理审批",
        "TYPE": "单选题",
        "A": "二级单位总经济师",
        "B": "二级单位商务经理",
        "C": "公司总经济师",
        "D": "公司商务管理部经理"
    },
    {
        "ANS": "A",
        "Q": "分供方在施工过程中增加合同范围施工标段之外的且与原合同约定的工作内容完全不一致的应重新组织招标出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "分供合同合同条款约定总包竣工后支付至结算值的80是背靠背条款",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "分供合同可以无故不使用公司示范文本",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "分供合同签订使用公司示范文本在定标后1日内起草",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "分供合同签订用印审批通过后3天内从定标至签约总体控制在12天内",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "分供合同条款中可以约定供应商不得在工信部投诉否则罚款2万等条款",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "分供招标清单及合同描述过程中合同单价范围界面不清特征描述与图纸规范有差异或前后有歧义质量标准甲供材损耗责任划分不清分包签证索赔等不明确导致的结果是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "采购滞后影响工期",
        "B": "实际采购价格偏高",
        "C": "责任划分不清分包签证索赔"
    },
    {
        "ANS": "B",
        "Q": "分阶段结算指在工程竣工验收履约证书颁发前发承包双方对施工内容中单位工程子单位工程造价达成一致意见并对该造价签订书面文件及发承包双方对施工合同内容签订书面文件的经济行为",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "分阶段结算指在工程竣工验收履约证书颁发前发承包双方对施工内容中单项工程或单位工程子单位工程造价达成一致意见并对该造价签订书面文件及发承包双方对施工合同内容进行重计量并对计量内容签订书面文件的经济行为",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "风机运转时应符合相关规范要求下面表述正确的有",
        "TYPE": "多选题",
        "A": "风机试运转时以电动机带动的风机均应经一次启动立即停止运转的试验",
        "B": "风机启动后转速不得在临界转速附近停留",
        "C": "风机运转中轴承的进油温度应高于40",
        "D": "风机的润滑油冷却系统中的冷却水压力必须低于油压"
    },
    {
        "ANS": "B",
        "Q": "风险金的特殊处理一般由项目部提出申请人力资源部组织相关部门审核",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "风险金预留完成率实际预留缴纳金额应预留缴纳金额",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "风险与合规管理委员会是本单位经理层关于合规管理的议事机构主要合规管理职责包括推进合规管理体系建设听取并审议重大合规情况汇报定期召开专题会议研究重点难点问题加强部门协同配合统筹推进合规管理各项工作",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "附录计算规则中已包含工程量合理损耗投标人报价中无需自行考虑",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "附墙烟囱通风道垃圾道按其外形体积计算并入所依附的墙体内不扣除每一个孔洞横截面在平方米以内的体积但孔洞内的抹灰工程量亦不增加",
        "TYPE": "单选题",
        "A": "01",
        "B": "02",
        "C": "03",
        "D": "05"
    },
    {
        "ANS": "B",
        "Q": "概算定额是确定完成合格的单位所需消耗的人工材料和机械台班的数量标准",
        "TYPE": "单选题",
        "A": "分项工程和结构构件",
        "B": "扩大分项工程和扩大结构构件",
        "C": "单位工程",
        "D": "单项工程"
    },
    {
        "ANS": "B",
        "Q": "概算定额与预算定额的幅度差一般应控制在以内",
        "TYPE": "单选题",
        "A": "01",
        "B": "015",
        "C": "006",
        "D": "005"
    },
    {
        "ANS": "ABCD",
        "Q": "赶工费是指建设单位将工期压缩后按照常规施工已不能满足工期要求施工单位为了能在建设单位规定的工期里完成施工任务所采取的赶工措施的费用包含哪几类费用",
        "TYPE": "多选题",
        "A": "人材机费用",
        "B": "措施费",
        "C": "管理费规费",
        "D": "其他费用增加工人施工的风险费夜间施工扰民费等其他不可预见费用",
        "E": "利润"
    },
    {
        "ANS": "B",
        "Q": "干粉灭火系统可扑灭的火灾类型为",
        "TYPE": "单选题",
        "A": "硝酸纤维",
        "B": "可熔化固体火灾",
        "C": "可燃固体深位火灾",
        "D": "带电设备火灾"
    },
    {
        "ANS": "A",
        "Q": "钢管桩的计量单位既可以按吨计量也可以按根计量",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "钢筋放样优化率",
        "TYPE": "单选题",
        "A": "钢筋放样优化率钢筋总控量钢筋预算耗用量钢筋总控量",
        "B": "钢筋放样优化率钢筋总控量钢筋实际耗用量钢筋总控量",
        "C": "钢筋放样优化率钢筋施工图预算量钢筋实际耗用量钢筋施工图预算量",
        "D": "钢筋放样优化率钢筋总控量钢筋预算耗用量钢筋总控量"
    },
    {
        "ANS": "CE",
        "Q": "钢筋工程计算中按设计图示尺寸长度乘以单位理论重量计算其中有还需按钢筋预留孔道长度的计算规定增减一定钢筋长度",
        "TYPE": "多选题",
        "A": "预制构件钢筋",
        "B": "先张法预应力钢筋",
        "C": "后张法预应力钢筋",
        "D": "钢筋笼",
        "E": "预应力钢丝束"
    },
    {
        "ANS": "C",
        "Q": "钢筋技术优化率",
        "TYPE": "单选题",
        "A": "钢筋技术优化率施工图用量实际用量施工图用量",
        "B": "钢筋技术优化率实际用量深化图用量施工图用量",
        "C": "钢筋技术优化率施工图用量深化图用量施工图用量",
        "D": "钢筋技术优化率施工图用量预算用量施工图用量"
    },
    {
        "ANS": "B",
        "Q": "钢筋精算优化率",
        "TYPE": "单选题",
        "A": "钢筋精算优化率钢簡工程量同口径钢筋预工程量钢筋预算量",
        "B": "钢筋精算优化率钢簡结算工程量同口径钢筋预算工程量钢筋预算量",
        "C": "钢筋精算优化率钢簡结算工程量钢筋预算工程量钢筋结算工程量",
        "D": "钢筋精算优化率钢簡结算工程量同口径钢筋实际工程量钢筋预算量"
    },
    {
        "ANS": "C",
        "Q": "钢筋精算优化率计算公式是",
        "TYPE": "单选题",
        "A": "确认费用实际成本",
        "B": "商务策划立项值自施合同额",
        "C": "业主确认量预算量预算量",
        "D": "商务策划效益值自施产值"
    },
    {
        "ANS": "B",
        "Q": "钢筋精算优化率是指",
        "TYPE": "单选题",
        "A": "业主确认量结算量结算量",
        "B": "业主确认量预算量预算量",
        "C": "预算量分包结算量预算量",
        "D": "预算量分包结算量业主结算量"
    },
    {
        "ANS": "C",
        "Q": "钢筋牌号为HRB是出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "光圆钢筋",
        "B": "热扎直条光圆钢筋",
        "C": "热扎带肋钢筋"
    },
    {
        "ANS": "D",
        "Q": "高分子材料除具有质轻比强度高韧性好耐磨性好易老化刚度小之外还具有的性能特点是",
        "TYPE": "单选题",
        "A": "导热系数大",
        "B": "耐燃性能好",
        "C": "耐蚀性差",
        "D": "电绝缘性能好"
    },
    {
        "ANS": "D",
        "Q": "隔热保温工程不正确的是",
        "TYPE": "单选题",
        "A": "铺贴不包括胶结材料应以净厚度计算",
        "B": "保温隔热使用稻壳加药物防虫剂时应在清单项目栏中进行描述",
        "C": "柱保温以保温层中心线展开长度乘保温层高度及厚度不包括粘结层厚度计算",
        "D": "墙体保温隔热不扣除管道穿墙洞口所占体积"
    },
    {
        "ANS": "A",
        "Q": "根据保障农民工工资支付条例关于农民工工资的说法正确的是",
        "TYPE": "单选题",
        "A": "施工总承包单位应按照规定存储工资保证金",
        "B": "农民工工资可以以部分实务或者有价证券的方式发放给农民工本人",
        "C": "开设和使用农民工工资专用账户的有关料应当由建设单位保存备查",
        "D": "工总承包单位应对分包单位所招用问别人民工的实名制管理和工资支付负直接责任"
    },
    {
        "ANS": "A",
        "Q": "根据标准设计施工总承包招标文件的规定根据变更产生的原因不同变更有多种情况但无论何种原因导致的工程变更变更指示的发出方式均为",
        "TYPE": "单选题",
        "A": "监理人向承包人发出变更指示",
        "B": "发包人向承包人发出变更指示",
        "C": "发包人向监理人发出变更指示",
        "D": "发包人和监理人共同向承包人发出变更指示"
    },
    {
        "ANS": "D",
        "Q": "根据标准设计施工总承包招标文件的规定下列各项内容中不包括在支付分解报告中的是",
        "TYPE": "单选题",
        "A": "勘察设计费",
        "B": "材料和工程设备费",
        "C": "技术服务培训费",
        "D": "已实施工程应支付金额"
    },
    {
        "ANS": "A",
        "Q": "根据标准施工招标文件下列导致承包人成本增加的情形中可以同时补偿承包人费用和利润的是",
        "TYPE": "单选题",
        "A": "发包人原因导致的工程缺陷和损失",
        "B": "发包人要求承包人提前交付材料和工程设备",
        "C": "常恶劣的气候条件",
        "D": "施工过程中现文物"
    },
    {
        "ANS": "C",
        "Q": "根据房屋建设与装饰工程工程量计算规范GB585552013关于实心砖墙工程量计算方法正确的为",
        "TYPE": "单选题",
        "A": "不扣除沿椽木木砖及凹进墙内的暖气槽所占的体积",
        "B": "框架间墙工程量区分内外墙按墙体净尺寸以体积计算",
        "C": "围墙柱体积并入围墙体积内计算",
        "D": "有混凝土压项围墙的高度算至压顶上表面"
    },
    {
        "ANS": "D",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB50854楼地面踢脚线工程量应",
        "TYPE": "单选题",
        "A": "按设计图示中心线长度计算",
        "B": "按设计图示净长线长度计算",
        "C": "区分不同材料和规格以长度计算",
        "D": "按设计图示长度乘以高度以面积计算"
    },
    {
        "ANS": "C",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB50854下面哪种不属于保温隔热方式",
        "TYPE": "单选题",
        "A": "内保温",
        "B": "外保温",
        "C": "夹层保温",
        "D": "夹心保温"
    },
    {
        "ANS": "A",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013关于分部分项工程量计算下列说法中正确的是",
        "TYPE": "单选题",
        "A": "不考虑施工方法和加工余量",
        "B": "考虑加工余量",
        "C": "考虑施工方法的施工量",
        "D": "考虑合理损耗的施工量"
    },
    {
        "ANS": "A",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013下列关于楼地面工程整体面层工程量计算正确的是",
        "TYPE": "单选题",
        "A": "按设计图示尺寸以面积计算扣除设备基础地沟所占面积",
        "B": "按内墙间净面积计算设备基础间壁墙地沟所占面积不再扣除",
        "C": "按设计图示尺寸以面积计算扣除间壁墙和03m2以内的柱垛所占面积",
        "D": "按设计图示尺寸面积乘以设计厚度以体积计算"
    },
    {
        "ANS": "CD",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013下列关于装饰装修工程量计算正确的有",
        "TYPE": "多选题",
        "A": "天棚抹灰应扣除墙垛柱所占面积",
        "B": "天棚灯带按设计图示尺寸以长度计算",
        "C": "标准金属门按设计图示数量计算",
        "D": "金属面油漆按设计图示尺寸以质量计算",
        "E": "铝合金窗帘盒按设计图示尺寸以面积计算"
    },
    {
        "ANS": "D",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013关于现浇混凝土板的工程量计算正确的为",
        "TYPE": "单选题",
        "A": "栏板按设计图示尺寸以面积计算",
        "B": "雨篷按设计外墙中心线外图示体积计算",
        "C": "阳台板按设计外墙中心线外图示面积计算",
        "D": "散水按设计图示尺寸以面积计算"
    },
    {
        "ANS": "B",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013关于综合脚手架的项目特征必须要描述",
        "TYPE": "单选题",
        "A": "建筑面积",
        "B": "建设结构形式",
        "C": "场内外材料搬运",
        "D": "脚手架的材质"
    },
    {
        "ANS": "C",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013计算清单工程量时附墙柱侧面抹灰",
        "TYPE": "单选题",
        "A": "不计算工程量在综合单价中考虑",
        "B": "计算工程量后并入柱面抹灰工程量",
        "C": "计算工程量后并入墙面抹灰工程量",
        "D": "计算工程量后并入零星抹灰工程量"
    },
    {
        "ANS": "D",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013框架柱的柱高应自柱基上表面至高度计算",
        "TYPE": "单选题",
        "A": "梁顶",
        "B": "梁底",
        "C": "上层建筑标高处",
        "D": "柱顶"
    },
    {
        "ANS": "CE",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013下列关于门窗工程计算正确的有",
        "TYPE": "多选题",
        "A": "金属门五金应单独列项计算",
        "B": "木门门锁已包含在五金中不另计算",
        "C": "金属橱窗飘窗以樘计量项目特征必需描述框外围面积",
        "D": "木质门按门外围尺寸的面积计量",
        "E": "防护铁丝门刷防护涂料应包括在综合单价中人"
    },
    {
        "ANS": "AC",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013砖基础按设计图示尺寸以体积计算应扣除所占体积",
        "TYPE": "多选题",
        "A": "圈梁",
        "B": "基础大放脚T形接头处重叠部分",
        "C": "构造柱",
        "D": "单个面积03的空洞体积",
        "E": "潜入基础的铁件及管道"
    },
    {
        "ANS": "DE",
        "Q": "根据房屋建筑与装饰工程工程量计算规范GB508542013屋面防水及其他中按设计图示尺寸以面积计算的项目是",
        "TYPE": "多选题",
        "A": "屋面排水管",
        "B": "屋面天沟檐沟",
        "C": "屋面吐水管",
        "D": "屋面刚性防水",
        "E": "屋面卷材防水"
    },
    {
        "ANS": "D",
        "Q": "根据房屋建筑与装饰工程工程量计算规范墙面抹灰按设计图示尺寸以面积计但应扣除",
        "TYPE": "单选题",
        "A": "踢脚线",
        "B": "墙与构件交界面",
        "C": "挂镜线",
        "D": "门窗洞口"
    },
    {
        "ANS": "D",
        "Q": "根据房屋建筑与装饰工程工程量计算规范的规定按设计图示尺寸以长度计算油漆工程量的是",
        "TYPE": "单选题",
        "A": "木栏杆",
        "B": "木墙裙",
        "C": "踢脚线",
        "D": "窗帘盒"
    },
    {
        "ANS": "ADE",
        "Q": "根据房屋建筑与装饰工程工程量计算规范的规定有关墙柱面工程工程量计算说法正确的有",
        "TYPE": "多选题",
        "A": "柱面抹灰按设计图示柱断面周长乘以高度以面积计算",
        "B": "柱面镶贴块料按设计图示尺寸以实贴面积计算",
        "C": "墙饰面按设计图示墙外围尺寸乘以净高以面积计算",
        "D": "柱梁面按设计图示饰面外围尺寸以相应面积计算",
        "E": "隔断按设计图示框外围尺寸以面积计算"
    },
    {
        "ANS": "B",
        "Q": "根据房屋建筑与装饰工程工程量计算规范的规定装饰装修工程中可按设计图示数量计算工程量的是",
        "TYPE": "单选题",
        "A": "镜面玻璃",
        "B": "厨房壁柜",
        "C": "雨篷吊挂饰面",
        "D": "暖气罩"
    },
    {
        "ANS": "C",
        "Q": "根据房屋建筑与装饰工程工程量计算规范的有关规定楼梯台阶牵边和侧面镶贴块料面层不大于的少量分散的楼地面镶贴块料面层应按零星装饰项目工程量清单执行",
        "TYPE": "单选题",
        "A": "01m2",
        "B": "03m2",
        "C": "05m2",
        "D": "10m2"
    },
    {
        "ANS": "B",
        "Q": "根据房屋建筑与装饰工程工程量计算规范的有关规定墙体保温隔热工程量正确的计算方法是",
        "TYPE": "单选题",
        "A": "扣除门窗洞口面积不计其侧壁保温隔热工程量",
        "B": "扣除门窗洞口面积计算其侧壁保温隔热工程量",
        "C": "不扣除门窗洞口面积不计其侧壁保温隔热工程量",
        "D": "不扣除门窗洞口面积计算其侧壁保温隔热工程量"
    },
    {
        "ANS": "BC",
        "Q": "根据房屋建筑与装饰工程计量规范GB508542013的规定脚手架计算时计量单位m2是指",
        "TYPE": "多选题",
        "A": "外墙面积",
        "B": "建筑面积",
        "C": "垂直投影面积",
        "D": "脚手架与外墙的接触面积"
    },
    {
        "ANS": "A",
        "Q": "根据国务院关于投资体制改革的决定对于采用直接投资和资金注入方式的政府投资项目政府需要严格审批其",
        "TYPE": "单选题",
        "A": "初步设计和概算",
        "B": "资金申请报告",
        "C": "项目核准报告",
        "D": "开工报告"
    },
    {
        "ANS": "C",
        "Q": "根据合同法对于可撤销的合同具有撤销权的当事人自知道或者因当知道撤销事由之日起内没有行使撤销权的其撤销权消灭",
        "TYPE": "单选题",
        "A": "3个月",
        "B": "6个月",
        "C": "1年",
        "D": "2年"
    },
    {
        "ANS": "B",
        "Q": "根据建设工程工程量清单计价规范GB505002008门窗工程的工程量计算正确的是",
        "TYPE": "单选题",
        "A": "金属推拉窗按设计图示尺寸以窗净面积计算",
        "B": "金属窗套按设计图示尺寸以展开面积计算",
        "C": "铝合金窗帘盒按设计图示尺寸以展开面积计算",
        "D": "金属窗帘轨按设计图示数量计算"
    },
    {
        "ANS": "B",
        "Q": "根据建设工程工程量清单计价规范GB505002008的规定安全文明施工费应计列于之中",
        "TYPE": "单选题",
        "A": "分部分项工程量清单计价表",
        "B": "以计算基础乘费率的形式表示的措施项目清单与计价表",
        "C": "其他项目清单与计价汇总表",
        "D": "规费税金项目计价表"
    },
    {
        "ANS": "B",
        "Q": "根据建设工程工程量清单计价规范GB50500关于材料和专业工程暂估价的说法中正确的是",
        "TYPE": "单选题",
        "A": "材料暂估价表中只填写原材料燃料构配件的暂估价",
        "B": "材料暂估价应纳入分部分项工程量清单项目综合单价",
        "C": "专业工程暂估价指完成专业工程的建筑安装工程费",
        "D": "专业工程暂估价由专业工程承包人填写"
    },
    {
        "ANS": "ACDE",
        "Q": "根据建设工程工程量清单计价规范GB505002008措施费包括",
        "TYPE": "多选题",
        "A": "垂直运输费",
        "B": "劳保费用",
        "C": "施工井点降水费",
        "D": "二次搬运费",
        "E": "冬雨期施工增加费"
    },
    {
        "ANS": "ACDE",
        "Q": "根据建设工程工程量清单计价规范GB505002008措施费包括",
        "TYPE": "多选题",
        "A": "环境保护",
        "B": "劳保费用",
        "C": "施工井点降水费",
        "D": "二次搬运费",
        "E": "冬雨期施工增加费"
    },
    {
        "ANS": "A",
        "Q": "根据建设工程工程量清单计价规范GB505002013承包人无正当理由在约定时间内未递交竣工结算书造成工程结算价款延期支付的责任由承包人承担",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "DE",
        "Q": "根据建设工程工程量清单计价规范GB505002013关于招标控制价的表述符合规定的是",
        "TYPE": "多选题",
        "A": "招标控制价不能超过批准的概算",
        "B": "招标控制价可上下浮动调整3",
        "C": "招标控制价不应在招标文件中公布应予保密",
        "D": "招标控制价超过批准的概算时招标人应将其报原概算审批部门审核",
        "E": "工程造价咨询人不得同时编制同一工程的招标控制价和投标报价"
    },
    {
        "ANS": "B",
        "Q": "根据建设工程工程量清单计价规范GB505002013下列关于工程量清单项目编码的说法中正确的是",
        "TYPE": "单选题",
        "A": "第三级编码为分部工程顺序码由三位数字表示",
        "B": "第五级编码应根据拟建工程的工程量清单项目名称设置不得重码",
        "C": "同一标段含有多个单位工程不同单位工程中项目特征相同的工程应采用相同编码",
        "D": "补充项目编码以B加上计量规范代码后跟三位数字表示"
    },
    {
        "ANS": "A",
        "Q": "根据建设工程工程量清单计价规范GB505002013的规定当合同约定调整因素出现时进行工程价款调整而预备的费用应列入之中",
        "TYPE": "单选题",
        "A": "暂列金额",
        "B": "暂估价",
        "C": "计日工",
        "D": "措施项目费"
    },
    {
        "ANS": "DE",
        "Q": "根据建设工程工程量清单计价规范GB505002013的规定下列属于规费项目清单的是",
        "TYPE": "多选题",
        "A": "安全文明施工费",
        "B": "城市维护建设费",
        "C": "地方教育附加",
        "D": "社会保险费",
        "E": "住房公积金"
    },
    {
        "ANS": "B",
        "Q": "根据建设工程工程量清单计价规范关于投标人投诉招标人不按规范编制招标控制价的说法正确的是",
        "TYPE": "单选题",
        "A": "书面投诉书面投诉书只需加盖投标单位公章",
        "B": "投诉书中应包括投诉依据及有关证明材料",
        "C": "投标人应向政府投资管理部门投诉",
        "D": "投诉人提出投诉的时间为招标控制公布后的10天内"
    },
    {
        "ANS": "A",
        "Q": "根据建设工程工程量清单计价规范某工程采用价格调整公式进行价格调整施工中由于承包人返工的原因导致工期延误则约定竣工日期后继续施工的工程在使用价格调整公式时应采用的价格指数是",
        "TYPE": "单选题",
        "A": "原约定竣工日期与实际竣工日期的两个价格指数中较低者",
        "B": "原约定竣工日期的价格指数",
        "C": "实际竣工日期的价格指数",
        "D": "约定竣工日期与实际竣工日期的两个价格指数中较高者"
    },
    {
        "ANS": "C",
        "Q": "根据建设工程工程量清单计价规范装饰装修工程中门窗套工程量的计算正确的是",
        "TYPE": "单选题",
        "A": "按设计图示尺寸以长度计算",
        "B": "按设计图示尺寸以投影面积计算",
        "C": "按设计图示尺寸以展开面积计算",
        "D": "并入门窗工程量不另计算"
    },
    {
        "ANS": "ABE",
        "Q": "根据建设工程工程量清单计量规范以下关于工程量计算正确的说法是",
        "TYPE": "多选题",
        "A": "现浇混凝土整体楼梯按设计图示的水平投影面积计算包括休息平台平台梁斜梁和连接梁",
        "B": "散水坡道按设计图示尺寸以面积计算不扣除单个面积在03m2以内的孔洞面积",
        "C": "电缆沟地沟和后浇带均按设计图示尺寸以长度计算",
        "D": "混凝土台阶按设计图示尺寸以体积计算",
        "E": "混凝土压顶按设计图示尺寸以体积计算"
    },
    {
        "ANS": "ADE",
        "Q": "根据建设工程施工合同示范文本GF201702011下列变化应纳入工程变更范围的有",
        "TYPE": "多选题",
        "A": "改变墙体厚度",
        "B": "工程设备价格上涨",
        "C": "转由他人实施土石方工程",
        "D": "提高地基沉降控制标准",
        "E": "增加排水沟长度"
    },
    {
        "ANS": "ABCE",
        "Q": "根据建设工程施工合同的规定关于工程进度款的叙述正确的是",
        "TYPE": "多选题",
        "A": "发包人超过约定的支付时间不支付工程款经承包人同意后可延期支付",
        "B": "按约定的时间发包人应扣回的预付款与工程款同期结算",
        "C": "在确认计量结果14天内发包人应向承包人支付工程款",
        "D": "发包人不安合同约定支付工程款双方又未达成延期付款协议导致施工无法进行的应由承包人承担违约责任",
        "E": "进度款的支付比例按照合同约定按期中结算价款总额计不低于60不高于91"
    },
    {
        "ANS": "ABCE",
        "Q": "根据建设工程施工合同的规定关于工程进度款的叙述正确的是",
        "TYPE": "多选题",
        "A": "发包人超过约定的支付时间不支付工程款经承包人同意后可延期支付",
        "B": "按约定的时间发包人应扣回的预付款与工程款同期结算",
        "C": "在确认计量结果14天内发包人应向承包人支付工程款",
        "D": "发包人不安合同约定支付工程款双方又未达成延期付款协议导致施工无法进行的应由承包人承担违约责任",
        "E": "进度款的支付比例按照合同约定按期中结算价款总额计不低于60不高于90"
    },
    {
        "ANS": "ABCE",
        "Q": "根据建设工程施工合同的规定关于工程进度款的叙述正确的是",
        "TYPE": "多选题",
        "A": "发包人超过约定的支付时间不支付工程款经承包人同意后可延期支付",
        "B": "按约定的时间发包人应扣回的预付款与工程款同期结算",
        "C": "在确认计量结果14天内发包人应向承包人支付工程款",
        "D": "发包人不安合同约定支付工程款双方又未达成延期付款协议导致施工无法进行的应由承包人承担违约责任",
        "E": "进度款的支付比例按照合同约定按期中结算价款总额计不低于60不高于90"
    },
    {
        "ANS": "ABE",
        "Q": "根据建设工程施工合同的规定关于工程进度款的叙述正确的是",
        "TYPE": "多选题",
        "A": "货币给付",
        "B": "按约定的时间发包人应扣回的预付款与工程款同期结算",
        "C": "在确认计量结果14天内发包人应向承包人支付工程款",
        "D": "发包人不安合同约定支付工程款双方又未达成延期付款协议导致施工无法进行的应由承包人承担违约责任",
        "E": "进度款的支付比例按照合同约定按期中结算价款总额计不低于60不高于91"
    },
    {
        "ANS": "B",
        "Q": "根据建设工程质星保证金管理办法保证金总预留比例不得高于工程价款结算总额的",
        "TYPE": "单选题",
        "A": "002",
        "B": "003",
        "C": "004",
        "D": "005"
    },
    {
        "ANS": "ABCD",
        "Q": "根据建筑安装工程费用项目组成人工日工资单价包括",
        "TYPE": "多选题",
        "A": "计时工资",
        "B": "计件工资",
        "C": "奖金",
        "D": "津贴补贴",
        "E": "劳动保护费"
    },
    {
        "ANS": "ABCE",
        "Q": "根据建筑安装工程费用项目组成建标201344号安全文明施工费包括",
        "TYPE": "多选题",
        "A": "环境保护费",
        "B": "文明施工费",
        "C": "安全施工费",
        "D": "场地准备及临时设施费",
        "E": "建筑工人实名制管理费"
    },
    {
        "ANS": "BDE",
        "Q": "根据建筑安装工程费用项目组成建标201344号对于不宜计量的措施项目通常用计算基数乘以费率的方法予以计算安全文明施工费的计算基数应为",
        "TYPE": "多选题",
        "A": "直接工程费",
        "B": "定额人工费",
        "C": "直接费",
        "D": "定额人工费和施工机具使用费",
        "E": "定额基价"
    },
    {
        "ANS": "ABCD",
        "Q": "根据建筑安装工程费用项目组成建标201344号临时设施的主要内容包括",
        "TYPE": "多选题",
        "A": "施工现场采用彩色定型钢板砖混凝土砌块等围挡的安砌维修拆除费用",
        "B": "施工现场临时建筑物构筑物的搭设维修拆除",
        "C": "施工现场临时设施的搭设维修拆除",
        "D": "施工现场规定范围内临时简易道路铺设",
        "E": "安全施工标志的购置及安全宣传费用"
    },
    {
        "ANS": "D",
        "Q": "根据建筑工程安全生产管理条例施工单位应当将施工现场的办公生活区域与作业区办公生活区的选址应符合安全性要求饮水休息场所应符合卫生标准",
        "TYPE": "单选题",
        "A": "保持适当距离",
        "B": "随意设置并保持安全距离",
        "C": "保持安全距离",
        "D": "分开设置并保持安全距离"
    },
    {
        "ANS": "A",
        "Q": "根据建筑工程工程量清单计价规范GBT505002008按设计图示尺寸以长度计算油漆工程量的是",
        "TYPE": "单选题",
        "A": "窗帘盒",
        "B": "木墙裙",
        "C": "踢脚线",
        "D": "木栏杆"
    },
    {
        "ANS": "C",
        "Q": "根据建筑工程建筑面积计算规范GBT503532013按照相应计算规则算12面积是",
        "TYPE": "单选题",
        "A": "建筑物间有围护结构有顶盖的架空走廊",
        "B": "无围护结构有围护设施但无结构层的立体车库",
        "C": "有围护设施顶高52m的室外走廊",
        "D": "结构层高310m的门斗"
    },
    {
        "ANS": "D",
        "Q": "根据建筑工程建筑面积计算规范GBT503532013外挑宽度为18m的有柱雨篷建筑面积应",
        "TYPE": "单选题",
        "A": "按柱外边线构成的水平投影面积计算",
        "B": "不计算",
        "C": "接结构板水平投影面积计算",
        "D": "接结构板水平投影面积的12计算"
    },
    {
        "ANS": "ABC",
        "Q": "根据建筑工程建筑面积计算规范GBT503532013不计算建筑面积的是",
        "TYPE": "多选题",
        "A": "建筑物室外台阶",
        "B": "空调室外机搁板",
        "C": "屋顶可上人露台",
        "D": "与建筑物不相连的有顶盖车棚"
    },
    {
        "ANS": "C",
        "Q": "根据建筑工程建筑面积计算规则GBT50353下列关于建筑物雨棚结构的建筑面积计算正确的是",
        "TYPE": "单选题",
        "A": "有柱雨篷按结构外边线计算",
        "B": "无柱雨篷按雨篷水平投影面积计算",
        "C": "雨篷外边线至外墙结构外边线不足210m不计算面积",
        "D": "雨篷外边线至外墙结构外边线超过210m按投影计算面积"
    },
    {
        "ANS": "D",
        "Q": "根据清单计价规范的规定下列各项中不是工程量清单项目内容",
        "TYPE": "单选题",
        "A": "项目编码",
        "B": "项目名称",
        "C": "计量单位",
        "D": "备注"
    },
    {
        "ANS": "D",
        "Q": "根据清单计价规范的规定下列各项中不是工程量清单项目内容",
        "TYPE": "单选题",
        "A": "项目编码",
        "B": "项目名称",
        "C": "计量单位",
        "D": "备注"
    },
    {
        "ANS": "AD",
        "Q": "根据通用安装工程工程量计算规范GB508562013给排水采暖管道室内外界限划分正确的有",
        "TYPE": "多选题",
        "A": "给水管以建筑物外墙皮15m为界入口处设阀门者以阀门为界",
        "B": "排水管以建筑物外墙皮3m为界有化粪池时以化粪池为界",
        "C": "采暖管地下引入室内以室内第一个阀门为界地上引入室内以墙外三通为界",
        "D": "采暖管以建筑物外墙皮15m为界入口处设阀门者以阀门为界"
    },
    {
        "ANS": "D",
        "Q": "根据通用安装工程工程量计算规范单独安装的铁壳开关自动开关箱式电阻器变阻器的外部进出线预留长度应从",
        "TYPE": "单选题",
        "A": "安装对象最远端子接口算起",
        "B": "安装对象最近端子接口算起",
        "C": "安装对象下端往上23处算起",
        "D": "安装对象中心算起"
    },
    {
        "ANS": "D",
        "Q": "根据招标投标法评标委员会成员的名单在前应当保密",
        "TYPE": "单选题",
        "A": "开标",
        "B": "合同签订",
        "C": "中标候选人公示",
        "D": "中标结果确定"
    },
    {
        "ANS": "ABCE",
        "Q": "根据招标投标法实施条例关于依法必须招标项目中标候选人的公示下列说法中正确的有",
        "TYPE": "多选题",
        "A": "应公示中标候选人",
        "B": "公示对象是全部中标候选人",
        "C": "公示期不少于3日",
        "D": "公示在开标后的第二天发布",
        "E": "对有业绩信誉条件的项目其业绩信誉情况应一并进行公示"
    },
    {
        "ANS": "C",
        "Q": "根据中建八局价值创造能力提升三年行动方案职责是1负责落实行动方案的各项要求积极推进工作开展2深入项目一线开展策划工作完成各项方案目标3负责定期向二级单位报告工作开展情况4聚焦分公司层面管控要素确定价值创造方向和目标并组织开展实施",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局价值创造能力提升三年行动方案职责是1履行本单位三年行动主体责任健全本单位组织体系落实局统一规划和部署2负责本单位行动方案细则的制定坚持靠前指挥体系协同实施推进3负责定期梳理本单位行动方案执行情况总结分析及时纠偏监督考核4聚焦公司层面管控要素确定价值创造方向和目标并组织开展实施",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局价值创造能力提升三年行动方案职责是1牵头组织三年行动工作开展2制定行动方案及提升目标3坚持系统联动靠前指挥实施督导推进定期考核开展成果验收总结提升4聚焦局层面管控要素确定价值创造方向和目标并组织开展实施",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "D",
        "Q": "根据中建八局价值创造能力提升三年行动方案职责是1全面落实各项管理要求确保完成项目目标2坚持策划先行围绕两条线铁三角良性互动提升项目盈利能力3做好项目精益管理价值创造案例总结推出经验交流4聚焦项目层面价值创造要素按岗位分解和考核",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "C",
        "Q": "根据中建八局价值创造能力提升三年行动方案1051大盈利项目占比不低于",
        "TYPE": "单选题",
        "A": "45",
        "B": "50",
        "C": "55",
        "D": "60"
    },
    {
        "ANS": "ADE",
        "Q": "根据中建八局价值创造能力提升三年行动方案2022年竣工项目结算平均利润率应达到",
        "TYPE": "多选题",
        "A": "房建项目142",
        "B": "房建项目145",
        "C": "专业工程195",
        "D": "专业工程205",
        "E": "海外项目7"
    },
    {
        "ANS": "BC",
        "Q": "根据中建八局价值创造能力提升三年行动方案2022年竣工项目结算平均利润率应达到",
        "TYPE": "多选题",
        "A": "基础设施175",
        "B": "基础设施18",
        "C": "EPC项目19",
        "D": "EPC项目18",
        "E": "海外项目6"
    },
    {
        "ANS": "BD",
        "Q": "根据中建八局价值创造能力提升三年行动方案2023年竣工项目结算平均利润率应达到",
        "TYPE": "多选题",
        "A": "房建项目142",
        "B": "房建项目145",
        "C": "专业工程205",
        "D": "专业工程22",
        "E": "海外项目7"
    },
    {
        "ANS": "BDE",
        "Q": "根据中建八局价值创造能力提升三年行动方案2023年竣工项目结算平均利润率应达到",
        "TYPE": "多选题",
        "A": "基础设施18",
        "B": "基础设施185",
        "C": "EPC项目19",
        "D": "EPC项目205",
        "E": "海外项目8"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局价值创造能力提升三年行动方案EPC项目竣工项目结算平均利润率2021年达到",
        "TYPE": "单选题",
        "A": "185",
        "B": "19",
        "C": "195",
        "D": "20"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局价值创造能力提升三年行动方案策划效益率平均不低于个百分点",
        "TYPE": "单选题",
        "A": "3",
        "B": "5",
        "C": "8",
        "D": "10"
    },
    {
        "ANS": "ABCD",
        "Q": "根据中建八局价值创造能力提升三年行动方案持续做强做优A类基础设施项目强化履约创效能力发挥规模效益优势将的管理理念和项目日常管控紧密衔接确保落地",
        "TYPE": "多选题",
        "A": "技术牵头",
        "B": "设计入手",
        "C": "系统联动",
        "D": "全程精益"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局价值创造能力提升三年行动方案房建项目竣工项目结算平均利润率2022年达到",
        "TYPE": "单选题",
        "A": "142",
        "B": "145",
        "C": "148",
        "D": "15"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局价值创造能力提升三年行动方案海外项目竣工项目结算平均利润率2022年达到",
        "TYPE": "单选题",
        "A": "6",
        "B": "7",
        "C": "8",
        "D": "9"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局价值创造能力提升三年行动方案基础设施项目竣工项目结算平均利润率2022年达到",
        "TYPE": "单选题",
        "A": "175",
        "B": "18",
        "C": "185",
        "D": "19"
    },
    {
        "ANS": "BCE",
        "Q": "根据中建八局价值创造能力提升三年行动方案价值创造能力提升行动方案确定的工作要求",
        "TYPE": "多选题",
        "A": "一年宣及推广",
        "B": "一年宣贯打基础",
        "C": "两年推进出成效",
        "D": "三年推进出成效",
        "E": "三年熟化再提升"
    },
    {
        "ANS": "ABCD",
        "Q": "根据中建八局价值创造能力提升三年行动方案坚定目标管理全覆盖科学设定项目管理目标强化四阶段有效实施",
        "TYPE": "多选题",
        "A": "标价分离",
        "B": "责任书签订",
        "C": "风险金预留",
        "D": "考核兑现",
        "E": "奖金发放"
    },
    {
        "ANS": "BCE",
        "Q": "根据中建八局价值创造能力提升三年行动方案建立健全全员全过程全方位的六全价值创造管理体系",
        "TYPE": "多选题",
        "A": "全周期",
        "B": "全要素",
        "C": "全产业链",
        "D": "全专业",
        "E": "全业务领域"
    },
    {
        "ANS": "ACE",
        "Q": "根据中建八局价值创造能力提升三年行动方案紧紧围绕的价值创造力强和的战略目标将推进集团行动和价值创造行动结合起来",
        "TYPE": "多选题",
        "A": "一创五强",
        "B": "万亿八局",
        "C": "六个一流",
        "D": "六个领先",
        "E": "六专"
    },
    {
        "ANS": "ABCDE",
        "Q": "根据中建八局价值创造能力提升三年行动方案聚焦管理创新培育盈利新路径包括以下几方面",
        "TYPE": "多选题",
        "A": "培育提升专业工程盈利能力",
        "B": "培育提升科技增值能力",
        "C": "培育提升采购降本增效能力",
        "D": "培育创新业务盈利模式",
        "E": "培育提升财务金融创效能力"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局价值创造能力提升三年行动方案快速结算额占当年营收比不低于",
        "TYPE": "单选题",
        "A": "15",
        "B": "20",
        "C": "25",
        "D": "30"
    },
    {
        "ANS": "AB",
        "Q": "根据中建八局价值创造能力提升三年行动方案强化协同联动多措并举促提升包括以下几方面",
        "TYPE": "多选题",
        "A": "同166战略统筹开展",
        "B": "同各业务行动协同开展",
        "C": "提升信息化支撑作用",
        "D": "提升岗位绩效激励",
        "E": "提升组织绩效激励"
    },
    {
        "ANS": "ACD",
        "Q": "根据中建八局价值创造能力提升三年行动方案深入开展EPC三年行动大力实施十百千计划推行五位一体项目管理架构提升EPC项目专业管理和资源整合五大能力",
        "TYPE": "多选题",
        "A": "设计管理",
        "B": "计划实施",
        "C": "计划管控",
        "D": "采购管理"
    },
    {
        "ANS": "ABDE",
        "Q": "根据中建八局价值创造能力提升三年行动方案完善考核评价体系推动考核评价各环节高效衔接促进各考核评价相关部门协同发力提升考核评价的四环节紧密衔接",
        "TYPE": "多选题",
        "A": "审计",
        "B": "考核",
        "C": "评审",
        "D": "兑现",
        "E": "发放"
    },
    {
        "ANS": "BC",
        "Q": "根据中建八局价值创造能力提升三年行动方案以下关于投资业务综合开发项目成本利润率说法正确的是",
        "TYPE": "多选题",
        "A": "2022年达到12",
        "B": "2022年达到122",
        "C": "2023年达到125",
        "D": "2023年达到13"
    },
    {
        "ANS": "BC",
        "Q": "根据中建八局价值创造能力提升三年行动方案以下关于投资业务综合开发项目股东各方内部收益率IRR说法正确的是",
        "TYPE": "多选题",
        "A": "2022年达到12",
        "B": "2022年达到122",
        "C": "2023年达到125",
        "D": "2023年达到13"
    },
    {
        "ANS": "D",
        "Q": "根据中建八局价值创造能力提升三年行动方案在建工程计量确权率年均提升个百分点以上",
        "TYPE": "单选题",
        "A": "01",
        "B": "015",
        "C": "02",
        "D": "025"
    },
    {
        "ANS": "ABC",
        "Q": "根据中建八局价值创造能力提升三年行动方案支撑举措包括",
        "TYPE": "多选题",
        "A": "提升信息化支撑作用",
        "B": "提升岗位绩效激励",
        "C": "提升组织绩效激励",
        "D": "提升系统联动"
    },
    {
        "ANS": "ABCDE",
        "Q": "根据中建八局价值创造能力提升三年行动方案重点工作是",
        "TYPE": "多选题",
        "A": "聚焦成本领先承传优势提效益",
        "B": "聚焦主业领域积蓄动能拓蓝海",
        "C": "聚焦管理创新培育盈利新路径",
        "D": "强化风险管理安全运营提质量",
        "E": "强化协同联动多措并举促提升"
    },
    {
        "ANS": "C",
        "Q": "根据中建八局价值创造能力提升三年行动方案专业工程项目竣工项目结算平均利润率2022年达到",
        "TYPE": "单选题",
        "A": "195",
        "B": "20",
        "C": "205",
        "D": "21"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局潜亏项目专项治理方案2021版职责是1负责本单位专项治理的各项工作是专项治理的责任主体2负责定期梳理本单位潜亏项目清单3负责拟定潜亏项目应对方案明晰责任落实到人4负责指导帮扶三级单位及项目部开展专项治理工作",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版职责是1负责编制治理方案拟定治理目标牵头潜亏项目专项治理工作2负责督导治理方案实施以及工作落实3负责定期分析预警和检查通报考核目标完成情况",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "C",
        "Q": "根据中建八局潜亏项目专项治理方案2021版职责是1负责落实治理方案各项要求积极推进专项治理工作2负责深入开展项目策划完成各项治理目标3负责定期向二级单位报告推进情况",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版职责是1全面负责督导跟踪推进潜亏项目专项治理工作2组织协调局优势资源对重点单位开展专项治理策划3考核各责任单位专项治理目标完成情况",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "市场部",
        "C": "法律合规与风险管理部",
        "D": "采购管理部"
    },
    {
        "ANS": "D",
        "Q": "根据中建八局潜亏项目专项治理方案2021版职责是1全面落实各项管理要求确保完成管理目标2协同联动积极主动开展扭亏策划化解项目风险3确保履约过程基础资料完整有效签证索赔等资料及时确认",
        "TYPE": "单选题",
        "A": "局总部",
        "B": "二级单位",
        "C": "三级单位",
        "D": "项目部"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版ⅠⅡ类项目按照潜亏金额大小分别划分为ABC三个风险等级其中A级为存在重大潜亏风险",
        "TYPE": "单选题",
        "A": "潜亏金额05亿元专业为02亿元",
        "B": "潜亏金额06亿元专业为02亿元",
        "C": "潜亏金额07亿元专业为04亿元",
        "D": "潜亏金额08亿元专业为04亿元"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版ⅠⅡ类项目按照潜亏金额大小分别划分为ABC三个风险等级其中B级为存在较大潜亏风险",
        "TYPE": "单选题",
        "A": "01亿元潜亏金额05亿元专业为00502亿元之间",
        "B": "01亿元潜亏金额06亿元专业为0102亿元之间",
        "C": "02亿元潜亏金额05亿元专业为0104亿元之间",
        "D": "02亿元潜亏金额06亿元专业为0204亿元之间"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版ⅠⅡ类项目按照潜亏金额大小分别划分为ABC三个风险等级其中C级为存在一般潜亏风险",
        "TYPE": "单选题",
        "A": "潜亏金额01亿元专业为005亿元",
        "B": "潜亏金额015亿元专业为005亿元",
        "C": "潜亏金额02亿元专业为01亿元",
        "D": "潜亏金额02亿元专业为015亿元"
    },
    {
        "ANS": "C",
        "Q": "根据中建八局潜亏项目专项治理方案2021版对于因管理原因造成的亏损进行严肃考核项目经理原则上内不得再担任项目经理商务经理原则上内不得再担任商务经理不得升职任用",
        "TYPE": "单选题",
        "A": "两年两年",
        "B": "三年两年",
        "C": "三年三年",
        "D": "五年三年"
    },
    {
        "ANS": "D",
        "Q": "根据中建八局潜亏项目专项治理方案2021版二级单位商务管理部及时总结各业务系统潜亏成因和措施成果集成典型做法和优秀经验反哺管理",
        "TYPE": "单选题",
        "A": "每季度次月5日前",
        "B": "每季度次月10日前",
        "C": "每季度次月25日前",
        "D": "每季度次月30日前"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版二级单位商务管理部监控项目收入成本变动情况扭亏举措落实情况过程目标完成情况及时预警督导",
        "TYPE": "单选题",
        "A": "每月5日前",
        "B": "每月10日前",
        "C": "每月15日前",
        "D": "每月20日前"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局潜亏项目专项治理方案2021版二级单位商务管理部全面盘点项目成本情况对比分析相关数值动态更新潜亏项目清单",
        "TYPE": "单选题",
        "A": "每季度月底前",
        "B": "每季度次月5日前",
        "C": "每季度次月10日前",
        "D": "每季度次月15日前"
    },
    {
        "ANS": "D",
        "Q": "根据中建八局潜亏项目专项治理方案2021版二级单位商务管理部建立例会机制交流通报推进情况聚焦潜亏项目主要问题进行专项督导",
        "TYPE": "单选题",
        "A": "每季度次月5日前",
        "B": "每季度次月10日前",
        "C": "每季度次月25日前",
        "D": "每季度次月30日前"
    },
    {
        "ANS": "ABCD",
        "Q": "根据中建八局潜亏项目专项治理方案2021版管理风险包括以下几方面",
        "TYPE": "多选题",
        "A": "工期管理",
        "B": "变更管理",
        "C": "质量管理",
        "D": "无效成本",
        "E": "合同管理"
    },
    {
        "ANS": "ABCD",
        "Q": "根据中建八局潜亏项目专项治理方案2021版管理原则为",
        "TYPE": "多选题",
        "A": "统筹兼顾",
        "B": "突出重点",
        "C": "分类管理",
        "D": "整体推进"
    },
    {
        "ANS": "C",
        "Q": "根据中建八局潜亏项目专项治理方案2021版潜亏项目按照项目所处不同阶段及潜亏类型分为ⅠⅡⅢ类其中项目为工程计量确权率小于100但自施利润率为正值的项目",
        "TYPE": "单选题",
        "A": "Ⅰ类",
        "B": "Ⅱ类",
        "C": "Ⅲ类"
    },
    {
        "ANS": "A",
        "Q": "根据中建八局潜亏项目专项治理方案2021版潜亏项目按照项目所处不同阶段及潜亏类型分为ⅠⅡⅢ类其中项目为完竣工节点时自施利润率为负值的项目",
        "TYPE": "单选题",
        "A": "Ⅰ类",
        "B": "Ⅱ类",
        "C": "Ⅲ类"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局潜亏项目专项治理方案2021版潜亏项目按照项目所处不同阶段及潜亏类型分为ⅠⅡⅢ类其中项目为在建期间自施利润率为负值的项目",
        "TYPE": "单选题",
        "A": "Ⅰ类",
        "B": "Ⅱ类",
        "C": "Ⅲ类"
    },
    {
        "ANS": "B",
        "Q": "根据中建八局潜亏项目专项治理方案2021版潜亏项目为项目的治理目标是年度项目扭亏率不低于60",
        "TYPE": "单选题",
        "A": "Ⅰ类",
        "B": "Ⅱ类",
        "C": "Ⅲ类"
    },
    {
        "ANS": "ABCD",
        "Q": "根据中建八局潜亏项目专项治理方案2021版主要应对风险为",
        "TYPE": "多选题",
        "A": "营销风险",
        "B": "合同风险",
        "C": "市场风险",
        "D": "管理风险"
    },
    {
        "ANS": "B",
        "Q": "根据最高人民法院关于审理建设工程施工合同纠纷案件适用法律问题的解释下列关于工程竣工日期确定的说法正确的是",
        "TYPE": "单选题",
        "A": "建设工程经竣工验收合格的以提交竣工结算文件为竣工日期",
        "B": "承包人已经提交竣工验收报告发包人拖延验收的以承包人提交验收报告之日为竣工日期",
        "C": "建设工程未经竣工验收发包人擅自使用的以承包人提交验收报告之日为竣工日期",
        "D": "承包人已经提交竣工验收报告发包人拖延验收的以提交竣工结算文件为竣工日期"
    },
    {
        "ANS": "BCDE",
        "Q": "根据2013市政工程工程量计算规范按拆除部位以面积计算的有",
        "TYPE": "多选题",
        "A": "拆除侧平缘石",
        "B": "拆除路面",
        "C": "拆除人行道",
        "D": "拆除基层",
        "E": "铣刨路面"
    },
    {
        "ANS": "ABCD",
        "Q": "根据2013市政工程工程量计算规范下列选项中按设计图示尺寸以体积计算的有",
        "TYPE": "多选题",
        "A": "沉井混凝土封底",
        "B": "沉井混凝土底板",
        "C": "沉井填心",
        "D": "基槽抛铺碎石",
        "E": "沉管接缝处理"
    },
    {
        "ANS": "C",
        "Q": "根据GB508572013市政工程工程量计算规范规定浇筑混凝土井的工作内容不包括的是",
        "TYPE": "单选题",
        "A": "垫层铺筑混凝土拌和运输浇筑养护防水止水",
        "B": "模板制作安装拆除",
        "C": "搭拆井字架",
        "D": "踏步井圈井盖安装"
    },
    {
        "ANS": "C",
        "Q": "根据标注施工招标文件发包人应进行工期延长增加费用并支付合理利润的情形是",
        "TYPE": "单选题",
        "A": "施工过程中发现文物采取措施",
        "B": "遇到不利物质条件采取措施",
        "C": "发包人提供的基准点有误导致施工方返工",
        "D": "发包人提供的设备不符合合同要求须进行更换"
    },
    {
        "ANS": "A",
        "Q": "根据工期费用索赔优化执行情况最终奖金乘以难度系数取011难度系数由谁确定",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司商务管理部经理",
        "C": "公司总经理",
        "D": "分公司总经济师"
    },
    {
        "ANS": "B",
        "Q": "根据公司采购管理手册规定项目部的采购授权为单笔以内累计不超过的零星采购出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "5万元10万元",
        "B": "5万元20万元",
        "C": "5万元30万元",
        "D": "5万元40万元"
    },
    {
        "ANS": "A",
        "Q": "根据公司相关规定主体二次结构定标环节需按照要求上传标前交底书出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "根据公司相关规定主体二次结构资审需审批到公司层级出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "根据管理要求可选择云筑平台线上开标或线上线下同时开标出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "根据规定因工程量偏差引起的可以调整措施项目费的前提是",
        "TYPE": "单选题",
        "A": "合同工程量偏差超过15",
        "B": "合同工程量偏差超过15且引起措施项目相应变化",
        "C": "措施项目工程量超过10",
        "D": "措施项目工程量超过10且引起施工方案发生变化"
    },
    {
        "ANS": "C",
        "Q": "根据国外建筑安装工程费的构成规定工程施工中的周转材料费应包含在中",
        "TYPE": "单选题",
        "A": "材料费",
        "B": "暂定金额",
        "C": "开办费",
        "D": "其他摊销费"
    },
    {
        "ANS": "C",
        "Q": "根据平法规定关于悬挑梁的钢筋以下说法错误的是",
        "TYPE": "单选题",
        "A": "只有当悬挑梁长度L4hb时端部才会有弯起钢筋",
        "B": "弯起钢筋的根数为至少2根脚筋并不少于第一排纵筋根数的12",
        "C": "弯起钢筋为所有纵筋根数的12",
        "D": "角筋不弯起"
    },
    {
        "ANS": "ABE",
        "Q": "根据现行标准设计总承包招标文件工程总承包项目合同中的暂列金额可用于支付签订合同时",
        "TYPE": "多选题",
        "A": "不可预见的变更设计费用",
        "B": "不可预见的变更施工费用",
        "C": "已知必然发生但暂时无法确定价格的专业工程费用",
        "D": "已知必然发生但暂时无法确定价格的工程设备购置费用",
        "E": "以计日工方式的工程变更费用"
    },
    {
        "ANS": "ABC",
        "Q": "根据现行建设工程工程量清单计价规范关于工程量清单的特点和应用下列说法正确的有",
        "TYPE": "多选题",
        "A": "分为招标工程量清单和已标价工程量清单",
        "B": "以单位项工程为单位编制",
        "C": "是招标文件的组成部分",
        "D": "是载明发包工程内容和数量的清单不涉及金额",
        "E": "仅用于最高投标限价和投标报价的编制"
    },
    {
        "ANS": "BCE",
        "Q": "根据现行财务制度和企业会计准则新增固定资产价值的内容包括",
        "TYPE": "多选题",
        "A": "专有技术",
        "B": "建设单位管理费",
        "C": "土地征用费",
        "D": "银行存款",
        "E": "建筑工程设计费"
    },
    {
        "ANS": "A",
        "Q": "根据现行建设项目投资相关规定为完成工程项目建设并达到使用要求或生产条件在建设期内预计或实际投入的全部费用总和是指",
        "TYPE": "单选题",
        "A": "建设项目总投资",
        "B": "固定资产投资",
        "C": "工程造价",
        "D": "建设投资"
    },
    {
        "ANS": "D",
        "Q": "根据现行建筑安装工程费用项目组成规定下列费用项目属于按照造价形成划分的是",
        "TYPE": "单选题",
        "A": "人工费",
        "B": "企业管理费",
        "C": "利润",
        "D": "税金"
    },
    {
        "ANS": "A",
        "Q": "根据现有规定下列项目中进项税额不得从销项税额中抵扣的是",
        "TYPE": "单选题",
        "A": "用于集体福利或者个人消费的购进货物劳务服务无形资产和不动产",
        "B": "正常损失的购进货物以及相关的劳务和交通运输服务",
        "C": "正常损失的在产品产成品所耗用的购进货物不包括固定资产劳务和交通运输服务",
        "D": "自境外单位或者个人购进劳务服务无形资产或者境内的不动产"
    },
    {
        "ANS": "B",
        "Q": "根据预结算管理办法2022版规定总包结算管理小组组员有项目铁三角总经济师二级单位商务法务部商务管理部",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "根据预结算管理办法2022版中规定停工项目要有停工报告书对现场的人员机械材料设备已完成签证工作需要有业主签字的有效资料",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "根据预结算管理办法2022版中规定下列属于二级单位审批权限的是结算责任状完成考核结算专用章使用审批结算奖罚事宜审批",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "根据政府采购法对于实行集中采购的政府采购集中采购目录应由公布",
        "TYPE": "单选题",
        "A": "省级以上人民政府",
        "B": "国务院相关主管部门",
        "C": "省级政府采购部门",
        "D": "县级以上人民政府"
    },
    {
        "ANS": "B",
        "Q": "根据最高人民法院关于审理建设工程施工合同纠纷案件适用法律问题的解释工程欠款利息支付时利息的起算日应首先选择",
        "TYPE": "单选题",
        "A": "建设工程交付之日",
        "B": "应付工程价款之日",
        "C": "提交竣工结算文件之日",
        "D": "当事人起诉之日"
    },
    {
        "ANS": "A",
        "Q": "工程计量的主要依据是",
        "TYPE": "单选题",
        "A": "施工图纸和工程量计算规则",
        "B": "施工图纸和建筑面积计算规则",
        "C": "施工图纸和合同",
        "D": "施工图纸和预算定额表"
    },
    {
        "ANS": "A",
        "Q": "工程计量确权率指同口径下业主确认产值与项目实际成本的比值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "工程计量确权率",
        "TYPE": "单选题",
        "A": "工程计量确权率业主确认产值成本",
        "B": "工程计量确权率业主确认自施产值实际成本",
        "C": "工程计量确权率业主确认产值自施成本",
        "D": "工程计量确权率业主确认自施产值自施成本"
    },
    {
        "ANS": "A",
        "Q": "工程进度款支付",
        "TYPE": "单选题",
        "A": "不低于工程价款的60不高于工程价款的90",
        "B": "不低于工程价款锝90",
        "C": "不低于工程价款的70不高于工程价款的85",
        "D": "应按工程价款的95付款保留55的质量保修金"
    },
    {
        "ANS": "A",
        "Q": "工程竣工后在向发包人递交结算报告后的7个工作日内但不得晚于竣工后2个月内项目商务经理应组织进行合同总结经二级单位商务法务部审核后上传至公司管理平台",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "工程竣工结算编制与核对的责任分工是",
        "TYPE": "单选题",
        "A": "发包人编制承包人核对",
        "B": "监理人编制发包人核对",
        "C": "工程造价咨询机构编制承包人核对",
        "D": "承包人编制发包人核对"
    },
    {
        "ANS": "B",
        "Q": "工程竣工验收前3个月成立结算小组为组长",
        "TYPE": "单选题",
        "A": "总工",
        "B": "项目经理",
        "C": "项目商务经理项目商务经理",
        "D": "项目商务经理项目经理"
    },
    {
        "ANS": "A",
        "Q": "工程量必须按照相关工程现行国家计量规范规定的工程量计算规则计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "工程量清单的编制主要用于",
        "TYPE": "多选题",
        "A": "编制标底",
        "B": "投标报价",
        "C": "编制设计文件",
        "D": "编制企业定额",
        "E": "办理竣工验收"
    },
    {
        "ANS": "BC",
        "Q": "工程量清单的项目设置规则是为了统一工程量清单的",
        "TYPE": "多选题",
        "A": "项目名称",
        "B": "项目编码",
        "C": "计量单位",
        "D": "项目内容",
        "E": "项目特征"
    },
    {
        "ANS": "B",
        "Q": "工程量清单及其计价格式中的任何内容不得随意删除或涂改但可以添加",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "工程量清单计价包括分部分项工程费措施项目费其他项目费规费和税金",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "工程量清单可以采用工料单价计价",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "工程量清单应采用综合单价计价",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "工程量清单应由具有编制招标文件能力的招标人或受其委托的中介机构进行编制",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACDE",
        "Q": "工程量清单中的工程量计算规则按专业分有工程",
        "TYPE": "多选题",
        "A": "建筑工程装饰",
        "B": "水利",
        "C": "安装",
        "D": "园林绿化",
        "E": "市政"
    },
    {
        "ANS": "B",
        "Q": "工程量清单中某些分部分项的工程量的计算规则与清单中工程内容的工程量的计算规则是一致的",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "工程量清单作为清单计价的基础主要用于建设工程的",
        "TYPE": "单选题",
        "A": "决策阶段和设计阶段",
        "B": "设计阶段和招投标阶段",
        "C": "施工阶段和运营使用阶段",
        "D": "招投标阶段和施工阶段"
    },
    {
        "ANS": "ABCE",
        "Q": "工程网络计划优化是指",
        "TYPE": "多选题",
        "A": "寻求工程总成本最低时工期安排",
        "B": "使计算工期满足要求工期",
        "C": "按要求工期寻求最低成本",
        "D": "在工期保持不变的条件下使咨询需用量最少",
        "E": "在满足资源限制条件下使工期延长最少"
    },
    {
        "ANS": "ABCD",
        "Q": "工程项目中设计概算的审查方法包括",
        "TYPE": "多选题",
        "A": "对比分析法",
        "B": "查询核实法",
        "C": "分类整理法",
        "D": "联合会审法"
    },
    {
        "ANS": "ABC",
        "Q": "工程造价管理体系中的是工程计价的主要依据",
        "TYPE": "多选题",
        "A": "工程造价管理的标准体系",
        "B": "工程定额体系",
        "C": "工程计价信息体系",
        "D": "工程法律体系",
        "E": "工程技术体系"
    },
    {
        "ANS": "ABCE",
        "Q": "工程造价咨询人出具的工程造价鉴定书应包括下列内容",
        "TYPE": "多选题",
        "A": "工程特征",
        "B": "委托鉴定的证据材料",
        "C": "鉴定的依据及使用的专业技术手段",
        "D": "鉴定公司的描述",
        "E": "明确的鉴定结论"
    },
    {
        "ANS": "ABCE",
        "Q": "工程造价咨询人出具的工程造价鉴定书应包括下列内容",
        "TYPE": "多选题",
        "A": "鉴定项目委托人名称委托鉴定的内容工程特征",
        "B": "委托鉴定的证据材料",
        "C": "鉴定的依据及使用的专业技术手段",
        "D": "鉴定公司的描述",
        "E": "明确的鉴定结论"
    },
    {
        "ANS": "ABCD",
        "Q": "工程造价咨询人收集鉴定项目的鉴定依据时应向鉴定项目委托人提出具体书面要求其内容包括",
        "TYPE": "多选题",
        "A": "鉴定项目委托人名称委托鉴定的内容",
        "B": "相应的施工图纸等技术经济文件",
        "C": "施工过程中的施工组织质量工期和造价等工程资料",
        "D": "存在争议的事实及各方当事人的理由",
        "E": "项目人员组成情况"
    },
    {
        "ANS": "C",
        "Q": "工程中标后由二级三级单位牵头组织生产技术财务采购等系统专家依照项目商务策划书的内容对项目商务管理过程进行技术工期安全质量收款采购等策划属于策划",
        "TYPE": "单选题",
        "A": "投标策划",
        "B": "设计策划",
        "C": "一体化策划",
        "D": "结算策划"
    },
    {
        "ANS": "ABD",
        "Q": "工程中常用有色金属及其合金中其有优良耐蚀性的有",
        "TYPE": "多选题",
        "A": "镍及其合金",
        "B": "钛及其合金",
        "C": "镁及其合金",
        "D": "铅及其合金"
    },
    {
        "ANS": "ABCD",
        "Q": "工程总包结算小组全程参与结算工作制定结算计划分工明确责任到人",
        "TYPE": "多选题",
        "A": "项目经理",
        "B": "项目总工",
        "C": "商务经理",
        "D": "项目商务人员"
    },
    {
        "ANS": "ABCDE",
        "Q": "工期顺延事件的费用索赔内容分为哪几类",
        "TYPE": "多选题",
        "A": "市场价格变动导致的上涨费",
        "B": "大型机械周转料具等使用期限延长费",
        "C": "资产折旧摊销费施工条件改变增加费",
        "D": "窝工及进退场影响费",
        "E": "规费及管理费"
    },
    {
        "ANS": "B",
        "Q": "工人工作时为恢复体力稍作休息的时间为非定额时间",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "工人伤亡的责任主体一般为用人单位即分包单位",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "公建类项目大型机械使用费",
        "TYPE": "单选题",
        "A": "25元m建筑面积",
        "B": "30元m建筑面积",
        "C": "35元m建筑面积",
        "D": "40元m建筑面积"
    },
    {
        "ANS": "AD",
        "Q": "公开招标是指以招标公告的方式邀请或参与投标的采购方式出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "不特定的法人",
        "B": "特定的法人",
        "C": "推荐的分包商",
        "D": "其他组织"
    },
    {
        "ANS": "D",
        "Q": "公开招标是指以招标公告的方式邀请不特定的法人或参与投标的采购方式出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "不良行为单位",
        "B": "特定的法人",
        "C": "推荐的分包商",
        "D": "其他组织"
    },
    {
        "ANS": "B",
        "Q": "公开招标时间较短及招标信息未充分到达优质单位采购集中在小范围供应商内不能形成充分竞争环境导致的结果是出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "进场后坐地涨价出现工期质量及安全问题分包退场",
        "B": "资源未形成竞争价格高履约能力差",
        "C": "价格偏高或经常性资源断供导致项目工期滞后"
    },
    {
        "ANS": "ABC",
        "Q": "公路工程施工图批复后发包人组织按照统一格式核对两阶段施工图变化情况并经四方签认形成零号清单作为工程计量依据",
        "TYPE": "多选题",
        "A": "设计",
        "B": "监理",
        "C": "施工单位",
        "D": "勘察"
    },
    {
        "ANS": "A",
        "Q": "公司项目既保留了盐城火车站原有的城市记忆又打造出展示盐城湿地文化的新地标",
        "TYPE": "单选题",
        "A": "盐城黄海湿地博物馆",
        "B": "盐城湿地博物馆",
        "C": "盐城东海湿地博物馆",
        "D": "江苏湿地博物馆"
    },
    {
        "ANS": "ABCD",
        "Q": "公司按照的原则系统编制形成公司2023版系列管理手册",
        "TYPE": "多选题",
        "A": "精简制度",
        "B": "优化流程",
        "C": "删繁就简",
        "D": "横纵联动"
    },
    {
        "ANS": "D",
        "Q": "公司参建的阿尔及利亚松树俱乐部项目个月完成建设国际五星级酒店创造中国公司海外建设速度新纪元",
        "TYPE": "单选题",
        "A": "16",
        "B": "18",
        "C": "15",
        "D": "20"
    },
    {
        "ANS": "B",
        "Q": "公司承建的是国内首个面积超过10万平方米的航站楼改扩建项目",
        "TYPE": "单选题",
        "A": "西安咸阳国际机场",
        "B": "南京禄口机场T1航站楼改扩建工程",
        "C": "海口美兰机场",
        "D": "大兴国际机场"
    },
    {
        "ANS": "C",
        "Q": "公司承建的是中建八局最早荣获省部级优质工程的住宅类项目",
        "TYPE": "单选题",
        "A": "魏公村小区项目",
        "B": "张府园456高层",
        "C": "上海珠江玫瑰花园2号楼",
        "D": "苏州园区小区项目"
    },
    {
        "ANS": "B",
        "Q": "公司承建的工程荣获2005年全国十大建设科技成就奖",
        "TYPE": "单选题",
        "A": "苏州奥体中心",
        "B": "南京奥林匹克体育中心主体育场",
        "C": "滁州奥体中心",
        "D": "蚌埠体育中心"
    },
    {
        "ANS": "B",
        "Q": "公司承建的是集演艺会议展示娱乐等功能为一体的大型文化综合体分为歌剧厅音乐厅戏剧厅综艺厅共享空间等五部分是亚洲最大的剧院综合体",
        "TYPE": "单选题",
        "A": "敦煌大剧院",
        "B": "江苏大剧院",
        "C": "保利大剧院",
        "D": "上海大剧院"
    },
    {
        "ANS": "B",
        "Q": "公司承建的是南京古城核心区旧城改造项目惠及一万余户居民",
        "TYPE": "单选题",
        "A": "南京汇杰新城",
        "B": "南京鼓楼中心片区改造",
        "C": "沿江大道改造工程",
        "D": "岱山安置房项目"
    },
    {
        "ANS": "A",
        "Q": "公司承建的是中建八局2020年承建的合同额体量最大的新基建项目",
        "TYPE": "单选题",
        "A": "阿里巴巴江苏总部",
        "B": "扬子江国际会议中心",
        "C": "江苏大剧院",
        "D": "绍兴二环北路"
    },
    {
        "ANS": "A",
        "Q": "公司承建的项目是院府合作的典型项目为南京江北地区打造品质型标杆性医院",
        "TYPE": "单选题",
        "A": "江苏省人民医院浦口分院三期",
        "B": "丁家庄妇幼保健院",
        "C": "栖霞妇幼保健院",
        "D": "江北新区医院"
    },
    {
        "ANS": "D",
        "Q": "公司承建的项目于2022年6月24日竣工并成为安徽省第十五届运动会主场馆",
        "TYPE": "单选题",
        "A": "芜湖体育中心",
        "B": "合肥奥体中心",
        "C": "蚌埠奥体中心",
        "D": "滁州奥体中心"
    },
    {
        "ANS": "A",
        "Q": "公司承建的安徽亳州民用机场项目是皖北第二个民用机场项目",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司承建的财盛大厦是海南建省后的第一幢高层被称誉为海南速度",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司承建的海口市是海南建省后的第一幢高层主体工程施工速度平均5天一层最快4天一层55天完成主体被海南日报称为海南速度",
        "TYPE": "单选题",
        "A": "财盛大厦",
        "B": "汇通大厦",
        "C": "东方万国",
        "D": "上海珠江玫瑰花园2号楼"
    },
    {
        "ANS": "A",
        "Q": "公司承建的南京奥林匹克体育中心主体育场工程荣获2005年全国十大建设科技成就奖",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司承建的南京地铁九号线项目是中建八局2020年承建的合同额体量最大的新基建项目",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司承建的徐州移动大楼2003年竣工是公司在徐州市公建领域的第一个国优奖",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "公司承建的中国电子科技集团第三十八研究所科研综合楼荣获和",
        "TYPE": "多选题",
        "A": "国家优质工程奖",
        "B": "安徽省黄山杯",
        "C": "南京金陵杯",
        "D": "江苏省扬子杯"
    },
    {
        "ANS": "A",
        "Q": "公司的前身部队曾改编为华东野战军建制部队参加了涟水孟良崮淮海等解放山东安徽和苏北的大小数十次战役和战斗",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "公司的前身最早可以追溯到新四军皖东游击队",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "公司对已交竣工未结算本年度收尾项目进行统计编制年度结算计划经公司总经济师审核后上报局商务管理部",
        "TYPE": "单选题",
        "A": "每年1月10日前",
        "B": "每年2月10日前",
        "C": "每年3月10日前",
        "D": "每年4月10日前"
    },
    {
        "ANS": "C",
        "Q": "公司对已竣工未结算本年度收尾项目进行统计编制年度结算计划经公司总经济师审核后上报局商务管理部的时间要求是什么",
        "TYPE": "单选题",
        "A": "每年3月5日前",
        "B": "每年3月20日前",
        "C": "每年3月10日前",
        "D": "每年3月15日前"
    },
    {
        "ANS": "C",
        "Q": "公司及分公司集中采购组织投标单位投标报价的时间应不少于天出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "3",
        "B": "4",
        "C": "5",
        "D": "6"
    },
    {
        "ANS": "B",
        "Q": "公司建设的为5A级高档写字楼高200米地下4层地上36层主要服务于银行金融机构为上海陆家嘴地标性建筑被列为上海市重点工程是三公司第三次开拓上海市场后在陆家嘴金融核心区承接的标志性工程毗邻中国第一高楼632米上海中心",
        "TYPE": "单选题",
        "A": "中石化项目",
        "B": "东方汇经中心",
        "C": "平安幸福中心",
        "D": "新金陵饭店"
    },
    {
        "ANS": "B",
        "Q": "公司建设的项目创造了三项世界第一的建筑奇迹也铸就了中建八局艰苦创业科技为先忘我奉献铸造精品的大漠精神",
        "TYPE": "单选题",
        "A": "海口财盛大厦",
        "B": "酒泉卫星发射中心总装测试厂房",
        "C": "南京奥体中心",
        "D": "青奥会议中心"
    },
    {
        "ANS": "C",
        "Q": "公司建设的项目被列为江苏省建筑业新技术应用示范工程和中国建筑总公司1996年科技推广示范工程",
        "TYPE": "单选题",
        "A": "海口美兰国际机场航站楼工程",
        "B": "徐州观音国际机场航站楼工程",
        "C": "南京禄口国际机场航站楼工程",
        "D": "成都天府机场国际航站楼工程"
    },
    {
        "ANS": "D",
        "Q": "公司建设的于2008年10月11日举办了常州市第十三届运动会开幕式",
        "TYPE": "单选题",
        "A": "常州游泳馆",
        "B": "常州足球场",
        "C": "常州幸福中心",
        "D": "常州体育馆"
    },
    {
        "ANS": "ABCE",
        "Q": "公司建设的酒泉卫星发射中心总装测试厂房项目创造了三项世界第一的建筑奇迹也铸就了中建八局的大漠精神",
        "TYPE": "多选题",
        "A": "艰苦创业",
        "B": "科技为先",
        "C": "忘我奉献",
        "D": "不畏艰险",
        "E": "铸造精品"
    },
    {
        "ANS": "C",
        "Q": "公司建设的南京烷基苯厂年产烷基苯吨为当时我国最大的烷基苯生产基地",
        "TYPE": "单选题",
        "A": "5万吨",
        "B": "62万吨",
        "C": "72万吨",
        "D": "10万吨"
    },
    {
        "ANS": "A",
        "Q": "公司南京市大厂污水处理厂新建工程一期获全国市政工程最高质量水平评价",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "公司内控时效要求公开招标整个招标用时不超过天每个审批流程不超过天出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "302",
        "B": "352",
        "C": "282",
        "D": "353"
    },
    {
        "ANS": "C",
        "Q": "公司牵头组织对重点项目进行采购策划重点项目一般指合同额项目出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "大于5亿元",
        "B": "大于8亿元",
        "C": "大于10亿元",
        "D": "大于12亿元"
    },
    {
        "ANS": "A",
        "Q": "公司前身曾先后承建了西北光学仪器厂东方机械厂远东机械制造公司等10项重大工程",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司全面风险管理的管理原则是预防为主体系融合重点突出",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "公司全面风险管理的总体要求是通过完善全面风险管理体系与制度在公司总部各部门各层级强化风险的识别预警管控与处置责任推进风险管理更加全面化体系化及时化与有效化确保公司各类风险全面受控",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "公司申报的江苏省数字城市智慧建造与运维工程研究中心获江苏省发改委批复认定这也是公司获得的首个省级工程研究中心",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司实施总包结算月度督导跟踪监控报表由二级单位上报至公司",
        "TYPE": "单选题",
        "A": "每月1日前",
        "B": "每月5日前",
        "C": "每月25日前",
        "D": "每月20日前"
    },
    {
        "ANS": "A",
        "Q": "公司实行一般较大重大和特大四个风险等级管理前十大风险由总部各部门每月进行评估与督导处置并对其中内容与应对举措进行动态调整",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "公司自研的自行走测量机器人在盘城2号保障房项目实现应用",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "公司综合实力位列2022年度中建集团号码公司第名",
        "TYPE": "单选题",
        "A": "三",
        "B": "五",
        "C": "七",
        "D": "九"
    },
    {
        "ANS": "B",
        "Q": "供求因果增加费属于施工附加费",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "构造边缘构件不包括哪一种",
        "TYPE": "单选题",
        "A": "构造边缘暗柱",
        "B": "构造边缘框柱",
        "C": "构造边缘翼墙",
        "D": "构造边缘转角墙"
    },
    {
        "ANS": "C",
        "Q": "固定消防炮水炮系统的适用范围为",
        "TYPE": "单选题",
        "A": "甲乙丙类液体火灾",
        "B": "液化石油气火灾",
        "C": "一般固体可燃物火灾",
        "D": "天然气等可燃气体火灾"
    },
    {
        "ANS": "D",
        "Q": "固定资产投资包括",
        "TYPE": "单选题",
        "A": "建筑费安装费预备费",
        "B": "建筑费安装费建设其他费",
        "C": "建安费建设其他费预备费",
        "D": "工程费用建设其他费预备费建设期利息"
    },
    {
        "ANS": "D",
        "Q": "固定资产投资包括",
        "TYPE": "单选题",
        "A": "建筑费安装费预备费",
        "B": "建筑费安装费建设其他费",
        "C": "建安费建设其他费预备费",
        "D": "工程费用建设其他费预备费建设期利息"
    },
    {
        "ANS": "ACD",
        "Q": "固体散料输送设备中振动输送机的特点包括",
        "TYPE": "多选题",
        "A": "可以输送高温磨琢性及有化学腐蚀性物料",
        "B": "结构简单初始投资价格较低",
        "C": "维护费用及运行费用较低",
        "D": "不能大角度向上倾斜输送物料"
    },
    {
        "ANS": "CDE",
        "Q": "关于清单门窗计量单位下列说法不正确的是勘误提示答案为",
        "TYPE": "多选题",
        "A": "卷帘门按设计数量计算",
        "B": "窗帘盒按设计长度计算",
        "C": "门窗套按设计长度计算",
        "D": "钢窗按砖口面积计算",
        "E": "窗帘轨以设计数量计算"
    },
    {
        "ANS": "B",
        "Q": "关于扁梁节点核心区的说法错误的是",
        "TYPE": "单选题",
        "A": "框架扁梁节点核心区代号为KBH",
        "B": "框架扁梁节点核心区包括柱内核心区和柱外核心区及端部核心区",
        "C": "框架扁梁节点核心区钢筋注写包括柱外核心区竖向拉筋及节点核心区附加纵向钢筋",
        "D": "框架扁梁端节点核心区还需要注写附加U型箍筋"
    },
    {
        "ANS": "ABCE",
        "Q": "关于场地准备及临时设施费说法正确的是",
        "TYPE": "多选题",
        "A": "临时设施费包括建设期间租赁费用以及施工期间专用公路或桥梁的加固养护维修等费用",
        "B": "场地准备和临时设施费工程费用费率拆除清理费",
        "C": "场地准备及临时设施应尽量与永久性工程统一考虑",
        "D": "改扩建项目的场地准备和临时设施费应根据实际工程量估算",
        "E": "临时设施费不包括已列入建筑安装工程费用中的施工单位临时设施费用"
    },
    {
        "ANS": "BC",
        "Q": "关于成本价格数据库说法正确的是",
        "TYPE": "多选题",
        "A": "每月25日前项目部收集价格数据",
        "B": "每月25日前二级单位收集价格数据",
        "C": "每季度次月10日前公司数据汇总与发布",
        "D": "每季度次月15日前局总部成本价格数据库维护",
        "E": "每季度次月10日前局总部成本价格数据库维护"
    },
    {
        "ANS": "BE",
        "Q": "关于承包人原因导致的工期延误期间合同价款的调整下列说法正确的有",
        "TYPE": "多选题",
        "A": "国家政策变化引起工程造价增加的应调增合同价款",
        "B": "国家政策变化引起工程造价降低的应调减合同价款",
        "C": "使用价格调整公式调价时以计划进度日期指数为现行价格指数",
        "D": "使用价格调整公式调价时以实际进度日期指数为现行价格指数",
        "E": "使用价格调整公式调价时以计划进度日期与实际进度日期两个指数中较低者作为调价指数"
    },
    {
        "ANS": "AB",
        "Q": "关于措施项目工程量清单编制与计价下列说法中正确的有",
        "TYPE": "多选题",
        "A": "能计算工程量的措施项目宜采用分部分项工程量清单方式编制",
        "B": "安全文明施工费按总价方式编制其计算基础可为定额基价定额人工费",
        "C": "总价措施项目清单表应列明计量单位计算基础费率金额等内容",
        "D": "除安全文明施工费外的其他总价措施项目的计算基础可为定额基价"
    },
    {
        "ANS": "B",
        "Q": "关于地下室外墙下列说法错误的是",
        "TYPE": "单选题",
        "A": "地下室外墙的代号是DWQ",
        "B": "h表示地下室外墙的厚度",
        "C": "OS表示外墙外侧贯通筋",
        "D": "IS表示外墙内侧贯通筋"
    },
    {
        "ANS": "BCD",
        "Q": "关于低成本运营中关键指标说法正确的是",
        "TYPE": "多选题",
        "A": "手工工具零星材料线下采购不超过MRO价格120",
        "B": "房建项目钢筋损耗率1",
        "C": "木方回收率60",
        "D": "房建项目零星机械租赁费03"
    },
    {
        "ANS": "D",
        "Q": "关于多层砌体工程工业房屋的圈梁设置位置正确的为",
        "TYPE": "单选题",
        "A": "在底层设置一道",
        "B": "在檐口标高处设置一道",
        "C": "在纵橫墙上隔层设置",
        "D": "在每层和檐口标高处设置"
    },
    {
        "ANS": "C",
        "Q": "关于房建基础设施专业板块成本控制临时设施费",
        "TYPE": "单选题",
        "A": "14",
        "B": "12",
        "C": "10",
        "D": "08"
    },
    {
        "ANS": "D",
        "Q": "关于分部分项工程项目清单中项目编码的编制下列说法正确的是",
        "TYPE": "单选题",
        "A": "第二级编码为分部工程顺序码",
        "B": "第五级编码为分项工程项目名称顺序码",
        "C": "同一标段内多个单位工程中项目特征完全相同的分项工程可采用项目编码",
        "D": "补充项目应采用6位编码"
    },
    {
        "ANS": "C",
        "Q": "关于工程变更的说法错误的是",
        "TYPE": "单选题",
        "A": "工程师同意采用承包方合理化建议所发生的费用全部由业主承担",
        "B": "施工中承包方不得擅自对原工程设计进行变更",
        "C": "任何工程变更均须由工程师确认并签发工程变更指令",
        "D": "工程变更包括改变有关工程的施工时间和顺序"
    },
    {
        "ANS": "BD",
        "Q": "关于工程变更的说法错误的是",
        "TYPE": "多选题",
        "A": "监理人要求承包人改变已批准的施工工艺或顺序属于变更",
        "B": "发包人通过变更取消某项工作从而转由他人实施",
        "C": "监理人要求承包人为完成工程需要追加的额外工作属于变更",
        "D": "承包人不能全面落实变更指令而扩大的损失由发包人承担",
        "E": "工程变更指令发布后应当迅速落实指令全面修改相关的各种文件"
    },
    {
        "ANS": "C",
        "Q": "关于工程建设其他费中的市政公用配套设施费及其构成下列说法正确的是",
        "TYPE": "单选题",
        "A": "包含在用地与工程准备费中",
        "B": "包括界区内水电路电信等设施建设费",
        "C": "包括界区内外绿化人防等配套设施建设费",
        "D": "包括项目配套建设的产权不归本单位的专用铁路公路建设费"
    },
    {
        "ANS": "B",
        "Q": "关于工程量清单编制中的项目特征描述下列说法中正确的是",
        "TYPE": "单选题",
        "A": "措施项目无需描述项目特征",
        "B": "应按计量规范附录中规定的项目特征结合技术规范标准图集加以描述",
        "C": "对完成清单项目可能发生的具体工作和操作程序仍需加以描述",
        "D": "项目特征是确定清单工程量不可缺少的重要依据"
    },
    {
        "ANS": "A",
        "Q": "关于工程质量保证金的说法正确的是",
        "TYPE": "单选题",
        "A": "合同约定缺陷责任期终止后发包人应按照合同中最终结清的相关规定将剩余的质量保证金返还给承包人",
        "B": "在合同约定的缺陷责任期终止后发包人退还剩余质量保证金承包人不再承担质量保修责任",
        "C": "保修期内因发包人使用不当造成工程的缺陷损坏承包人也应负责维修费用从质量保证金中扣除",
        "D": "最终结清时如果承包人被预留的质量保证金不足以抵减发包人工程缺陷修复费用的发包人应承担不足部分"
    },
    {
        "ANS": "A",
        "Q": "关于基坑与边坡支护工程量计算的说法正确的是",
        "TYPE": "单选题",
        "A": "地下连续墙按设计图示尺寸以体积计算",
        "B": "咬合灌注桩按设计图示尺寸以体积计算",
        "C": "喷射混凝土按设计图示以体积计算",
        "D": "预制钢筋混凝土板桩按照设计图示尺寸以体积计算"
    },
    {
        "ANS": "A",
        "Q": "关于加强专业领域自主采购模式转变的通知中专业工程自主采购13项有钢结构幕墙精装修电气给排水消防暖通智能化人防园林绿化金属屋面体育工艺医疗专项出题来源采购管理部关于加强专业领域自主采购模式转变的通知",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "关于剪力墙下面哪种说法是错误的",
        "TYPE": "单选题",
        "A": "剪力墙端部无暗柱时水平钢筋弯折10d设置双列拉筋",
        "B": "剪力墙端部无暗柱时可设置U型箍筋做封边构造设置双列拉筋",
        "C": "剪力墙端部遇暗柱时水平筋紧贴角筋内侧弯折10d",
        "D": "剪力墙端部遇L形暗柱时水平筋紧贴角筋内侧弯折10d"
    },
    {
        "ANS": "ABC",
        "Q": "关于建设项目总投资及工程造价的构成说法正确的是",
        "TYPE": "多选题",
        "A": "建设投资和建设期利息之和对应于固定资产投资",
        "B": "固定资产投资与建设项目的工程造价在量上相等",
        "C": "工程造价中的主要构成部分是建设投资",
        "D": "工程费用仅包含建筑安装工程费"
    },
    {
        "ANS": "ABC",
        "Q": "关于建设项目总预算的编制说法正确的是",
        "TYPE": "多选题",
        "A": "建设项目总预算由组成该建设项目的各个单项工程综合预算以及经计算的工程建设其他费预备费和建设期利息和铺底流动资金汇总而成",
        "B": "三级预算编制中总预算由综合预算和工程建设其他费预备费建设期利息及铺底流动资金汇总而成",
        "C": "以建设项目施工图预算编制时为界线若B选项中的费用已经发生按合理发生金额列计如果还未发生按照原概算内容和本阶段的计费原则计算列入",
        "D": "单项工程预算书主要由综合预算表综合费率表构成"
    },
    {
        "ANS": "CD",
        "Q": "关于结算小组以下说法错误的是",
        "TYPE": "多选题",
        "A": "项目经理为组长",
        "B": "项目总工商务经理全程参与结算工作",
        "C": "公司经理为组长",
        "D": "项目全体成员全程参与结算工作"
    },
    {
        "ANS": "B",
        "Q": "关于金属窗工程量计算说法正确的是",
        "TYPE": "单选题",
        "A": "彩板钢窗按设计图示尺寸以框外围展开面积计算",
        "B": "金属纱窗按框的外围尺寸以面积计算",
        "C": "金属百叶窗按框外围尺寸以面积计算",
        "D": "金属橱窗按设计图示洞口尺寸以面积计算"
    },
    {
        "ANS": "ABCD",
        "Q": "关于抗震缝处墙局部构造中针对拉结筋说法正确的有",
        "TYPE": "多选题",
        "A": "不少于4根",
        "B": "直径10",
        "C": "竖向间距150",
        "D": "水平间距由设计指定"
    },
    {
        "ANS": "ABCD",
        "Q": "关于连梁暗梁及边框梁的拉筋说法正确的是",
        "TYPE": "多选题",
        "A": "当梁宽350时为6",
        "B": "当梁宽350时为8",
        "C": "间距为2倍箍筋间距",
        "D": "竖向沿侧面水平筋隔一拉一"
    },
    {
        "ANS": "AB",
        "Q": "关于梁原位标注规定描述正确是",
        "TYPE": "多选题",
        "A": "当梁中间支座两边的上部纵筋不同时须在支座两边分别标注",
        "B": "当梁中间支座两边的上部纵筋相同时可仅在支座的一边标注配筋值另一边省去不注",
        "C": "当上部纵筋多于一排时用加号将各排纵筋自上而下分开",
        "D": "当同排纵筋有两种直径时用斜线将前后的纵筋相联"
    },
    {
        "ANS": "AD",
        "Q": "关于楼梯装饰工程量计算规则正确的说法是",
        "TYPE": "多选题",
        "A": "按设计图示尺寸以楼梯水平投影面积计算",
        "B": "踏步休息平台应单独另行计算",
        "C": "踏步应单独另行计算休息平台不应单独另行计算",
        "D": "踏步休息平台不单独另行计算",
        "E": "休息平台应单独另行计算而踏步不应单独计算"
    },
    {
        "ANS": "ABCD",
        "Q": "关于目标管理责任书的管理要求说法正确的是",
        "TYPE": "多选题",
        "A": "岗位责任书签订完成人员变更到岗后应在7天内补充签订并通知财务系统",
        "B": "根据项目总体管理目标进行分解编制项目岗位责任书",
        "C": "项目起草岗位责任书可根据项目实际情况增加相应岗位及工作内容",
        "D": "因项目二次经营增加工程内容的应签订相关补充项目目标管理责任书"
    },
    {
        "ANS": "BC",
        "Q": "关于泡沫喷头的设置下列说法正确的有",
        "TYPE": "多选题",
        "A": "用于固定消防炮灭火系统",
        "B": "可分为吸气型和非吸气型",
        "C": "吸气型可采用蛋白氟蛋白或水成膜泡沫液",
        "D": "非吸气型只能采用蛋白氟蛋白泡沫液"
    },
    {
        "ANS": "AC",
        "Q": "关于其他项目清单与计价表的编制下列说法正确的有",
        "TYPE": "多选题",
        "A": "材料暂估单价进入清单项目综合单价不汇总到其他项目清单计价表总额",
        "B": "暂列金额归招标人所有投标人应将其扣除后再做投标报价",
        "C": "专业工程暂估价的费用构成类别应与分部分项工程综合单价的构成保持致",
        "D": "计日工的名称和数量应由投标人填写",
        "E": "总承包服务费的内容和金额应由投标人填写"
    },
    {
        "ANS": "ACD",
        "Q": "关于砌体工程量计算正确的有",
        "TYPE": "多选题",
        "A": "按设计图示尺寸以体积计算",
        "B": "扣除大放面T形接头处的重叠部分",
        "C": "内墙基础长度按净长线计算",
        "D": "材料相同时基础于墙身划分通常以设计室内地坪为界",
        "E": "基础工程量不扣除构造柱所占面积"
    },
    {
        "ANS": "CE",
        "Q": "关于人工定额消耗量的确定下列算式正确的有",
        "TYPE": "多选题",
        "A": "工序作业时间基本工作时间X1辅助工作时间占比",
        "B": "工序作业时间基本工作时间辅助工作时间不可避免中断时间",
        "C": "规范时间准备与结束时间不可避免中断时间休息时间",
        "D": "定额时间基本工作时间1辅助工作时间占比",
        "E": "定额时间基本工作时间辅助工作时间1规范时间占比"
    },
    {
        "ANS": "AD",
        "Q": "关于设备购置费中的设备原价下列说法正确的有",
        "TYPE": "多选题",
        "A": "包含随设备同时订购的首套备品备件费",
        "B": "包括施工现场自制设备的制造费",
        "C": "包括达到固定资产标准的办公家具购置费",
        "D": "包括进口设备从来源地到买方边境的运输费",
        "E": "包括设备采购保管人员的工资费"
    },
    {
        "ANS": "D",
        "Q": "关于设备融资租贷的说法正确的是",
        "TYPE": "单选题",
        "A": "租赁期的设备租金总额低于直接购置设备的费用",
        "B": "租赁容易导致承租人资产负债状况恶化",
        "C": "租贷期间承租人可以将租用设备用于抵押贷款",
        "D": "设备融资租赁的租期通常较长"
    },
    {
        "ANS": "ABD",
        "Q": "关于审批权限的说法正确的是",
        "TYPE": "多选题",
        "A": "项目投标阶段商务策划由二级单位总经济师审批",
        "B": "项目目标管理责任书由公司总经理审批",
        "C": "标价分离书由公司总经济师审批",
        "D": "自施合同额10亿元以上项目商务策划书由公司商务管理部经理审批"
    },
    {
        "ANS": "ADE",
        "Q": "关于施工图预算的编制下列说法正确的有",
        "TYPE": "多选题",
        "A": "施工图总预算应控制在已批准的设计总概算范围内",
        "B": "施工图预算采用的价格水平应与设计概算编制时期的保持致",
        "C": "只有一个单项工程的建设项目应采用三级预算编制形式",
        "D": "单项工程综合预算由组成该单项工程的各个单位工程预算汇总而成",
        "E": "施工图预算编制时已发生的工程建设其他费按合理发生金额列计"
    },
    {
        "ANS": "ABC",
        "Q": "关于投标报价标准成本确定的说法正确的是",
        "TYPE": "多选题",
        "A": "成本测算启动会由二级单位总报价师牵头组织确定工作分工编制成本测算进度计划",
        "B": "标前标准成本由二级单位商务法务部和市场客户部共同确认",
        "C": "标前标准成本报公司商务管理部审核经公司商务管理部和市场客户部共同确认后备案",
        "D": "标前标准成本作为项目标价分离测算的基础数据中标后标价分离要重新测算标准成本"
    },
    {
        "ANS": "AC",
        "Q": "关于投资估算指标下列说法正确的有",
        "TYPE": "多选题",
        "A": "以独立的建设项目单位工程或单位工程为对象",
        "B": "费用和消耗量指标主要来自概算指标",
        "C": "一般分为建设项目综合指标单项工程指标和单位工程指标三个层次",
        "D": "单位工程指标般以单位生产能力投资表示",
        "E": "建设项目综合指标表示的建设项目的静态投资指标"
    },
    {
        "ANS": "ABD",
        "Q": "关于增值税部分下列进项税额准予从销项税额中抵扣的有",
        "TYPE": "多选题",
        "A": "从销售方取得的增值税专用发票上注明的增值税额",
        "B": "从海关取得的海关进口增值税专用缴款书上注明的增值税额",
        "C": "购进农产品除取得增值税专用发票或者海关进口增值税专用缴款书外按照农产品收购发票或者销售发票上注明的农产品买价和11的扣除率计算的进项税额",
        "D": "从境外单位或者个人购进服务无形资产或者不动产自税务机关或者扣缴义务人取得的解缴税款的完税凭证上注明的增值税额"
    },
    {
        "ANS": "ABD",
        "Q": "关于招标人与中标人合同的签订下列说法正确的有",
        "TYPE": "多选题",
        "A": "双方按照招标文件和投标文件订立书面合同",
        "B": "双方在投标有效期内并在自中标通知书发出之日起30日内签订施工合同",
        "C": "招标人要求中标人按中标下浮3后签订施工合同",
        "D": "中标人无正当理由拒绝签订合同的招标人可不退还其投标保证金",
        "E": "招标人在于中标人签订合同后5日内向所有投标人退还投标保证金"
    },
    {
        "ANS": "B",
        "Q": "关于支撑钢筋铁马工程量计量的说法错误的是",
        "TYPE": "单选题",
        "A": "区分钢筋种类和规格按钢筋长度乘单位理论质量计算",
        "B": "现浇构件中固定位置的支撑钢筋用的铁马只能按钢筋长度乘单位理论质量计算",
        "C": "机械连接需要单独列项计算工程量",
        "D": "双层钢筋用的铁马如果设计未明确结算时可按现场签证数量计算"
    },
    {
        "ANS": "B",
        "Q": "关于主次梁相交部位箍筋吊筋次梁加筋的构造以下错误的是",
        "TYPE": "单选题",
        "A": "主次梁相交部位主梁箍筋照设次梁箍筋在主梁边50mm处开始布置",
        "B": "主次梁相交部位箍筋均不设次梁范围布置次梁加筋",
        "C": "次梁加筋布置在次梁两侧",
        "D": "吊筋的高度随主梁高度当主梁高大于800时吊筋弯折60"
    },
    {
        "ANS": "ABCD",
        "Q": "关于总包结算评审及提交正确的做法是",
        "TYPE": "多选题",
        "A": "组织总包结算评审与交竣工成本对比若发现未达到上缴利润率情况则立即组织相关部门研究分析原因",
        "B": "商务管理部组织评审提出修改建议",
        "C": "竣工结算文件提交发包人时必须取得发包人有效签收包括签名和收到日期明确结算报送金额",
        "D": "项目部根据评审建议及要求对交竣工结算文件结算资料结算书进行补充和调整"
    },
    {
        "ANS": "B",
        "Q": "关于总包结算以下说法错误的是",
        "TYPE": "单选题",
        "A": "项目竣工前三个月启动总包结算流程项目竣工前两个月内完成工程量计算",
        "B": "由商务经理牵头商务主管负责梳理编制项目所有结算资料",
        "C": "竣工前一个月内完成结算初稿二级单位组织专家小组和结算小组审核结算资料",
        "D": "进行结算策划确保项目竣工验收结束后一个月内上报结算资料"
    },
    {
        "ANS": "D",
        "Q": "管道绝热工程施工时适用于纤维质绝热层面上的保护层材料应该采用",
        "TYPE": "单选题",
        "A": "石棉石膏",
        "B": "石棉水泥",
        "C": "金属薄板",
        "D": "玻璃丝布"
    },
    {
        "ANS": "A",
        "Q": "管理原则中公平公正原则指的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "须做到机会公平过程公正结果公开",
        "B": "须做到机会公正过程公平结果公开",
        "C": "须做到过程公平评审公正结果公开",
        "D": "须做到机会公平评审公正结果公开"
    },
    {
        "ANS": "B",
        "Q": "管理原则中三全三化原则指的是",
        "TYPE": "单选题",
        "A": "实行招标采购的规范化标准化信息化管理全专业全过程全方位管控",
        "B": "实行招标采购的全专业全过程全方位管理规范化标准化信息化管控",
        "C": "实行招标采购的全专业全周期全方位管理技术化标准化信息化管控",
        "D": "实行招标采购的规范化技术化信息化管理全专业全周期全方位管控"
    },
    {
        "ANS": "A",
        "Q": "管理总目标员工满意度保持分以上",
        "TYPE": "单选题",
        "A": "85",
        "B": "90",
        "C": "95",
        "D": "100"
    },
    {
        "ANS": "C",
        "Q": "灌注桩的加劲筋如果设计未注明时应按照多大直径算",
        "TYPE": "单选题",
        "A": "8",
        "B": "10",
        "C": "12",
        "D": "16"
    },
    {
        "ANS": "BCD",
        "Q": "光纤传输中的单模光纤其主要传输特点有",
        "TYPE": "多选题",
        "A": "对光源要求低可配用LED光源",
        "B": "模间色散很小传输频带较宽",
        "C": "耦合光能量较小",
        "D": "传输设备较贵"
    },
    {
        "ANS": "D",
        "Q": "规范项目资产加强物资过程的标准化规范化管理实现高回收高周转",
        "TYPE": "单选题",
        "A": "效益化",
        "B": "系统化",
        "C": "模式化",
        "D": "精细化"
    },
    {
        "ANS": "ACD",
        "Q": "锅炉本体部分的锅包括的部件有",
        "TYPE": "多选题",
        "A": "对流管束",
        "B": "送风装置",
        "C": "蒸汽过热器",
        "D": "集箱联箱"
    },
    {
        "ANS": "A",
        "Q": "国家工作人员利用职务便利以直接或者间接明示或者暗示等任何方式非法干涉招标投标活动依法给予处分",
        "TYPE": "单选题",
        "A": "记过或者记大过",
        "B": "记过",
        "C": "记大过",
        "D": "警告或者严重警告"
    },
    {
        "ANS": "A",
        "Q": "国家建立招标投标信用制度应当依法公告对招标人招标代理机构投标人评标委员会成员等当事人违法行为的行政处理决定",
        "TYPE": "单选题",
        "A": "有关行政监督部门",
        "B": "项目主管部门",
        "C": "发展改革部门",
        "D": "建设行政主管部门"
    },
    {
        "ANS": "D",
        "Q": "海外承包项目项目经理预留风险金规定基数的",
        "TYPE": "单选题",
        "A": "15",
        "B": "20",
        "C": "25",
        "D": "30"
    },
    {
        "ANS": "B",
        "Q": "海外规章制度经济合同重大决策等未经合规审查可以实施",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "焊接电源种类选择时直流电源的特性为",
        "TYPE": "单选题",
        "A": "一般用在重要的焊接结构或厚板小刚度结构的焊接上",
        "B": "电弧稳定飞溅小焊接质量好",
        "C": "构造简单造价低",
        "D": "使用维护比交流电源方便"
    },
    {
        "ANS": "BCD",
        "Q": "焊条选用的原则正确的有",
        "TYPE": "多选题",
        "A": "焊件的焊接部位不能翻转时应选用酸性焊条",
        "B": "受力不大焊接部位难以清理的焊件应选用酸性焊条",
        "C": "酸性焊条和碱性焊条都可满足要求时应尽量选用酸性焊条",
        "D": "焊接工作量大的结构有条件时应尽量选用高效率焊条如铁粉焊条"
    },
    {
        "ANS": "A",
        "Q": "合规管理要纳入企业主要负责人履行推进法治建设第一责任人职责明确各业务系统各级机构合规职责加大违规风险排查力度对违法违规行为严肃追责",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "合同初始收入与成本录入信息系统的主责部门有",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "项目总工",
        "C": "项目商务经理",
        "D": "项目副经理",
        "E": "二级单位商法部"
    },
    {
        "ANS": "C",
        "Q": "合同额不能大于招标概算额的出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "20",
        "B": "15",
        "C": "10",
        "D": "5"
    },
    {
        "ANS": "A",
        "Q": "合同额不能大于招标概算额的10出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "合同额不能大于招标概算额的30出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "合同额是指",
        "TYPE": "单选题",
        "A": "合同额指工程承包过程中由发承包双方在工程承包合同中约定的工程造价即签约合同价",
        "B": "合同额指工程发承包交易过程中由发承包双方在工程承包合同中约定的工程造价即签约合同价",
        "C": "合同额指工程发承包交易过程中由承包方在工程承包合同中约定的工程造价即签约合同价",
        "D": "合同额指工程发承包交易过程中由发承包双方在工程承包合同中约定的工程造价即工程结算额"
    },
    {
        "ANS": "B",
        "Q": "合同工程发生现场签证事项未经发包人书面签证确认同意承包人擅自施工的发生的费用应由承包人承担",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "合同工程完工后承包人应编制完成竣工结算文件且应在的同时向发包人提交竣工结算文件",
        "TYPE": "单选题",
        "A": "竣工验收",
        "B": "竣工验收合格",
        "C": "提交竣工验收申请",
        "D": "提交竣工结算申请"
    },
    {
        "ANS": "B",
        "Q": "合同工期较短建设规模较小技术难度较低且施工图设计已审查完备的建设工程可以采用",
        "TYPE": "单选题",
        "A": "单价合同",
        "B": "总价合同",
        "C": "成本加酬金合同"
    },
    {
        "ANS": "D",
        "Q": "合同价款争议的解决方式不包括",
        "TYPE": "单选题",
        "A": "调解",
        "B": "仲裁",
        "C": "诉讼",
        "D": "媒体曝光"
    },
    {
        "ANS": "ABC",
        "Q": "合同价款争议的解决方式有",
        "TYPE": "多选题",
        "A": "调解",
        "B": "仲裁",
        "C": "诉讼",
        "D": "媒体曝光"
    },
    {
        "ANS": "ABC",
        "Q": "合同价款争议的解决方式有",
        "TYPE": "多选题",
        "A": "计日工应按发包人实际签证确认的事项计算",
        "B": "仲裁",
        "C": "诉讼",
        "D": "媒体曝光"
    },
    {
        "ANS": "C",
        "Q": "合同履行期间出现实际施工设计图纸含设计变更与招标工程量清单任一项目的特征描述不符时应",
        "TYPE": "单选题",
        "A": "按照招标工程量清单项目描述的项目特征施工并按照原有的综合单价计价",
        "B": "按照招标工程量清单项目描述的项目特征施工并按照工程量清单计价规范规定重新确定综合单价",
        "C": "按照实际施工的项目特征重新确定相应工程量清单项目的综合单价",
        "D": "按照实际施工的项目特征施工并按照原有综合单价计价"
    },
    {
        "ANS": "C",
        "Q": "合同谈判策划优化可量化效益率为",
        "TYPE": "单选题",
        "A": "2",
        "B": "1",
        "C": "05",
        "D": "02"
    },
    {
        "ANS": "A",
        "Q": "合同谈判策划时间要求是",
        "TYPE": "单选题",
        "A": "合同谈判前2天",
        "B": "合同谈判前3天",
        "C": "合同谈判前5天",
        "D": "合同谈判前7天"
    },
    {
        "ANS": "ABCDEF",
        "Q": "合同条款中等条款苛刻限制确权制约项目开源创效",
        "TYPE": "多选题",
        "A": "计价模式",
        "B": "签证索赔",
        "C": "工期补偿",
        "D": "调差补偿",
        "E": "付款条件",
        "F": "认质认价"
    },
    {
        "ANS": "B",
        "Q": "合同文件包括合同当事人就该项合同文件所作出的补充和修改属于同一类内容的文件应以最早签署的为准",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "合同约定由承包人采购的材料工程设备发包人可以指定生产厂家或供应商",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "合同中可以约定承包人承担无限风险",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AC",
        "Q": "后浇带两种留筋方式说法正确的有",
        "TYPE": "多选题",
        "A": "后浇带宽度通常取大于或等于800",
        "B": "后浇带宽度通常取小于800",
        "C": "100搭接钢筋后浇带宽度通常取max800与ll60或lle60",
        "D": "100搭接钢筋后浇带宽度通常取min800与ll60或lle60"
    },
    {
        "ANS": "AC",
        "Q": "后浇带在16G平法中提供了哪两种留筋方式",
        "TYPE": "多选题",
        "A": "贯通",
        "B": "植筋",
        "C": "100搭接",
        "D": "50搭接"
    },
    {
        "ANS": "ABD",
        "Q": "活塞式压缩机的性能特点包括",
        "TYPE": "多选题",
        "A": "气流速度低损失小",
        "B": "压力范围宽适用于高压低压",
        "C": "外型尺寸小结构简单",
        "D": "适用性强排气压力变化较大时排气量不变"
    },
    {
        "ANS": "B",
        "Q": "获得中宣部全国优秀政治思想工作典型的是哪个项目",
        "TYPE": "单选题",
        "A": "军博展览大楼加固改造工程",
        "B": "酒泉921520项目",
        "C": "南京新生圩港码头项目",
        "D": "海口财盛大厦"
    },
    {
        "ANS": "BCDE",
        "Q": "机械台班单价组成内容有",
        "TYPE": "多选题",
        "A": "机械预算价格",
        "B": "机械折旧费",
        "C": "机械维修费",
        "D": "机械燃料动力费",
        "E": "机械操作人员的工资"
    },
    {
        "ANS": "A",
        "Q": "机械租赁方报量时间点为上月21日至本月20日必须有机械租赁方签字盖章不能盖章时机械租赁方签字代表人必须取得机械租赁单位的授权委托书",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "基础次梁端部外伸构造中当从基础主梁内边算起的外伸长度不满足直锚要求时基础次梁下部钢筋应伸至端部后弯折",
        "TYPE": "单选题",
        "A": "6d",
        "B": "12d",
        "C": "15d",
        "D": "20d"
    },
    {
        "ANS": "B",
        "Q": "基础梁侧面拉筋的直径除注明者外均为",
        "TYPE": "单选题",
        "A": "6",
        "B": "8",
        "C": "10",
        "D": "12"
    },
    {
        "ANS": "C",
        "Q": "基础梁侧面纵向构造钢筋的搭接长度为",
        "TYPE": "单选题",
        "A": "6d",
        "B": "12d",
        "C": "15d",
        "D": "20d"
    },
    {
        "ANS": "C",
        "Q": "基础上为嵌固部位柱底部非连接区长度取值为",
        "TYPE": "单选题",
        "A": "Ln3",
        "B": "Ln4",
        "C": "Hn3",
        "D": "Hn4"
    },
    {
        "ANS": "ABCD",
        "Q": "基础设施板块分供方价格中由公司总经济师审批其余由公司商务管理部经理审批",
        "TYPE": "多选题",
        "A": "超控制价审批",
        "B": "补充协议价格审批",
        "C": "单一来源采购",
        "D": "结算与总包关联的分包控制价审批"
    },
    {
        "ANS": "ABD",
        "Q": "基础设施板块商务资料分为应依次编号装盒",
        "TYPE": "多选题",
        "A": "发包人类",
        "B": "分包类",
        "C": "监理类",
        "D": "内部管理类"
    },
    {
        "ANS": "D",
        "Q": "基础设施板块涉及200万元以下的变更补差函件或报告由审批",
        "TYPE": "单选题",
        "A": "二级单位总经理",
        "B": "二级单位总经济师",
        "C": "二级单位商务管理部经理",
        "D": "项目经理"
    },
    {
        "ANS": "ABCD",
        "Q": "基础设施板块施工过程策划内容包括深化设计设计变更认质认价重新组价工程计量确权现金流签证索赔现场投入资源配置主材优化采购管理总承包管理税费关系协调等",
        "TYPE": "多选题",
        "A": "计管理优化",
        "B": "施工图纸优化",
        "C": "图纸会审",
        "D": "双优化"
    },
    {
        "ANS": "A",
        "Q": "基础设施板块施合同额10亿元以上项目商务策划书由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位总经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "C",
        "Q": "基础设施板块施合同额10亿元以下项目商务策划书由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位总经理",
        "C": "二级单位总经济师",
        "D": "二级单位商务管理部经理"
    },
    {
        "ANS": "ABC",
        "Q": "基础设施板块投标阶段策划参加人员有",
        "TYPE": "多选题",
        "A": "二级单位市场客户部",
        "B": "二级单位总经济师",
        "C": "拟定项目经理商务经理项目总工",
        "D": "公司商务管理部部门经理"
    },
    {
        "ANS": "ABCDEF",
        "Q": "基础设施板块项目变更补差小组由组成",
        "TYPE": "多选题",
        "A": "商务经理",
        "B": "项目总工",
        "C": "项目副经理",
        "D": "材料负责人",
        "E": "工长",
        "F": "项目经理"
    },
    {
        "ANS": "ABC",
        "Q": "基础设施板块项目经济运营分析会准备工作的主责部门是",
        "TYPE": "多选题",
        "A": "项目商务经理",
        "B": "二级单位商务法务部",
        "C": "商务管理部",
        "D": "项目经理"
    },
    {
        "ANS": "D",
        "Q": "基础设施板块项目投标阶段商务策划由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "基础设施项目项目经理预留风险金规定基数的",
        "TYPE": "单选题",
        "A": "15",
        "B": "13",
        "C": "10",
        "D": "8"
    },
    {
        "ANS": "C",
        "Q": "基础设施项目优化效益率应不小于多少",
        "TYPE": "单选题",
        "A": "8",
        "B": "10",
        "C": "12",
        "D": "14"
    },
    {
        "ANS": "B",
        "Q": "基础土方石方开挖时应按照基础垫层底面标高至交付施工场地标高确定无交付施工场地标高时应按确定",
        "TYPE": "单选题",
        "A": "设计标高",
        "B": "自然地面标高",
        "C": "室外设计地坪",
        "D": "室内设计地坪"
    },
    {
        "ANS": "ABC",
        "Q": "基础主次梁相交时附加吊筋描述正确的是",
        "TYPE": "多选题",
        "A": "平直段次梁宽度100",
        "B": "斜长考虑角度60",
        "C": "弯折长度20d",
        "D": "斜长考虑角度45"
    },
    {
        "ANS": "A",
        "Q": "基础主梁在高度变截面处上下钢筋深入支座长要达到什么要求",
        "TYPE": "单选题",
        "A": "深入支座长要满足La",
        "B": "深入支座长要满足1000mm",
        "C": "深入支座长要满足15d",
        "D": "深入支座长要满足2倍的梁高"
    },
    {
        "ANS": "B",
        "Q": "基建工程兵部队集体专业为三公司后的首个工程是",
        "TYPE": "单选题",
        "A": "南京金陵饭店项目",
        "B": "南京新生圩港码头项目",
        "C": "南京炼油厂扩建工程",
        "D": "南京烷基苯厂"
    },
    {
        "ANS": "B",
        "Q": "激活合规管理两道防线各部门各单位在合规管理体系中各负其责各司其职紧密配合确保合规管理体系运行通畅合规风险得以有效防范",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "集采二次谈判对集采中标股份局结果引用时项目通过二次谈判采购单价较集采中标结果降低的按照降低额的10计算奖金奖金的计算公式是",
        "TYPE": "单选题",
        "A": "收入单价采购数量物资设备采购效益率采购效益率8125",
        "B": "发包人批价认价采购效益率55",
        "C": "发包人批价采购价发包人批价100",
        "D": "集采单价采购单价采购数量10"
    },
    {
        "ANS": "B",
        "Q": "集采回标时间不少于天出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "3天",
        "B": "5天",
        "C": "7天",
        "D": "1天"
    },
    {
        "ANS": "BC",
        "Q": "集团清理拖欠专项行动提出两个负面清单包括和",
        "TYPE": "多选题",
        "A": "违规违纪负面清单",
        "B": "项目经理限制从业负面清单",
        "C": "分包分供商负面清单"
    },
    {
        "ANS": "ABCDEF",
        "Q": "集团清欠工作应知应做清单要求加强台账基础工作主要包括哪些台账",
        "TYPE": "多选题",
        "A": "投诉线索台账工信部国资委信访码上纠风云筑网",
        "B": "清欠台账",
        "C": "连环清台账",
        "D": "分供商投诉台账",
        "E": "项目经理被投诉台账",
        "F": "应急储备资金建立与使用台账"
    },
    {
        "ANS": "ABCDEF",
        "Q": "集团清欠应知应做清单要求严肃认真实事求是处理投诉线索以下哪些操作不符合要求",
        "TYPE": "多选题",
        "A": "延期支付无分歧欠款",
        "B": "虚假清欠",
        "C": "以协议代替付款签署协议不执行又被投诉后",
        "D": "将无分歧欠款做成有分歧欠款",
        "E": "让供应商出具澄清函证明函进行办结",
        "F": "以不再保障范围内掩盖清付责任",
        "G": "无分歧欠款及时支付"
    },
    {
        "ANS": "B",
        "Q": "集中采购的价格一般分散采购的价格出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "高于",
        "B": "低于",
        "C": "相等",
        "D": "高于等于"
    },
    {
        "ANS": "C",
        "Q": "计划外招标申请需要审批至出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "分公司经理",
        "B": "公司商务管理部经理",
        "C": "公司总经济师",
        "D": "采购管理部经理"
    },
    {
        "ANS": "BE",
        "Q": "计算清单空斗墙的工程量",
        "TYPE": "多选题",
        "A": "应按设计图示尺寸以实际砌筑的砖体积计算",
        "B": "应按设计图示尺寸以外形体积计算",
        "C": "应该扣除内外墙交接处实砌部分体积",
        "D": "应该扣除窗台砖屋檐处实砌部分体积",
        "E": "空斗墙的窗间墙楼板下等实砌部分不应并入空斗墙体积中"
    },
    {
        "ANS": "B",
        "Q": "计算板式楼梯底面抹灰时应遵循以下清单原则计算",
        "TYPE": "单选题",
        "A": "按楼梯水平投影面积",
        "B": "按楼梯斜面积",
        "C": "按楼梯底板展开面积",
        "D": "按楼梯水平投影面积乘以系数115"
    },
    {
        "ANS": "B",
        "Q": "计算板式楼梯底面抹灰时应遵循以下清单原则计算",
        "TYPE": "单选题",
        "A": "按楼梯水平投影面积",
        "B": "按楼梯斜面积",
        "C": "按楼梯底板展开面积",
        "D": "按楼梯水平投影面积乘以系数115"
    },
    {
        "ANS": "B",
        "Q": "计算楼地面工程量时不应扣除下列哪项所占面积",
        "TYPE": "单选题",
        "A": "设备基础",
        "B": "间壁墙",
        "C": "凸出地面的构筑物",
        "D": "地沟"
    },
    {
        "ANS": "D",
        "Q": "计算清单单价措施费用中大型机械设备安拆费及场外运费时包含",
        "TYPE": "单选题",
        "A": "被运机械台班费",
        "B": "人工费拖运机械费",
        "C": "机械进退场及组装拆卸费",
        "D": "机械安拆费及场外运费管理费利润"
    },
    {
        "ANS": "D",
        "Q": "计算外墙面抹灰工程量时不扣除所占面积",
        "TYPE": "单选题",
        "A": "门洞口",
        "B": "窗洞口",
        "C": "外墙裙",
        "D": "小于03m2孔洞"
    },
    {
        "ANS": "A",
        "Q": "计算装饰工程楼地面块料面层时应扣除",
        "TYPE": "单选题",
        "A": "突出地面设备基础",
        "B": "间壁墙",
        "C": "03平方米以内的附墙烟筒",
        "D": "03平方米以内柱"
    },
    {
        "ANS": "D",
        "Q": "计砖烟囱砖水塔清单工程量时扣除砌体中",
        "TYPE": "单选题",
        "A": "钢筋混凝土圈梁过梁体积",
        "B": "大于03m2的孔洞所占体积",
        "C": "大于03m2的孔洞及钢砼圈过梁等体积",
        "D": "各种孔洞及钢砼圈过梁等体积"
    },
    {
        "ANS": "D",
        "Q": "计砖烟囱砖水塔清单工程量时扣除砌体中",
        "TYPE": "单选题",
        "A": "钢筋混凝土圈梁过梁体积",
        "B": "大于03m2的孔洞所占体积",
        "C": "大于03m2的孔洞及钢砼圈过梁等体积",
        "D": "各种孔洞及钢砼圈过梁等体积"
    },
    {
        "ANS": "A",
        "Q": "纪检监察部门违规经营投资责任追究委员会等监督机构负责就监督过程中发现的风险问题提出巡查整改建议跟踪督促责任部门整改落实同时对因风险事项识别预警不及时和管控应对不当造成的损失按照规定进行追责",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "既能承受主要负荷又能承受设备运行时产生强连续振动的垫铁是",
        "TYPE": "单选题",
        "A": "三角形垫铁",
        "B": "矩形垫铁",
        "C": "梯型垫铁",
        "D": "菱形垫铁"
    },
    {
        "ANS": "ABCD",
        "Q": "加强等创新创效管理落实工程项目设计优化认定及激励办法要求强化效益认定奖励时效性",
        "TYPE": "多选题",
        "A": "双优化",
        "B": "优化设计",
        "C": "质量一次成优",
        "D": "高新技术企业加计扣除"
    },
    {
        "ANS": "B",
        "Q": "甲供材料的采保费应该在其他费用中考虑",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "甲类工程是固定资产方向调节税税率为0的投资项",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "价格指数调整价格差额的方法有哪些",
        "TYPE": "多选题",
        "A": "承包人工期延误后的价格调整",
        "B": "价格调整公式",
        "C": "暂时确定调整差额",
        "D": "权重的调整",
        "E": "数量的调整"
    },
    {
        "ANS": "ABCD",
        "Q": "价格指数调整价格差额的方法有哪些",
        "TYPE": "多选题",
        "A": "承包人投标报价中材料单价低于基准单价",
        "B": "价格调整公式",
        "C": "暂时确定调整差额",
        "D": "权重的调整",
        "E": "数量的调整"
    },
    {
        "ANS": "B",
        "Q": "价值创造三年行动以为抓手强化目标引领责任分解绩效考核",
        "TYPE": "单选题",
        "A": "聚焦高端房建基础设施等五大板块",
        "B": "企业提质增效项目降本增效",
        "C": "精益管理再提升",
        "D": "企业盈利模式再升级"
    },
    {
        "ANS": "C",
        "Q": "坚持导向坚定高回报优资产树品牌保障稳定现金流确保运营价值创造",
        "TYPE": "单选题",
        "A": "效益品牌质量",
        "B": "质量创新效益",
        "C": "质量运营创新",
        "D": "品牌质量创新"
    },
    {
        "ANS": "D",
        "Q": "坚持的原则发布采购优化效益考核兑现实施细则推行采购管理人员积分制推进物资量差采购价差创效激励出题来源采购管理部采购优化效益考核兑现实施细则",
        "TYPE": "单选题",
        "A": "责任到人",
        "B": "动态管理",
        "C": "高效周转",
        "D": "贡献越大奖励越多"
    },
    {
        "ANS": "C",
        "Q": "坚持实时传送准确可靠的原则确保信息化建设完善",
        "TYPE": "单选题",
        "A": "查有可究",
        "B": "流程简单",
        "C": "数出同源",
        "D": "分析准确"
    },
    {
        "ANS": "BCD",
        "Q": "坚持以习近平新时代中国特色社会主义思想为指导围绕采购管理三个领先出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "合规",
        "B": "效率",
        "C": "效益",
        "D": "品质"
    },
    {
        "ANS": "B",
        "Q": "坚持责任到人的原则发布采购优化效益考核兑现实施细则推行采购管理人员积分制推进物资量差采购价差创效激励",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCE",
        "Q": "坚定项目管理全覆盖科学设定项目管理目标设立四阶段有效实施",
        "TYPE": "多选题",
        "A": "标价分离",
        "B": "责任书签订",
        "C": "风险金预留",
        "D": "商务策划",
        "E": "考核兑现",
        "F": "结算管理"
    },
    {
        "ANS": "B",
        "Q": "间壁墙指墙厚的墙",
        "TYPE": "单选题",
        "A": "小于等于100",
        "B": "小于等于120",
        "C": "小于等于150",
        "D": "小于等于180"
    },
    {
        "ANS": "B",
        "Q": "监理人发出变更指示无须经过发包人同意",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "剪力墙端部无暗柱时做法为",
        "TYPE": "单选题",
        "A": "弯折15D",
        "B": "弯折10D",
        "C": "互相搭接",
        "D": "180度弯钩"
    },
    {
        "ANS": "BCD",
        "Q": "剪力墙端部无暗柱时墙身水平钢筋端部构造下面描述正确的是",
        "TYPE": "多选题",
        "A": "当墙厚较大时端部用U型箍同水平钢筋搭接",
        "B": "搭接长度为12Lae",
        "C": "每道水平分布钢筋均设置双列拉筋",
        "D": "墙水平筋也可以伸至墙端弯折10d"
    },
    {
        "ANS": "AD",
        "Q": "剪力墙对于分布钢筋网的排数的规定那些是正确的",
        "TYPE": "多选题",
        "A": "当剪力墙厚度不大于400时应配置双排",
        "B": "当剪力墙厚度大于400时宜配置三排",
        "C": "当剪力墙厚度大于500时应配置三排",
        "D": "当剪力墙厚度大于700时宜配置四排"
    },
    {
        "ANS": "B",
        "Q": "剪力墙平法中以下哪一种构件不属于剪力墙构件",
        "TYPE": "单选题",
        "A": "连梁",
        "B": "过梁",
        "C": "暗梁",
        "D": "边框梁"
    },
    {
        "ANS": "A",
        "Q": "剪力墙墙身第一根水平分布筋距基础顶面的距离是",
        "TYPE": "单选题",
        "A": "50mm",
        "B": "100mm",
        "C": "墙身水平分布筋间距",
        "D": "墙身水平分布筋间距2"
    },
    {
        "ANS": "C",
        "Q": "剪力墙上的顶层连梁在洞口范围纵筋锚固范围均须配置箍筋请问洞口范围箍筋布置的起步距离纵筋锚固范围箍筋布置的起步距离",
        "TYPE": "单选题",
        "A": "50mm50mm",
        "B": "100mm100mm",
        "C": "50mm100mm",
        "D": "100mm50mm"
    },
    {
        "ANS": "B",
        "Q": "剪力墙水平分布钢筋交错搭接搭接长度为",
        "TYPE": "单选题",
        "A": "lle",
        "B": "12lae",
        "C": "16lae",
        "D": "16lle"
    },
    {
        "ANS": "ABC",
        "Q": "碱性焊条熔渣的主要成分是碱性氧化物碱性焊条具有的特点为",
        "TYPE": "多选题",
        "A": "熔渣脱氧较完全合金元素烧损少",
        "B": "焊缝金属的力学性能和抗裂性均较好",
        "C": "可用于合金钢和重要碳钢结构焊接",
        "D": "不能有效消除焊缝金属中的硫磷"
    },
    {
        "ANS": "A",
        "Q": "建成后成为我国混凝土建设机械三大生产基地之一成为国内最先进的混凝土机械智能化工厂的项目是",
        "TYPE": "单选题",
        "A": "徐工集团混凝土建设机械产业化基地项目",
        "B": "金昌浓密池矿业项目",
        "C": "海南混凝土项目",
        "D": "中原混凝土基地项目"
    },
    {
        "ANS": "ABCDE",
        "Q": "建立健全全员的六全价值创造管理体系",
        "TYPE": "多选题",
        "A": "全过程",
        "B": "全方位",
        "C": "全产业链",
        "D": "全要素",
        "E": "全业务领域",
        "F": "全生命周期"
    },
    {
        "ANS": "ABDE",
        "Q": "建设标准的主要内容包括",
        "TYPE": "多选题",
        "A": "建设规模",
        "B": "占地面积",
        "C": "总平面布置",
        "D": "劳动定员",
        "E": "建筑标准"
    },
    {
        "ANS": "ABCDE",
        "Q": "建设工程发承包和实施阶段的工程造价应由组成",
        "TYPE": "多选题",
        "A": "分部分项工程费",
        "B": "措施项目费",
        "C": "其他项目费",
        "D": "规费",
        "E": "税金"
    },
    {
        "ANS": "A",
        "Q": "建设工程施工合同约定施工企业未按节点工期完成约定进度建设单位可解除合同此约定属于合同的",
        "TYPE": "单选题",
        "A": "附条件解除",
        "B": "附期限解除",
        "C": "附期限终止",
        "D": "附条件终止"
    },
    {
        "ANS": "ABC",
        "Q": "建设工程造价指标应区分不同的工程特征进行测算这些特征包括",
        "TYPE": "多选题",
        "A": "地区特征",
        "B": "工程类型",
        "C": "造价类型",
        "D": "合同类型",
        "E": "造价来源"
    },
    {
        "ANS": "ACDE",
        "Q": "建设项目竣工验收的一般程序为",
        "TYPE": "多选题",
        "A": "承包商申请交工验收",
        "B": "造价工程师现场初验",
        "C": "正式验收",
        "D": "单项工程验收",
        "E": "全部工程的竣工验收"
    },
    {
        "ANS": "A",
        "Q": "建设行政主管部门负责建筑安全生产的管理并依法接受劳动行政主管部门对建筑安全生产的指导和监督",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCDE",
        "Q": "建议期中结算分为哪几个阶段",
        "TYPE": "多选题",
        "A": "土方桩基四大块",
        "B": "地下室封顶",
        "C": "主体封顶",
        "D": "二次结构",
        "E": "专业工程"
    },
    {
        "ANS": "C",
        "Q": "建造合同要求合同额大于万元工期超过年的项目都要求执行建造合同核算体系",
        "TYPE": "单选题",
        "A": "6001",
        "B": "10002",
        "C": "5001",
        "D": "5002"
    },
    {
        "ANS": "BCDE",
        "Q": "建筑安装工程费按照工程费用造价形成划分下列属于其他项目费",
        "TYPE": "多选题",
        "A": "安全文明施工费",
        "B": "暂列金额",
        "C": "暂估价",
        "D": "计日工",
        "E": "总承包服务费"
    },
    {
        "ANS": "BDE",
        "Q": "建筑安装工程税金是指按国家税法规定应计入建筑安装工程造价的",
        "TYPE": "多选题",
        "A": "土地使用税",
        "B": "营业税",
        "C": "房产税",
        "D": "城市维护建设税",
        "E": "教育费附加"
    },
    {
        "ANS": "BDE",
        "Q": "建筑安装工程税金是指按国家税法规定应计入建筑安装工程造价的",
        "TYPE": "多选题",
        "A": "土地使用税",
        "B": "营业税",
        "C": "房产税",
        "D": "城市维护建设税",
        "E": "教育费附加"
    },
    {
        "ANS": "C",
        "Q": "建筑安装工程造价构成中不包括",
        "TYPE": "单选题",
        "A": "营业税",
        "B": "分部分项工程费",
        "C": "设备购置费",
        "D": "规费"
    },
    {
        "ANS": "ABCD",
        "Q": "建筑材料采购工作内容包括",
        "TYPE": "多选题",
        "A": "编制材料采购计划",
        "B": "确定材料采购批量",
        "C": "确定采购方式",
        "D": "采购计划实施",
        "E": "材料运输储存"
    },
    {
        "ANS": "B",
        "Q": "建筑工程的砖基础与砖墙的划分界限是以室外设计地坪为界以下分基础以上为墙体",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "建筑面积计算说法不正确的有",
        "TYPE": "单选题",
        "A": "室外地下消防通道不计算建筑面积",
        "B": "舞台灯光控制室按照围护结构外围水平面积计算",
        "C": "有维护结构的挑阳台按围护结构外围水平面积的12计算",
        "D": "露台不计算建筑面积"
    },
    {
        "ANS": "ACD",
        "Q": "建筑面积是指建筑各层面积的总和它包括",
        "TYPE": "多选题",
        "A": "辅助面积",
        "B": "附属面积",
        "C": "结构面积",
        "D": "使用面积"
    },
    {
        "ANS": "A",
        "Q": "建筑施工企业和作业人员在施工过程中应当遵守有关安全生产的法律法规和建筑行业安全规章规程不得违章指挥或者违章作业",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "建筑物的檐高是从室内设计地坪000算起的",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "建筑物内变形缝沉降缝在缝宽以内者均按其缝宽按自然层计算建筑面积",
        "TYPE": "单选题",
        "A": "200mm",
        "B": "300mm",
        "C": "100mm",
        "D": "500mm"
    },
    {
        "ANS": "D",
        "Q": "践行的采购管理文化理念出题来源采购管理部局采购管理手册",
        "TYPE": "单选题",
        "A": "务实",
        "B": "专业",
        "C": "敬业",
        "D": "以上全是"
    },
    {
        "ANS": "A",
        "Q": "将单项采购拆分为多个招标化整为零规避招标审批属于不合规行为出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "将公司战略材料设备品牌融合招标文件是采购策划管理哪个阶段的工作要求出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "组织实施阶段",
        "B": "单项材料设备招标阶段",
        "C": "完工总结阶段",
        "D": "投标签约阶段"
    },
    {
        "ANS": "B",
        "Q": "将公司战略材料设备品牌融合招标文件是采购策划管理组织实施阶段的工作要求出题来源采购管理部项目采购策划管理指引",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "交竣工结算报告经签字盖章后天内项目部要及时将交竣工结算报告原件提交商务管理部财务资金部和档案管理部门并办理签收手续",
        "TYPE": "单选题",
        "A": "1",
        "B": "3",
        "C": "5",
        "D": "6"
    },
    {
        "ANS": "C",
        "Q": "结算策划的主责部门为商务管理部策划目标为结算策划效益率",
        "TYPE": "单选题",
        "A": "1",
        "B": "3",
        "C": "4",
        "D": "5"
    },
    {
        "ANS": "ABC",
        "Q": "结算额转化要求622指的是哪些",
        "TYPE": "多选题",
        "A": "当年竣工结算额不低于前第3年营业收入60",
        "B": "前第2年营业收入20",
        "C": "前1年营业收入20",
        "D": "前1年营业收入15"
    },
    {
        "ANS": "ABCDEF",
        "Q": "结算时点要求661163具体指的是",
        "TYPE": "多选题",
        "A": "收到图纸后60天内完成施工图预算",
        "B": "竣工前6个月开展结算策划",
        "C": "竣工前一个月签订结算责任状",
        "D": "竣工后一个月报出结算",
        "E": "竣工6个月内完成总包结算",
        "F": "竣工3个月内完成分包结算"
    },
    {
        "ANS": "D",
        "Q": "截止2023年底公司累计获国家科技进步一等奖项二等奖项",
        "TYPE": "单选题",
        "A": "11",
        "B": "12",
        "C": "12",
        "D": "22"
    },
    {
        "ANS": "B",
        "Q": "截止2023年底公司累计荣获鲁班奖项国家优质工程项",
        "TYPE": "单选题",
        "A": "1520",
        "B": "2436",
        "C": "2535",
        "D": "2838"
    },
    {
        "ANS": "ACD",
        "Q": "金属缠绕垫片是由金属带和非金属带螺旋复合绕制而成的一种半金属平垫片其具有的特点是",
        "TYPE": "多选题",
        "A": "压缩回弹性能好",
        "B": "具有多道密封但无自紧功能",
        "C": "对法兰压紧面的表面缺陷不太敏感",
        "D": "容易对中拆卸方便"
    },
    {
        "ANS": "ABCD",
        "Q": "金属网的计量正确的",
        "TYPE": "多选题",
        "A": "包括油漆",
        "B": "包括制作",
        "C": "包括运输",
        "D": "包括安装",
        "E": "以重量计算"
    },
    {
        "ANS": "ABC",
        "Q": "进项税额指纳税人购进无形资产或者不动产支付或者负担的增值税额",
        "TYPE": "多选题",
        "A": "货物",
        "B": "劳务",
        "C": "服务",
        "D": "材料"
    },
    {
        "ANS": "D",
        "Q": "景观照明灯具安装在人行道等人员来往密集场所安装的落地式灯具无围栏防护时灯具距地面高度应大于",
        "TYPE": "单选题",
        "A": "55m",
        "B": "45m",
        "C": "35m",
        "D": "25m"
    },
    {
        "ANS": "C",
        "Q": "竞争性谈判采购招标控制时长不高于天出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "5",
        "B": "7",
        "C": "12",
        "D": "15"
    },
    {
        "ANS": "C",
        "Q": "竞争性谈判是指直接邀请家及以上分供方就采购事宜进行谈判的方式出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "C",
        "Q": "竞争性谈判要求不少于家投标人进行议价谈判出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "B",
        "Q": "竞争性谈判应在云筑网那个模块发起出题来源采购管理部采购全链条指导手册",
        "TYPE": "单选题",
        "A": "招标易",
        "B": "询价易",
        "C": "评标易",
        "D": "合同宝"
    },
    {
        "ANS": "C",
        "Q": "竞争性谈判招采小组中商务及技术人员比例为出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "不少于13",
        "B": "不少于12",
        "C": "不少于23",
        "D": "不少于34"
    },
    {
        "ANS": "A",
        "Q": "久竣未结项目占比久竣未结项目数期末在建项目数完工未结项目数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "久竣未结指工程竣工或完成合同工作或停工撤场之日起算满年及以上仍未与发包人办理竣工结算的项目",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "ABC",
        "Q": "局对二级单位商务策划的总结复盘工作进行考核评价时的管控要点包括",
        "TYPE": "多选题",
        "A": "是否集成项目商务策划案例库并定期完善更新",
        "B": "是否对项目商务策划进行总结分析",
        "C": "是否对优化商务策划案例进行评选推广复制",
        "D": "是否将项目商务策划纳入年度重点工作任务"
    },
    {
        "ANS": "A",
        "Q": "局发布的P3报表中策划类型包括选型策划品牌策划规格策划调差策划组价策划错峰采购模式创新支付策划其他出题来源采购管理部局P报表",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "局总部对二级单位商务策划工作的考核评价重点包括",
        "TYPE": "多选题",
        "A": "办法制度",
        "B": "重点策划",
        "C": "推进机制",
        "D": "总结复盘"
    },
    {
        "ANS": "ACD",
        "Q": "局总总对二级单位商务策划工作的重点管控指标",
        "TYPE": "多选题",
        "A": "房建项目优化效益率9",
        "B": "双优化效益率5",
        "C": "基础设施项目优化效益率12",
        "D": "专业工程优化效益率14"
    },
    {
        "ANS": "C",
        "Q": "矩形小墙肢的厚度不大于300时箍筋的加密范围为",
        "TYPE": "单选题",
        "A": "底层刚性地面上下500mm",
        "B": "基础顶面嵌固部位向上16Hn",
        "C": "全高加密",
        "D": "搭接范围"
    },
    {
        "ANS": "ABC",
        "Q": "聚氨酯漆是一种新型涂料其主要性能有",
        "TYPE": "多选题",
        "A": "能够耐盐耐酸腐蚀",
        "B": "能耐各种稀释剂",
        "C": "可用于混凝土构筑物表面的涂覆",
        "D": "施工方便无毒但造价高"
    },
    {
        "ANS": "ACD",
        "Q": "聚集资源整合构建和谐共赢的方式包括",
        "TYPE": "多选题",
        "A": "拓展资源集成",
        "B": "推行多方比价",
        "C": "强化战略聚能",
        "D": "培育战略资源"
    },
    {
        "ANS": "B",
        "Q": "聚集资源整合构建和谐共赢的方式不包括",
        "TYPE": "单选题",
        "A": "拓展资源集成",
        "B": "推行多方比价",
        "C": "强化战略聚能",
        "D": "培育战略资源"
    },
    {
        "ANS": "ABCDF",
        "Q": "聚焦五大板块效益高质量主线强化目标引领责任分解绩效考核",
        "TYPE": "多选题",
        "A": "高端房建",
        "B": "基础设施",
        "C": "地产开发",
        "D": "综合投资",
        "E": "质量维保",
        "F": "运营服务"
    },
    {
        "ANS": "BCD",
        "Q": "聚焦以量换价提升采购品牌主要指的是那些方面",
        "TYPE": "多选题",
        "A": "提升考察频率",
        "B": "强化统筹管理",
        "C": "推行标化招采",
        "D": "推进厂家集采"
    },
    {
        "ANS": "A",
        "Q": "聚四氟乙烯具有极强的耐腐蚀性几乎耐所有的化学药品除此之外还具有的特性为",
        "TYPE": "单选题",
        "A": "优良的耐高温低温性能",
        "B": "摩擦系数高常用于螺纹连接处的密封",
        "C": "强度较高塑性韧性也较好",
        "D": "介电常数和介电损耗大绝缘性能优异"
    },
    {
        "ANS": "D",
        "Q": "卷材防水屋面清单工程量计算规则中规定",
        "TYPE": "单选题",
        "A": "平屋顶按实际面积计算",
        "B": "斜屋顶按水平投影面积计算",
        "C": "平斜屋顶均按水平投影面积计算",
        "D": "斜屋顶按斜面积计算"
    },
    {
        "ANS": "D",
        "Q": "卷材防水屋面清单工程量计算规则中规定",
        "TYPE": "单选题",
        "A": "平屋顶按实际面积计算",
        "B": "斜屋顶按水平投影面积计算",
        "C": "平斜屋顶均按水平投影面积计算",
        "D": "斜屋顶按斜面积计算"
    },
    {
        "ANS": "ABCD",
        "Q": "卷材屋面防水的应考虑在报价内",
        "TYPE": "多选题",
        "A": "附加层",
        "B": "接缝",
        "C": "收头",
        "D": "找平层的嵌缝",
        "E": "伸缩缝和天窗等处的弯起部分"
    },
    {
        "ANS": "D",
        "Q": "竣工结算策划的时间要求是",
        "TYPE": "单选题",
        "A": "竣工验收前14天内",
        "B": "竣工验收前1个月",
        "C": "竣工验收前2个月",
        "D": "竣工验收前3个月"
    },
    {
        "ANS": "B",
        "Q": "竣工结算策划的时间要求是",
        "TYPE": "单选题",
        "A": "竣工验收前6个月",
        "B": "竣工验收前3个月",
        "C": "竣工验收前1个月",
        "D": "竣工验收前2个月"
    },
    {
        "ANS": "A",
        "Q": "竣工结算率本年度结算项目数截止上年度末竣工未结项目数本年度630前竣工项目数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCDE",
        "Q": "竣工结算资料清单包括",
        "TYPE": "多选题",
        "A": "会议纪要",
        "B": "施工方案及施工组织设计",
        "C": "总包合同及补充协议",
        "D": "发包人认价单",
        "E": "发包人签证"
    },
    {
        "ANS": "A",
        "Q": "竣工前月签订总包结算目标责任书",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "6"
    },
    {
        "ANS": "C",
        "Q": "竣工验收前个月完成竣工结算策划",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "A",
        "Q": "竣工已结项目平均结算周期月数本年度结算项目项目结算日期竣工日期本年度结算项目数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "开标后采购小组审核分供方投标文件组织开展清标工作投标文件中有含义不明确的内容明显文字或者计算错误招标人认为需要投标人作出必要澄清说明的应当通知该投标人投标人的澄清说明不得超出投标文件的范围或者改变投标文件的实质性内容出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "考核兑现管理办法中竣工考核奖金按工程款实际回收发放的比例工程款回收比率在60以下计算兑现总额的50工程款回收比率在80含95计算兑现总额的80工程款全额收回全额兑现",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "考核兑现管理办法中项目优化考核包括所有与项目有关的过程开源节流化解风险工作的立项考核兑现",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "考核兑现管理办法中建立目标设定过程考核节点考核和竣工考核相结合的项目考核体系下列包括项目策划考核兑现季度目标考核兑现节点目标考核兑现",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "考核兑现完成率完成考核兑现项目数具备考核兑现条件项目数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "考核兑现完成率完成考核兑现项目数上报兑现项目数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACD",
        "Q": "可锻铸铁的性能特点有",
        "TYPE": "多选题",
        "A": "具有较高的强度塑性冲击韧性",
        "B": "主要用于生产汽缸盖汽缸套等铸件",
        "C": "可锻铸铁有黑心可锻铸铁白心可锻铸铁珠光体可锻铸铁三种类型",
        "D": "与球墨铸铁相比具有成本低质量稳定处理工艺简单等优点"
    },
    {
        "ANS": "C",
        "Q": "可计量产值转化率",
        "TYPE": "单选题",
        "A": "可计量产值转化率合同约定计量确权条件的实际产值预估产值",
        "B": "可计量产值转化率合同约定计量确权条件的实际产值实际产值",
        "C": "可计量产值转化率在计量确权时点达到合同约定计量确权条件的实际产值实际产值",
        "D": "可计量产值转化率在计量确权时点达到合同约定计量确权条件的实际产值预估产值"
    },
    {
        "ANS": "C",
        "Q": "跨中板带底部筋在端支座处的构造为",
        "TYPE": "单选题",
        "A": "伸至支座边弯折15d",
        "B": "伸入支座内h",
        "C": "伸入支座内max12d支座宽2",
        "D": "伸入支座内max5d支座宽2"
    },
    {
        "ANS": "ABCD",
        "Q": "块料楼地面按设计图示尺寸以面积计算的开口部分并入相应的工程量内",
        "TYPE": "多选题",
        "A": "门洞",
        "B": "空圈",
        "C": "暖气包槽",
        "D": "壁龛",
        "E": "以上都不是"
    },
    {
        "ANS": "AB",
        "Q": "块料楼地面的材料消耗量包括",
        "TYPE": "多选题",
        "A": "材料净耗量",
        "B": "材料不可避免的损耗量",
        "C": "材料毛损耗量",
        "D": "周转材料摊销量"
    },
    {
        "ANS": "B",
        "Q": "框架扁梁边柱节点中未穿过柱截面的扁梁纵向受力筋锚固做法下面说法中正确的是其中hc为支座宽b为框架扁梁宽度",
        "TYPE": "单选题",
        "A": "当支座宽度bhclae且05hc5d时判断为直锚直锚长度为maxlae05hc5d",
        "B": "当支座宽度bhclae且05b5d时判断为直锚直锚长度为maxlae05b5d",
        "C": "当支座宽度bhclae时判断为弯锚弯锚长度为支座宽bhc12d",
        "D": "当支座宽度bhclae时判断为弯锚弯锚长度为支座宽bhc12d"
    },
    {
        "ANS": "D",
        "Q": "框架扁梁箍筋构造关于箍筋加密区范围以下说法正确的是其中b为框架扁梁宽度hb为框架扁梁高度",
        "TYPE": "单选题",
        "A": "一级抗震时加密区范围max2hb500",
        "B": "二四级抗震时加密区范围max15hb500",
        "C": "框架扁梁箍筋加密区范围和抗震等级无关为maxbhblae",
        "D": "框架扁梁箍筋加密区范围为maxbhblae且应满足框架梁箍筋加密区长度范围的要求"
    },
    {
        "ANS": "C",
        "Q": "框架扁梁核心区竖向拉近勾住上下双层纵筋弯钩为135度平直段长度为",
        "TYPE": "单选题",
        "A": "5d",
        "B": "625d",
        "C": "10d",
        "D": "119d"
    },
    {
        "ANS": "AB",
        "Q": "框架扁梁中柱节点中说法正确的是",
        "TYPE": "多选题",
        "A": "未穿过柱截面下部纵筋应贯通节点区",
        "B": "穿过柱截面的框架扁梁下部纵筋可在柱内锚固",
        "C": "未穿过柱截面下部纵筋可在柱内锚固",
        "D": "穿过柱截面的框架扁梁下部纵筋必须贯通节点区"
    },
    {
        "ANS": "AD",
        "Q": "框架扁梁中柱节点中针对于拉筋的说法正确的是",
        "TYPE": "多选题",
        "A": "拉筋末端采用135弯钩",
        "B": "拉筋末端采用90弯钩",
        "C": "平直段长度为5d",
        "D": "平直段长度为10d"
    },
    {
        "ANS": "A",
        "Q": "框架梁上部通长筋端支座构造当满足直锚时直锚长度为",
        "TYPE": "单选题",
        "A": "max05hc5dlae",
        "B": "hcbhc15d",
        "C": "04labe",
        "D": "06lae"
    },
    {
        "ANS": "ABCDE",
        "Q": "框架协议是双方多方就内容达成一致意向的协议形式",
        "TYPE": "多选题",
        "A": "合作意向",
        "B": "合作范围",
        "C": "合作内容",
        "D": "合作方式",
        "E": "合作模式"
    },
    {
        "ANS": "B",
        "Q": "劳动定额的时间中已包括了",
        "TYPE": "单选题",
        "A": "多余和偶然工作损失时间",
        "B": "不可避免的中断时间",
        "C": "因施工本身原因的停工时间"
    },
    {
        "ANS": "B",
        "Q": "劳务与专业分包月度产值单可以打包在云筑网上跨月录入出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "劳务与专业分包中主体二次结构是由分公司采购公司审批出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "离心式通风机的型号表示由六部分组成包括名称型号机号出风口位置及",
        "TYPE": "单选题",
        "A": "气流方向旋转方式",
        "B": "传动方式旋转方式",
        "C": "气流方向叶轮级数",
        "D": "传动方式叶轮级数"
    },
    {
        "ANS": "D",
        "Q": "利用刚性较小的回折管挠性变形来补偿两端直管部分的热伸长量占地面积较大的补偿器为",
        "TYPE": "单选题",
        "A": "L形补偿器",
        "B": "波形补偿器",
        "C": "Z形补偿器",
        "D": "方形补偿器"
    },
    {
        "ANS": "ABCDE",
        "Q": "沥青混凝土的项目特征描述有",
        "TYPE": "多选题",
        "A": "沥青品种",
        "B": "沥青混凝土种类",
        "C": "石料粒径",
        "D": "掺合料",
        "E": "厚度"
    },
    {
        "ANS": "ABCDE",
        "Q": "连梁分为哪几种类型",
        "TYPE": "多选题",
        "A": "LL",
        "B": "LLJC",
        "C": "LLJX",
        "D": "LLDX",
        "E": "LLK"
    },
    {
        "ANS": "C",
        "Q": "连梁纵筋锚入端支座的长度需要满足",
        "TYPE": "单选题",
        "A": "lae",
        "B": "600",
        "C": "maxlae600",
        "D": "12lae"
    },
    {
        "ANS": "C",
        "Q": "联采集采执行率出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "90",
        "B": "95",
        "C": "100",
        "D": "85"
    },
    {
        "ANS": "B",
        "Q": "梁板柱等构件的混凝土工程量按面积计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "梁板式筏形基础梁端部无外伸构造中伸至尽端钢筋内侧弯折长度为",
        "TYPE": "单选题",
        "A": "6d",
        "B": "12d",
        "C": "15d",
        "D": "20d"
    },
    {
        "ANS": "D",
        "Q": "梁侧面构造钢筋的搭接长度为梁侧面受扭钢筋的搭接长度为",
        "TYPE": "单选题",
        "A": "lle15d",
        "B": "llelle",
        "C": "15d15d",
        "D": "15dlle"
    },
    {
        "ANS": "B",
        "Q": "梁当同排纵筋中既有通长筋又有架立筋时表示方式为",
        "TYPE": "单选题",
        "A": "222412",
        "B": "222412",
        "C": "222412",
        "D": "222412"
    },
    {
        "ANS": "D",
        "Q": "梁的平面注写包括集中标注和原位标注集中标注有五项必注值其中不包含哪一项",
        "TYPE": "单选题",
        "A": "截面尺寸",
        "B": "箍筋",
        "C": "梁侧面纵向钢筋",
        "D": "梁顶面标高高差"
    },
    {
        "ANS": "BC",
        "Q": "梁的平面注写方式包含",
        "TYPE": "多选题",
        "A": "截面标注",
        "B": "集中标注",
        "C": "原位标注",
        "D": "列表标注"
    },
    {
        "ANS": "A",
        "Q": "梁高800时吊筋弯起角度为",
        "TYPE": "单选题",
        "A": "60",
        "B": "30",
        "C": "45",
        "D": "90",
        "E":"大于800时60度",
        "F":"小于800时45度"
    },
    {
        "ANS": "C",
        "Q": "梁高800时吊筋弯起角度为",
        "TYPE": "单选题",
        "A": "60",
        "B": "30",
        "C": "45",
        "D": "90",
        "E":"大于800时60度",
        "F":"小于800时45度"
    },
    {
        "ANS": "A",
        "Q": "梁上部贯通筋由不同直径钢筋搭接时钢筋的搭接长度为",
        "TYPE": "单选题",
        "A": "lle",
        "B": "150mm",
        "C": "lae",
        "D": "15d"
    },
    {
        "ANS": "AB",
        "Q": "梁上部纵筋注写为225222表示正确的含义有",
        "TYPE": "多选题",
        "A": "梁支座上部有4根纵筋225放在角部222放在中部",
        "B": "当梁上部同排纵筋有两种直径时用相联",
        "C": "当225为通长筋222为架立筋时",
        "D": "当梁的上部纵筋为225下部纵筋为222时"
    },
    {
        "ANS": "A",
        "Q": "梁原位标注和集中标注冲突在施工时应以以下取值优先",
        "TYPE": "单选题",
        "A": "原位标注",
        "B": "集中标注",
        "C": "平面注写",
        "D": "截面注写"
    },
    {
        "ANS": "A",
        "Q": "临时设施临水临电占比临设成本产值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "零星工作项目表可以不列出详细的人工材料机械名称",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "零星砌砖项目中的台阶工程量的计算正确的是",
        "TYPE": "单选题",
        "A": "按实砌体积并入基础工程量中计算",
        "B": "按砌筑纵向长度以米计算",
        "C": "按水平投影面积以平方米计算",
        "D": "按设计尺寸体积以立方米计算"
    },
    {
        "ANS": "B",
        "Q": "楼层框架梁的支座负筋延伸长度怎样规定的",
        "TYPE": "单选题",
        "A": "第一排端支座负筋从柱边开始延伸至Ln4位置",
        "B": "第二排端支座负筋从柱边开始延伸至Ln4位置",
        "C": "第二排端支座负筋从柱边开始延伸至Ln5位置",
        "D": "中间支座负筋延伸长度同端支座负筋"
    },
    {
        "ANS": "D",
        "Q": "楼层框架梁端部钢筋锚固长度判断分析正确的是",
        "TYPE": "单选题",
        "A": "当Lae支座宽保护层时可以直锚",
        "B": "直锚长度为Lae",
        "C": "当Lae支座宽保护层时必须弯锚",
        "D": "弯锚时锚固长度为支座宽保护层15d"
    },
    {
        "ANS": "A",
        "Q": "楼层连梁LLK箍筋加密范围",
        "TYPE": "单选题",
        "A": "同楼层框架梁加密范围",
        "B": "加密区为500",
        "C": "加密20HB且500",
        "D": "加密15HB且500"
    },
    {
        "ANS": "D",
        "Q": "楼地面工程整体面层水泥砂浆楼地面现浇水磨石楼地面不正确的计量是",
        "TYPE": "单选题",
        "A": "按设计图示尺寸以面积计算",
        "B": "按设计图示尺寸以实际面积计算",
        "C": "应扣除地沟等所占面积",
        "D": "暖气包槽的开口部分和并计入面积"
    },
    {
        "ANS": "C",
        "Q": "楼地面铺设同质地砖面层清单工程量计算应",
        "TYPE": "单选题",
        "A": "不扣除柱垛附墙烟囱及孔洞所占面积",
        "B": "扣除柱垛附墙烟囱及孔洞所占面积",
        "C": "不扣除03m2的柱垛附墙烟囱及孔洞所占面积",
        "D": "扣除03m2的柱垛附墙烟囱及孔洞所占面积"
    },
    {
        "ANS": "C",
        "Q": "楼地面铺设同质地砖面层清单工程量计算应",
        "TYPE": "单选题",
        "A": "不扣除柱垛附墙烟囱及孔洞所占面积",
        "B": "扣除柱垛附墙烟囱及孔洞所占面积",
        "C": "不扣除03m2的柱垛附墙烟囱及孔洞所占面积",
        "D": "扣除03m2的柱垛附墙烟囱及孔洞所占面积"
    },
    {
        "ANS": "AC",
        "Q": "楼地面水磨石面层按主墙间的净面积计算应扣除下列哪些项目",
        "TYPE": "多选题",
        "A": "设备基础",
        "B": "柱",
        "C": "地沟",
        "D": "半砖墙",
        "E": "03m2孔洞"
    },
    {
        "ANS": "BC",
        "Q": "楼面工程量计算规则为",
        "TYPE": "多选题",
        "A": "地面垫层按室内主墙间净面积以平方米计算",
        "B": "整体面层找平层接主墙间净面积以平方米计算",
        "C": "块料面层按图示尺寸实铺面积以平方米计算",
        "D": "楼梯面层按实际面积计算",
        "E": "台阶面层包括踏步及最上一层踏步300mm按实际面积计算"
    },
    {
        "ANS": "D",
        "Q": "楼梯包括休息平台梯段平台梁斜梁及楼梯与楼板连接的梁按水平投影面积计算",
        "TYPE": "单选题",
        "A": "扣除楼梯井增加伸入墙内部分",
        "B": "不扣除楼梯井伸人墙内部分不另增加",
        "C": "宽度小于200mm的楼梯井不扣除增加伸入墙内部分",
        "D": "宽度小于200mm的楼梯井不扣除伸入墙内部分不另增加"
    },
    {
        "ANS": "CD",
        "Q": "楼梯铺贴块料面层已包括",
        "TYPE": "多选题",
        "A": "防滑条",
        "B": "踢脚板",
        "C": "块料切割",
        "D": "砂浆结合层",
        "E": "砂浆找平层"
    },
    {
        "ANS": "B",
        "Q": "铝合金门窗工程量按框外围面积计算无框门按扇外围面积计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BC",
        "Q": "每半年进行一次整体成本分析由共同完成经二级单位总经理审核报公司商务管理部",
        "TYPE": "多选题",
        "A": "商务经理",
        "B": "二级单位总经济师",
        "C": "二级单位总会计师",
        "D": "项目经理"
    },
    {
        "ANS": "A",
        "Q": "每年11月召开对当年完竣工项目商务策划成本数据管理得失和经验教训的总结提炼和集中汇报三级单位总结会采取完竣工项目全覆盖项目铁三角全覆盖形式二级单位总结会采取典型项目交流形式",
        "TYPE": "单选题",
        "A": "商务总结会",
        "B": "经济运营分析会",
        "C": "商务例会",
        "D": "总分包推进会"
    },
    {
        "ANS": "C",
        "Q": "每月季度末月的日组织对形象部位材料库存半成品等进行盘点",
        "TYPE": "单选题",
        "A": "5",
        "B": "15",
        "C": "20",
        "D": "25"
    },
    {
        "ANS": "BCD",
        "Q": "每月25日根据工程盘点归口计算成本基础数据形成成本报表",
        "TYPE": "多选题",
        "A": "项目总工",
        "B": "商务经理",
        "C": "物资工程师",
        "D": "专业工程师"
    },
    {
        "ANS": "BC",
        "Q": "门窗工程工程量计算时不按框外围面积计算的是",
        "TYPE": "多选题",
        "A": "铝合金门窗",
        "B": "卷帘门",
        "C": "无框玻璃门",
        "D": "木门窗",
        "E": "塑钢门窗"
    },
    {
        "ANS": "B",
        "Q": "门窗制作安装工程量均按门窗扇尺寸计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "民用建筑分两大部分",
        "TYPE": "单选题",
        "A": "生活建筑和公共建筑",
        "B": "居住建筑和公共建筑",
        "C": "居住建筑和文化建筑",
        "D": "生活建筑和公共建筑"
    },
    {
        "ANS": "A",
        "Q": "民用住宅建筑的居住面积是",
        "TYPE": "单选题",
        "A": "居室净面积",
        "B": "居室和起居室的净面积",
        "C": "居室净面积和辅助面积的总称",
        "D": "使用面积和居室净面积的总称"
    },
    {
        "ANS": "D",
        "Q": "某段装有调节阀的热力管道安装及试压合格后要进行管道清理下列表述正确的是",
        "TYPE": "单选题",
        "A": "采用水冲洗方式按先支管后主管依次进行清理",
        "B": "采用压缩空气吹扫方式按先主管后支管依次进行清理",
        "C": "若调节阀为法兰连接应采用旁通管方式保护后再进行压缩空气吹扫",
        "D": "将非焊接的调节阀拆除后用临时短管代替再采用水冲洗清理合格后将阀门复位"
    },
    {
        "ANS": "C",
        "Q": "某工程合同价格为5000万元计划工期是200天施工期间因非承包人原因导致工期延误10天若同期该公司承揽的所有工程合同总价为25亿元计划总部管理费为1250万元则承包人可以索赔的总部管理费为万元",
        "TYPE": "单选题",
        "A": "75",
        "B": "10",
        "C": "125",
        "D": "15"
    },
    {
        "ANS": "C",
        "Q": "某工程合同价格为5000万元计划工期是200天施工期间因非承包人原因导致工期延误10天若同期该公司承揽的所有工程合同总价为25亿元计划总部管理费为1250万元则承包人可以索赔的总部管理费为万元",
        "TYPE": "单选题",
        "A": "75",
        "B": "10",
        "C": "125",
        "D": "15"
    },
    {
        "ANS": "A",
        "Q": "某工程合同总价为5000万元合同工期180天材料费占合同总价的60材料储备定额天数为25天材料供应在途天数为5天用公式计算法来求得该工程的预付款为万元",
        "TYPE": "单选题",
        "A": "417",
        "B": "500",
        "C": "694",
        "D": "833"
    },
    {
        "ANS": "B",
        "Q": "某工程抗震等级为三级框架梁的箍筋标注为101002002并且梁的净跨长度为4900MM梁高为700MM计算本跨梁的箍筋根数",
        "TYPE": "单选题",
        "A": "40",
        "B": "34",
        "C": "41",
        "D": "45"
    },
    {
        "ANS": "C",
        "Q": "某工程抗震等级为一级框架梁的贯通筋的标注为2B202B12共三跨净跨长度分别为Ln1Ln2Ln3且Ln1Ln2Ln3则中间跨架立筋长度为",
        "TYPE": "单选题",
        "A": "Ln232Lle",
        "B": "Ln2Ln13Ln232Lle",
        "C": "Ln2Ln13Ln232150",
        "D": "Ln232150"
    },
    {
        "ANS": "C",
        "Q": "某建设项目建筑安装工程费为6000万元设备购置费为1000万元工程建设其他费用为2000万元建设期利息为500万元若基本预备费费率为5则该建设项目的基本预备费为万",
        "TYPE": "单选题",
        "A": "350",
        "B": "400",
        "C": "450",
        "D": "475"
    },
    {
        "ANS": "C",
        "Q": "某建设项目建筑安装工程费为6000万元设备购置费为1000万元工程建设其他费用为2000万元建设期利息为500万元若基本预备费费率为5则该建设项目的基本预备费为万",
        "TYPE": "单选题",
        "A": "350",
        "B": "400",
        "C": "450",
        "D": "475"
    },
    {
        "ANS": "C",
        "Q": "某建筑物开挖深度6米且地下水位高土质松散支撑结构应选用",
        "TYPE": "单选题",
        "A": "间断式水平挡土板",
        "B": "连续式挡土板",
        "C": "深层搅拌桩",
        "D": "垂直挡土板"
    },
    {
        "ANS": "D",
        "Q": "某民用建筑30层高110m属于",
        "TYPE": "单选题",
        "A": "多层建筑",
        "B": "中高层建筑",
        "C": "高层建筑",
        "D": "超高层建筑"
    },
    {
        "ANS": "B",
        "Q": "某排水沟槽需井点降水已知原地面标高为30m沟槽底标高为28m设计要求需降水至沟槽底下1m根据以上条件较为适宜的降水方式是降水",
        "TYPE": "单选题",
        "A": "轻型井点",
        "B": "喷射井点",
        "C": "深井井点",
        "D": "大口径井点"
    },
    {
        "ANS": "D",
        "Q": "某排水管道沟槽深3m其中一二类土深12m三类土深18m顺沟槽方向坑上作业则该沟槽的放坡系数应为",
        "TYPE": "单选题",
        "A": "10415",
        "B": "1025",
        "C": "1033",
        "D": "10398"
    },
    {
        "ANS": "C",
        "Q": "某桥梁设计总长度为250m该桥属",
        "TYPE": "单选题",
        "A": "小桥",
        "B": "中桥",
        "C": "大桥",
        "D": "特大桥"
    },
    {
        "ANS": "B",
        "Q": "某施工现场主导施工机械一台由承包人租得施工合同约定当发生索赔事件时该机械台班单价租赁费分别按900元台班400元台班计人工工资窝工补贴分别按100元工日50元工日计以人工费与机械费之和为基数的综合费率为30在施工过程中发生如下事件出现异常恶劣天气导致工程停工2天人员窝工20个工日因恶劣天气导致工程修复用工10个工日主导机械1个台班为此承包人可向发包人索赔的费用为元",
        "TYPE": "单选题",
        "A": "1820",
        "B": "2470",
        "C": "2820",
        "D": "3470"
    },
    {
        "ANS": "A",
        "Q": "某砼输送泵每小时纯工作状态可输送砼25m3泵的时间利用系数为075则该砼输送泵的产量定额为多少",
        "TYPE": "单选题",
        "A": "150m3台班",
        "B": "067台班100m3",
        "C": "200m3台班",
        "D": "050台班100m3"
    },
    {
        "ANS": "A",
        "Q": "某挖土机挖土一次正常循环工作时间为50s每次循环平均挖土量为05m3机械正常利用系数为08机械幅度差系数为25按8小时工作制考虑挖土方预算定额的机械台班消耗量为台班1000m3",
        "TYPE": "单选题",
        "A": "543",
        "B": "72",
        "C": "8",
        "D": "868"
    },
    {
        "ANS": "B",
        "Q": "某招标项目采用经评审的最低投标价法评标招标文件规定对同时投多个标段的评标修正率为5投标人甲同时投标12标段报价分别为5000万元4OOO万元若甲在1标段中标则其在2标段的评标价为万元",
        "TYPE": "单选题",
        "A": "3750",
        "B": "3800",
        "C": "4200",
        "D": "4250"
    },
    {
        "ANS": "C",
        "Q": "某执行2013清单规范的固定单价合同的工程某材料价在造价信息单价基准单价为100时承包人投标报价单价为150风险幅度为5当施工期间该材料造价信息单价为80时若按清单规范的规定结算时其材料单价调整为",
        "TYPE": "单选题",
        "A": "80",
        "B": "100",
        "C": "135",
        "D": "150"
    },
    {
        "ANS": "A",
        "Q": "某执行2013清单规范的固定单价合同的工程招标工程量清单列出的工程量为100投标综合单价为50结算的工程量为150问不执行投标综合单价的工程量为",
        "TYPE": "单选题",
        "A": "35",
        "B": "40",
        "C": "50",
        "D": "100"
    },
    {
        "ANS": "B",
        "Q": "某中性耐火材料制品热膨胀系数较低导热性高耐热震性能好高温强度高不受酸碱的侵蚀也不受金属和熔渣的润湿质轻是优质的耐高温材料此类耐火制品为",
        "TYPE": "单选题",
        "A": "硅砖制品",
        "B": "碳质制品",
        "C": "黏土砖制品",
        "D": "镁质制品"
    },
    {
        "ANS": "B",
        "Q": "某种钢材其塑性和韧性较高可通过热处理强化多用于制作较重要的荷载较大的机械零件是广泛应用的机械制造用钢此种钢材为",
        "TYPE": "单选题",
        "A": "普通碳素结构钢",
        "B": "优质碳素结构钢",
        "C": "普通低合金钢",
        "D": "奥氏体型不锈钢"
    },
    {
        "ANS": "A",
        "Q": "某种铸铁具有较高的强度塑性和冲击韧性可以部分代替碳钢用来制作形状复杂承受冲击和振动荷载的零件且与其他铸铁相比其成本低质量稳定处理工艺简单此铸铁为",
        "TYPE": "单选题",
        "A": "可锻铸铁",
        "B": "球墨铸铁",
        "C": "蠕墨铸铁",
        "D": "片墨铸铁"
    },
    {
        "ANS": "A",
        "Q": "某总承包项目防水工程概算500万元该项目招标专业分包单位时若选择一家拟中标单位则该项目资审应设置防水防腐保温工程专业承包级资质出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "一级",
        "B": "二级",
        "C": "三级"
    },
    {
        "ANS": "BC",
        "Q": "木门窗安装子目综合安装和",
        "TYPE": "多选题",
        "A": "油漆",
        "B": "玻璃",
        "C": "普通小五金",
        "D": "刷防腐油",
        "E": "高档五金"
    },
    {
        "ANS": "D",
        "Q": "目标责任书签订率",
        "TYPE": "单选题",
        "A": "目标责任书签订率目标责任书项目数在建项目数",
        "B": "目标责任书签订率在建项目中签订目标责任书数在建项目数",
        "C": "目标责任书签订率在建项目中签订目标责任书项目数项目数",
        "D": "目标责任书签订率在建项目中签订目标责任书项目数在建项目数"
    },
    {
        "ANS": "A",
        "Q": "目前在公司管理平台中采购管理模块开发的内容不包括下面哪个出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "公开招标",
        "B": "采购计划管理",
        "C": "非公开招标"
    },
    {
        "ANS": "C",
        "Q": "幕墙按设计图示尺寸以幕墙外围面积计算",
        "TYPE": "单选题",
        "A": "带肋全玻幕墙其工程量按外围面积计算",
        "B": "带肋全玻幕墙其工程量按投影面积计算",
        "C": "设在玻璃幕墙隔墙上的门窗可包括在玻璃幕墙隔墙项目内",
        "D": "设在玻璃幕墙隔墙上的门窗必须另列项目计算"
    },
    {
        "ANS": "ABD",
        "Q": "内部协同结算额指局内部单位之问发生的工程承发包总分类业务发承包分包方双方依据合同约定的相应条款参照国家有关法律法规标准及局标准文件规定确定承包人分包方完成承包分包工作的最终工程造价",
        "TYPE": "多选题",
        "A": "合同约定的相应条款",
        "B": "参照国家有关法律法规",
        "C": "双方口头约定内容",
        "D": "标准及局标准文件规定"
    },
    {
        "ANS": "AC",
        "Q": "内墙面抹灰清单工程量计算时应",
        "TYPE": "多选题",
        "A": "扣除门窗洞口",
        "B": "计算门窗洞口侧壁面积",
        "C": "不扣除踢脚板",
        "D": "不增加附墙柱侧面抹灰",
        "E": "扣除墙与构件交接处的面积"
    },
    {
        "ANS": "A",
        "Q": "内墙面抹灰清单工程量计算时应扣除",
        "TYPE": "单选题",
        "A": "门窗洞口",
        "B": "附墙柱侧面抹灰",
        "C": "踢脚板",
        "D": "墙上梁侧面抹灰"
    },
    {
        "ANS": "A",
        "Q": "内墙面抹灰清单工程量计算时应扣除",
        "TYPE": "单选题",
        "A": "门窗洞口",
        "B": "附墙柱侧面抹灰",
        "C": "踢脚板",
        "D": "墙上梁侧面抹灰"
    },
    {
        "ANS": "AD",
        "Q": "内墙面一般抹灰计量按",
        "TYPE": "多选题",
        "A": "按墙裙顶面至天棚底面计算",
        "B": "扣除踢脚线面积",
        "C": "扣除门窗洞口和01m2以上孔洞所占的面积",
        "D": "附墙柱的侧面抹灰并入墙面抹灰工程量内计算",
        "E": "门窗洞口孔洞的侧壁面积并入墙面抹灰工程量内计算"
    },
    {
        "ANS": "ABCD",
        "Q": "内墙面装饰抹灰工程量按内墙图示结构尺寸以m计算不扣除",
        "TYPE": "多选题",
        "A": "踢脚板",
        "B": "挂镜线",
        "C": "装饰条",
        "D": "03m2内孔洞",
        "E": "门窗框外围面积"
    },
    {
        "ANS": "A",
        "Q": "拟定标供应商查看云筑网发现三公司其他分公司有过考察的可以不再考察直接发起定标出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "拟中标人数量N3时有效投标单位不少于出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "3N",
        "B": "2N1",
        "C": "N3",
        "D": "2N"
    },
    {
        "ANS": "A",
        "Q": "拟中标人数量N3时有效投标单位不少于2N1出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "拟中标人为3家时有效投标人出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "不少于5家",
        "B": "不少于6家",
        "C": "不少于7家",
        "D": "不少于8家"
    },
    {
        "ANS": "B",
        "Q": "拟中标人为4家时有效投标人出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "不少于6家",
        "B": "不少于7家",
        "C": "不少于8家",
        "D": "不少于9家"
    },
    {
        "ANS": "C",
        "Q": "培育采购管理文化推行三全管理是不包括",
        "TYPE": "单选题",
        "A": "全方位",
        "B": "全过程",
        "C": "全体系",
        "D": "全专业"
    },
    {
        "ANS": "ABD",
        "Q": "培育采购管理文化推行三全管理是哪三全",
        "TYPE": "多选题",
        "A": "全方位",
        "B": "全过程",
        "C": "全体系",
        "D": "全专业"
    },
    {
        "ANS": "B",
        "Q": "培育采购管理文化以下列哪一项为采购理念出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "构建共赢生态圈打造行业领先的智慧供应链体系",
        "B": "智慧采购创新驱动阳光高效诚信共赢",
        "C": "价值创造",
        "D": "品质效率效益"
    },
    {
        "ANS": "D",
        "Q": "平法规定梁侧面为构造钢筋时其搭接与锚固长度取值可为",
        "TYPE": "单选题",
        "A": "5d",
        "B": "6d",
        "C": "10d",
        "D": "15d"
    },
    {
        "ANS": "ABC",
        "Q": "平面天棚造型天棚吊顶定额按分别列项进行项目划分",
        "TYPE": "多选题",
        "A": "龙骨",
        "B": "基层",
        "C": "面层",
        "D": "找平层",
        "E": "结合层"
    },
    {
        "ANS": "B",
        "Q": "平整场地的工程量就是建筑物的底面积",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "平整场地的工程量就是建筑物底平面的外形图示尺寸面积",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "平整场地指原地面与设计室外地坪标高相差厘米以内的原土找平",
        "TYPE": "单选题",
        "A": "35",
        "B": "30",
        "C": "25",
        "D": "20"
    },
    {
        "ANS": "B",
        "Q": "评标成员参与过投标单位历史项目评标且评分过高人员应主动回避出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "评标成员有下列情况之一的应主动回避出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "多选题",
        "A": "招标人或投标人的主要负责人的近亲属",
        "B": "与投标人有商务利益关系",
        "C": "曾因在招标评标以及其他与招标投标有关活动中因违纪而受过处分的投标单位的推荐人",
        "D": "参与过投标单位历史项目评标且评分过高人员"
    },
    {
        "ANS": "A",
        "Q": "评标时投标单位提供虚假资料隐瞒误导招标单位的由评标委员会审议后该投标文件可以按无效处理出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACD",
        "Q": "评标委员会的组成",
        "TYPE": "多选题",
        "A": "招标人的代表和有关经济技术等方面的专家",
        "B": "成员人数为3人以上的单数",
        "C": "成员人数为5人以上的单数",
        "D": "技术经济等方面的专家不得少于成员总数的23",
        "E": "技术经济等方面的专家不得多于成员总数的23"
    },
    {
        "ANS": "D",
        "Q": "评标小组人员数量应为人以上的单数出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "2",
        "B": "3",
        "C": "4",
        "D": "5"
    },
    {
        "ANS": "A",
        "Q": "评标小组人员数量应为五人以上的单数出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "评标小组人员数量应为五人以上的双数出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "铺花岗岩板面层工程量按计算",
        "TYPE": "单选题",
        "A": "主墙间净面积",
        "B": "墙中线面积",
        "C": "墙外围面积",
        "D": "墙净面积下料系数"
    },
    {
        "ANS": "ABC",
        "Q": "其他工程工程量计算错误的是",
        "TYPE": "多选题",
        "A": "货架收银台工程量均以正立面面积计算",
        "B": "柜类吧台服务台等以延长米计算",
        "C": "大理石洗漱台按设计图示尺寸以台面外接矩形面积计算不扣除空洞所占面积",
        "D": "招牌灯箱面层工程量按展开面积以2计算",
        "E": "试衣间按展开面积以2计算"
    },
    {
        "ANS": "AB",
        "Q": "其他工程叙述错误的是",
        "TYPE": "多选题",
        "A": "柜类货架如设计要求或与实际施工不同时不能调整",
        "B": "装饰线条以墙面上直线安装编制的实际施工不同时人工乘以系数10材料乘以系数110",
        "C": "石材磨边台面开孔定额项目均按现场制作考虑",
        "D": "各种装饰线条均按成品编制"
    },
    {
        "ANS": "B",
        "Q": "其他类合同也需要控制价审批或者超控制价审批",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "其他类合同也需要控制价审批或者超控制价审批出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACDE",
        "Q": "其他项目清单包括",
        "TYPE": "多选题",
        "A": "预留金",
        "B": "二次搬运费",
        "C": "材料购置费",
        "D": "总承包服务费",
        "E": "零星工作项目费"
    },
    {
        "ANS": "ACDE",
        "Q": "其他项目清单计价表中内容说法正确的有",
        "TYPE": "多选题",
        "A": "计日工应按发包人实际签证确认的事项计算",
        "B": "总承包服务费不调整",
        "C": "索赔费用应依据发承包双方确认的索赔事项和金额计算",
        "D": "现场签证费用应依据发承包双方签证资料确认的金额计算",
        "E": "暂列金额应减去合同价款调整包括索赔现场签证金额计算如有余额归发包人"
    },
    {
        "ANS": "ACDE",
        "Q": "其他项目清单计价表中内容说法正确的有",
        "TYPE": "多选题",
        "A": "竣工结算合同价款总额",
        "B": "总承包服务费不调整",
        "C": "索赔费用应依据发承包双方确认的索赔事项和金额计算",
        "D": "现场签证费用应依据发承包双方签证资料确认的金额计算",
        "E": "暂列金额应减去合同价款调整包括索赔现场签证金额计算如有余额归发包人"
    },
    {
        "ANS": "ABCE",
        "Q": "其他项目清单与计价汇总表由组成",
        "TYPE": "多选题",
        "A": "暂列金额",
        "B": "暂估价",
        "C": "计日工",
        "D": "人工费",
        "E": "索赔与现场签证"
    },
    {
        "ANS": "ABCE",
        "Q": "其他项目清单与计价汇总表由组成勘误提示答案ABCE",
        "TYPE": "多选题",
        "A": "安全文明施工费",
        "B": "暂估价",
        "C": "计日工",
        "D": "人工费",
        "E": "索赔与现场签证"
    },
    {
        "ANS": "ABCE",
        "Q": "其他项目清单中包含以下哪些项目",
        "TYPE": "多选题",
        "A": "暂列金额",
        "B": "暂估价",
        "C": "计日工",
        "D": "规费",
        "E": "总承包服务费"
    },
    {
        "ANS": "ACDE",
        "Q": "企业管理方针是",
        "TYPE": "多选题",
        "A": "诚信经营",
        "B": "品质保障",
        "C": "绿色建造",
        "D": "追求卓越",
        "E": "关爱生命"
    },
    {
        "ANS": "B",
        "Q": "砌筑物高度超过米可计算脚手架搭拆费用",
        "TYPE": "单选题",
        "A": "36",
        "B": "12",
        "C": "15",
        "D": "18"
    },
    {
        "ANS": "B",
        "Q": "签订结算责任书的时间要求为",
        "TYPE": "单选题",
        "A": "竣工验收前14天内",
        "B": "竣工验收前1个月",
        "C": "竣工验收前2个月",
        "D": "竣工验收前3个月"
    },
    {
        "ANS": "C",
        "Q": "签约阶段合同谈判优化主责部门是",
        "TYPE": "单选题",
        "A": "分公司市场客户部公司市场部",
        "B": "分公司施工管理部分公司科技与设计管理部公司科技部",
        "C": "分公司商务法务部公司法律合规与风险管理部",
        "D": "分公司商务法务部公司采购中心"
    },
    {
        "ANS": "ABC",
        "Q": "签证单必须量化",
        "TYPE": "多选题",
        "A": "工作量",
        "B": "工作时间",
        "C": "工作人数",
        "D": "工作地点"
    },
    {
        "ANS": "C",
        "Q": "潜亏金额指针对自施利润率为负值的项目不含税与自施实际成本不含税的差额",
        "TYPE": "单选题",
        "A": "自建合同额",
        "B": "产值",
        "C": "自施产值",
        "D": "合同额"
    },
    {
        "ANS": "ABC",
        "Q": "潜亏项目按照项目所处不同阶段及潜亏类型分为",
        "TYPE": "多选题",
        "A": "Ⅰ类",
        "B": "Ⅱ类",
        "C": "Ⅲ类",
        "D": "Ⅳ类"
    },
    {
        "ANS": "B",
        "Q": "潜亏项目指自施利润率为负值或工程计量确权率低于的项目",
        "TYPE": "单选题",
        "A": "90",
        "B": "100",
        "C": "105",
        "D": "102"
    },
    {
        "ANS": "ABCDEF",
        "Q": "潜亏项目治理情况纳入各二级单位年度绩效考核中其检查范围有",
        "TYPE": "多选题",
        "A": "专项方案",
        "B": "清单锁定",
        "C": "责任分工",
        "D": "措施方案",
        "E": "目标设定",
        "F": "考核奖惩"
    },
    {
        "ANS": "C",
        "Q": "潜在投标人或者其他利害关系人对招标文件有异议的应当在投标截止时间日前提出",
        "TYPE": "单选题",
        "A": "3",
        "B": "7",
        "C": "10",
        "D": "15"
    },
    {
        "ANS": "ABCD",
        "Q": "强化采购赋能包括出题来源采购管理部中建八局采购管理价值创造能力提升实施方案",
        "TYPE": "多选题",
        "A": "强化战采集采",
        "B": "丰富创效手段",
        "C": "助力产业转型",
        "D": "拓展创效聚能"
    },
    {
        "ANS": "ABCDE",
        "Q": "强化采购前置设计阶段品牌植入全产业链自主采购进一步提升在那些方面联动成效",
        "TYPE": "多选题",
        "A": "分包模式",
        "B": "成本控制",
        "C": "采购时效",
        "D": "工艺推新",
        "E": "品牌植入"
    },
    {
        "ANS": "A",
        "Q": "强化合同谈判策划从营销源头介入招标文件合同文本特别是投标过程中承诺保证答疑回复等协议性文件的风险评估和条件优化谈判提前集成谈判意见减免无效谈判次数从而加速合同优化谈判和评审进程",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "强化合约法务职能提升各业务系统第一道防线履职能力源头做好全面风险防控管理",
        "TYPE": "单选题",
        "A": "统筹协调",
        "B": "风控管理",
        "C": "法治宣传",
        "D": "合规管理"
    },
    {
        "ANS": "C",
        "Q": "强化营销源头管理落实营销立项底线标准提高月进度付款比例以上的项目占比提升子公司承接项目质量",
        "TYPE": "单选题",
        "A": "70",
        "B": "90",
        "C": "80",
        "D": "85"
    },
    {
        "ANS": "B",
        "Q": "墙端为端柱时外侧钢筋其长度怎样计算",
        "TYPE": "单选题",
        "A": "墙长保护层",
        "B": "墙净长锚固长度弯锚或直锚",
        "C": "墙长保护层065Lae",
        "D": "墙净长支座宽度保护层15D"
    },
    {
        "ANS": "B",
        "Q": "墙面勾缝工程量设计图示尺寸以面积计算不应扣除的面积是",
        "TYPE": "单选题",
        "A": "门窗洞口抹灰面积",
        "B": "踢脚线所占面积",
        "C": "墙裙抹灰的面积",
        "D": "04m3孔洞占面积"
    },
    {
        "ANS": "ABC",
        "Q": "墙面木装饰定额按分别列项进行项目划分",
        "TYPE": "多选题",
        "A": "龙骨",
        "B": "基层",
        "C": "面层",
        "D": "找平层",
        "E": "结合层"
    },
    {
        "ANS": "BCE",
        "Q": "墙面砖粘贴施工前要求基层这样才能粘贴牢固",
        "TYPE": "多选题",
        "A": "平整光滑",
        "B": "平整粗糙",
        "C": "洁净五浮灰油污",
        "D": "干燥",
        "E": "预先浇水湿润"
    },
    {
        "ANS": "C",
        "Q": "墙上起柱时柱纵筋从墙顶向下墙内长度为",
        "TYPE": "单选题",
        "A": "16Lae",
        "B": "15Lae",
        "C": "12Lae",
        "D": "10Lae"
    },
    {
        "ANS": "D",
        "Q": "墙身竖向分布钢筋在基础中的构造锚固区横向钢筋不需要满足",
        "TYPE": "单选题",
        "A": "直径d4d为纵筋最大直径",
        "B": "间距10dd为纵筋最小直径",
        "C": "间距100",
        "D": "间距150"
    },
    {
        "ANS": "ABC",
        "Q": "墙身竖向分布钢筋在基础中的构造中基础内箍筋说法正确的是",
        "TYPE": "多选题",
        "A": "间距500",
        "B": "不少于两道水平分布钢筋",
        "C": "不少于两道拉结筋",
        "D": "间距500"
    },
    {
        "ANS": "B",
        "Q": "墙体工程应按图示尺寸以平方米计算其长度规定为",
        "TYPE": "单选题",
        "A": "外墙以外边线计内墙以中心线",
        "B": "外墙以中心线计内墙以净长线计",
        "C": "内墙以中心线计",
        "D": "内外墙均以净长线计"
    },
    {
        "ANS": "B",
        "Q": "墙中间单洞口连梁锚固值为Lae且不小于",
        "TYPE": "单选题",
        "A": "500mm",
        "B": "600mm",
        "C": "750mm",
        "D": "800mm"
    },
    {
        "ANS": "C",
        "Q": "桥梁工程的全长为",
        "TYPE": "单选题",
        "A": "桥梁的两个桥台台背前缘线间的距离",
        "B": "桥台台背中线间的距离",
        "C": "桥梁的两个桥台背后构筑物尾端之间的距离",
        "D": "多孔净跨径总和的距离"
    },
    {
        "ANS": "ABC",
        "Q": "轻钢龙骨一般分为三部分包括",
        "TYPE": "多选题",
        "A": "主龙骨",
        "B": "次龙骨",
        "C": "连接件",
        "D": "吊杆",
        "E": "边龙骨"
    },
    {
        "ANS": "B",
        "Q": "清标过程中采购小组成员应公平对待各投标单位洽谈过程中可以带有倾向性或暗示引导投标人的行为出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "清单工程量以面积为计量单位有以下",
        "TYPE": "单选题",
        "A": "现浇混凝土天沟",
        "B": "现浇混凝土雨蓬",
        "C": "混凝土台阶",
        "D": "预制混凝土楼梯"
    },
    {
        "ANS": "C",
        "Q": "清单工程量以面积为计量单位有以下",
        "TYPE": "单选题",
        "A": "现浇混凝土天沟",
        "B": "现浇混凝土雨蓬",
        "C": "混凝土台阶",
        "D": "预制混凝土楼梯"
    },
    {
        "ANS": "CE",
        "Q": "清单工程量以面积为计量单位有以下",
        "TYPE": "多选题",
        "A": "现浇混凝土天沟",
        "B": "现浇混凝土雨蓬",
        "C": "混凝土台阶",
        "D": "预制混凝土楼梯",
        "E": "防滑坡道"
    },
    {
        "ANS": "A",
        "Q": "清单项目是以形成工程实体为基础设立的按计算容易比较直观的原则来设置的",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACDE",
        "Q": "清单中现浇混凝土板分部工程有以下分项工程组成",
        "TYPE": "多选题",
        "A": "有梁板",
        "B": "框架梁",
        "C": "天沟挑檐板",
        "D": "栏板",
        "E": "阳台板"
    },
    {
        "ANS": "ABC",
        "Q": "清单中预制混凝土柱的特征描述应选择以下方面",
        "TYPE": "多选题",
        "A": "构件单件体积",
        "B": "砼强度等级",
        "C": "安装高度",
        "D": "柱截面尺寸",
        "E": "接头灌缝养护方式"
    },
    {
        "ANS": "ABCDEFG",
        "Q": "清欠工作中八个一工作原则包括以下哪些内容",
        "TYPE": "多选题",
        "A": "想通一个道理支付企业账款是履行央企职责使命的必然要求",
        "B": "下好一个决心坚决完成清欠工作不能因为部分指标受影响而踌躇不前",
        "C": "建好一个平台建立起一个有规模有公信力的内部投诉平台",
        "D": "完善一个体系建立责任体系明确吹哨人调解人预警人",
        "E": "厘清一份清单建好用好供应商负面清单",
        "F": "找到一个办法加大款项回收力度解决上游欠款问题为支付款项创造条件",
        "G": "干明白一件事严格遵守项目承接底线标准投资底线要求切忌盲目承接项目形成低效无效负流项目一定要重视海外清欠海外无小事重点关注海外清欠工作"
    },
    {
        "ANS": "ABCD",
        "Q": "清欠工作中分包分供商负面清单纳入条件包括等",
        "TYPE": "多选题",
        "A": "多头不实投诉",
        "B": "投诉问题已经解决仍反复投诉",
        "C": "以投诉争取合同外利益",
        "D": "无合同关系恶意投诉",
        "E": "合理清欠诉求"
    },
    {
        "ANS": "ABCDE",
        "Q": "清欠工作中五要五不要包括以下哪些内容",
        "TYPE": "多选题",
        "A": "要严格执行集团市场营销",
        "B": "不高息套利",
        "C": "要优先接受保函保险替代保证金",
        "D": "不以对方出具的澄清函证明函作为解决问题的手段",
        "E": "带头不签署背靠背条款手段"
    },
    {
        "ANS": "ABCDE",
        "Q": "清欠工作中五要五不要工作纪律中五不要包括以下哪些内容",
        "TYPE": "多选题",
        "A": "不以签署协议等代替还款",
        "B": "不以对方出具的澄清函证明函作为解决问题的手段",
        "C": "不超越自身财务承受能力开展投资采购承揽活动",
        "D": "带头不签署背靠背条款不滥用市场优势地位设立不合理付款条件时限",
        "E": "不高息套利严格规范供应链金融管理"
    },
    {
        "ANS": "ABCDE",
        "Q": "清欠工作中五要五不要工作纪律中五要包括以下哪些内容",
        "TYPE": "多选题",
        "A": "要严格执行集团市场营销十条禁令项目承接底线标准投资底线要求",
        "B": "要按照行业规范交易习惯依据保障中小企业款项支付条例规定合理约定付款期限",
        "C": "要明确支付方式优先使用现金支付中小企业账款",
        "D": "要严格票据管理规范票据电子凭证业务",
        "E": "要优先接受保函保险替代保证金"
    },
    {
        "ANS": "C",
        "Q": "清欠工作中带息负债预算额度调整快速审批通道金额是亿元应急储备资金设立使用快速决策通道的金额是亿元",
        "TYPE": "单选题",
        "A": "30030",
        "B": "35050",
        "C": "30050"
    },
    {
        "ANS": "ABC",
        "Q": "清欠工作中对拖欠及投诉严重单位的负责人和相关业务人员可采取以下哪些措施",
        "TYPE": "多选题",
        "A": "扣减绩效薪酬",
        "B": "降低公务出行标准",
        "C": "严格出国出境审批"
    },
    {
        "ANS": "B",
        "Q": "清欠工作中对无分歧欠款的处理要求是",
        "TYPE": "单选题",
        "A": "优先支付",
        "B": "动态清零",
        "C": "压存控增"
    },
    {
        "ANS": "C",
        "Q": "清欠工作中对有分歧欠款的处理要求是",
        "TYPE": "单选题",
        "A": "优先支付",
        "B": "B动态清零",
        "C": "压存控增"
    },
    {
        "ANS": "A",
        "Q": "清欠工作中工信部平台官网信访投诉线索事实清晰的在天办结情况复杂的在天内处理完毕云筑网平台线索个工作日内受理",
        "TYPE": "单选题",
        "A": "30902",
        "B": "30905",
        "C": "301805"
    },
    {
        "ANS": "AB",
        "Q": "清欠工作中集团建立的两个绿色通道是指",
        "TYPE": "多选题",
        "A": "带息负债预算额度调整快速审批通道",
        "B": "应急储备资金设立使用快速决策通道",
        "C": "清理拖欠行动项目紧急借款快速审批通道"
    },
    {
        "ANS": "AC",
        "Q": "清欠工作中集团建立的两个投诉平台是指",
        "TYPE": "多选题",
        "A": "云筑网投诉线索平台",
        "B": "合作方维权投诉平台",
        "C": "官网投诉热线平台"
    },
    {
        "ANS": "A",
        "Q": "清欠工作中项目应当在醒目位置公示投诉举报电话云筑网平台建立首位负责制确保分供商投诉有门维权有道",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "清欠工作中一年内被投诉超过次或连续年内被投诉经核实属实且应承担主要责任的时任项目经理1年内禁止从事项目经理及以上职务",
        "TYPE": "单选题",
        "A": "52",
        "B": "33",
        "C": "53"
    },
    {
        "ANS": "B",
        "Q": "清欠工作中因签订还款协议未按时执行被二次投诉的可以再以签订还款协议方式办结",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "清欠工作中针对投诉线索台账重点核实投诉线索如何处理",
        "TYPE": "多选题",
        "A": "实事求是",
        "B": "合规办理",
        "C": "置之不理"
    },
    {
        "ANS": "ABD",
        "Q": "球型补偿器是一种新型补偿装置关于其使用特征正确的表述有",
        "TYPE": "多选题",
        "A": "可以补偿管道在一个或多个方向上的横向位移",
        "B": "流体阻力和变形应力小对固定支座的作用力小",
        "C": "成对使用补偿能力大单台使用时补偿能力小",
        "D": "补偿能力为一般补偿器的510倍"
    },
    {
        "ANS": "A",
        "Q": "全部使用国有资金投资或国有资金投资为主的建设工程施工发承包必须采用工程量清单计价",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "全国各地预算定额中人工工日单价是相同的",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "全口径利润率指项目利润除以百分比表示",
        "TYPE": "单选题",
        "A": "产值",
        "B": "产值结算额",
        "C": "实际成本",
        "D": "责任成本"
    },
    {
        "ANS": "B",
        "Q": "缺乏对成本的有效控制或降低成本的方法或未恰当的运用既定的成本控制方法导致采购成本超过行业平均水平这是采购管理手册主要应对的出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "采购计划风险",
        "B": "成本控制风险",
        "C": "合同履约风险",
        "D": "制度体系风险"
    },
    {
        "ANS": "ABCD",
        "Q": "缺乏科学合理的计划导致采购中的各种计划产生风险即与采购目标发生较大偏离",
        "TYPE": "多选题",
        "A": "采购数量",
        "B": "采购时间",
        "C": "采购质量",
        "D": "规格型号"
    },
    {
        "ANS": "AD",
        "Q": "确定多层厂房经济层数的主要因素包括",
        "TYPE": "多选题",
        "A": "厂房的长度和宽度",
        "B": "厂房的地质条件",
        "C": "厂房的结构形式",
        "D": "厂房的单层净高",
        "E": "厂房的展开面积"
    },
    {
        "ANS": "B",
        "Q": "确定项目部经理且责任书审批后天内签订责任书",
        "TYPE": "单选题",
        "A": "1",
        "B": "2",
        "C": "3",
        "D": "4"
    },
    {
        "ANS": "B",
        "Q": "热膨胀系数很低导热性高耐热震性能好高温强度高但在高温下易氧化不宜在氧化气氛中使用的是",
        "TYPE": "单选题",
        "A": "高铝质制品",
        "B": "碳质制品",
        "C": "镁质制品",
        "D": "优质铝钒土"
    },
    {
        "ANS": "B",
        "Q": "人工幅度差用工包括用工",
        "TYPE": "单选题",
        "A": "超运距",
        "B": "零星用",
        "C": "辅助"
    },
    {
        "ANS": "D",
        "Q": "认质认价管理的时间要求为出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "招标前10日内",
        "B": "招标前一个月",
        "C": "持续推进",
        "D": "设计完成后"
    },
    {
        "ANS": "C",
        "Q": "认质认价管理应在后协同商务推进认质认价材料设备的品牌参数和价格等报送和谈判工作出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "项目进场",
        "B": "物资设备招标完成",
        "C": "设计完成",
        "D": "分供合同签订"
    },
    {
        "ANS": "A",
        "Q": "任何情况下发包人不得压缩合理工期",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACD",
        "Q": "日工资综合单价包括",
        "TYPE": "多选题",
        "A": "生产工人基本工资",
        "B": "生产工人附加工资",
        "C": "职工福利费",
        "D": "工资性补贴",
        "E": "办公费"
    },
    {
        "ANS": "ABD",
        "Q": "熔焊接头的坡口根据其形状的不同可分为基本型组合型和特殊型三类下列坡口形式中属于特殊型坡口的有",
        "TYPE": "多选题",
        "A": "卷边坡口",
        "B": "塞焊槽焊坡口",
        "C": "带钝边U形坡口",
        "D": "带垫板坡口"
    },
    {
        "ANS": "A",
        "Q": "如果在施工过程中是按图施工没有变动由在原施工图上加盖竣工图标志后即作为竣工图",
        "TYPE": "单选题",
        "A": "承包单位",
        "B": "建设单位",
        "C": "设计单位",
        "D": "质监站"
    },
    {
        "ANS": "ABC",
        "Q": "如今三公司海外分公司已初步形成以泰国为周边东南亚国家为非洲美洲等地区为的战略布局",
        "TYPE": "多选题",
        "A": "战略市场",
        "B": "目标市场",
        "C": "机会市场",
        "D": "远景市场"
    },
    {
        "ANS": "ABC",
        "Q": "若发包人没有按合同约定按时支付预付款下列说法正确的有",
        "TYPE": "多选题",
        "A": "承包人可催告发包人支付",
        "B": "发包人在预付款期满后的7天内仍未支付的承包人可在付款期满后的第8天起暂停施工",
        "C": "发包人应承担由此增加的费用和延误的工期并应向承包人支付合理利润",
        "D": "发承包双方共同承担由此增加的费用和延误的工期并应向承包人支付合理利润",
        "E": "发包人在预付款期满后的14天内仍未支付的承包人可在付款期满后的第15天起暂停施工"
    },
    {
        "ANS": "ABC",
        "Q": "若发包人没有按合同约定按时支付预付款下列说法正确的有",
        "TYPE": "多选题",
        "A": "承包人应将预付款专用于合同工程",
        "B": "发包人在预付款期满后的7天内仍未支付的承包人可在付款期满后的第8天起暂停施工",
        "C": "发包人应承担由此增加的费用和延误的工期并应向承包人支付合理利润",
        "D": "发承包双方共同承担由此增加的费用和延误的工期并应向承包人支付合理利润",
        "E": "发包人在预付款期满后的14天内仍未支付的承包人可在付款期满后的第15天起暂停施工"
    },
    {
        "ANS": "B",
        "Q": "若发承包双方对部分清单项目的计量结果出现争议下列说法正确的是",
        "TYPE": "单选题",
        "A": "发包人可不向承包人出具进度款支付证书",
        "B": "发包人应对无争议部分的工程计量结果向承包人出具进度款支付证书",
        "C": "发包人可暂按含争议部分的工程计量结果向承包人出具进度款支付证书",
        "D": "争议部分解决后支付发包人承担逾期付款的利息"
    },
    {
        "ANS": "C",
        "Q": "若在合同履行期间出现设计图纸与招标工程量清单项目的特征描述不符时应",
        "TYPE": "单选题",
        "A": "按照招标工程量清单项目描述的项目特征施工并按照原有的综合单价计价",
        "B": "按照招标工程量清单项目描述的项目特征施工并按照工程量清单计价规范规定重新确定综合单价",
        "C": "按照实际施工的项目特征施工并按照工程量清单计价规范规定重新确定综合单价",
        "D": "按照实际施工的项目特征施工并按照原有综合单价计价"
    },
    {
        "ANS": "ABCDEF",
        "Q": "三公司从最早可追忆的新四军皖东游击队算起共经历了以下几个阶段",
        "TYPE": "多选题",
        "A": "辉煌历程19401983",
        "B": "军企转型19831988",
        "C": "开拓发展19881998",
        "D": "砥砺奋进19982007",
        "E": "转型升级20072015",
        "F": "奋进新时代2015至今"
    },
    {
        "ANS": "A",
        "Q": "三公司的第一个全国劳动模范是",
        "TYPE": "单选题",
        "A": "常俊锋",
        "B": "蒲新荣",
        "C": "梁新向",
        "D": "骆明红"
    },
    {
        "ANS": "A",
        "Q": "三公司的第一个行业楷模是哪个单位或项目",
        "TYPE": "单选题",
        "A": "921520项目部",
        "B": "南京禄口机场项目部",
        "C": "江心洲污水处理厂扩建工程项目部",
        "D": "南京奥体中心项目部"
    },
    {
        "ANS": "ABCD",
        "Q": "三公司的四大核心精神是",
        "TYPE": "多选题",
        "A": "开拓精神",
        "B": "奉献精神",
        "C": "争先精神",
        "D": "创新精神",
        "E": "奋斗精神"
    },
    {
        "ANS": "D",
        "Q": "三公司第一个省级廉洁文化示范单位是哪一年获得的",
        "TYPE": "单选题",
        "A": "2000年",
        "B": "2005年",
        "C": "2007年",
        "D": "2009年"
    },
    {
        "ANS": "C",
        "Q": "三公司海外分公司已初步形成以为战略市场",
        "TYPE": "单选题",
        "A": "马来西亚",
        "B": "柬埔寨",
        "C": "泰国",
        "D": "越南"
    },
    {
        "ANS": "A",
        "Q": "三公司获得的全国建筑业第一个国家科技进步一等奖是",
        "TYPE": "单选题",
        "A": "酒泉卫星基地火箭垂直总装测试厂房工程综合施工技术",
        "B": "南京奥体中心施工技术",
        "C": "南京新金陵饭店施工技术",
        "D": "江苏大剧院施工技术"
    },
    {
        "ANS": "C",
        "Q": "三公司人创造的15个八局第一其中第一个港口项目是",
        "TYPE": "单选题",
        "A": "青岛港港口项目",
        "B": "厦门港港口项目",
        "C": "南京新生圩港码头项目",
        "D": "南京龙潭港港口项目"
    },
    {
        "ANS": "C",
        "Q": "三公司人创造的15个八局第一其中第一个高铁站房项目是",
        "TYPE": "单选题",
        "A": "郑州东站站房",
        "B": "南京站站房",
        "C": "南京南站站房",
        "D": "徐州东站站房"
    },
    {
        "ANS": "C",
        "Q": "三公司人创造的15个八局第一其中第一个国际机场项目是",
        "TYPE": "单选题",
        "A": "海口美兰机场",
        "B": "北京大兴机场",
        "C": "南京禄口机场T1航站楼",
        "D": "成都天府机场"
    },
    {
        "ANS": "C",
        "Q": "三公司人创造的15个八局第一其中第一个航天工程是",
        "TYPE": "单选题",
        "A": "太原卫星发射中心35厂房",
        "B": "西昌卫星发射中心",
        "C": "酒泉卫星发射中心垂直总装测试厂房",
        "D": "文昌卫星发射中心"
    },
    {
        "ANS": "B",
        "Q": "三公司人创造的15个八局第一其中第一个火力电厂项目是",
        "TYPE": "单选题",
        "A": "南京大厂电厂",
        "B": "重庆安稳电厂",
        "C": "南京城南电厂",
        "D": "江北新区电厂"
    },
    {
        "ANS": "A",
        "Q": "三公司人创造的15个八局第一其中第一个鲁班奖是",
        "TYPE": "单选题",
        "A": "海口财盛大厦",
        "B": "酒泉卫星发射中心垂直总装测试厂房",
        "C": "南京奥体中心",
        "D": "青奥会议中心"
    },
    {
        "ANS": "B",
        "Q": "三公司人创造的15个八局第一其中第一个区域分公司是",
        "TYPE": "单选题",
        "A": "华中分公司",
        "B": "徐州分公司",
        "C": "上海分公司",
        "D": "西南分公司"
    },
    {
        "ANS": "C",
        "Q": "三公司人创造的15个八局第一其中第一个省级文明单位是哪一年度获得的",
        "TYPE": "单选题",
        "A": "19891990年度",
        "B": "19901991年度",
        "C": "19911992年度",
        "D": "19921993年度"
    },
    {
        "ANS": "A",
        "Q": "三公司人创造的15个八局第一其中第一个隧道项目是",
        "TYPE": "单选题",
        "A": "重庆轨道交通红旗河沟区间隧道及车站工程",
        "B": "苏州七子山隧道工程",
        "C": "上海长江隧道项目",
        "D": "南京过江隧道项目"
    },
    {
        "ANS": "ABCD",
        "Q": "商务策划包括",
        "TYPE": "多选题",
        "A": "投标策划",
        "B": "设计策划",
        "C": "采购策划",
        "D": "资金策划"
    },
    {
        "ANS": "BCD",
        "Q": "商务策划的动态监督管控机制指",
        "TYPE": "多选题",
        "A": "重点跟踪",
        "B": "一项目一策划",
        "C": "凡策划必有清单",
        "D": "凡清单必有责任落实",
        "E": "分段落实"
    },
    {
        "ANS": "A",
        "Q": "商务策划效益率是指",
        "TYPE": "单选题",
        "A": "商务策划效益值自施产值",
        "B": "商务策划效益值合同额",
        "C": "商务策划效益值实际成本",
        "D": "商务策划效益值总结算"
    },
    {
        "ANS": "ACDE",
        "Q": "商务策划整体目标是指以项目全生命周期管理为主线以项目成本管理为核心围绕三点一控结合技术生产采购等环节制定开源节流化解风险的整体策划实施方案确定策划整体目标其中三点一控是指",
        "TYPE": "多选题",
        "A": "盈利点",
        "B": "管控点",
        "C": "风险点",
        "D": "亏损点",
        "E": "控制低效无效成本"
    },
    {
        "ANS": "ABCD",
        "Q": "商务管理的管理原则是",
        "TYPE": "多选题",
        "A": "履约为先",
        "B": "系统联动",
        "C": "价值创造",
        "D": "各方共赢",
        "E": "品质优先"
    },
    {
        "ANS": "ABCD",
        "Q": "商务资料属于企业机密必须设资料柜并加锁妥善保管收到资料后及时整理入柜除人员可查阅外未经领导同意不得向外借阅或携带外出如系电子文档的内部管理类商务资料未经领导同意不得向外发送",
        "TYPE": "多选题",
        "A": "上级单位的主要领导",
        "B": "总经济师",
        "C": "商务管理部部门相关人员",
        "D": "项目部铁三角"
    },
    {
        "ANS": "C",
        "Q": "商务总结管理目标未按商务管理部要求完成项目成本总结与还原项目工程造价指标编制项目经济资料归档扣减奖金",
        "TYPE": "单选题",
        "A": "20",
        "B": "15",
        "C": "10",
        "D": "5"
    },
    {
        "ANS": "ACD",
        "Q": "设备气密性试验是用来检验连接部位的密封性能其遵循的规定有",
        "TYPE": "多选题",
        "A": "设备经液压试验合格后方可进行气密性试验",
        "B": "气密性试验的压力应为设计压力的115倍",
        "C": "缓慢升压至试验压力后保压30min以上",
        "D": "连接部位等应用检漏液检查"
    },
    {
        "ANS": "D",
        "Q": "设计混凝土配合比不需满足要求",
        "TYPE": "单选题",
        "A": "混凝土设计的强度等级",
        "B": "施工要求的混凝土和易性",
        "C": "混凝土使用要求的耐久性",
        "D": "控制水灰比及保证足够的水泥用量"
    },
    {
        "ANS": "BDE",
        "Q": "社会保险费包括",
        "TYPE": "多选题",
        "A": "分部分项工程",
        "B": "失业保险费",
        "C": "商业险",
        "D": "工伤保险费",
        "E": "生育保险费"
    },
    {
        "ANS": "ABDE",
        "Q": "社会保险费包括",
        "TYPE": "多选题",
        "A": "养老保险费",
        "B": "失业保险费",
        "C": "商业险",
        "D": "工伤保险费",
        "E": "生育保险费"
    },
    {
        "ANS": "ABDE",
        "Q": "社会保险费包括",
        "TYPE": "多选题",
        "A": "养老保险费",
        "B": "失业保险费",
        "C": "商业险",
        "D": "工伤保险费",
        "E": "生育保险费"
    },
    {
        "ANS": "D",
        "Q": "深化预算管控在坚持综合开发基础设施高端房建及创新业务上按的预算配比",
        "TYPE": "单选题",
        "A": "622",
        "B": "532",
        "C": "721",
        "D": "631"
    },
    {
        "ANS": "A",
        "Q": "审查施工图预算的方法中有一种对比方法是用分部分项工程的单方基本价值作为参照该方法适用于",
        "TYPE": "单选题",
        "A": "住宅工程",
        "B": "工程量大的工程",
        "C": "工程工艺比较简单的工程",
        "D": "标准图纸设计的工程"
    },
    {
        "ANS": "B",
        "Q": "生产资料市场及物资贸易中心的建立发展及其市场占有率国家有关生产资料市场的政策等属于材料采购信息中的出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "供应信息",
        "B": "市场信息",
        "C": "资源信息",
        "D": "政策信息"
    },
    {
        "ANS": "B",
        "Q": "省部级媒体对公司的重大负面报道事件在风险等级中划分为较大风险等级",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "CD",
        "Q": "施工策划中工期成本降低率为资金策划中资金策划效益率为",
        "TYPE": "多选题",
        "A": "2",
        "B": "1",
        "C": "05",
        "D": "01"
    },
    {
        "ANS": "B",
        "Q": "施工单位视情况决定是否设立安全生产管理机构配备专职安全生产管理人员",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "施工定额是按社会平均先进水平编制的",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "施工过程策划的管理要求是",
        "TYPE": "单选题",
        "A": "签约前合同风险研判收集相关政策法规拟定谈判方案优化合同条件",
        "B": "做好设计资源整合根据投标报价及测算成本优化设计方案制定限额设计标准引导设计方向在设计出图前测算预算指标是否符合标准要求提出优化建议确定总控指标",
        "C": "二级单位公司总经济师总经理会同项目部进行结算策划",
        "D": "由二级单位总报价师组织市场客户部计量中心等部门对项目部进行投标策略投标报价交底项目部编制商务策划书上报商务管理部"
    },
    {
        "ANS": "D",
        "Q": "施工合同履行期间出现现场签证事件时现场签证应由提出",
        "TYPE": "单选题",
        "A": "发包人",
        "B": "监理人",
        "C": "设计人",
        "D": "承包人"
    },
    {
        "ANS": "C",
        "Q": "施工合同约定承包人承担的钢筋价格风险幅度为5超过部分依据建设工程工程量清单计价规范GB505002013造价信息法调差已知承包人投标价格基准期发布价格分别为2400元t2200元t2015年12月2016年7月的造价信息发布价为2000元t2600元t则该两月钢筋的实际结算价格应分别为元t",
        "TYPE": "单选题",
        "A": "22802520",
        "B": "23102690",
        "C": "23102480",
        "D": "22802480"
    },
    {
        "ANS": "B",
        "Q": "施工企业在投标报价中下列说法错误的是",
        "TYPE": "单选题",
        "A": "应掌握工程现场情况",
        "B": "发现工程量清单有误可自行更正后报价",
        "C": "工程单价可同国家颁布的预算定额不一致",
        "D": "投标报价按规定税率进行报价"
    },
    {
        "ANS": "C",
        "Q": "施工图预算按照商务管理手册要求在公司管理平台上传审批项目收到初步设计图纸天内完成工程概算正式施工图纸收到后天内完成施工图预算",
        "TYPE": "单选题",
        "A": "3030",
        "B": "6060",
        "C": "3060",
        "D": "6030"
    },
    {
        "ANS": "A",
        "Q": "施工图预算编制自收到施工图纸60天内合同有约定从约定大型项目分阶段编制收到设计变更图纸60天内完成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "施工现场暂时停止施工的监理单位应当做好现场防护",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "时间定额和产量定额之间的关系是互为倒数关系",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "时间定额与产量定额互为倒数",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "实际工程量比招标工程量清单减少15且引起措施项目变化若措施项目按系数计价相应调低措施项目费",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "实施培养的复合型人才提高人均效益和人均创效能力",
        "TYPE": "单选题",
        "A": "一人多岗一人多责",
        "B": "一人多职一人多能",
        "C": "一人多岗一专多能",
        "D": "一职多能一人多岗"
    },
    {
        "ANS": "A",
        "Q": "实行工程量清单计价招标投标的建设工程其招标标底投标报价的编制合同价款确定与调整工程结算应按建设工程工程量清单计价规范执行",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "市政工程工程量GB508572013中关于交通管理设施工程量计算规则下列描述错误的是",
        "TYPE": "单选题",
        "A": "标记以平方米计量按设计图示尺寸以面积计算",
        "B": "标记以m计量按设计图示以长度计算",
        "C": "标线以m计量按设计图示以长度计算",
        "D": "标线以平方米计量按设计图示尺寸以面积计算"
    },
    {
        "ANS": "C",
        "Q": "市政工程工程量计算规范GB508572013中关于道路基层计算规则下列描述错误的是",
        "TYPE": "单选题",
        "A": "A石灰稳定土按设计图示尺寸以面积计算不扣除各类井所占面积",
        "B": "水泥稳定碎石项目特征需描述水泥含量",
        "C": "沥青稳定碎石项目特征无需描述水泥含量",
        "D": "石灰稳定碎石项目特征无需描述厚度"
    },
    {
        "ANS": "D",
        "Q": "适用于1kV及以下室外直埋敷设的电缆型号",
        "TYPE": "单选题",
        "A": "YJVNI",
        "B": "BTTZ",
        "C": "VV",
        "D": "VV22"
    },
    {
        "ANS": "C",
        "Q": "适用于潮湿有机械外力有轻微腐蚀气体场所的明暗线配管的管子应为",
        "TYPE": "单选题",
        "A": "电线管",
        "B": "硬质聚氯乙烯管",
        "C": "焊接钢管",
        "D": "半硬质阻燃管"
    },
    {
        "ANS": "C",
        "Q": "适用于潮湿有机械外力有轻微腐蚀气体场所的明暗线配管的管子应为",
        "TYPE": "单选题",
        "A": "电线管",
        "B": "硬质聚氯乙烯管",
        "C": "焊接钢管",
        "D": "半硬质阻燃管"
    },
    {
        "ANS": "B",
        "Q": "室内有楼梯时室外楼梯按其计算建筑面积",
        "TYPE": "单选题",
        "A": "水平投影面积",
        "B": "水平投影面积的一半",
        "C": "水平投影面积的二倍",
        "D": "水平投影面积的三倍"
    },
    {
        "ANS": "A",
        "Q": "收取总承包服务费的专业工程暂估价部分属于非自施合同额",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "书面文件和通知不得扣压一方能够提供证据证明另一方拒绝签收或已送达应视为对方已签收并应承担相应责任",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "属于安全文明施工措施费中的有",
        "TYPE": "多选题",
        "A": "环境保护",
        "B": "文明施工",
        "C": "安全施工",
        "D": "临时设施",
        "E": "绿化费用---平台没选这个"
    },
    {
        "ANS": "BCD",
        "Q": "属于安全文明施工措施费中的有",
        "TYPE": "多选题",
        "A": "累计已完成的合同价款",
        "B": "文明施工",
        "C": "安全施工",
        "D": "临时设施",
        "E": "绿化费用"
    },
    {
        "ANS": "ABCD",
        "Q": "属于商务策划中实施策划分解落实的工作内容包括",
        "TYPE": "多选题",
        "A": "项目经理组织项目部全体管理人员进行策划交底",
        "B": "项目经理将策划内容按岗位职责进行分解签订单项责任书",
        "C": "针对各项目策划点进行专项把脉会诊",
        "D": "项目部向上一层级反馈策划实施情况并对落地率低的说明原因"
    },
    {
        "ANS": "B",
        "Q": "属于无管网灭火系统灭火剂是以固态常温常压贮存不存在泄漏问题维护方便安装相对灵活无须布置管道工程造价相对较低这种灭火系统为",
        "TYPE": "单选题",
        "A": "七氟丙烷灭火系统",
        "B": "热气熔胶预制灭火系统",
        "C": "低倍数泡沫灭火系统",
        "D": "干粉灭火系统"
    },
    {
        "ANS": "C",
        "Q": "树立理念推行以钢代木钢包木等支撑体系变革减少木方的投入加大新材料新工艺新设备的推广应用出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "创新采购",
        "B": "分类采购",
        "C": "绿色采购"
    },
    {
        "ANS": "A",
        "Q": "双优化的主责部门是",
        "TYPE": "单选题",
        "A": "分公司施工管理部分公司科技与设计管理部公司科技部",
        "B": "分公司市场客户部公司市场部",
        "C": "分公司商务法务部公司法律合规与风险管理部",
        "D": "分公司施工管理部公司工程管理部"
    },
    {
        "ANS": "C",
        "Q": "双优化归口的审批部门是",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "公司分管领导",
        "C": "双优化领导小组",
        "D": "公司总经理"
    },
    {
        "ANS": "B",
        "Q": "双优化效益率的控制指标为",
        "TYPE": "单选题",
        "A": "3",
        "B": "4",
        "C": "5",
        "D": "6"
    },
    {
        "ANS": "ABCD",
        "Q": "水泥是建筑上广泛应用的一种具有",
        "TYPE": "多选题",
        "A": "水硬性",
        "B": "耐火性",
        "C": "耐久性",
        "D": "较高强度"
    },
    {
        "ANS": "B",
        "Q": "私刻公章用于市场经营行为用于经济类合同协议的签订直接造成公司被诉讼市场停牌对公司造成经济损失商誉损失等重大风险的行为在风险等级中划分为重大风险等级",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "四新技术不包括出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "新技术",
        "B": "新工艺",
        "C": "新材料",
        "D": "新方案"
    },
    {
        "ANS": "BCD",
        "Q": "松套法兰多用于铜铝等有色金属及不锈钢管道上其形式特点和适用范围有",
        "TYPE": "多选题",
        "A": "分为焊环活动法兰翻边活动法兰和搭焊活动法兰",
        "B": "法兰可以旋转易于对中螺栓孔大口径管道易于安装",
        "C": "适用于管道因定时清洗和检查需要频繁拆卸的情况",
        "D": "法兰材料可与管道材料不一致"
    },
    {
        "ANS": "A",
        "Q": "诉讼仲裁案件委托律师处理应尽可能地采取风险代理方式将案件处理阶段处理结果和律师费挂钩案件代理应当有一名公司内部法律人员担任特别授权代理人共同参加开庭审理",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "索赔三要素是",
        "TYPE": "多选题",
        "A": "正当的索赔理由",
        "B": "有效的索赔证据",
        "C": "优秀的索赔团队",
        "D": "在合同约定的时间内提出",
        "E": "索赔无时效"
    },
    {
        "ANS": "C",
        "Q": "它是一种常用的小电流主令电器主要是起连锁保护的作用利用生产机械运动部件的碰撞使其触头动作来实现接通或分断控制电路达到一定的控制目的这种低压电器为",
        "TYPE": "单选题",
        "A": "转换开关",
        "B": "自动开关",
        "C": "行程开关",
        "D": "接近开关"
    },
    {
        "ANS": "C",
        "Q": "它是最轻的热塑性塑料管材具有较高的强度较好的耐热性且无毒耐化学腐蚀但低温易脆化每段长度有限且不能弯曲施工目前广泛用于冷热水供应系统中此种管材为",
        "TYPE": "单选题",
        "A": "聚乙烯管",
        "B": "超高分子量聚乙烯管",
        "C": "无规共聚聚丙烯管",
        "D": "工程塑料管"
    },
    {
        "ANS": "A",
        "Q": "拓展战略品牌库补齐资源短板建立自主采购参考价格体系",
        "TYPE": "单选题",
        "A": "高精尖稀",
        "B": "精确稀少",
        "C": "高端精细",
        "D": "稀缺"
    },
    {
        "ANS": "D",
        "Q": "台阶装饰按设计图示尺寸以台阶水平投影计算包括最上层踏步边沿加",
        "TYPE": "单选题",
        "A": "150mm",
        "B": "200mm",
        "C": "250mm",
        "D": "300mm"
    },
    {
        "ANS": "ABCDE",
        "Q": "陶瓷地砖定额按铺贴部位分为",
        "TYPE": "多选题",
        "A": "楼地面",
        "B": "楼梯",
        "C": "台阶",
        "D": "踢脚线",
        "E": "零星项目"
    },
    {
        "ANS": "A",
        "Q": "梯段板厚度为130梯板平板段的厚度为150描述正确的是",
        "TYPE": "单选题",
        "A": "h130P150",
        "B": "h130150",
        "C": "h130150",
        "D": "h130P150"
    },
    {
        "ANS": "ABCE",
        "Q": "提升考核评价的四环节紧密衔接力促四奖项落地实施",
        "TYPE": "多选题",
        "A": "审计",
        "B": "考核",
        "C": "兑现",
        "D": "评审",
        "E": "发放"
    },
    {
        "ANS": "ABCD",
        "Q": "提升专业管理能力建立等业务在运营前的协同联动创效机制多措并举提升运营期项目盈利能力",
        "TYPE": "多选题",
        "A": "设计",
        "B": "采购",
        "C": "金融",
        "D": "商务"
    },
    {
        "ANS": "B",
        "Q": "天棚面层在同一标高或不在同一标高均为一级天棚",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "天棚面作石灰砂浆抹面下列正确的清单规则是",
        "TYPE": "单选题",
        "A": "带梁天棚的梁侧面抹灰另外计算",
        "B": "应扣除天棚下独立柱所占面积",
        "C": "锯齿形楼梯底板抹灰按水平投影面积计算",
        "D": "不扣除间壁墙垛柱管道等所占面积"
    },
    {
        "ANS": "D",
        "Q": "天棚面作石灰砂浆抹面下列正确的清单规则是",
        "TYPE": "单选题",
        "A": "带梁天棚的梁侧面抹灰另外计算",
        "B": "应扣除天棚下独立柱所占面积",
        "C": "锯齿形楼梯底板抹灰按水平投影面积计算",
        "D": "不扣除间壁墙垛柱管道等所占面积"
    },
    {
        "ANS": "BCDE",
        "Q": "天棚抹灰面层清单工程量计算不扣除",
        "TYPE": "多选题",
        "A": "墙体",
        "B": "附墙柱",
        "C": "独立柱",
        "D": "检查洞",
        "E": "附墙烟囱"
    },
    {
        "ANS": "B",
        "Q": "条形基础底板配筋构造中在两向受力钢筋交接处的网状部位分布钢筋与同向受力钢筋的搭接长度为",
        "TYPE": "单选题",
        "A": "lle",
        "B": "150",
        "C": "b4",
        "D": "ll"
    },
    {
        "ANS": "D",
        "Q": "条形基础底板配筋长度减短10构造中说法错误的是",
        "TYPE": "单选题",
        "A": "基础底板宽度大于等于2500",
        "B": "配筋的长度为09b",
        "C": "底板交接区的受力钢筋和无交接底板时端部第一根钢筋不应减短",
        "D": "隔二步一"
    },
    {
        "ANS": "ABC",
        "Q": "铁素体奥氏体型不锈钢和奥氏体型不锈钢相比具有的特点有",
        "TYPE": "多选题",
        "A": "其屈服强度为奥氏体型不锈钢的两倍",
        "B": "应力腐蚀小于奥氏体型不锈钢",
        "C": "晶间腐蚀小于奥氏体型不锈钢",
        "D": "焊接时的热裂倾向大于奥氏体型不锈钢"
    },
    {
        "ANS": "AD",
        "Q": "通常情况下评标委员会在对投标文件进行进一步评审时的评标方法有",
        "TYPE": "多选题",
        "A": "经评审的最低投标价法",
        "B": "项目经济效益评价法",
        "C": "项目成本效益费用评审法",
        "D": "综合评估法"
    },
    {
        "ANS": "B",
        "Q": "通过编制补充定额的奖励化解项目风险点和盈利点实现增加效益或减少亏损以及提高利润点根据创造效益按项目优化奖标准给予奖励",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "通过签证索赔化解项目风险点和亏损点实现增加效益或减少亏损以及提高利润点根据创造效益按项目优化奖标准给予奖励",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "通过水的高速运动导致气体体积变化产生负压主要用于抽吸空气或水以达到液固分离也可用作压缩机的泵是",
        "TYPE": "单选题",
        "A": "喷射泵",
        "B": "电磁泵",
        "C": "水环泵",
        "D": "水锤泵"
    },
    {
        "ANS": "A",
        "Q": "通过完善制度收紧权力健全不敢腐不能腐不想腐的机制防范廉洁风险杜绝出现利益输送问题是采购管理主要应对的廉洁管理风险出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AB",
        "Q": "同工况下轴流泵与混流泵离心泵相比其特点和性能有",
        "TYPE": "多选题",
        "A": "适用于低扬程大流量送水",
        "B": "轴流泵的比转数高于混流泵",
        "C": "扬程介于离心泵与混流泵之间",
        "D": "流量小于混流泵高于离心泵"
    },
    {
        "ANS": "ABC",
        "Q": "同口径是指即成本的被算应考虑确权的周期保证与确权的形象进度同口径",
        "TYPE": "多选题",
        "A": "产值",
        "B": "确权",
        "C": "成本的形象进度",
        "D": "利润"
    },
    {
        "ANS": "D",
        "Q": "同口径下发包人确认工程计量与项目实际成本的比值是衡量项目过程确权的工作指标是哪一种术语",
        "TYPE": "单选题",
        "A": "合同外工期费用确认率",
        "B": "工程计量确权不含税",
        "C": "营收确权率不含税",
        "D": "工程计量确认率不含税"
    },
    {
        "ANS": "B",
        "Q": "同一标段包含多个单项单位工程时措施项目及其他项目应按同一标段综合报价",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "CE",
        "Q": "投标保证金的要求",
        "TYPE": "多选题",
        "A": "投标保证金金额无要求",
        "B": "投标保证金有效期与投标有效期可以不一致",
        "C": "投标保证金有效期与投标有效期一致",
        "D": "投标保证金可以个人缴纳",
        "E": "投标保证金应当从基本账户转出"
    },
    {
        "ANS": "ABDE",
        "Q": "投标报价的分包询价投标人应注意的问题有",
        "TYPE": "多选题",
        "A": "分包标函是否完整",
        "B": "分包单价所包含的内容",
        "C": "分包人是否自备专用施工机具",
        "D": "分包人可信赖程度",
        "E": "分包人的质量保证措施"
    },
    {
        "ANS": "A",
        "Q": "投标报价时投标人结合本企业的实际情况计价表中的人工材料机械台班耗用量可作适当调整",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "投标合作类财务资金类投资发展类海外合同办公服务类招聘培训类企划类其他类合同审批权限为公司总经理",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "投标后投标人撤销投标文件的招标人可以不退还投标保证金",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "投标人复核招标工程量清单时发现了遗漏是否向招标人提出修改意见取决于",
        "TYPE": "单选题",
        "A": "招标文件规定是否允许提出增补",
        "B": "遗漏工程量的大小",
        "C": "投标人的投标策略",
        "D": "遗漏项目是否在工程量计算规范附录中有列项"
    },
    {
        "ANS": "B",
        "Q": "投标人少于个的不得开标招标人应当重新招标",
        "TYPE": "单选题",
        "A": "2",
        "B": "3",
        "C": "4",
        "D": "5"
    },
    {
        "ANS": "ACDE",
        "Q": "投标人有下列哪些情形的属于招标投标法第三十三条规定的以其他方式弄虚作假的行为",
        "TYPE": "多选题",
        "A": "使用伪造变造的许可证件",
        "B": "不同投标人的投标文件相互混装",
        "C": "提供虚假的项目负责人或者主要技术人员简历劳动关系证明",
        "D": "提供虚假的信用状况",
        "E": "提供虚假的财务状况或者业绩"
    },
    {
        "ANS": "ABD",
        "Q": "投标人有下列哪些行为属于招标投标法第五十三条规定的情节严重行为由有关行政监督部门取消其1年至2年内参加依法必须进行招标的项目的投标资格",
        "TYPE": "多选题",
        "A": "以行贿谋取中标",
        "B": "3年内2次以上串通投标",
        "C": "通投标行为损害招标人其他投标人或者国家集体公民的合法利益",
        "D": "其他串通投标情节严重的行为",
        "E": "2年内3次以上串通投标"
    },
    {
        "ANS": "ACD",
        "Q": "投标人在确定综合单价时需要注意的事项有",
        "TYPE": "多选题",
        "A": "清单项目特征描述",
        "B": "清单项目的编码顺序",
        "C": "材料暂估价的处理",
        "D": "材料设备市场价格的变化风险",
        "E": "税金规费的变化风险"
    },
    {
        "ANS": "ABC",
        "Q": "透平式压缩机同活塞式压缩机相比所具有的性能有",
        "TYPE": "多选题",
        "A": "气流速度高损失大",
        "B": "流量小超高压范围还不适用",
        "C": "流量和出口压力变化由性能曲线决定",
        "D": "外形尺寸及重量较大结构复杂排气脉动大"
    },
    {
        "ANS": "ABCD",
        "Q": "图纸管理中已经分割好的图纸如何上移下移",
        "TYPE": "多选题",
        "A": "左键选择要移动的图纸上下拖动",
        "B": "锁定小锁点开左键选择要移动的图纸上下拖动",
        "C": "点到图纸名称上鼠标右键上移下移",
        "D": "锁定小锁点开点到图纸名称上鼠标右键上移下移"
    },
    {
        "ANS": "BC",
        "Q": "涂料涂覆工艺中电泳涂装的主要特点有",
        "TYPE": "多选题",
        "A": "使用于水溶性涂料和油溶性涂料",
        "B": "涂装效率高涂料损失小",
        "C": "涂膜厚度均匀附着力强",
        "D": "不适用复杂形状工件的涂装"
    },
    {
        "ANS": "C",
        "Q": "土方开挖时底宽8米底长18米挖深2米应套用的土方开挖形式为",
        "TYPE": "单选题",
        "A": "一般土方开挖",
        "B": "沟槽土方开挖",
        "C": "基坑土方开挖",
        "D": "平整场地"
    },
    {
        "ANS": "A",
        "Q": "土方体积应按照挖掘前的天然密实体积计算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "推进提升装配式建筑设计研发和生产制造能力推动建筑行业四新技术落地应用",
        "TYPE": "多选题",
        "A": "智慧建造",
        "B": "智慧运营",
        "C": "数据产业化",
        "D": "智慧区域链"
    },
    {
        "ANS": "C",
        "Q": "推行双模式重点发展文体场馆高端康养等领域",
        "TYPE": "单选题",
        "A": "重资产运营轻资产投资",
        "B": "重资产建设轻资产运营",
        "C": "重资产投资轻资产运营",
        "D": "重资产开发轻资产运维"
    },
    {
        "ANS": "ABCDE",
        "Q": "推行五位一体项目管理架构提升EPC项目能力",
        "TYPE": "多选题",
        "A": "设计管理",
        "B": "计划管控",
        "C": "采购管理",
        "D": "专业管理",
        "E": "资源整合"
    },
    {
        "ANS": "CD",
        "Q": "外墙抹灰工程中窗台雨篷檐口等部位要求下面应",
        "TYPE": "多选题",
        "A": "水平",
        "B": "垂直",
        "C": "做滴水线",
        "D": "做泛水坡"
    },
    {
        "ANS": "D",
        "Q": "完成某单位分部分项工程需要基本用工42工日超运距用工03工日辅助用工1工日人工幅度系数为10则该单位分部分项工作预算定额人工消耗量为工日",
        "TYPE": "单选题",
        "A": "592",
        "B": "595",
        "C": "602",
        "D": "605"
    },
    {
        "ANS": "ABCD",
        "Q": "完善巩固八局集采品牌优势",
        "TYPE": "多选题",
        "A": "厂家直采",
        "B": "区域联采",
        "C": "战略集采任务清单",
        "D": "缩短供应链条"
    },
    {
        "ANS": "BCD",
        "Q": "完善兑现及时机制推动目标管理向管快速转变",
        "TYPE": "多选题",
        "A": "管质量",
        "B": "管源头",
        "C": "管过程",
        "D": "管要素",
        "E": "管效益"
    },
    {
        "ANS": "A",
        "Q": "违法分包指承包单位承包工程后违反法律法规规定把单位工程或分部分项工程分包给其他单位或个人施工的行为出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "围绕的所需配套专业发挥内部联动优势和外部资源整合能力扩大高附加值的高端产品及末端领域专业自施占比",
        "TYPE": "单选题",
        "A": "BOT项目工程",
        "B": "PPP项目工程",
        "C": "施工总承包",
        "D": "EPC工程总承包"
    },
    {
        "ANS": "B",
        "Q": "围绕资本市场对资产证券划的核心要求打造全周期资产管理闭环优化资产结构",
        "TYPE": "单选题",
        "A": "旧改更新",
        "B": "投融管退",
        "C": "保值增值",
        "D": "规模拓展"
    },
    {
        "ANS": "B",
        "Q": "为帮助受伤工人办理工伤认定项目部应在工伤认定审定单用人单位处加盖印章",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "为保证建设工程仲裁协议有效合同双方签订的仲裁协议中必须包括的内容有",
        "TYPE": "多选题",
        "A": "请求仲裁的意思表达",
        "B": "仲裁事项",
        "C": "选定的仲裁员",
        "D": "选定的仲裁委员会",
        "E": "仲裁结果的执行方式"
    },
    {
        "ANS": "B",
        "Q": "为本建设项目提供和验证设计数据资料等进行必要的研究实验费用及按照设计规定在建设过程中必须进行试验验证所需的费用应列入",
        "TYPE": "单选题",
        "A": "材料费",
        "B": "工程建设其他费",
        "C": "企业检验试验费",
        "D": "按质论价费"
    },
    {
        "ANS": "A",
        "Q": "为防控增量需坚定实施月结月清推进分供结算及时锁定项目成本",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "市场部",
        "C": "法律合规与风险管理部",
        "D": "工程管理部"
    },
    {
        "ANS": "C",
        "Q": "为防控增量需开展招标文件合同条款优化谈判变闭口为开口谋求效益最大风险最小",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "市场部",
        "C": "法律合规与风险管理部",
        "D": "工程管理部"
    },
    {
        "ANS": "B",
        "Q": "为防控增量要加强标前成本测算精细策划科学竞价落实报价策划交底扩大一次经营效益",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "市场部",
        "C": "法律合规与风险管理部",
        "D": "工程管理部"
    },
    {
        "ANS": "C",
        "Q": "为获得较高的力学性能高强度弹性极限和较高的韧性对于重要钢结构零件经热处理后其强度较高且塑性韧性更显著超过正火处理此种热处理工艺为",
        "TYPE": "单选题",
        "A": "低温回火",
        "B": "中温回火",
        "C": "高温回火",
        "D": "完全退火"
    },
    {
        "ANS": "BD",
        "Q": "为激活合格供应商库建立了以为特点的评价考核管理模型",
        "TYPE": "多选题",
        "A": "供货质量履约质量服务质量相结合",
        "B": "动态评价和静态考核相结合",
        "C": "服务动力和服务效能相结合",
        "D": "正向激励和负向约束相补充"
    },
    {
        "ANS": "A",
        "Q": "为了保证安全文明施工措施落实到位现场安全文明施工措施费实行核定制度",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "为判断能否采用PPP模式代替传统的政府投资运营方式提供公共服务项目应采用的评价方法",
        "TYPE": "单选题",
        "A": "项目经济评价",
        "B": "财政承受能力评价",
        "C": "物有所值评价",
        "D": "项目财务评价"
    },
    {
        "ANS": "D",
        "Q": "为强化潜亏治理加强间接费用管理降低项目间接成本开支",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "市场部",
        "C": "法律合规与风险管理部",
        "D": "财务资金部"
    },
    {
        "ANS": "ABC",
        "Q": "为强化潜亏治理各二级单位要",
        "TYPE": "多选题",
        "A": "梳理潜亏项目清单",
        "B": "拟定应对方案明晰责任人",
        "C": "指导开展专项治理工作",
        "D": "确保基础资料完整有效",
        "E": "编制治理方案拟定治理目标"
    },
    {
        "ANS": "ABC",
        "Q": "为强化潜亏治理局总部要",
        "TYPE": "多选题",
        "A": "编制治理方案拟定治理目标",
        "B": "督导治理方案实施工作落实",
        "C": "责定期分析预警和检查通报",
        "D": "梳理潜亏项目清单",
        "E": "拟定应对方案明晰责任人"
    },
    {
        "ANS": "ABCDE",
        "Q": "为强化潜亏治理科技部负责以下职责",
        "TYPE": "多选题",
        "A": "相关技术资料的有效确认",
        "B": "加强质量一次成优管理",
        "C": "确保设计优化优化设计",
        "D": "确保方案优化和钢筋技术优化效益",
        "E": "防范质量缺陷降低维修成本支出"
    },
    {
        "ANS": "ACD",
        "Q": "为强化潜亏治理项目部要",
        "TYPE": "多选题",
        "A": "确保基础资料完整有效",
        "B": "梳理潜亏项目清单",
        "C": "落实各项要求确保完成管理目标",
        "D": "开展扭亏策划化解项目风险",
        "E": "督导治理方案实施工作落实"
    },
    {
        "ANS": "ABCD",
        "Q": "为什么绘图输入界面查看工程量有量但报表预览界面没有量及处理方法",
        "TYPE": "多选题",
        "A": "汇总计算到最后提示报错需要把报错处理后再汇总计算当提示成功报表里面才会有量软件汇总的流程是先汇总构件工程量再汇总",
        "B": "文件导出GTJ工程",
        "C": "新建一个工程文件合并GTJ工程",
        "D": "需要全楼汇总计算单层汇总数据刷新不过来"
    },
    {
        "ANS": "CD",
        "Q": "为有效控制工程造价应将工程造价管理的重点放在阶段",
        "TYPE": "多选题",
        "A": "施工招标",
        "B": "施工",
        "C": "策划决策",
        "D": "设计",
        "E": "竣工验收"
    },
    {
        "ANS": "A",
        "Q": "未对分供方的融资水平和合同内容进行严格审核合同履约监控不到位付款不及时等可能引起纠纷这是采购管理主要应对的合同履约风险出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "未明确招标清单回标要求评标定标办法废标条件等条款或评定标环节未按照招标文件条款执行属于不合规行为出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "CE",
        "Q": "屋面防水工程量计算中正确的工程量清单计算规则是",
        "TYPE": "多选题",
        "A": "瓦屋面型材屋面按设计图示尺寸以水平投影面积计算",
        "B": "膜结构屋面按设计尺寸以覆盖面积计算",
        "C": "斜屋面卷材防水按设计图示尺寸以斜面积计算",
        "D": "屋面排水管按设计图示尺寸以理论重量计算",
        "E": "屋面天沟按设计尺寸以面积计算"
    },
    {
        "ANS": "C",
        "Q": "屋面框架梁顶层端支座梁下部钢筋满足直锚时直锚的长度为",
        "TYPE": "单选题",
        "A": "lae",
        "B": "05hc5d",
        "C": "maxlae05hc5d",
        "D": "12lae"
    },
    {
        "ANS": "A",
        "Q": "无梁板跨中板带和柱上板带细分了遇剪力墙和顶层节点构造",
        "TYPE": "单选题",
        "A": "中间层",
        "B": "基础层",
        "C": "地下室",
        "D": "顶层"
    },
    {
        "ANS": "ACD",
        "Q": "无损检测时关于射线探伤特点的正确表述为",
        "TYPE": "多选题",
        "A": "X射线照射时间短速度快",
        "B": "射线穿透力比X射线强灵敏度高",
        "C": "射线投资少成本低施工现场使用方便",
        "D": "中子射线检测能够检测封闭在高密度金属材料中的低密度非金属材料"
    },
    {
        "ANS": "C",
        "Q": "无粘结预应力混凝土特点是",
        "TYPE": "单选题",
        "A": "预留孔道施工复杂",
        "B": "张拉阻力比较大",
        "C": "预应力筋可完成曲线状态",
        "D": "预应力筋和混凝土不可产生相对滑动"
    },
    {
        "ANS": "ABCD",
        "Q": "无支承板端部封边构造当板厚150时说法正确的是",
        "TYPE": "多选题",
        "A": "可设置U形封边",
        "B": "可伸至端部弯折",
        "C": "U形封边2max15d200板厚2保护层",
        "D": "弯折长度板厚2保护层"
    },
    {
        "ANS": "BC",
        "Q": "物价变化合同价款的调整方法有",
        "TYPE": "多选题",
        "A": "平均价格调整法",
        "B": "价格指数调整法",
        "C": "造价信息调整法",
        "D": "双倍增值法",
        "E": "系数调整法"
    },
    {
        "ANS": "ABC",
        "Q": "物资采购策划是结合项目实际情况对项目物资管理中的进行辨识并根据辨识情况制定物资管理的目标和措施",
        "TYPE": "多选题",
        "A": "风险点",
        "B": "亏损点",
        "C": "赢利点",
        "D": "重点和难点"
    },
    {
        "ANS": "D",
        "Q": "物资结算发起物资管理人员在供应方供应完成日内发起",
        "TYPE": "单选题",
        "A": "20",
        "B": "15",
        "C": "10",
        "D": "5"
    },
    {
        "ANS": "C",
        "Q": "物资设备供应商储备不足潜在优质供应商未参与投标招投标未形成竞争环境未深入有效发掘属地资源价格偏高或经常性资源断供导致项目工期滞后对分供考察不全面导致的结果是出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "进场后坐地涨价出现工期质量及安全问题分包退场",
        "B": "资源未形成竞争价格高履约能力差",
        "C": "价格偏高或经常性资源断供导致项目工期滞后"
    },
    {
        "ANS": "B",
        "Q": "物资需求总计划编制按照施工进度计划和流水分段作业的要求分部分项分阶段进行编制",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "物资需求总计划编制中标后日内根据中标文件编制初步物资需求总计划",
        "TYPE": "单选题",
        "A": "7",
        "B": "6",
        "C": "10",
        "D": "15"
    },
    {
        "ANS": "A",
        "Q": "物资需求总计划编制按照施工进度计划和流水分段作业的要求分层分段分规格分构件进行编制中标后7日内根据中标文件编制初步物资需求总计划施工图预算编制完成后7日内提供完整物资需求总计划",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "下列属于电气设备安装工程计价定额中刚性阻燃管砖砼结构暗敷设定额的工作内容",
        "TYPE": "多选题",
        "A": "测位划线",
        "B": "刨沟抹砂浆保护层",
        "C": "扫管",
        "D": "切割墙体"
    },
    {
        "ANS": "BCD",
        "Q": "下列属于电气设备安装工程计价定额中管内穿线定额的工作内容",
        "TYPE": "多选题",
        "A": "查校线",
        "B": "穿引线",
        "C": "涂滑石粉",
        "D": "编号"
    },
    {
        "ANS": "ABC",
        "Q": "下列属于给排水采暖燃气工程计价定额中螺纹阀安装定额的工作内容",
        "TYPE": "多选题",
        "A": "切管",
        "B": "制垫加垫",
        "C": "水压试验",
        "D": "稳固"
    },
    {
        "ANS": "ABCD",
        "Q": "下列属于给排水采暖燃气工程计价定额中室内镀锌钢管螺纹连接定额的工作内容",
        "TYPE": "多选题",
        "A": "打堵洞眼",
        "B": "切管套丝",
        "C": "栽钩卡及管件安装",
        "D": "水压试验"
    },
    {
        "ANS": "BD",
        "Q": "下列属于刷油防腐蚀绝热过程计价定额中管道刷油定额的工作内容",
        "TYPE": "多选题",
        "A": "清理",
        "B": "调配",
        "C": "运料",
        "D": "涂刷"
    },
    {
        "ANS": "C",
        "Q": "下列安全文明施工费用中属于临时设施费的是",
        "TYPE": "单选题",
        "A": "现场生活卫生设施费用",
        "B": "建筑物内临时便溺设施费用",
        "C": "临时文化福利用房费",
        "D": "工程防暑降温费用"
    },
    {
        "ANS": "D",
        "Q": "下列不是以长度为计算单位的是",
        "TYPE": "单选题",
        "A": "木扶手油漆",
        "B": "线条刷涂料",
        "C": "板条油漆",
        "D": "栏杆油漆"
    },
    {
        "ANS": "D",
        "Q": "下列不属于工程造价职能的是",
        "TYPE": "单选题",
        "A": "预测职能",
        "B": "控制职能",
        "C": "评价职能",
        "D": "核算职能"
    },
    {
        "ANS": "AB",
        "Q": "下列材料损耗中因损耗而产生的费用包含在材料单价中的有",
        "TYPE": "多选题",
        "A": "场外运输损耗",
        "B": "工地仓储损耗",
        "C": "出工地料库后的搬运损耗",
        "D": "材料加工损耗",
        "E": "材料施工损耗"
    },
    {
        "ANS": "AB",
        "Q": "下列材料损耗中因损耗而产生的费用包含在材料单价中的有",
        "TYPE": "多选题",
        "A": "场外运输损耗",
        "B": "工地仓储损耗",
        "C": "出工地料库后的搬运损耗",
        "D": "材料加工损耗",
        "E": "材料施工损耗"
    },
    {
        "ANS": "D",
        "Q": "下列拆除工程中既可以按拆除部位的面积计算又可以按延长米计算的是",
        "TYPE": "单选题",
        "A": "砖砌体",
        "B": "抹灰面",
        "C": "龙骨及饰面",
        "D": "油漆涂料裱糊面"
    },
    {
        "ANS": "A",
        "Q": "下列地面面层中属于整体面层的是",
        "TYPE": "单选题",
        "A": "水磨石面层",
        "B": "花岗石面层",
        "C": "大理石面层",
        "D": "实木地板面层"
    },
    {
        "ANS": "A",
        "Q": "下列定额中定额水平应反映社会平均先进水平的是",
        "TYPE": "单选题",
        "A": "施工定额",
        "B": "预算定额",
        "C": "概算定额",
        "D": "概算指标"
    },
    {
        "ANS": "ABC",
        "Q": "下列对于管道吹扫与清洗描述正确的有",
        "TYPE": "多选题",
        "A": "空气吹扫流速不宜小于20ms",
        "B": "蒸汽吹扫应以大流量蒸汽进行吹扫流速不应小于30ms",
        "C": "管道水冲洗的流速不应小于15ms",
        "D": "冲洗排放管的截面积不应小于被冲洗管截面积的50"
    },
    {
        "ANS": "D",
        "Q": "下列费用项目中投标时应由投标人确定金额并计入其他项目清单与计价汇总表中的是",
        "TYPE": "单选题",
        "A": "暂列金额",
        "B": "材料暂估价",
        "C": "专业工程暂估价",
        "D": "总承包服务费"
    },
    {
        "ANS": "B",
        "Q": "下列费用中不属于建筑安装工程措施项目费的有",
        "TYPE": "单选题",
        "A": "材料二次搬运费",
        "B": "材料检验试验费",
        "C": "超高施工增加费",
        "D": "垂直运输费"
    },
    {
        "ANS": "D",
        "Q": "下列费用中计入技术服务费中勘察设计费的是",
        "TYPE": "单选题",
        "A": "设计评审费",
        "B": "技术经济标准使用费",
        "C": "技术革新研究试验费",
        "D": "非标准设备设计文件编制费"
    },
    {
        "ANS": "C",
        "Q": "下列费用中属于安全文明施工费中临时设施费的是",
        "TYPE": "单选题",
        "A": "现场配备的医疗保健器材费",
        "B": "塔吊及外用电梯安全防护措施费",
        "C": "临时文化福利用房费",
        "D": "新建项目的场地准备费"
    },
    {
        "ANS": "A",
        "Q": "下列费用中属于基本预算费支出范围的是",
        "TYPE": "单选题",
        "A": "超规超限设备运输增加费",
        "B": "人工材料施工机具的价差费",
        "C": "建设期内利率调整增加费",
        "D": "未明确项目准备金"
    },
    {
        "ANS": "BD",
        "Q": "下列费用中属于建筑安装工程费用企业管理费的有",
        "TYPE": "多选题",
        "A": "施工机械保险费",
        "B": "劳动保险费",
        "C": "工伤保险费",
        "D": "财产保险费",
        "E": "工程保险费"
    },
    {
        "ANS": "ABCD",
        "Q": "下列费用中属于招标工程量清单中其他项目清单编制内容的是",
        "TYPE": "多选题",
        "A": "暂列金额",
        "B": "暂估价",
        "C": "计日工",
        "D": "总承包服务费",
        "E": "措施费"
    },
    {
        "ANS": "BCD",
        "Q": "下列费用中应计入工程建设其他费用中用地与工程准备费的有",
        "TYPE": "多选题",
        "A": "建设场地大型土石方工程费",
        "B": "土地使用费和补偿费",
        "C": "场地准备费",
        "D": "建设单位临时设施费",
        "E": "施工单位平整场地费"
    },
    {
        "ANS": "ABC",
        "Q": "下列费用中由招标人填写金额投标人直接计入投标总价的有",
        "TYPE": "多选题",
        "A": "材料设备暂估价",
        "B": "专业工程暂估价",
        "C": "暂列金额",
        "D": "计日工单价",
        "E": "总承包服务费"
    },
    {
        "ANS": "BCD",
        "Q": "下列费用中应计入规费的有",
        "TYPE": "多选题",
        "A": "劳动保险费",
        "B": "养老保险费",
        "C": "工伤保险费",
        "D": "住房公积金",
        "E": "工程保险费"
    },
    {
        "ANS": "A",
        "Q": "下列风机中输送气体压力最大的风机是",
        "TYPE": "单选题",
        "A": "轴流鼓风机",
        "B": "高压离心通风机",
        "C": "高压轴流通风机",
        "D": "高压混流通风机"
    },
    {
        "ANS": "BCDE",
        "Q": "下列钢筋品牌中可用于预应力钢筋混凝土的钢筋有",
        "TYPE": "多选题",
        "A": "CRB600H",
        "B": "CRB680H",
        "C": "CRB800H",
        "D": "CRB650",
        "E": "CRB800"
    },
    {
        "ANS": "CE",
        "Q": "下列各项关于其他项目清单的编制说法正确的有",
        "TYPE": "多选题",
        "A": "暂列金额是预见肯定要发生而暂时无法明确数额的费用项目",
        "B": "专业工程暂估价应包括除规费以外的所有综合单价构成内容",
        "C": "需要纳入分部分项工程量清单项目综合单价中的暂估价只是材料费和工程设备费",
        "D": "总承包服务费包括总承包人为分包工程及自行采购材料设备发生的管理费用",
        "E": "招标人应预计总承包服务费并按投标人的投标报价向投标人支付该项费用"
    },
    {
        "ANS": "C",
        "Q": "下列各项收入中属于企业的免征税收入的是",
        "TYPE": "单选题",
        "A": "转让财产的收入",
        "B": "接受捐赠的收入",
        "C": "国债利息收入",
        "D": "提供劳务的收入"
    },
    {
        "ANS": "C",
        "Q": "下列各项中室内消火栓给水系统不需要设水泵结合器的是",
        "TYPE": "单选题",
        "A": "高层工业建筑",
        "B": "超过四层的多层工业建筑",
        "C": "多层民用建筑",
        "D": "城市交通隧道"
    },
    {
        "ANS": "ABD",
        "Q": "下列各项中属于室外消火栓组成部分的有",
        "TYPE": "多选题",
        "A": "室外消火栓",
        "B": "消防水泵接合器",
        "C": "消火栓",
        "D": "防水池"
    },
    {
        "ANS": "C",
        "Q": "下列各项中不属于材料预算价格的是",
        "TYPE": "单选题",
        "A": "材料原价",
        "B": "材料包装费",
        "C": "材料二次搬运费",
        "D": "材料采购及保管费"
    },
    {
        "ANS": "ABE",
        "Q": "下列各项中属于投标文件中应当包含的内容是",
        "TYPE": "多选题",
        "A": "施工组织设计",
        "B": "已标价工程量清单",
        "C": "项目概况",
        "D": "投标人须知",
        "E": "拟分包项目情况表"
    },
    {
        "ANS": "D",
        "Q": "下列各项中应列入工程计量范围的是",
        "TYPE": "单选题",
        "A": "不符合合同文件要求的工程",
        "B": "因承包人原因造成的超出合同工程范围施工的工程量",
        "C": "因承包人原因返工的工程量",
        "D": "价格调整项目"
    },
    {
        "ANS": "D",
        "Q": "下列工程定额中能反应建设总投资和各项费用的是",
        "TYPE": "单选题",
        "A": "施工定额",
        "B": "预算定额",
        "C": "概算指标",
        "D": "投资估算指标"
    },
    {
        "ANS": "ABCD",
        "Q": "下列工程技术其他费用属于技术服务费的有",
        "TYPE": "多选题",
        "A": "勘察设计费",
        "B": "职业病危害预评价费",
        "C": "监理费",
        "D": "技术经济标准使用费",
        "E": "专有技术使用费"
    },
    {
        "ANS": "C",
        "Q": "下列工程量清单计算公式正确的是",
        "TYPE": "单选题",
        "A": "分部分项工程量工料单价",
        "B": "措施项目工程量措施项目工料单价",
        "C": "其他项目暂列金额十暂估价十计日工十总承包服务费",
        "D": "单项工程费分部分项项目费措施项目费十其他项目十税金"
    },
    {
        "ANS": "C",
        "Q": "下列工程量清单正确的是",
        "TYPE": "单选题",
        "A": "分部分项工程量工料单价",
        "B": "措施项目工程量措施项目工料单价",
        "C": "其他项目暂列金额暂估价计日工总承包服务费",
        "D": "单项工程费分部分项项目费措施项目费其他项目税金"
    },
    {
        "ANS": "ABCD",
        "Q": "下列工程项目中必须采用工程量清单计价的有",
        "TYPE": "多选题",
        "A": "使用各级财政预算资金的项目",
        "B": "使用国家发行债券所筹资金的项目",
        "C": "国有资金投资总额占50以上的项目",
        "D": "使用国家政策性贷款的项目",
        "E": "使用国际金融机构贷款的项目"
    },
    {
        "ANS": "D",
        "Q": "下列工程项目组织机构形式中能够实现集权与分权的有效结合能够根据任务的实际情况组建和调整组织机构但稳定性差其成员容易受双重领导的组织机构是",
        "TYPE": "单选题",
        "A": "直线制",
        "B": "职能制",
        "C": "直线职能制",
        "D": "矩阵制"
    },
    {
        "ANS": "C",
        "Q": "下列工程造价中由承包单位编制发包单位或其委托的具有相应资质的工程造价咨询机构审查的是",
        "TYPE": "单选题",
        "A": "工程概算价",
        "B": "工程预算价",
        "C": "工程结算价",
        "D": "工程决算价"
    },
    {
        "ANS": "ABCD",
        "Q": "下列工作中属于商务策划内容的是",
        "TYPE": "多选题",
        "A": "专项策划",
        "B": "合同清单盈亏子项策划",
        "C": "认质认价策划",
        "D": "税费保险理赔策划",
        "E": "标价分离"
    },
    {
        "ANS": "B",
        "Q": "下列关于给排水采暖燃气工程计价定额中哪一种说法不正确的是",
        "TYPE": "单选题",
        "A": "带感应器的小便器安装包含了电气检查接线电气测试等工作内容",
        "B": "过墙过楼板钢套管套用室外焊接钢管定额",
        "C": "小便槽冲洗管制作与安装不包括阀门安装",
        "D": "热熔塑料给水管安装中包括管件安装的人工但不包括管件的价格"
    },
    {
        "ANS": "C",
        "Q": "下列关于给排水采暖燃气工程计价定额中说法正确的是",
        "TYPE": "单选题",
        "A": "自动排气阀安装未包括支架制作安装另行计算",
        "B": "采暖管道工程量计算中不应扣除暖气片所占长度",
        "C": "各种法兰连接用垫片均按石棉橡胶板计算如用其他材料不得调整",
        "D": "直埋式预制保温管安装定额规定按管道的公称直径套用相应的定额"
    },
    {
        "ANS": "ABC",
        "Q": "下列关于给排水采暖燃气工程计价定额中说法正确的有",
        "TYPE": "多选题",
        "A": "洗脸盆安装是按照电钻打孔塑料膨胀管安装如果采用预埋铁件定额不调整",
        "B": "法兰阀门安装中包括了二只法兰片安装",
        "C": "方形伸缩器的两臂按二倍臂长合并在管道长度内计算",
        "D": "搪瓷浴盆安装中包含了金属软管安装的人工不包含金属软管的材料费"
    },
    {
        "ANS": "ACD",
        "Q": "下列关于通用安装工程工程量计算规范GB508562013中说法正确的是",
        "TYPE": "多选题",
        "A": "施工现场临时设施的装饰装修美化费用包含在安全文明施工费中",
        "B": "公共庭院喷灌及喷泉水设备安装执行本规范",
        "C": "计算高层建筑施工措施费时建筑物的地下室不计入层数",
        "D": "通电测试防雷装置检测消防工程检测属于安装工程不包括的属经营服务性项目"
    },
    {
        "ANS": "BCD",
        "Q": "下列关于安装工程类别划分说法不正确的是",
        "TYPE": "多选题",
        "A": "多栋建筑物下有连通的地下室面积为8000m2地下室部分水电安装可按二类标准取费",
        "B": "一个单位工程如由几个分部分项工程组成其工程类别必须一致",
        "C": "如确定了工程类别为一类或二类工程则必须对定额中的人工费和管理费调整",
        "D": "一类工程中的人工费必须调整为一类工工资"
    },
    {
        "ANS": "D",
        "Q": "下列关于承发包模式的说明中正确的是",
        "TYPE": "单选题",
        "A": "总分包模式由于总包商和分包商签合同因此不利于业主方的合同管理",
        "B": "平行发包模式由于是业主和多个分包商分别签订合同因此有利于工程造价的控制",
        "C": "合作体承包模式承包商的风险较大",
        "D": "EPC承包模式承包商的风险较大"
    },
    {
        "ANS": "BD",
        "Q": "下列关于措施项目说法正确的有",
        "TYPE": "多选题",
        "A": "挑脚手架按水平投影面积计算",
        "B": "混凝土模板支架可以按平方米或者立方米计算",
        "C": "排水降水可以按照深度计算",
        "D": "文明施工项目包含五牌一图"
    },
    {
        "ANS": "ABC",
        "Q": "下列关于工程量计算及应用说明正确的是",
        "TYPE": "多选题",
        "A": "门窗筒子板工程量按实铺面积以m计算",
        "B": "窗台板工程量按实铺面积以m2计算",
        "C": "门窗筒子板及窗台板定额项目不包括装饰线条",
        "D": "门窗贴脸工程量按展开面积以2计算",
        "E": "门窗筒子板工程量按设计长度以m计算"
    },
    {
        "ANS": "BCD",
        "Q": "下列关于国内三相五线制电气接线颜色说法正确的是",
        "TYPE": "多选题",
        "A": "黑色为零线",
        "B": "黄绿红为相线",
        "C": "蓝色为零线",
        "D": "黄绿双色为接地线"
    },
    {
        "ANS": "A",
        "Q": "下列关于基础梁端部有外伸情况的钢筋构造说法正确的是",
        "TYPE": "单选题",
        "A": "纵筋伸至梁端弯折12d",
        "B": "纵筋伸至梁端弯折15d",
        "C": "上部第二排筋伸入支座内长度为lae",
        "D": "上部第二排筋伸至支座对边弯折15d而不必伸至悬挑端弯折"
    },
    {
        "ANS": "ABCD",
        "Q": "下列关于计价资料说法正确的是",
        "TYPE": "多选题",
        "A": "任何书面文件送达时应由对方签收",
        "B": "书面文件和通知不得扣压一方能够提供证据证明另一方拒绝签收或已送达的应视为对方已签收并应承担相应责任",
        "C": "发承包双方应当在合同中约定各自在合同工程中现场管理人员的职责范围",
        "D": "发承包双方不论在何种场合对与工程计价有关的事项所给予的批准均应采用书面形式",
        "E": "业主发函"
    },
    {
        "ANS": "ABCD",
        "Q": "下列关于计价资料说法正确的是",
        "TYPE": "多选题",
        "A": "养老保险费",
        "B": "书面文件和通知不得扣压一方能够提供证据证明另一方拒绝签收或已送达的应视为对方已签收并应承担相应责任",
        "C": "发承包双方应当在合同中约定各自在合同工程中现场管理人员的职责范围",
        "D": "发承包双方不论在何种场合对与工程计价有关的事项所给予的批准均应采用书面形式",
        "E": "业主发函"
    },
    {
        "ANS": "B",
        "Q": "下列关于碱性焊条的作用描述正确的是",
        "TYPE": "单选题",
        "A": "一般用于焊接低碳钢和不太重要的碳钢结构",
        "B": "药皮中加入一定量的萤石具有去氢作用",
        "C": "萤石不利于电弧的稳定必须采用直流正极性进行焊接",
        "D": "药皮中加入稳定电弧的组成物大理石等便可使用交流电源"
    },
    {
        "ANS": "D",
        "Q": "下列关于建设项目总投资的表述正确的是",
        "TYPE": "单选题",
        "A": "建设项目总投资就是动态投资",
        "B": "建设项目总投资包括动态投资和静态投资两部分",
        "C": "建设项目总投资包括固定资产投资和建筑安装工程造价",
        "D": "生产性建设项目总投资包括固定资产投资和流动资产投资"
    },
    {
        "ANS": "A",
        "Q": "下列关于建筑面积计算规则的论述中正确的是",
        "TYPE": "单选题",
        "A": "室内电梯井按建筑自然层计算建筑面积",
        "B": "室内电梯井按一层计算建筑面积",
        "C": "室内电梯井不计算建筑面积",
        "D": "室内垃圾井按一层计算建筑面积"
    },
    {
        "ANS": "A",
        "Q": "下列关于其他项目费的说法正确的是",
        "TYPE": "单选题",
        "A": "计日工是指在施工过程中施工单位完成建设单位提出的工程合同范围以外的零星项目或工作",
        "B": "计日工由施工单位按施工过程中形成的实际发生量来计价",
        "C": "施工单位投标时按建设单位给定的金额填报总承包服务费施工过程中按签约合同价执行",
        "D": "在施工过程中暂列金额由施工单位掌握使用扣除合同价款调整后如有余额归建设单位"
    },
    {
        "ANS": "B",
        "Q": "下列关于现场签证报告的确认说法正确的是",
        "TYPE": "单选题",
        "A": "承包人应在收到发包人指令后的2天内向发包人提交现场签证报告",
        "B": "承包人应在收到发包人指令后的7天内向发包人提交现场签证报告",
        "C": "承包人应在收到发包人指令后的5天内向发包人提交现场签证报告",
        "D": "发包人在收到现场签证报告后的24小时内对报告内容进行核实"
    },
    {
        "ANS": "C",
        "Q": "下列关于盈亏平衡分析的说法中正确的是",
        "TYPE": "单选题",
        "A": "盈亏平衡点越高项目抗风险能力越强",
        "B": "盈亏平衡分析揭示了有效控制风险的途径",
        "C": "盈亏平衡分析虽然能够度量项目风险的大小但并不能揭示产生项目风险的根源",
        "D": "盈亏平衡分析可分为单因素盈亏平衡分析和多因素盈亏平衡分析"
    },
    {
        "ANS": "C",
        "Q": "下列计入总价措施项目表的是",
        "TYPE": "单选题",
        "A": "垂直运输费",
        "B": "施工降排水",
        "C": "地上地下成品保护",
        "D": "大型机械进出场"
    },
    {
        "ANS": "C",
        "Q": "下列计入总价措施项目表的是",
        "TYPE": "单选题",
        "A": "垂直运输费",
        "B": "施工降排水",
        "C": "地上地下成品保护",
        "D": "大型机械进出场"
    },
    {
        "ANS": "ACD",
        "Q": "下列计算清单土方工程量正确的是",
        "TYPE": "多选题",
        "A": "挖土量不计放坡工作面等增加土方量",
        "B": "基础挖土方按基础底面积乘以挖土深度计算",
        "C": "石方开挖按设计图示尺寸以体积计算",
        "D": "管沟土方工程量以管道中心线长度计算",
        "E": "基础回填土按挖土体积减去设计室内地坪以下埋设的基础体积计算"
    },
    {
        "ANS": "C",
        "Q": "下列建设项目投货中属于动态投资部分的是",
        "TYPE": "单选题",
        "A": "预备费和铺定流动资金",
        "B": "工程建设其他费和镇底流动资金",
        "C": "价差预备费和建设期利息",
        "D": "建设期利息和铺底流动资金"
    },
    {
        "ANS": "A",
        "Q": "下列经济效果评价指标中属于动态指标的是",
        "TYPE": "单选题",
        "A": "财务净现值",
        "B": "流动比率",
        "C": "资金净利润率",
        "D": "投资率"
    },
    {
        "ANS": "ABCD",
        "Q": "下列满足规定的墙柱编号有",
        "TYPE": "多选题",
        "A": "YBZ",
        "B": "GBZ",
        "C": "AZ",
        "D": "FBZ"
    },
    {
        "ANS": "A",
        "Q": "下列哪个不是16G剪力墙中竖向钢筋在基础中的构造",
        "TYPE": "单选题",
        "A": "保护层厚度5d且hjLaE时弯折长度为max6d150",
        "B": "保护层厚度5d且hjLaE时弯折长度为15d全部弯折",
        "C": "保护层厚度5d且hjLaE时弯折长度为max6d150全部弯折",
        "D": "保护层厚度5d且hjLaE时弯折长度为15d全部弯折"
    },
    {
        "ANS": "BCDE",
        "Q": "下列哪项不属于装饰工程",
        "TYPE": "多选题",
        "A": "天棚吊顶",
        "B": "现浇混凝土柱",
        "C": "钢筋",
        "D": "瓦屋面",
        "E": "屋面保温"
    },
    {
        "ANS": "ABE",
        "Q": "下列哪些情形属于投标人相互串通投标",
        "TYPE": "多选题",
        "A": "投标人之间协商投标报价等投标文件的实质性内容",
        "B": "投标人之间约定中标人",
        "C": "不同投标人的投标文件载明的项目管理成员为同一人",
        "D": "不同投标人的投标文件异常一致或者投标报价呈规律性差异",
        "E": "投标人之间约定部分投标人放弃投标或者中标"
    },
    {
        "ANS": "A",
        "Q": "下列哪种情况不可以选择单一来源采购出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "招标后没有分供商投标或者没有合格标的或者重新招标未能成立的",
        "B": "涉及国家安全和秘密的",
        "C": "根据总承包合同约定或建设单位指定文件建设单位明确约定分供方的情形",
        "D": "只能从唯一分供方处采购的如专利产品及地方垄断行业"
    },
    {
        "ANS": "BCD",
        "Q": "下列哪种情况可以选择单一来源采购",
        "TYPE": "多选题",
        "A": "邀请招标后没有分供商投标或者没有合格标的导致流标的",
        "B": "涉及国家安全和秘密的",
        "C": "根据总承包合同约定或建设单位指定文件建设单位明确约定分供方的情形",
        "D": "只能从唯一分供方处采购的如专利产品及地方垄断行业"
    },
    {
        "ANS": "ABCD",
        "Q": "下列属于约束边缘构件的有",
        "TYPE": "多选题",
        "A": "约束边缘暗柱",
        "B": "约束边缘端柱",
        "C": "约束边缘翼墙",
        "D": "约束边缘转角墙"
    },
    {
        "ANS": "ABDE",
        "Q": "下列属于造价信息调整价格差额的有哪些",
        "TYPE": "多选题",
        "A": "承包人投标报价中材料单价低于基准单价",
        "B": "承包人投标报价中材料单价高于基准单价",
        "C": "承包人投标报价中材料单价等于基准单价",
        "D": "承包人应在采购材料前将采购数量和新的材料单价报送发包人核对确认用于本合同工程时发包人应确认采购材料的数量和单价",
        "E": "施工机械台班单价或施工机械使用费发生变化超过省级或行业建设主管部门或其授权的工程造价管理机构规定的范围时按其规定调整合同价款"
    },
    {
        "ANS": "ABDE",
        "Q": "下列属于造价信息调整价格差额的有哪些",
        "TYPE": "多选题",
        "A": "承包人投标报价中材料单价低于基准单价",
        "B": "承包人投标报价中材料单价高于基准单价",
        "C": "承包人投标报价中材料单价等于基准单价",
        "D": "承包人应在采购材料前将采购数量和新的材料单价报送发包人核对确认用于本合同工程时发包人应确认采购材料的数量和单价",
        "E": "施工机械台班单价或施工机械使用费发生变化超过省级或行业建设主管部门或其授权的工程造价管理机构规定的范围时按其规定调整合同价款"
    },
    {
        "ANS": "ABDE",
        "Q": "下列属于造价信息调整价格差额的有哪些",
        "TYPE": "多选题",
        "A": "任何书面文件送达时应由对方签收",
        "B": "承包人投标报价中材料单价高于基准单价",
        "C": "承包人投标报价中材料单价等于基准单价",
        "D": "承包人应在采购材料前将采购数量和新的材料单价报送发包人核对确认用于本合同工程时发包人应确认采购材料的数量和单价",
        "E": "施工机械台班单价或施工机械使用费发生变化超过省级或行业建设主管部门或其授权的工程造价管理机构规定的范围时按其规定调整合同价款"
    },
    {
        "ANS": "ABDE",
        "Q": "下列属于招标控制价的编制依据的是",
        "TYPE": "多选题",
        "A": "建设工程设计文件",
        "B": "拟定的招标文件",
        "C": "企业定额",
        "D": "与建设项目相关的标准规范技术资料",
        "E": "工程造价管理机构发布的工程造价信息"
    },
    {
        "ANS": "ABDE",
        "Q": "下列属于招标控制价的编制依据的是",
        "TYPE": "多选题",
        "A": "建设工程设计文件",
        "B": "招标工程量清单",
        "C": "企业定额",
        "D": "专业工程计量规范",
        "E": "施工现场情况工程特点及常规施工方案"
    },
    {
        "ANS": "D",
        "Q": "下列税率中采用差别比例税率的是",
        "TYPE": "单选题",
        "A": "土地增值税",
        "B": "城镇土地使用税",
        "C": "建筑业增值税",
        "D": "城市维护建设税"
    },
    {
        "ANS": "D",
        "Q": "下列说法不正确的是",
        "TYPE": "单选题",
        "A": "双洞口楼层连梁跨之间不设置箍筋",
        "B": "顶层连梁锚固支座部分箍筋设置同跨中箍筋间距为150",
        "C": "双洞口顶层连梁跨之间不设置箍筋",
        "D": "洞口上连梁箍筋起步距离洞口边100"
    },
    {
        "ANS": "ABC",
        "Q": "下列说法错误的是",
        "TYPE": "多选题",
        "A": "楼地面装饰中已包括木龙骨刷两遍防火涂料的工料",
        "B": "墙柱面装饰中已包括木龙骨刷两遍防火涂料的工料",
        "C": "顶棚装饰中已包括木龙骨刷两遍防火涂料的工料",
        "D": "楼地面装饰中不包括木龙骨刷两遍防火涂料的工料",
        "E": "墙柱面装饰中不包括木龙骨刷两遍防火涂料的工料"
    },
    {
        "ANS": "BCD",
        "Q": "下列说法正确的是",
        "TYPE": "多选题",
        "A": "垂直运输定额已包括特大型机械进出场及安拆费",
        "B": "地下层超过二层或层高超过36m时计取垂直运输费",
        "C": "带一层地下室的建筑物若地下垂直运输高度小于3m时不计算垂直运输",
        "D": "檐口高度3以内的单层建筑物不计算垂直运输",
        "E": "无论单层建筑物高度如何均应计算垂直运输"
    },
    {
        "ANS": "BDE",
        "Q": "下列索赔事件引起的费用索赔中可以获得利润补偿的有",
        "TYPE": "多选题",
        "A": "施工中发现文物",
        "B": "延迟提供施工场地",
        "C": "承包人提前竣工",
        "D": "延迟提供图纸",
        "E": "因发包人违约导致承包人暂停施工"
    },
    {
        "ANS": "BDE",
        "Q": "下列索赔事件引起的费用索赔中可以获得利润补偿的有",
        "TYPE": "多选题",
        "A": "施工中发现文物",
        "B": "延迟提供施工场地",
        "C": "承包人提前竣工",
        "D": "延迟提供图纸",
        "E": "因发包人违约导致承包人暂停施工"
    },
    {
        "ANS": "BD",
        "Q": "下列条件下的建设工程其施工承包合同适合采用成本加酬金方式确定合同价的有",
        "TYPE": "多选题",
        "A": "工程建设规模小",
        "B": "施工技术特别复杂",
        "C": "工期较短",
        "D": "紧急抢险项目",
        "E": "施工图设计还有待进一步优化"
    },
    {
        "ANS": "C",
        "Q": "下列违规选项中属于情节严重行为由有关行政监督部门取消其1年至2年内参加依法必须进行招标项目的投标资格的是",
        "TYPE": "单选题",
        "A": "借用其他企业的资质证书参加投标",
        "B": "投标时递交虚假业绩证明资格文件",
        "C": "以行贿谋取中标",
        "D": "投标文件中故意在商务上和技术上采用模糊的语言骗取中标中标后提供劣质货物工程或服务"
    },
    {
        "ANS": "CD",
        "Q": "下列项目按水平投影面积12计算建筑面积的有",
        "TYPE": "多选题",
        "A": "有围护结构的阳台",
        "B": "室外楼梯",
        "C": "单排柱车棚",
        "D": "独立柱雨篷",
        "E": "屋顶上的水箱"
    },
    {
        "ANS": "ABCDE",
        "Q": "下列选项属于采购管理人员从业准则的是出题来源采购管理部中建八局采购管理廉洁从业准则",
        "TYPE": "多选题",
        "A": "自觉修身崇德明理提升境界意识过硬",
        "B": "自觉用权谨言慎行责任至上能力过硬",
        "C": "自觉履职尽责担当忠于职守担当过硬",
        "D": "自觉学习勇于创新示范引领服务过硬",
        "E": "自觉律己崇廉拒腐清白做人纪律过硬"
    },
    {
        "ANS": "A",
        "Q": "下列选项中不属于信息来源的是出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "过期的报刊网络资源",
        "B": "采购人员提供的资料及自行调查取得的信息资料",
        "C": "政府部门发布的计划通报及情况报告",
        "D": "各种供货会展销会交流会提供的资料"
    },
    {
        "ANS": "ABDE",
        "Q": "下列选项中属于采购信息来源的是",
        "TYPE": "多选题",
        "A": "各报刊网络等媒体和专业性商业情报刊载的资料",
        "B": "广告资料",
        "C": "听熟人说的",
        "D": "有关学术技术交流会提供的资料",
        "E": "各种供货会展销会交流会提供的资料"
    },
    {
        "ANS": "A",
        "Q": "下列选项中需要计算建筑面积的是",
        "TYPE": "单选题",
        "A": "与建筑物内相连通的建筑部件",
        "B": "骑楼过街楼底层的开放公共空间",
        "C": "建筑物内的操作平台",
        "D": "室外专用消防钢楼梯"
    },
    {
        "ANS": "A",
        "Q": "下列选项中按设计图示尺寸以水平投影计算的是",
        "TYPE": "单选题",
        "A": "格珊吊顶",
        "B": "玻璃幕墙",
        "C": "灯槽",
        "D": "采光天棚"
    },
    {
        "ANS": "BCD",
        "Q": "下列选项中工程量计算规则按设计图示数量计算的是",
        "TYPE": "多选题",
        "A": "电缆保护管",
        "B": "标杆",
        "C": "标志板",
        "D": "视线诱导器",
        "E": "标线"
    },
    {
        "ANS": "D",
        "Q": "下列选项中属透层油的是",
        "TYPE": "单选题",
        "A": "桥梁砼搭板上喷洒的沥青",
        "B": "沥青砼面层的上面层与下面层间喷洒的沥青",
        "C": "道路表面处治喷洒的沥青",
        "D": "水泥稳定碎石基层上喷洒的乳化沥青"
    },
    {
        "ANS": "ABC",
        "Q": "下列选项中属于电磁继电器的有",
        "TYPE": "多选题",
        "A": "直流电磁继电器",
        "B": "交流电磁继电器",
        "C": "磁保持继电器",
        "D": "固态继电器"
    },
    {
        "ANS": "C",
        "Q": "下列油漆工程量计算规则中正确的是",
        "TYPE": "单选题",
        "A": "门窗油漆按展开面积计算",
        "B": "木扶手油漆按平方米计算",
        "C": "金属面油漆按构件质量计算",
        "D": "抹灰面油漆按图示尺寸面积和遍数计算"
    },
    {
        "ANS": "D",
        "Q": "下列有关缺陷责任期限的表述正确的是",
        "TYPE": "单选题",
        "A": "缺陷责任期从工程竣工日期起计算",
        "B": "缺陷责任期一般为2年发包人可要求延长延长期限不超过1年",
        "C": "缺陷责任期是指承包人按照有关法规承担保修义务的期限",
        "D": "由于发包人原因导致工程无法按规定期限进行竣工验收的在承包人提交竣工验收报告90天后工程自动进人缺陷责任期"
    },
    {
        "ANS": "C",
        "Q": "下列自动喷水灭火系统中适用于环境温度低于4且采用闭式喷头的是",
        "TYPE": "单选题",
        "A": "雨淋系统",
        "B": "湿式自动喷水灭火系统",
        "C": "干式自动喷水灭火系统",
        "D": "水幕系统"
    },
    {
        "ANS": "D",
        "Q": "下面清单计量规则中正确的是",
        "TYPE": "单选题",
        "A": "屋面保温隔热材料以铺设材料的体积计算",
        "B": "屋面架空隔热板中砖墩的费用应包括在内",
        "C": "现浇钢砼楼梯按钢砼实体积计算",
        "D": "平屋面上铺设的防水卷材应按水平投影面积计算"
    },
    {
        "ANS": "D",
        "Q": "下面清单计量规则中正确的是",
        "TYPE": "单选题",
        "A": "屋面保温隔热材料以铺设材料的体积计算",
        "B": "屋面架空隔热板中砖墩的费用应包括在内",
        "C": "现浇钢砼楼梯按钢砼实体积计算",
        "D": "平屋面上铺设的防水卷材应按水平投影面积计算"
    },
    {
        "ANS": "C",
        "Q": "下面关于剪力墙平法施工图是YD5100018006C20A81502C16下面说法正确的是",
        "TYPE": "单选题",
        "A": "YD51000表示5号圆形洞口半径1000",
        "B": "1800表示洞中心距上层结构层下表面距离1800mm",
        "C": "A8150表示加强暗梁的箍筋",
        "D": "6C20表示洞口环形加强钢筋"
    },
    {
        "ANS": "A",
        "Q": "下面关于剪力墙竖向钢筋构造描述错误的是",
        "TYPE": "单选题",
        "A": "剪力墙竖向钢筋采用搭接时必须在楼面以上500mm时搭接",
        "B": "剪力墙竖向钢筋采用机械连接时可以在楼面以上500mm处连接",
        "C": "四级抗震剪力墙竖向分布钢筋可在同一部位连接",
        "D": "剪力墙竖向钢筋顶部构造为到顶层板顶弯折12d"
    },
    {
        "ANS": "C",
        "Q": "下面哪个不是采购管理手册中所对应的风险出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "采购计划风险",
        "B": "廉洁管理风险",
        "C": "业主违约风险",
        "D": "成本控制风险"
    },
    {
        "ANS": "B",
        "Q": "下面哪个不属于采购管理原则中的公平公正原则出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "机会公平",
        "B": "履约公开",
        "C": "过程公正",
        "D": "结果公开"
    },
    {
        "ANS": "C",
        "Q": "下面哪项工作不是单一来源采购准备工作中需要的文件出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "单一来源采购申请",
        "B": "招标控制价审批表",
        "C": "评标报告"
    },
    {
        "ANS": "D",
        "Q": "下面哪种不是灌注桩配筋构造",
        "TYPE": "单选题",
        "A": "通长等截面配筋",
        "B": "通长变截面配筋",
        "C": "部分长度等截面配筋",
        "D": "部分长度变截面配筋"
    },
    {
        "ANS": "D",
        "Q": "下面那个内容不是项目采购策划书中的需要填报的内容出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "资产配置方案",
        "B": "采购管理目标控制表",
        "C": "专业工程采购模式策划表",
        "D": "项目施工进度计划"
    },
    {
        "ANS": "ABCD",
        "Q": "下面那些内容是项目采购策划书中的需要填报的内容",
        "TYPE": "多选题",
        "A": "资产配置方案",
        "B": "采购管理目标控制表",
        "C": "专业工程采购模式策划表",
        "D": "主要材料设备策划表",
        "E": "项目施工进度计划"
    },
    {
        "ANS": "C",
        "Q": "下面有关顶层柱节点构造描述错误的是",
        "TYPE": "单选题",
        "A": "角柱顶层纵向钢筋构造给出5个节点",
        "B": "2号节点外侧钢筋伸入梁内的长度为15Labe",
        "C": "2号节点内侧钢筋伸入梁内的长度为梁高保护层15d",
        "D": "中柱柱顶纵向钢筋当直锚长度Lae时可以直锚"
    },
    {
        "ANS": "B",
        "Q": "下面有关楼层框架梁中间支座下部纵筋锚固计算的判断正确的是",
        "TYPE": "单选题",
        "A": "能直锚固长度lae",
        "B": "lae与05hc5d取大值",
        "C": "能直锚固长度lae不能直锚取05hc5d",
        "D": "06lae且04hc5d"
    },
    {
        "ANS": "ABCD",
        "Q": "现场成本控制策划主要包括哪些方面",
        "TYPE": "多选题",
        "A": "材料的损耗",
        "B": "零星人工的使用",
        "C": "机械设备使用",
        "D": "周转料具的使用",
        "E": "市场行情摸底"
    },
    {
        "ANS": "B",
        "Q": "现场经费占比现场经费成本产值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "现场经费占比现场经费成本自施产值",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "现场临时设施参考中建八局项目临建标准化管理办法开工前需呈报方案及预算需约定占自施合同额比例此文件将作为结算附件在办理结算时一同上交",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "现场形象进度确认的主责部门为",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "项目总工",
        "C": "项目副经理",
        "D": "生产经理"
    },
    {
        "ANS": "C",
        "Q": "现浇钢筋混凝土构件中要扣除",
        "TYPE": "单选题",
        "A": "构件内300mm300mm孔洞所占体积",
        "B": "构件内预埋件的体积",
        "C": "板中超过03m2孔洞所占体积",
        "D": "墙中超过01m2孔洞所占体积"
    },
    {
        "ANS": "ACD",
        "Q": "现浇混凝土其他构件工程量以面积计算的有",
        "TYPE": "多选题",
        "A": "坡道",
        "B": "地沟",
        "C": "台阶",
        "D": "散水"
    },
    {
        "ANS": "B",
        "Q": "现浇混凝土挑檐天沟板雨篷阳台与板包括屋面板楼板连接时以为分界线",
        "TYPE": "单选题",
        "A": "外墙内边线",
        "B": "外墙外边线",
        "C": "梁外边线",
        "D": "梁内边线"
    },
    {
        "ANS": "A",
        "Q": "现浇砼构件工程量以延长米计算的有",
        "TYPE": "单选题",
        "A": "压顶",
        "B": "预制楼梯",
        "C": "后浇带",
        "D": "散水"
    },
    {
        "ANS": "ABC",
        "Q": "现浇砼构件工程量以延长米计算的有",
        "TYPE": "多选题",
        "A": "压顶",
        "B": "地沟",
        "C": "扶手",
        "D": "散水",
        "E": "后浇带"
    },
    {
        "ANS": "A",
        "Q": "现浇砼构件工程量以延长米计算的有",
        "TYPE": "单选题",
        "A": "压顶",
        "B": "预制楼梯",
        "C": "后浇带",
        "D": "散水"
    },
    {
        "ANS": "A",
        "Q": "现行国家价格政策市场交易价格及专业公司牌价地区建筑主管部门颁布的预算价格国家公布的外汇交易价格等属于材料采购信息中的出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "价格信息",
        "B": "资源信息",
        "C": "政策信息",
        "D": "市场信息"
    },
    {
        "ANS": "B",
        "Q": "限额设计中投资的分配顺序是",
        "TYPE": "单选题",
        "A": "单项工程专业工程单位工程",
        "B": "单项工程单位工程专业工程",
        "C": "专业工程单项工程单位工程",
        "D": "初步设计技术设计施工图设计"
    },
    {
        "ANS": "D",
        "Q": "线路敷设部位文字符号中SCE是指敷设方式",
        "TYPE": "单选题",
        "A": "沿或跨柱敷设",
        "B": "沿顶棚或顶板面敷设",
        "C": "沿或跨梁敷设",
        "D": "吊顶内敷设"
    },
    {
        "ANS": "ABC",
        "Q": "镶贴大理石面层装饰定额按施工工艺设置项目",
        "TYPE": "多选题",
        "A": "挂贴",
        "B": "干挂",
        "C": "粘贴",
        "D": "镶贴",
        "E": "现浇"
    },
    {
        "ANS": "C",
        "Q": "项目部策划实施目标不少于商务策划效益额的多少",
        "TYPE": "单选题",
        "A": "50",
        "B": "60",
        "C": "70",
        "D": "80"
    },
    {
        "ANS": "C",
        "Q": "项目部可向二级单位商务法务部计量中心提出委托申请经审批同意后根据项目实际情况组建算量小组协助项目编制总包结算书",
        "TYPE": "单选题",
        "A": "二级单位总经理",
        "B": "项目经理",
        "C": "二级单位总经济师",
        "D": "公司总经理"
    },
    {
        "ANS": "B",
        "Q": "项目部人员在项目预留的风险金尚未具备返还条件开工6个月内即调离该项目部预留风险金退回本人不再承担项目盈亏风险",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "项目部人员在项目预留的风险金尚未具备返还条件在该项目部工作时间超过3个月调离",
        "TYPE": "多选题",
        "A": "若该岗位存在继任者无论调离人是否退还预留风险金继任者均须按相应岗位标准进行补交若为项目内部人员岗位变动须按上限补交差额",
        "B": "项目部对调动人员和继任人员的绩效考核及项目部奖金的兑现可视为同一岗位的不同阶段以双方所在同一岗位的时间长短为权重分别考核及兑现",
        "C": "项目主要成员已缴纳的预留风险金不予退还且该岗位继任者需按相同标准缴纳同等额度的预留风险金兑现奖罚数额以在同一岗位的考勤时间为权重分别进行兑现奖励或者扣除预留的风险金存在特殊情况需单独上报公司经审批后执行",
        "D": "不予退回",
        "E": "协商退回"
    },
    {
        "ANS": "A",
        "Q": "项目部商务部牵头负责组织本项目风险识别预警负责督导落实各项风险管理要求对识别的重特大风险应对方案和处置效果可以直接上报分公司商务法务部",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "项目部月度或季度成本分析中应总结当期策划完成情况制定下月策划实施重点及措施企业对项目策划实施情况原策划执行中修正情况等定期跟踪和检查考核项目部每月将策划动态调整情况录入信息管理平台",
        "TYPE": "单选题",
        "A": "每次月3日前",
        "B": "每次月4日前",
        "C": "每次月5日前",
        "D": "每次月6日前"
    },
    {
        "ANS": "B",
        "Q": "项目采购策划的立项考核奖励等具体按执行出题来源采购管理部三公司项目目标管理考核兑现办法",
        "TYPE": "单选题",
        "A": "物资管理手册",
        "B": "三公司项目目标管理考核兑现办法",
        "C": "项目采购策划管理指引2021版",
        "D": "采购管理手册"
    },
    {
        "ANS": "C",
        "Q": "项目采购策划管理应以为核心以工期管理为主线出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "盈利",
        "B": "完美履约",
        "C": "成本",
        "D": "高效建造"
    },
    {
        "ANS": "A",
        "Q": "项目采购策划管理应以成本为核心以工期管理为主线出题来源采购管理部项目采购策划管理指引",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "项目采购策划管理应以盈利为核心以工期管理为主线出题来源采购管理部项目采购策划管理指引",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACDE",
        "Q": "项目采购策划管理原则是",
        "TYPE": "多选题",
        "A": "全面覆盖",
        "B": "周转利用",
        "C": "目标引领",
        "D": "系统联动",
        "E": "全程精益"
    },
    {
        "ANS": "C",
        "Q": "项目采购策划管理中的成果总结由负责实施出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "公司采购管理部",
        "B": "分公司采购中心",
        "C": "项目经理",
        "D": "分公司总经济师"
    },
    {
        "ANS": "D",
        "Q": "项目采购策划管理主要应对风险不包括出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "管理风险",
        "B": "成本风险",
        "C": "履约风险",
        "D": "法律风险"
    },
    {
        "ANS": "A",
        "Q": "项目采购策划目标管理是出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "以成本管理为核心以工期管理为主线",
        "B": "以工期管理为核心以成本管理为主线",
        "C": "以计划管理为核心以工期管理为主线",
        "D": "以成本管理为核心以计划管理为主线"
    },
    {
        "ANS": "A",
        "Q": "项目采购策划书应依据合同范围进度计划编制出题来源采购管理部项目采购策划管理指引",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "项目发生工期延误后编制工期延误费用索赔并成功取得发包人批复的工期延误索赔收入按发包人批复的工期延误索赔收入的多少给予奖励",
        "TYPE": "单选题",
        "A": "20",
        "B": "10",
        "C": "30",
        "D": "15"
    },
    {
        "ANS": "B",
        "Q": "项目岗位责任书签订的主责部门是",
        "TYPE": "单选题",
        "A": "项目商务管理部",
        "B": "项目经理",
        "C": "二级单位商务管理部",
        "D": "三级单位商务管理部"
    },
    {
        "ANS": "D",
        "Q": "项目竣工结算策划应在项目竣工验收前多久完成",
        "TYPE": "单选题",
        "A": "半个月",
        "B": "1个月",
        "C": "2个月",
        "D": "3个月"
    },
    {
        "ANS": "D",
        "Q": "项目零星物资采购主要审批人员是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "物资管理部经理",
        "B": "分公司总经济师",
        "C": "分公司招采主任",
        "D": "项目经理"
    },
    {
        "ANS": "A",
        "Q": "项目目标管理项目部的管理职责",
        "TYPE": "单选题",
        "A": "项目目标管理责任分解与实施",
        "B": "标价分离",
        "C": "商务策划",
        "D": "施工图预算",
        "E": "一体化策划"
    },
    {
        "ANS": "B",
        "Q": "项目目标管理责任书签订的审批权限是",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "二级单位总经理",
        "C": "项目经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "D",
        "Q": "项目商务策划第一责任人是",
        "TYPE": "单选题",
        "A": "公司总经济师",
        "B": "分公司总经济师",
        "C": "商务经理",
        "D": "项目经理"
    },
    {
        "ANS": "B",
        "Q": "项目商务策划书经批准实施后3天内由组织对项目部全体人员进行策划交底",
        "TYPE": "单选题",
        "A": "商务经理",
        "B": "项目经理",
        "C": "项目总工"
    },
    {
        "ANS": "D",
        "Q": "项目商务策划主要应对的风险中未对工期进行统筹策划计划未获业主监理确认计划安排不合理存在工期延误赶工抢工停工窝工等情况致使成本增加属于什么风险",
        "TYPE": "单选题",
        "A": "策划未覆盖全部项目",
        "B": "参与策划积极性不足",
        "C": "合同风险",
        "D": "工期滞后风险"
    },
    {
        "ANS": "C",
        "Q": "项目商务经理完成项目成本还原项目整体成本核定分包结算汇总核定项目预算收入核定项目管理费用核定项目材料损耗控制核定项目改进成本控制措施核定经二级单位审核后上报",
        "TYPE": "单选题",
        "A": "竣工后15日内",
        "B": "竣工后1个月内",
        "C": "结算定案后14天内",
        "D": "竣工后3个月内"
    },
    {
        "ANS": "C",
        "Q": "项目商务经理完成项目成本总结包括盈亏原因分析成本管控分析主要经验教训与启示等经二级单位审核后上报",
        "TYPE": "单选题",
        "A": "竣工后15日内",
        "B": "竣工后1个月内",
        "C": "结算定案后14天内",
        "D": "竣工后3个月内"
    },
    {
        "ANS": "B",
        "Q": "项目商务经理填报项目部商务月度报告报送二级单位商务法务部和商务管理部分析指导",
        "TYPE": "单选题",
        "A": "次月3日前",
        "B": "次月5日前",
        "C": "次月7日前",
        "D": "次月10日前"
    },
    {
        "ANS": "A",
        "Q": "项目实际成本指为完成工程顺利履约所投入的全部承包范围内的费用",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "项目投标策划的组织时间",
        "TYPE": "单选题",
        "A": "提交投标文件前10天",
        "B": "收到招标文件后5天",
        "C": "收到招标文件后10天",
        "D": "提交投标文件前5天"
    },
    {
        "ANS": "D",
        "Q": "项目应建立中标前封样按样品验收确保进场物资品质出题来源采购管理部中建八局采购管理价值创造能力提升实施方案",
        "TYPE": "单选题",
        "A": "储存室",
        "B": "样品展示区",
        "C": "复试区",
        "D": "封样室"
    },
    {
        "ANS": "D",
        "Q": "项目优化应事前立项且一事一立项房建项目510亿元自施单项优化预计效益立项基数是",
        "TYPE": "单选题",
        "A": "20万",
        "B": "30万",
        "C": "50万",
        "D": "40万"
    },
    {
        "ANS": "A",
        "Q": "项目优化应事前立项且一事一立项基础设施项目10亿元以上自施单项优化预计效益立项基数是",
        "TYPE": "单选题",
        "A": "60万",
        "B": "30万",
        "C": "40万",
        "D": "50万"
    },
    {
        "ANS": "B",
        "Q": "项目优化应事前立项且一事一立项专业项目051亿元自施单项优化预计效益立项基数是",
        "TYPE": "单选题",
        "A": "10万",
        "B": "20万",
        "C": "30万",
        "D": "40万"
    },
    {
        "ANS": "A",
        "Q": "项目总包结算和该项目所有分包结算分供结算完成后天内二级单位商务管理部及时通知二级单位财务资金部门发出项目总分包结算结清通知单",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "21",
        "D": "30"
    },
    {
        "ANS": "A",
        "Q": "虚假招标无效招标主要表现是伪造投标报价单中标单位的工商登记信息完全不存在中标单位不具备业务承揽资质出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "CD",
        "Q": "悬挑板底部构造筋伸入支座内的长度为",
        "TYPE": "多选题",
        "A": "h",
        "B": "120",
        "C": "12d",
        "D": "支座宽2"
    },
    {
        "ANS": "D",
        "Q": "询价采购适用于因抢工应急等所需零星物资单笔万元以内累计采购总额不超过万元的零星采购出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "1030",
        "B": "1020",
        "C": "530",
        "D": "520"
    },
    {
        "ANS": "A",
        "Q": "严厉禁止不考察或考察不合格入库行为被本单位标记的分供方一律不予通过资审出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "单选题",
        "A": "不良行为",
        "B": "战略",
        "C": "良好",
        "D": "较差"
    },
    {
        "ANS": "ABC",
        "Q": "氧丙烷火焰切割与氧乙炔火焰切割相比具有的优点为",
        "TYPE": "多选题",
        "A": "安全性能高",
        "B": "对环境污染小",
        "C": "切割面粗糙度低",
        "D": "火焰温度相对较高"
    },
    {
        "ANS": "D",
        "Q": "邀请招标采购控制时长不高于天出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "5",
        "B": "10",
        "C": "15",
        "D": "20"
    },
    {
        "ANS": "C",
        "Q": "邀请招标中拟中标数量为2时推荐分供方数量不少于出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "3",
        "B": "4",
        "C": "5",
        "D": "6"
    },
    {
        "ANS": "ABC",
        "Q": "液位检测表水位计用于指示锅炉内水位的高低在安装时应满足设置要求下列表述正确的有",
        "TYPE": "多选题",
        "A": "蒸发量大于02th的锅炉每台锅炉应安装两个彼此独立的水位计",
        "B": "水位计与锅筒之间的汽水连接管长度应小于500mm",
        "C": "水位计距离操作地面高于6m时应加装远程水位显示装置",
        "D": "水位计不得设置放水管及放水阀门"
    },
    {
        "ANS": "ABCDE",
        "Q": "一般建设工程包括",
        "TYPE": "多选题",
        "A": "分部分项工程费",
        "B": "措施项目费",
        "C": "其他项目费",
        "D": "规费",
        "E": "税金"
    },
    {
        "ANS": "A",
        "Q": "一轮取消最高价中标权即按报价由高到低顺序依次取消中标权一轮取消中标权的单位数量原则上不少于1家不高于投标单位数量的35如果满足废标条件则优先于最高价淘汰出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "一轮淘汰的单位数量原则上不少于1家不高于投标单位数量的出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "25",
        "B": "30",
        "C": "35",
        "D": "40"
    },
    {
        "ANS": "B",
        "Q": "一台某种机械工作24小时为一个台班",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "依法必须进行招标的工程建设项目的具体范围和规模标准由制订报国务院批准后公布施行",
        "TYPE": "单选题",
        "A": "国务院",
        "B": "国务院发展改革部门会同国务院有关部门",
        "C": "国务院发展改革部门",
        "D": "各级地方政府自行"
    },
    {
        "ANS": "B",
        "Q": "依法应当公开招标的项目招标人无正当理由不与中标人签订合同的由有关行政监督部门责令改正可以处中标项目金额10以下的罚款",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BCD",
        "Q": "依据安装工程计量规范措施项目清单中属于专业措施项目的有",
        "TYPE": "多选题",
        "A": "二次搬运",
        "B": "平台铺设拆除",
        "C": "焊接工艺评定",
        "D": "防护棚制作安装拆除"
    },
    {
        "ANS": "AD",
        "Q": "依据安装工程计量规范下列项目中属于安全文明施工及其他措施项目的有",
        "TYPE": "多选题",
        "A": "已完工程及设备保护",
        "B": "有害化合物防护",
        "C": "高浓度氧气防护",
        "D": "高层施工增加"
    },
    {
        "ANS": "ACD",
        "Q": "依据安装工程计量规范措施项目清单中关于高层施工增加的规定正确的表述有",
        "TYPE": "多选题",
        "A": "单层建筑物檐口高度超过20m应分别列项",
        "B": "多层建筑物超过8层时应分别列项",
        "C": "突出主体建筑物顶的电梯房水箱间排烟机房等不计入檐口高度",
        "D": "计算层数时地下室不计入层数"
    },
    {
        "ANS": "A",
        "Q": "依据电气设备安装工程计价定额计算某办公楼装修工程中的120套筒灯安装350mm灯具安装高度距地55定额人工费16502元10套计算该种筒灯的分部分项中人工费是",
        "TYPE": "单选题",
        "A": "198024",
        "B": "237629",
        "C": "257431",
        "D": "263372"
    },
    {
        "ANS": "C",
        "Q": "依据电气设备安装工程计价定额计算某办公楼装修工程中的900RVS225mm2电线沿金属线槽敷设线槽安装高度距地65m线槽配线导线截面25mm2的定额人工费为598元100单线计算该规格电线的分部分项中人工费是",
        "TYPE": "单选题",
        "A": "61538",
        "B": "68205",
        "C": "78461",
        "D": "81846"
    },
    {
        "ANS": "B",
        "Q": "依据给排水采暖燃气工程计价定额计算某项目中的2个DN80给水螺纹阀门安装位于新建高层建筑的34层在管廊内安装阀门标高38m距本层地面定额人工费为3552元个计算该项目中DN80阀门的分部分项中人工费是",
        "TYPE": "单选题",
        "A": "9554",
        "B": "9946",
        "C": "1216",
        "D": "11291"
    },
    {
        "ANS": "B",
        "Q": "依据江苏省建设工程费用定额下列不属于分部分项中人工费的是",
        "TYPE": "单选题",
        "A": "计时工资或计件工资",
        "B": "工会经费",
        "C": "津贴补贴",
        "D": "加班加点工资"
    },
    {
        "ANS": "C",
        "Q": "依据江苏省建设工程费用定额下列不属于施工机械使用费的是",
        "TYPE": "单选题",
        "A": "折旧费",
        "B": "大修理费",
        "C": "固定资产使用费",
        "D": "操作员人工费"
    },
    {
        "ANS": "BC",
        "Q": "依据通用安装工程工程量计算规范GB508562013机械设备安装工程量中以台为计量单位的有",
        "TYPE": "多选题",
        "A": "直流电梯安装",
        "B": "冷水机组",
        "C": "多级离心泵安装",
        "D": "起重设备轨道安装"
    },
    {
        "ANS": "D",
        "Q": "依据通用安装工程工程量计算规范GB508562013室外给水管道与市政管道界限划分应为",
        "TYPE": "单选题",
        "A": "以项目区入口水表井为界",
        "B": "以项目区围墙外15m为界",
        "C": "以项目区围墙外第一个阀门为界",
        "D": "以市政管道碰头井为界"
    },
    {
        "ANS": "CD",
        "Q": "依据通用安装工程工程量计算规范GB508562013属于有害身体健康环境中施工增加的为",
        "TYPE": "多选题",
        "A": "噪声防护",
        "B": "火灾防护",
        "C": "粉尘防护",
        "D": "有害气体防护"
    },
    {
        "ANS": "AC",
        "Q": "依据通用安装工程工程量计算规范GB508562013消防工程水灭火系统安装工程量中以组为单位计量的包括",
        "TYPE": "多选题",
        "A": "湿式报警装置安装",
        "B": "装置压力表安装",
        "C": "末端试水装置安装",
        "D": "试验管流量计安装"
    },
    {
        "ANS": "A",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定给排水采暖燃气工程的编码为",
        "TYPE": "单选题",
        "A": "0310",
        "B": "0311",
        "C": "0312",
        "D": "0313"
    },
    {
        "ANS": "A",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定给排水采暖燃气工程计算管道工程量时方形补偿器的长度计量方法正确的是",
        "TYPE": "单选题",
        "A": "以所占长度列入管道工程量内",
        "B": "以总长度列入管道工程量内",
        "C": "列入补偿器总长度的12",
        "D": "列入补偿器总长度的23"
    },
    {
        "ANS": "C",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定工程量按设计图示外径尺寸以展开面积计算的通风管道是",
        "TYPE": "单选题",
        "A": "碳钢通风管道",
        "B": "铝板通风管道",
        "C": "玻璃钢通风管道",
        "D": "塑料通风管道"
    },
    {
        "ANS": "D",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定利用基础钢筋作接地极应执行的清单项目是",
        "TYPE": "单选题",
        "A": "接地极项目",
        "B": "接地母线项目",
        "C": "基础钢筋项目",
        "D": "均压环项目"
    },
    {
        "ANS": "AC",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定通风空调工程中过滤器的计量方式有",
        "TYPE": "多选题",
        "A": "以台计量按设计图示数量计算",
        "B": "以个计量按设计图示数量计算",
        "C": "以面积计量按设计图示尺寸的过滤面积计算",
        "D": "以面积计量按设计图示尺寸计算"
    },
    {
        "ANS": "D",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定项目编码设置中的第四级编码的数字位数及表示含义为",
        "TYPE": "单选题",
        "A": "2位数表示各分部工程顺序码",
        "B": "2位数表示各分项工程顺序码",
        "C": "3位数表示各分部工程顺序码",
        "D": "3位数表示各分项工程顺序码"
    },
    {
        "ANS": "ABC",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定以下选项属于湿式报警装置内容的有",
        "TYPE": "多选题",
        "A": "水力警铃",
        "B": "延时器",
        "C": "试验管流量计",
        "D": "挠性接头"
    },
    {
        "ANS": "ACD",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定自动报警系统调试按系统计算其报警系统包括探测器报警器消防广播及",
        "TYPE": "多选题",
        "A": "报警控制器",
        "B": "防火控制阀",
        "C": "报警按钮",
        "D": "消防电话"
    },
    {
        "ANS": "ABC",
        "Q": "依据通用安装工程工程量计算规范GB508562013030801001低压碳钢管项目特征有",
        "TYPE": "多选题",
        "A": "材质规格",
        "B": "连接形式焊接方法",
        "C": "压力试验吹扫与清洗设计要求",
        "D": "刷油绝热方法"
    },
    {
        "ANS": "C",
        "Q": "依据通用安装工程工程量计算规范GB508562013安装工程分类编码体系中第一二级编码为0308表示",
        "TYPE": "单选题",
        "A": "电气设备安装工程",
        "B": "通风空调工程",
        "C": "工业管道工程",
        "D": "消防工程"
    },
    {
        "ANS": "C",
        "Q": "依据通用安装工程工程量计算规范GB508562013工业锅炉脱硫设备及辅助设备安装工程量中以t为计量单位的是",
        "TYPE": "单选题",
        "A": "烟气换热器",
        "B": "真空皮带脱水机",
        "C": "吸收塔",
        "D": "旋流器"
    },
    {
        "ANS": "D",
        "Q": "依据通用安装工程工程量计算规范GB508562013室外给水管道与市政管道界限划分应为",
        "TYPE": "单选题",
        "A": "以项目区入口水表井为界",
        "B": "以项目区围墙外15m为界",
        "C": "以项目区围墙外第一个阀门为界",
        "D": "以市政管道碰头井为界"
    },
    {
        "ANS": "CD",
        "Q": "依据通用安装工程工程量计算规范GB508562013下列项目中属于安全文明施工及其他措施项目的有",
        "TYPE": "多选题",
        "A": "设备管道焊接保护",
        "B": "管道安拆后的充气保护",
        "C": "已完工程及设备保护",
        "D": "施工安全防护通道"
    },
    {
        "ANS": "BCD",
        "Q": "依据通用安装工程工程量计算规范GB508562013消防工程工程量计量时下列装置按组计算的有",
        "TYPE": "多选题",
        "A": "消防水炮",
        "B": "报警装置",
        "C": "末端试水装置",
        "D": "温感式水幕装置"
    },
    {
        "ANS": "C",
        "Q": "依据通用安装工程工程量计算规范GB508562013规定刷油防腐蚀绝热工程的基本安装高度为m",
        "TYPE": "单选题",
        "A": "4",
        "B": "5",
        "C": "6",
        "D": "10"
    },
    {
        "ANS": "BC",
        "Q": "依据通用安装工程工程量计算规范GB508562013的规定中压锅炉及其他辅助设备安装工程量计量时以只为计量单位的项目有",
        "TYPE": "多选题",
        "A": "省煤器",
        "B": "煤粉分离器",
        "C": "暖风器",
        "D": "旋风分离器"
    },
    {
        "ANS": "ABD",
        "Q": "依据通用安装工程工程量计算规范GB508562013机械设备安装工程量中以台为计量单位的有",
        "TYPE": "多选题",
        "A": "离心式泵安装",
        "B": "刮板输送机安装",
        "C": "交流电梯安装",
        "D": "离心式压缩机安装"
    },
    {
        "ANS": "A",
        "Q": "依据合同范围编制采购策划书出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "进度计划",
        "B": "招标计划",
        "C": "采购策划管理目标",
        "D": "物资消耗管控目标"
    },
    {
        "ANS": "B",
        "Q": "依据项目合同承包范围合理划分各专业招采界面的主责人是出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "项目商务经理",
        "B": "项目经理",
        "C": "项目物资主管",
        "D": "项目采购经理"
    },
    {
        "ANS": "B",
        "Q": "已签约合同价中的暂列金额应由掌握使用",
        "TYPE": "单选题",
        "A": "承包人",
        "B": "发包人",
        "C": "监理人",
        "D": "设计人"
    },
    {
        "ANS": "BCE",
        "Q": "已完工程进度款支付申请应包括下列哪些内容",
        "TYPE": "多选题",
        "A": "挂号邮寄",
        "B": "累计已实际支付的合同价款",
        "C": "本周期合计应扣减的金额",
        "D": "本周期应预留的质量保证金",
        "E": "本周期合计完成的合同价款"
    },
    {
        "ANS": "ABCE",
        "Q": "已完工程进度款支付申请应包括下列哪些内容",
        "TYPE": "多选题",
        "A": "累计已完成的合同价款",
        "B": "累计已实际支付的合同价款",
        "C": "本周期合计应扣减的金额",
        "D": "本周期应预留的质量保证金",
        "E": "本周期合计完成的合同价款"
    },
    {
        "ANS": "B",
        "Q": "以t为单位应保留小数点后数字",
        "TYPE": "单选题",
        "A": "两位",
        "B": "三位",
        "C": "四位",
        "D": "整数"
    },
    {
        "ANS": "C",
        "Q": "以局科技创新三年行动为契机打通链条建立核心攻关任务清单加大研发投入",
        "TYPE": "单选题",
        "A": "设计优化",
        "B": "提高效益",
        "C": "产学研用",
        "D": "采购降本"
    },
    {
        "ANS": "B",
        "Q": "以南京禄口机场T1航站楼改扩建工程为载体的大型航站楼技改综合施工技术研究成果达到",
        "TYPE": "单选题",
        "A": "国际领先水平",
        "B": "国际先进水平",
        "C": "国内领先水平",
        "D": "国内先进水平"
    },
    {
        "ANS": "B",
        "Q": "以投标邀请书的方式邀请特定的法人或其他组织参与投标的采购方式是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "公开招标",
        "B": "邀请招标",
        "C": "竞争性谈判",
        "D": "单一来源采购"
    },
    {
        "ANS": "ABE",
        "Q": "以下项目属于零星砖砌体",
        "TYPE": "多选题",
        "A": "地垄墙",
        "B": "室外砖砌花台",
        "C": "砖窨井",
        "D": "砖地沟",
        "E": "砖砌台阶"
    },
    {
        "ANS": "ABE",
        "Q": "以下项目属于零星砖砌体",
        "TYPE": "多选题",
        "A": "地垄墙",
        "B": "室外砖砌花台",
        "C": "砖窨井",
        "D": "砖地沟",
        "E": "砖砌台阶"
    },
    {
        "ANS": "D",
        "Q": "以下不属于采购管理人员履职准则三主动的是出题来源采购管理部中建八局廉洁从业准则",
        "TYPE": "单选题",
        "A": "主动公开",
        "B": "主动回避",
        "C": "主动作为",
        "D": "主动澄清"
    },
    {
        "ANS": "B",
        "Q": "以下不属于邀请招标的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "技术复杂或有特殊要求或受自然地域环境限制只有少量潜在的投标人可供选择的",
        "B": "因严重自然灾害不可预见的紧急情况涉及抢险救灾突发紧急事件和其他不可抗力事件所实施的紧急采购和涉及国家安全和秘密的",
        "C": "涉及国家安全国家秘密或抢险救灾适宜招标但不宜公开招标的",
        "D": "对完成质量服务效果等有特殊要求分供方只能在特定范围内选择的"
    },
    {
        "ANS": "CE",
        "Q": "以下不属于招标方式选择过程中合规管控要点的是",
        "TYPE": "多选题",
        "A": "拆分招标",
        "B": "未按要求进行公开招标",
        "C": "除公开招标外未在合格分供方名录中选择供方",
        "D": "询价采购单一来源采购竞争性谈判未按照要求提交采购申请",
        "E": "排斥潜在投标人"
    },
    {
        "ANS": "A",
        "Q": "以下对定点分包合同说法正确的是",
        "TYPE": "单选题",
        "A": "定点分包合同指按照固定百分比点数签订的分包合同此类合同一般由分包直接或以总承包人的名义与总承包合同发包人办理结算或产值确权总承包人依据定点分包合同及分包与发包人确定的竣工结算或确权产值与分包人办理结算或产值确权",
        "B": "定点分包合同指按照固定的清单单价签订的分包合同此类合同一般由分包直接或以总承包人的名义与总承包合同发包人办理结算或产值确权总承包人依据清单分包合同及分包与发包人确定的竣工结算或确权产值与分包人办理结算或产值确权",
        "C": "定点分包合同指按照固定百分率签订的分包合同此类合同一般由分包直接或以总承包人的名义与总承包合同发包人办理结算或产值确权总承包人依据百分率分包合同及分包与发包人确定的竣工结算或确权产值与分包人办理结算或产值确权",
        "D": "定点分包合同指按照固定百分比点数签订的分包合同此类合同一般由发包人直接与总承包合同发包人办理结算或产值确权总承包人依据定点分包合同及分包与发包人确定的竣工结算或确权产值与分包人办理结算或产值确权"
    },
    {
        "ANS": "A",
        "Q": "以下对建造合同描述正确的是",
        "TYPE": "单选题",
        "A": "建造合同是指建造一项资产或者在设计技术功能最终用途等方面密切相关的数项资产而订立的合同",
        "B": "建造合同是指建造一项资产或者在设计技术功能最终用途等方面密切相关的其中某项资产而订立的合同",
        "C": "建造合同是指建造多项资产或者在设计技术功能最终用途等方面密切相关的某项资产而订立的合同",
        "D": "建造合同是指建造多项资产在设计技术功能最终用途等方面密切相关的某项资产而订立的合同"
    },
    {
        "ANS": "ABDE",
        "Q": "以下关于安全文明措施费的说法正确的有",
        "TYPE": "多选题",
        "A": "承包人对安全文明施工费应专款专用在财务账目中应单独列项备查不得挪作他用否则发包人有权要求其限期改正逾期未改正的造成的损失和延误的工期应由承包人承担",
        "B": "安全文明施工费包括的内容和使用范围应符合国家有关文件和计量规范的规定",
        "C": "发包人应在工程开工后的28天内预付不低于当年施工进度计划的安全文明施工费总额的70",
        "D": "安全文明施工费发包人在付款期满后的7天内仍未支付的若发生安全事故发包人应承担相应责任",
        "E": "发包人没有按时支付安全文明施工费的承包人可催告发包人支付"
    },
    {
        "ANS": "ABDE",
        "Q": "以下关于安全文明措施费的说法正确的有",
        "TYPE": "多选题",
        "A": "发包人超过约定的支付时间不支付工程款经承包人同意后可延期支付",
        "B": "安全文明施工费包括的内容和使用范围应符合国家有关文件和计量规范的规定",
        "C": "发包人应在工程开工后的28天内预付不低于当年施工进度计划的安全文明施工费总额的70",
        "D": "安全文明施工费发包人在付款期满后的7天内仍未支付的若发生安全事故发包人应承担相应责任",
        "E": "发包人没有按时支付安全文明施工费的承包人可催告发包人支付"
    },
    {
        "ANS": "ABDE",
        "Q": "以下关于预付款的说法正确的有",
        "TYPE": "多选题",
        "A": "承包人应将预付款专用于合同工程",
        "B": "预付款应从每一个支付期应支付给承包人的工程进度款中扣回直到扣回的金额达到合同约定的预付款金额为止",
        "C": "发包人应在预付款扣完后的15天内将预付款保函退还给承包人",
        "D": "承包人应在签订合同或向发包人提供与预付款等额的预付款保函后向发包人提交预付款支付申请",
        "E": "承包人的预付款保函的担保金额根据预付款扣回的数额相应递减但在预付款全部扣回之前一直保持有效"
    },
    {
        "ANS": "ABDE",
        "Q": "以下关于预付款的说法正确的有",
        "TYPE": "多选题",
        "A": "承包人应将预付款专用于合同工程",
        "B": "预付款应从每一个支付期应支付给承包人的工程进度款中扣回直到扣回的金额达到合同约定的预付款金额为止",
        "C": "发包人应在预付款扣完后的15天内将预付款保函退还给承包人",
        "D": "承包人应在签订合同或向发包人提供与预付款等额的预付款保函后向发包人提交预付款支付申请",
        "E": "承包人的预付款保函的担保金额根据预付款扣回的数额相应递减但在预付款全部扣回之前一直保持有效"
    },
    {
        "ANS": "BDE",
        "Q": "以下关于预付款的说法正确的有",
        "TYPE": "多选题",
        "A": "施工现场围墙围护及场地硬地化粉尘控制噪音控制排水措施垃圾排放",
        "B": "预付款应从每一个支付期应支付给承包人的工程进度款中扣回直到扣回的金额达到合同约定的预付款金额为止",
        "C": "发包人应在预付款扣完后的15天内将预付款保函退还给承包人",
        "D": "承包人应在签订合同或向发包人提供与预付款等额的预付款保函后向发包人提交预付款支付申请",
        "E": "承包人的预付款保函的担保金额根据预付款扣回的数额相应递减但在预付款全部扣回之前一直保持有效"
    },
    {
        "ANS": "AB",
        "Q": "以下可以用m计量的是",
        "TYPE": "多选题",
        "A": "注浆地基",
        "B": "水泥粉煤灰碎石桩",
        "C": "地基的振冲密实",
        "D": "窗台板",
        "E": "褥垫层"
    },
    {
        "ANS": "C",
        "Q": "以下哪个品牌的母线槽不属于国际一线品牌出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "施耐德",
        "B": "西门子",
        "C": "伊顿",
        "D": "ABB"
    },
    {
        "ANS": "ABCDE",
        "Q": "以下哪个属于项目商务策划主要应对的风险",
        "TYPE": "多选题",
        "A": "策划预计效益不高",
        "B": "报价风险",
        "C": "合同风险",
        "D": "工期滞后风险",
        "E": "质量维修风险"
    },
    {
        "ANS": "D",
        "Q": "以下哪项不属于区域联采的目的",
        "TYPE": "单选题",
        "A": "集约采购",
        "B": "资源整合",
        "C": "价值创造",
        "D": "效益优先"
    },
    {
        "ANS": "D",
        "Q": "以下哪些不属于风机的构成出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "机壳",
        "B": "叶轮",
        "C": "机轴",
        "D": "减震器"
    },
    {
        "ANS": "ACDE",
        "Q": "以下哪些费用必须按国家或省级行业建设主管部门的规定计算不得作为竞争性费用",
        "TYPE": "多选题",
        "A": "安全施工费",
        "B": "企业管理费",
        "C": "文明施工费",
        "D": "规费",
        "E": "税金"
    },
    {
        "ANS": "ACDE",
        "Q": "以下哪些费用必须按国家或省级行业建设主管部门的规定计算不得作为竞争性费用",
        "TYPE": "多选题",
        "A": "安全施工费",
        "B": "企业管理费",
        "C": "文明施工费",
        "D": "规费",
        "E": "税金"
    },
    {
        "ANS": "AD",
        "Q": "以下哪些风险级别的项目为局重点督导项目",
        "TYPE": "多选题",
        "A": "Ⅰ类A级",
        "B": "Ⅱ类B级",
        "C": "Ⅰ类B级",
        "D": "Ⅱ类A级"
    },
    {
        "ANS": "ABCD",
        "Q": "以下哪些精神是三公司项目建设中形成的精神",
        "TYPE": "多选题",
        "A": "建港精神",
        "B": "大漠精神",
        "C": "南站精神",
        "D": "青奥精神",
        "E": "海南精神"
    },
    {
        "ANS": "ABCD",
        "Q": "以下哪些可以选择邀请招标出题来源采购管理部采购管理手册",
        "TYPE": "多选题",
        "A": "技术复杂或有特殊要求或受自然地域环境限制只有少量潜在的投标人可供选择的",
        "B": "涉及国家安全国家秘密或抢险救灾适宜招标但不宜公开招标的",
        "C": "对完成质量服务效果等有特殊要求分供方只能在特定范围内选择的",
        "D": "法律法规规定的不宜公开招标的",
        "E": "海外项目"
    },
    {
        "ANS": "AB",
        "Q": "以下哪些文件的编制与核对应由具有专业资格的工程造价人员承担",
        "TYPE": "多选题",
        "A": "招标控制价",
        "B": "投标报价",
        "C": "工程计量",
        "D": "签证变更",
        "E": "合同价款调整与结算"
    },
    {
        "ANS": "ABDE",
        "Q": "以下哪种情况可视为竣工结算办理完毕",
        "TYPE": "多选题",
        "A": "承包人可催告发包人支付",
        "B": "发包人在收到承包人竣工结算文件后的28天内不核对竣工结算或未提出核对意见的应视为承包人提交的竣工结算文件已被发包人认可",
        "C": "发包人委托工程造价咨询人核对工程竣工结算的工程造价咨询人在28天内核对完毕直接调整并出具审核报告",
        "D": "发包人委托的工程造价咨询人指派的专业人员与承包人指派的专业人员经核对后无异议并签名确认的竣工结算文件",
        "E": "承包人在收到发包人提出的核实意见后的28天内不确认也未提出异议的应视为发包人提出的核实意见已被承包人认可"
    },
    {
        "ANS": "ABDE",
        "Q": "以下哪种情况可视为竣工结算办理完毕",
        "TYPE": "多选题",
        "A": "发承包双方对竣工结算经核对复核结果无异议且均在复核8天内在竣工结算文件上签字确认",
        "B": "发包人在收到承包人竣工结算文件后的28天内不核对竣工结算或未提出核对意见的应视为承包人提交的竣工结算文件已被发包人认可",
        "C": "发包人委托工程造价咨询人核对工程竣工结算的工程造价咨询人在28天内核对完毕直接调整并出具审核报告",
        "D": "发包人委托的工程造价咨询人指派的专业人员与承包人指派的专业人员经核对后无异议并签名确认的竣工结算文件",
        "E": "承包人在收到发包人提出的核实意见后的28天内不确认也未提出异议的应视为发包人提出的核实意见已被承包人认可"
    },
    {
        "ANS": "D",
        "Q": "以下哪种情况可以对投标单位做废标处理出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "无因加价",
        "B": "IP重复",
        "C": "恶意低价",
        "D": "以上全部"
    },
    {
        "ANS": "A",
        "Q": "以下哪种情形不适用竞争性谈判出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "涉及国家安全和秘密的",
        "B": "用户紧急需要的",
        "C": "技术复杂或性质特殊的",
        "D": "不能确定具体要求的"
    },
    {
        "ANS": "D",
        "Q": "以下砌体不应按零星砌砖项目编码列项",
        "TYPE": "单选题",
        "A": "空斗墙的窗间墙",
        "B": "窗台下实砌部分",
        "C": "梁板下实砌部分",
        "D": "砖检查井"
    },
    {
        "ANS": "D",
        "Q": "以下砌体不应按零星砌砖项目编码列项",
        "TYPE": "单选题",
        "A": "空斗墙的窗间墙",
        "B": "窗台下实砌部分",
        "C": "梁板下实砌部分",
        "D": "砖检查井"
    },
    {
        "ANS": "A",
        "Q": "以下使用单一来源采购的情形是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "只能从唯一分供方处采购的如专利产品及地方垄断行业",
        "B": "必须保证原有采购项目一致性或服务配套的要求需要继续从原分供方处添购且添购资金总额不超过原合同金额20的",
        "C": "技术复杂或性质特殊不能确定详细规格或具体要求的",
        "D": "技术复杂或有特殊要求或受自然地域环境限制只有少量潜在的投标人可供选择的"
    },
    {
        "ANS": "C",
        "Q": "以下属于采购创效内容的是",
        "TYPE": "单选题",
        "A": "周转料具使用",
        "B": "分包模式转变",
        "C": "采购成本降低",
        "D": "发包方暂估价认质认价采购效益"
    },
    {
        "ANS": "D",
        "Q": "以下属于单一来源采购的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "非采购方原因导致采用公开或邀请招标所需时间不能满足项目建设进度或用户紧急需要的",
        "B": "对完成质量服务效果等有特殊要求分供方只能在特定范围内选择的",
        "C": "因抢工应急等所需零星物资单笔或单项采购金额5万元以内片区加工厂年度累计或单个项目累计采购总额不超过20万元的零星采购",
        "D": "因严重自然灾害不可预见的紧急情况涉及抢险救灾突发紧急事件和其他不可抗力事件所实施的紧急采购和涉及国家安全和秘密的"
    },
    {
        "ANS": "D",
        "Q": "以下属于单一来源采购的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "技术复杂或有特殊要求或者受自然地域环境限制只有少量潜在的投标人可供选择的",
        "B": "因抢工应急等所需零星物资单笔或单项采购金额5万元以内片区加工厂年度累计或单个项目累计采购总额不超过20万元的零星采购",
        "C": "招标后没有分供方投标或者没有合格标的或者重新招标未能成立的",
        "D": "只能从唯一分供方处采购的如专利产品及地方垄断行业"
    },
    {
        "ANS": "B",
        "Q": "以下属于单一来源采购的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "因抢工应急等所需零星物资单笔或单项采购金额5万元以内片区加工厂年度累计或单个项目累计采购总额不超过20万元的零星采购",
        "B": "必须保证原有采购项目一致性或服务配套的要求需要继续从原分供方处添购且添购资金总额不超过原合同金额10的",
        "C": "涉及国家安全国家秘密或者抢险救灾适宜招标但不宜公开招标的",
        "D": "技术复杂或者性质特殊不能确定详细规格或者具体要求的"
    },
    {
        "ANS": "D",
        "Q": "以下属于竞争性谈判的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "必须保证原有采购项目一致性或服务配套的要求需要继续从原分供方处添购且添购资金总额不超过原合同金额10的",
        "B": "原属于签约合同中的暂估价部分建设单位业主通过另行招标确定的指定分包平行发包中标单位或根据书面变更文件明确系建设单位指令列入我方工程总承包管理范围的",
        "C": "涉及国家安全国家秘密或者抢险救灾适宜招标但不宜公开招标的",
        "D": "技术复杂或者性质特殊不能确定详细规格或者具体要求的"
    },
    {
        "ANS": "C",
        "Q": "以下属于竞争性谈判的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "对完成质量服务效果等有特殊要求分供方只能在特定范围内选择的",
        "B": "因严重自然灾害不可预见的紧急情况涉及抢险救灾突发紧急事件和其他不可抗力事件所实施的紧急采购和涉及国家安全和秘密的",
        "C": "非采购方原因导致采用公开或邀请招标所需时间不能满足项目建设进度或用户紧急需要的",
        "D": "原属于签约合同中的暂估价部分建设单位业主通过另行招标确定的指定分包平行发包中标单位或根据书面变更文件明确系建设单位指令列入我方工程总承包管理范围的"
    },
    {
        "ANS": "A",
        "Q": "以下属于竞争性谈判的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "招标后没有分供方投标或者没有合格标的或者重新招标未能成立的",
        "B": "只能从唯一分供方处采购的如专利产品及地方垄断行业",
        "C": "原属于签约合同中的暂估价部分建设单位业主通过另行招标确定的指定分包平行发包中标单位或根据书面变更文件明确系建设单位指令列入我方工程总承包管理范围的",
        "D": "技术复杂或有特殊要求或者受自然地域环境限制只有少量潜在的投标人可供选择的"
    },
    {
        "ANS": "B",
        "Q": "以下属于模式创新创效内容的是出题来源采购管理部中建八局采购管理价值创造能力提升实施方案",
        "TYPE": "单选题",
        "A": "周转料具使用",
        "B": "分包模式转变",
        "C": "采购成本降低",
        "D": "发包方暂估价认质认价采购效益"
    },
    {
        "ANS": "ACDE",
        "Q": "以下属于围标串标行为的是",
        "TYPE": "多选题",
        "A": "线下未招标先确定中标单位同一业务类别中存在多家关联单位轮流中标垄断某项业务",
        "B": "设置不合理定制化的供方入围条件",
        "C": "明示或者暗示投标人压低或者抬高投标报价授意投标单位撤换修改投标文件",
        "D": "直接或者间接向投标单位泄露标底评标小组成员等信息",
        "E": "明示或者暗示投标人为特定投标单位中标提供方便"
    },
    {
        "ANS": "A",
        "Q": "以下属于虚假招标无效招标行为的是出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "伪造投标报价单中标单位的工商登记信息完全不存在中标单位不具备业务承揽资质",
        "B": "线下确定中标单位线上走流程",
        "C": "拟中标数量3时有效投标数量大于N3家",
        "D": "资审结果不符合招标公告要求未按要求上传资审结果附件"
    },
    {
        "ANS": "B",
        "Q": "以下属于邀请招标的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "根据总承包合同约定或业主出具有效文件说明需加盖业主公章建设单位明确约定分供方的情形",
        "B": "对完成质量服务效果等有特殊要求分供方只能在特定范围内选择的",
        "C": "非采购方原因导致采用公开或邀请招标所需时间不能满足项目建设进度或用户紧急需要的",
        "D": "因严重自然灾害不可预见的紧急情况涉及抢险救灾突发紧急事件和其他不可抗力事件所实施的紧急采购和涉及国家安全和秘密的"
    },
    {
        "ANS": "C",
        "Q": "以下属于邀请招标的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "技术复杂或者性质特殊不能确定详细规格或者具体要求的",
        "B": "必须保证原有采购项目一致性或服务配套的要求需要继续从原分供方处添购且添购资金总额不超过原合同金额10的",
        "C": "涉及国家安全国家秘密或者抢险救灾适宜招标但不宜公开招标的",
        "D": "根据总承包合同约定或业主出具有效文件说明需加盖业主公章建设单位明确约定分供方的情形"
    },
    {
        "ANS": "C",
        "Q": "以下属于邀请招标的是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "招标后没有分供方投标或者没有合格标的或者重新招标未能成立的",
        "B": "只能从唯一分供方处采购的如专利产品及地方垄断行业",
        "C": "技术复杂或有特殊要求或者受自然地域环境限制只有少量潜在的投标人可供选择的",
        "D": "根据总承包合同约定或业主出具有效文件说明需加盖业主公章建设单位明确约定分供方的情形"
    },
    {
        "ANS": "A",
        "Q": "以下说法不正确的有",
        "TYPE": "单选题",
        "A": "工程量计算规范的工程量计算规则主要用于计算工程量和组价",
        "B": "消耗量定额的工程量计算规则主要用于工程计算价格",
        "C": "消耗量定额项目划分一般是基于施工工序进行设置的体现施工单元",
        "D": "清单规范的项目划分一般是基于综合实体进行设置的体现功能单元"
    },
    {
        "ANS": "D",
        "Q": "以下说法不正确的有",
        "TYPE": "单选题",
        "A": "全预制装配式结构通常采用柔性连接技术",
        "B": "全预制装配式结构的恢复性能好",
        "C": "预制装配整体式结构通常采用强连接节点",
        "D": "全预制装配式结构能够达到与现浇混凝土现浇结构相同或相近的抗震能力"
    },
    {
        "ANS": "ACD",
        "Q": "以下说法正确的是",
        "TYPE": "多选题",
        "A": "装饰板墙面按设计图示墙净长乘以净高以面积计算扣除门窗洞口及03以上的孔洞所占面积",
        "B": "装饰板柱梁面按设计图示外围饰面尺寸乘以高度以平方米计算扣除03以上的孔洞所占面积",
        "C": "浴厕隔断门的材质相同者其门的面积不扣除并入隔断内计算",
        "D": "隔断按设计图示尺寸以框外围面积计算扣除03以上的孔洞所占面积",
        "E": "柱帽柱墩工程量并入相应板面积内计算"
    },
    {
        "ANS": "AC",
        "Q": "以下说法正确的是",
        "TYPE": "多选题",
        "A": "带反挑檐的预制的挑檐板遮阳板等应按带肋板项目编码列项",
        "B": "预制管沟沟盖板按照米计量",
        "C": "成品金属雨棚可以用延长米计量",
        "D": "成品金属雨棚可以用水平投影面积计量",
        "E": "楼梯侧面的抹灰不单独计算在综合单价中考虑"
    },
    {
        "ANS": "D",
        "Q": "以下说法正确的有",
        "TYPE": "单选题",
        "A": "措施项目中挑脚手架按照延长米计量或者服务面积计量",
        "B": "混凝土钢模板及支撑按照面积计量或者按T计量",
        "C": "现浇混凝土模板中除门窗洞口外不扣除其他预留孔洞",
        "D": "某多层建筑5层的高度32m不计算超高施工增加费"
    },
    {
        "ANS": "D",
        "Q": "以下说法中错误的有",
        "TYPE": "单选题",
        "A": "定额与市场经济的共融性是与生俱来的",
        "B": "定额有利于建筑市场公平竞争",
        "C": "定额是对市场行为的规范",
        "D": "定额是计划经济的产物随着市场经济体制的建立定额将逐渐走向消亡"
    },
    {
        "ANS": "BE",
        "Q": "以下说明是正确的",
        "TYPE": "多选题",
        "A": "凡图示的槽底宽在m以内且槽长大于槽宽倍以上的为沟槽",
        "B": "凡图示基坑底面积在20m2以内的为基坑",
        "C": "凡图示沟槽底宽在米以外基坑底面积在20m2以外的按挖土方计算",
        "D": "挖土一律以天然地面标高为准计算",
        "E": "平整场地工程量按建筑物外墙外边线每边各加米以平方米计算"
    },
    {
        "ANS": "BE",
        "Q": "以下说明是正确的",
        "TYPE": "多选题",
        "A": "凡图示的槽底宽在m以内且槽长大于槽宽倍以上的为沟槽",
        "B": "凡图示基坑底面积在20m2以内的为基坑",
        "C": "凡图示沟槽底宽在米以外基坑底面积在20m2以外的投挖土方计算",
        "D": "挖土一律以天然地面标高为准计算",
        "E": "平整场地工程量按建筑物外墙外边线每边各加米以平方米计算"
    },
    {
        "ANS": "ABCD",
        "Q": "以下行为可做废标处理的有",
        "TYPE": "多选题",
        "A": "无因加价",
        "B": "大幅降价",
        "C": "恶意低价",
        "D": "不平衡报价",
        "E": "算术性错误"
    },
    {
        "ANS": "BCE",
        "Q": "以下有关门窗工程量计算错误的是",
        "TYPE": "多选题",
        "A": "纱窗扇按扇外围面积计算",
        "B": "门窗贴脸门窗筒子板按设计长度以m计算",
        "C": "卷闸门按洞口高度增加m乘以门洞宽度以m计算",
        "D": "卷帘门电动装置安装以套计算活动小门以个计算",
        "E": "无框玻璃门按门扇计算"
    },
    {
        "ANS": "ACD",
        "Q": "以下正确的是",
        "TYPE": "多选题",
        "A": "门窗油漆计量单位为樘",
        "B": "金属面油漆计量单位为",
        "C": "木扶手油漆计量单位为m",
        "D": "栏杆刷乳胶漆计量单位为",
        "E": "栏杆刷乳胶漆计量单位为t"
    },
    {
        "ANS": "ABC",
        "Q": "以项目成本管理为核心围绕三点一控结合技术生产采购等环节制定开源节流化解风险的整体策划实施方案确定策划整体目标三点一控包括",
        "TYPE": "多选题",
        "A": "低效无效成本",
        "B": "盈利点",
        "C": "亏损点",
        "D": "策划点"
    },
    {
        "ANS": "C",
        "Q": "以项目实现履约为前提依据项目标准成本经过二级单位和项目部协商一致确定的由项目部控制的成本总额这是哪一种成本",
        "TYPE": "单选题",
        "A": "标准成本",
        "B": "计划成本",
        "C": "责任成本",
        "D": "预留风险金"
    },
    {
        "ANS": "A",
        "Q": "以招标公告的方式邀请不特定的法人或其他组织参与投标的采购方式是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "公开招标",
        "B": "邀请招标",
        "C": "竞争性谈判",
        "D": "单一来源采购"
    },
    {
        "ANS": "A",
        "Q": "因变更引起工期变化的合同当事人均可要求调整合同工期",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "因不可抗力事件导致的人员伤亡财产损失及其费用增加应由承担",
        "TYPE": "单选题",
        "A": "发包人",
        "B": "承包人",
        "C": "发承包双方分别",
        "D": "保险公司"
    },
    {
        "ANS": "ADE",
        "Q": "因不可抗力事件导致的人员伤亡财产损失及其费用增加应由发包人承担的有哪些",
        "TYPE": "多选题",
        "A": "合同工程本身的损害",
        "B": "承包人人员伤亡",
        "C": "承包人的施工机械设备损坏及停工损失",
        "D": "承包人应发包人要求留在现场的必要的管理人员及保卫人员的费用",
        "E": "运至施工场地用于施工的材料和待安装的设备的损害"
    },
    {
        "ANS": "B",
        "Q": "因承包人违约解除合同的发包人应在合同解除后天内核实合同解除时承包人已完成的全部工程款以及已运至现场的材料和工程设备货款",
        "TYPE": "单选题",
        "A": "14",
        "B": "28",
        "C": "30",
        "D": "60"
    },
    {
        "ANS": "A",
        "Q": "因发包人违约解除合同的承包人向承包人提出由于解除合同而引起的损失或损害的款项后发包人应在核实后与承包人协商确定后的天内向承包人签发支付证书",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "21",
        "D": "28"
    },
    {
        "ANS": "A",
        "Q": "应将合规管理要求合规禁止清单纳入各级审计巡视巡察对违规事项进行专项梳理排查",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "营改增后的一般计税法下市政工程中三类桥梁工程的企业管理费取费标准为",
        "TYPE": "单选题",
        "A": "29",
        "B": "27",
        "C": "28",
        "D": "32"
    },
    {
        "ANS": "C",
        "Q": "营改增后的一般计税法下市政工程中一类道路工程的企业管理费取费标准为",
        "TYPE": "单选题",
        "A": "23",
        "B": "25",
        "C": "26",
        "D": "20"
    },
    {
        "ANS": "A",
        "Q": "营收确权率不含税指与营业收入的比值",
        "TYPE": "单选题",
        "A": "发包人确权产值",
        "B": "自建施工产值",
        "C": "实际成本",
        "D": "合同施工产值"
    },
    {
        "ANS": "A",
        "Q": "营收确权率",
        "TYPE": "单选题",
        "A": "营收确权率业主确认产值营业收入",
        "B": "营收确权率实际产值营业收入",
        "C": "营收确权率业主确认产值实际收入",
        "D": "营收确权率施工图预算产值营业收入"
    },
    {
        "ANS": "C",
        "Q": "硬质绝热制品金属保护层纵缝在不损坏里面制品及防潮层的前提下可进行",
        "TYPE": "单选题",
        "A": "插接",
        "B": "搭接",
        "C": "咬接",
        "D": "钢带捆扎"
    },
    {
        "ANS": "A",
        "Q": "用于混凝土抹灰砂浆贴200300瓷砖墙面灰缝宽5mm假设瓷砖损耗率为8则100m2瓷砖墙面的瓷砖损耗是m2",
        "TYPE": "单选题",
        "A": "1036",
        "B": "1043",
        "C": "108",
        "D": "1087"
    },
    {
        "ANS": "B",
        "Q": "用于剪力墙分布钢筋的拉结筋构造中弯钩平直段的长度为",
        "TYPE": "单选题",
        "A": "15d",
        "B": "5d",
        "C": "119d",
        "D": "max10d75"
    },
    {
        "ANS": "D",
        "Q": "优化供方管理体系秉持的管理要求分级分类严选严控出题来源采购管理部局采购管理手册",
        "TYPE": "单选题",
        "A": "入库严考察",
        "B": "过程全督导",
        "C": "结果强考评",
        "D": "以上全是"
    },
    {
        "ANS": "B",
        "Q": "优先使用支付中小企业账款不得违规开具个月以上的票据",
        "TYPE": "单选题",
        "A": "现金3",
        "B": "现金6",
        "C": "供应链金融3",
        "D": "供应链金融6"
    },
    {
        "ANS": "ABC",
        "Q": "由二级单位牵头开组织商务策划会的项目分别是",
        "TYPE": "多选题",
        "A": "自施合同额10亿元以上",
        "B": "专业工程自施合同额5000万元以上",
        "C": "存在成本效益重大风险的项目",
        "D": "自施合同额5亿以上"
    },
    {
        "ANS": "BCD",
        "Q": "由聚氯乙烯塑料与低碳钢板复合而成的塑料钢复合材料除能够耐酸碱油等侵蚀外还具有的性能包括",
        "TYPE": "多选题",
        "A": "塑料与钢材之间剥离强度大于200MPa",
        "B": "深冲加工时不剥离冷弯120不分离开裂",
        "C": "绝缘性能和耐磨性能良好",
        "D": "具有低碳钢的冷加工性能"
    },
    {
        "ANS": "A",
        "Q": "由于采购计划安排不合理导致集采供给无法满足经营生产需要影响工期进展是采购管理主要应对的集中采购风险出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "市场调研论证分析不足",
        "B": "领导意志",
        "C": "付款不及时",
        "D": "制度不完善分级授权不明确"
    },
    {
        "ANS": "ABDE",
        "Q": "由于不可抗力致使合同无法履行解除合同的发包人应承担哪些费用",
        "TYPE": "多选题",
        "A": "由发包人承担的费用",
        "B": "已实施或部分实施的措施项目应付价款",
        "C": "承包人因不可抗力造成的损失",
        "D": "承包人撤离现场所需的合理费用包括员工遣送费和临时工程拆除施工设备运离现场的费用",
        "E": "承包人为完成合同工程而预期开支的任何合理费用且该项费用未包括在本款其他各项支付之内"
    },
    {
        "ANS": "ABDE",
        "Q": "由于不可抗力致使合同无法履行解除合同的发包人应承担哪些费用",
        "TYPE": "多选题",
        "A": "与鉴定项目相关的合同协议及其附件",
        "B": "已实施或部分实施的措施项目应付价款",
        "C": "承包人因不可抗力造成的损失",
        "D": "承包人撤离现场所需的合理费用包括员工遣送费和临时工程拆除施工设备运离现场的费用",
        "E": "承包人为完成合同工程而预期开支的任何合理费用且该项费用未包括在本款其他各项支付之内"
    },
    {
        "ANS": "B",
        "Q": "由于承包人使用机械设备施工技术以及组织管理水平等自身原因造成施工费用增加的应由发包人全部承担",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "由于代理型合同是建设单位与分包单位直接签订因此采用的合同形式",
        "TYPE": "单选题",
        "A": "固定单价",
        "B": "可调总价",
        "C": "GMP加酬金",
        "D": "简单的成本加酬金"
    },
    {
        "ANS": "D",
        "Q": "由于施工过程受到严重干扰造成多个索赔事件混杂在一起时可用计算索赔费用",
        "TYPE": "单选题",
        "A": "实物法",
        "B": "单价法",
        "C": "分项法",
        "D": "总费用法"
    },
    {
        "ANS": "B",
        "Q": "由于市场物价波动影响合同价款的风险应由承包人承担",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AD",
        "Q": "由于下列因素出现影响合同价款调整的应由发包人承担的有",
        "TYPE": "多选题",
        "A": "国家法律法规规章和政策发生变化",
        "B": "省级或行业建设主管部门发布的人工费调整但承包人对人工费或人工单价的报价高于发布价格",
        "C": "由于承包人原因造成施工费用增加",
        "D": "由政府定价或政府指导价管理的原材料等价格进行了调整",
        "E": "由于市场物价波动引起材料价格调整"
    },
    {
        "ANS": "C",
        "Q": "由于招标工程量清单中措施项目缺项承包人应将新增措施项目实施方案提交发包人批准后按照工程变更事件中的有关规定调整合同价款调整的原则表述正确的是",
        "TYPE": "单选题",
        "A": "单价措施项目费已标价清单中有类似项目的直接采用该单价",
        "B": "单价措施项目费已标价清单中有适用项目的参照适用项目调整",
        "C": "单价措施项目费已标价清单中没有适用也没有类似项目的承包人提出变更单价报发包人确认后调整",
        "D": "总价措施项目费按照实际发生变化的措施项目调整但应考虑承包人报价浮动因素"
    },
    {
        "ANS": "B",
        "Q": "有地下室的满堂基础其基础与墙体的分界线为地下室地面",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "有吊顶天棚抹灰高度算至",
        "TYPE": "单选题",
        "A": "天棚底",
        "B": "梁底",
        "C": "板底",
        "D": "根据情况"
    },
    {
        "ANS": "AD",
        "Q": "有防锈要求的脱脂件经脱脂处理后宜采用的封存方式为",
        "TYPE": "多选题",
        "A": "充氮气封存",
        "B": "充空气封存",
        "C": "充满水封存",
        "D": "气相防锈纸封存"
    },
    {
        "ANS": "CD",
        "Q": "有梁板遇剪力墙构造包含节点",
        "TYPE": "多选题",
        "A": "有梁板遇暗梁节点",
        "B": "有梁板遇连梁节点",
        "C": "有梁板遇剪力墙顶部节点",
        "D": "有梁板遇剪力墙中间节点"
    },
    {
        "ANS": "B",
        "Q": "有频繁开关灯要求和需要调光的室内场所宜优先选用作为主要照明光源",
        "TYPE": "单选题",
        "A": "高压汞灯",
        "B": "LED",
        "C": "卤钨灯",
        "D": "荧光灯"
    },
    {
        "ANS": "ACD",
        "Q": "与射线探伤相比X射线探伤的特点有",
        "TYPE": "多选题",
        "A": "显示缺陷的灵敏度高",
        "B": "穿透力较线强",
        "C": "照射时间短速度快",
        "D": "设备复杂笨重成本高"
    },
    {
        "ANS": "ABD",
        "Q": "与衬铅设备相比搪铅设备使用的不同点有",
        "TYPE": "多选题",
        "A": "传热性能好",
        "B": "适用于负压情况",
        "C": "适用于立面",
        "D": "用于回转运动和振动下工作"
    },
    {
        "ANS": "B",
        "Q": "与合同有关的通知批准证明证书指示指令要求请求同意意见确定和决定等可以采用书面或者口头形式在合同约定的期限内送达接收人和送达地点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "与普通材料相比复合材料具有许多特性具体表现在",
        "TYPE": "多选题",
        "A": "耐疲劳性高",
        "B": "抗断裂能力强",
        "C": "高温性能好",
        "D": "耐腐蚀性差"
    },
    {
        "ANS": "ACD",
        "Q": "与其他工程总承包方式相比较交钥匙总承包的优越性有",
        "TYPE": "多选题",
        "A": "有利于满足业主特殊要求",
        "B": "有利于降低总承包承担的风险",
        "C": "有利于调动总包商积极性",
        "D": "有利于简化业主与承包商之间的关系",
        "E": "有利于加大业主的介入程度"
    },
    {
        "ANS": "AC",
        "Q": "与铁素体型不锈钢相比马氏体型不锈钢具有的特点有",
        "TYPE": "多选题",
        "A": "具有较高的强度硬度和耐磨性",
        "B": "用于强腐蚀性介质环境中",
        "C": "可作为受力较大的零件和工具的制作材料",
        "D": "一般用作焊接件"
    },
    {
        "ANS": "B",
        "Q": "雨篷阳台计量不正确的是",
        "TYPE": "单选题",
        "A": "按设计图示尺寸以外墙外边线以外部分的体积计算",
        "B": "伸出墙外的牛腿和雨篷反挑檐不计算",
        "C": "伸出墙外的牛腿合并在体积内计算",
        "D": "伸出墙外的雨篷反挑檐合并在体积内计算"
    },
    {
        "ANS": "AC",
        "Q": "雨篷建筑面积按下列规定计算",
        "TYPE": "多选题",
        "A": "有柱雨蓬按柱外围水平面积计算",
        "B": "独立柱的雨蓬按顶盖水平投影面积计算",
        "C": "独立柱的雨蓬按顶盖水平投影面积一半计算",
        "D": "无柱的雨蓬按顶盖水平投影面积计算"
    },
    {
        "ANS": "A",
        "Q": "预计总成本累计实际发生的合同成本尚需发生的合同成本",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "预计总成本指为完成项目预计要发生的全部耗费由项目累计发生实际成本和项目尚需发生的预计成本组成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "预计总收入初始预计合同总收入合同变更索赔收入",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "预计总收入初始预计合同总收入合同变更索赔收入奖励收入",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "预计总收入指预计完成全部项目可从工程发包方收回的全部价款由组成",
        "TYPE": "多选题",
        "A": "初始预计总收入",
        "B": "合同变更",
        "C": "索赔收入",
        "D": "奖励收入等内容组成"
    },
    {
        "ANS": "B",
        "Q": "预结算管理办法2022版的管理原则是注重时效梳理归纳业务归口精心策划",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "预结算管理办法2022版中建议期中结算分土桩基四大块地下室封顶主体封顶二次结构完成专业工程等几个阶段并对每个阶段完成时间进行约定",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "预结算管理的管理原则是",
        "TYPE": "多选题",
        "A": "注重时效",
        "B": "精心策划",
        "C": "业务归口",
        "D": "分级管理"
    },
    {
        "ANS": "B",
        "Q": "预留金是指投标人为可能发生的工程量变更而预留的金额",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "预算编制依据施工合同图纸施工组织设计方案等确定编制方法计划编制施工图预算收到施工图纸天内合同有约定从约定大型项目分阶段编制",
        "TYPE": "单选题",
        "A": "60",
        "B": "70",
        "C": "80",
        "D": "90"
    },
    {
        "ANS": "A",
        "Q": "预算定额是按社会平均水平编制的",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "原则上项目策划效益额项目目标管理责任书约定上缴效益额的",
        "TYPE": "单选题",
        "A": "1",
        "B": "15",
        "C": "2",
        "D": "25"
    },
    {
        "ANS": "C",
        "Q": "原则上项目策划效益额应不小于项目上缴效益额的几倍",
        "TYPE": "单选题",
        "A": "11",
        "B": "12",
        "C": "15",
        "D": "2"
    },
    {
        "ANS": "B",
        "Q": "云筑网招标密钥文件及口令丢失后不可以重新设置出题来源采购管理部采购全链条指导手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "云筑网招标任务概算金额填写的是不含税概算出题来源采购管理部采购全链条指导手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "云筑网招标任务概算金额填写的是含税概算出题来源采购管理部采购全链条指导手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "云筑网招标在需要发布评标参考价出题来源采购管理部商务管理手册",
        "TYPE": "单选题",
        "A": "开标前",
        "B": "调价前",
        "C": "约标前",
        "D": "末轮回标后"
    },
    {
        "ANS": "C",
        "Q": "在16G平法中下列关于嵌固部位的注写说法错误的是",
        "TYPE": "单选题",
        "A": "在基础顶面时无需注明",
        "B": "不在基础顶面时在层高表嵌固部位标高下使用双细线注明",
        "C": "不在基础顶面时在层高表嵌固部位标高下使用双虚线注明",
        "D": "可在层高表地下室顶板标高下使用双虚线注明"
    },
    {
        "ANS": "B",
        "Q": "在保修责任期终止后的天内发包人应将剩余的质量保证金返还给承包人剩余质量保证金的返还",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "21",
        "D": "28"
    },
    {
        "ANS": "D",
        "Q": "在北京国家大剧院召开的中国建筑工程鲁班奖创立20周年纪念大会上公司荣获",
        "TYPE": "单选题",
        "A": "东方杯",
        "B": "长城杯",
        "C": "飞天奖",
        "D": "创鲁班奖工程特别荣誉企业"
    },
    {
        "ANS": "A",
        "Q": "在本单位第一次合作的主体二次结构劳务分包必须考察出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BC",
        "Q": "在编制单位建筑工程施工图预算时一般应计入综合取定的措施项目费的有",
        "TYPE": "多选题",
        "A": "施工降水费",
        "B": "冬雨季施工增加费",
        "C": "夜间施工增加费",
        "D": "模板费用",
        "E": "脚手架费用"
    },
    {
        "ANS": "A",
        "Q": "在编制工程量清单和工程量清单计价时应按照建设工程工程量清单计价规范规定的统一格式",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "BCD",
        "Q": "在采购模式这一管理环节容易造成无效成本产生的原因有哪些",
        "TYPE": "多选题",
        "A": "相应分部分项利润减少不利于专业化人才培养无资质施工质量差返工",
        "B": "分包模式设置不合理标段划分不合理计划性不足招标受外部因素影响",
        "C": "以租代买租赁标的物租赁时间过长导致租赁费超租赁物本身价值",
        "D": "未经论证盲目采用收取管理费等分包模式材料采购效益流失"
    },
    {
        "ANS": "A",
        "Q": "在地下工程选址时考虑较多的地质问题为",
        "TYPE": "单选题",
        "A": "区域稳定性",
        "B": "边坡稳定性",
        "C": "泥石流",
        "D": "斜坡滑动"
    },
    {
        "ANS": "ABD",
        "Q": "在电气照明配管配线工程中可明配的管道有",
        "TYPE": "多选题",
        "A": "焊接钢管",
        "B": "硬质聚氯乙烯管",
        "C": "半硬质阻燃管",
        "D": "电线管"
    },
    {
        "ANS": "C",
        "Q": "在冻土厚度为03m的地区城市配水管网埋地铺设于车行道下时覆土厚度不小于",
        "TYPE": "单选题",
        "A": "05m",
        "B": "06m",
        "C": "07m",
        "D": "10m"
    },
    {
        "ANS": "ABC",
        "Q": "在对建筑物工程量计算时通常计算基数所指的三线一面中三线指的是",
        "TYPE": "多选题",
        "A": "外墙中心线",
        "B": "外墙外边线",
        "C": "内墙净长线",
        "D": "轴线",
        "E": "结构断面尺寸"
    },
    {
        "ANS": "C",
        "Q": "在发承包双方没有认可的其他期限时调解人应在收到调解委托后天内提出调解决定",
        "TYPE": "单选题",
        "A": "7",
        "B": "14",
        "C": "28",
        "D": "30"
    },
    {
        "ANS": "A",
        "Q": "在复合材料分类中属于无机非金属材料基复合材料的是",
        "TYPE": "单选题",
        "A": "水泥基复合材料",
        "B": "铝基复合材料",
        "C": "木质基复合材料",
        "D": "高分子基复合材料"
    },
    {
        "ANS": "AB",
        "Q": "在工程计量中对内计量完成后按比例为专业单位办理支付手续的主责部门是哪些",
        "TYPE": "多选题",
        "A": "项目商务经理",
        "B": "项目经理",
        "C": "二级单位商务法务部",
        "D": "项目总工"
    },
    {
        "ANS": "A",
        "Q": "在工程量清单中最能体现分部分项工程项目自身价值的本质的是",
        "TYPE": "单选题",
        "A": "项目特征",
        "B": "项目编码",
        "C": "项目名称",
        "D": "项目计量单位"
    },
    {
        "ANS": "B",
        "Q": "在工人工作时间的分类中属于损失时间但应当在定额时间中予以合理考虑的是",
        "TYPE": "单选题",
        "A": "多余工作时间",
        "B": "偶然工作时间",
        "C": "停工时间",
        "D": "休息时间"
    },
    {
        "ANS": "BDE",
        "Q": "在购置设备费的构成内容中不含有",
        "TYPE": "多选题",
        "A": "设备运输包装费",
        "B": "设备安装保险费",
        "C": "设备检验费",
        "D": "设备采购招标费",
        "E": "设备联合试运转费"
    },
    {
        "ANS": "B",
        "Q": "在关于投标的禁止性规定中招标人明示或者暗示投标人为特定投标人中标提供方便属于",
        "TYPE": "单选题",
        "A": "投标人相互串通投标",
        "B": "招标人与投标人串通投标",
        "C": "投标人以行贿手段谋取中标",
        "D": "投标人以非法手段骗取中标"
    },
    {
        "ANS": "B",
        "Q": "在管道上主要用于切断分配和改变介质流动方向设计成V形开口时具有良好的流量调节功能易实现快速启闭且维修方便不仅适用于一般工作介质还适用于含纤维微小固体颗料等介质该阀门为",
        "TYPE": "单选题",
        "A": "疏水阀",
        "B": "球阀",
        "C": "旋塞阀",
        "D": "蝶阀"
    },
    {
        "ANS": "B",
        "Q": "在合同订立及履行过程中形成的与合同有关的文件不是合同文件组成部分",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ACD",
        "Q": "在火焰切割当中氧氢火焰切割的优点有",
        "TYPE": "多选题",
        "A": "燃气费用仅为乙炔的20丙烷的3040",
        "B": "氢气制取容易成本低廉易于液化和灌装",
        "C": "气体压力较低管理要求低",
        "D": "生产过程无污染"
    },
    {
        "ANS": "B",
        "Q": "在基础内的第一根柱箍筋到基础顶面的距离是多少",
        "TYPE": "单选题",
        "A": "50",
        "B": "100",
        "C": "3dd为箍筋直径",
        "D": "5dd为箍筋直径"
    },
    {
        "ANS": "C",
        "Q": "在集团清理拖欠账款专项行动中清欠工作覆盖所有下游款项要逐级宣贯传达到层级解决上热中温下冷问题",
        "TYPE": "单选题",
        "A": "集团二级单位",
        "B": "集团三级单位",
        "C": "项目部"
    },
    {
        "ANS": "C",
        "Q": "在计算赶工费用时下列各项中不属于材料费增加内容的是",
        "TYPE": "单选题",
        "A": "不经济使用材料而损耗过大",
        "B": "材料提前交货可能增加的费用",
        "C": "新增加投人的材料用量",
        "D": "材料运输费的增加"
    },
    {
        "ANS": "D",
        "Q": "在计算砌筑墙体工程量时",
        "TYPE": "单选题",
        "A": "不扣除门洞口所占的体积",
        "B": "不扣除窗洞口所占的体积",
        "C": "不扣除嵌入墙身的钢筋混凝土柱梁所占的体积",
        "D": "不扣除墙内的加固钢筋所占体积"
    },
    {
        "ANS": "A",
        "Q": "在既定的市场环境下根据企业管理水平和管理特点按企业费用支出标准资源市场价格信息和工程实际情况测算的项目各项费用支出总额这属于哪一种成本",
        "TYPE": "单选题",
        "A": "标准成本",
        "B": "责任成本",
        "C": "计划成本",
        "D": "预留风险金"
    },
    {
        "ANS": "B",
        "Q": "在价值工程的工作中是分析阶段应做的工作为",
        "TYPE": "单选题",
        "A": "对象的选择和功能分析",
        "B": "功能定义和功能整理",
        "C": "功能整理和方案评价",
        "D": "方案创造和成果评价"
    },
    {
        "ANS": "D",
        "Q": "在冷轧带肋钢筋中既可作为普通混凝土用钢也可作为预应力钢筋混凝土用钢的是",
        "TYPE": "单选题",
        "A": "CRB550",
        "B": "CRB600H",
        "C": "CRB650",
        "D": "CRB680H"
    },
    {
        "ANS": "A",
        "Q": "在梁的标注中下列是竖向加腋截面注写的是",
        "TYPE": "单选题",
        "A": "300700Y500250",
        "B": "300700PY500250",
        "C": "300700GY500250",
        "D": "300700JY500250"
    },
    {
        "ANS": "DE",
        "Q": "在楼地面面层清单工程量计算中对门洞空圈等开口部分并入计算的有",
        "TYPE": "多选题",
        "A": "水泥砂浆面层",
        "B": "细石砼面层",
        "C": "水磨石面层",
        "D": "硬木地板",
        "E": "塑料卷材面层"
    },
    {
        "ANS": "D",
        "Q": "在楼地面面层清单工程量计算中对门洞空圈等开口部分并入计算的有",
        "TYPE": "单选题",
        "A": "水泥砂浆面层",
        "B": "细石砼面层",
        "C": "水磨石面层",
        "D": "硬木地板"
    },
    {
        "ANS": "AC",
        "Q": "在楼地面面层工程量计算中对门洞空圈等开口部分不计算的有",
        "TYPE": "多选题",
        "A": "水泥砂浆面层",
        "B": "快料面层",
        "C": "水磨石面层",
        "D": "硬木地板",
        "E": "复合地板"
    },
    {
        "ANS": "BCD",
        "Q": "在满足建筑物使用要求的前提下关于设计阶段影响工程造价的因素下列说法正确的有",
        "TYPE": "多选题",
        "A": "流通空间越大工业建筑物越经济",
        "B": "建筑层高越高工程造价越高",
        "C": "对于单跨厂房当柱间距不变时跨度越大单位面积造价越低",
        "D": "对于多跨厂房当跨度不变时中跨数目越多单位面积造价越低",
        "E": "住宅层数越多单位面积造价越低"
    },
    {
        "ANS": "C",
        "Q": "在民用建设中一所医院中的住院大楼是一个",
        "TYPE": "单选题",
        "A": "建设项目",
        "B": "单项工程",
        "C": "单位工程",
        "D": "分项工程"
    },
    {
        "ANS": "D",
        "Q": "在评价一个投资方案的经济效果时利息备付率属于指标",
        "TYPE": "单选题",
        "A": "抗风险能力",
        "B": "财务生存能力",
        "C": "盈利能力",
        "D": "偿债能力"
    },
    {
        "ANS": "A",
        "Q": "在设计完成后项目部人员就应推进认质认价工作出题来源采购管理部项目采购策划管理指引",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "在室内排水系统中排水立管安装后应做",
        "TYPE": "单选题",
        "A": "通球试验",
        "B": "高压水清洗",
        "C": "水压试验",
        "D": "化学清洗"
    },
    {
        "ANS": "B",
        "Q": "在收到支付申请的7天内经行核对向承包人发出预付款支付证书并在签发支付证书后的14天内向承包人支付预付款",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AD",
        "Q": "在项目签证索赔管理中以下哪位负责人有责任发起提出签证索赔",
        "TYPE": "多选题",
        "A": "项目总工",
        "B": "项目商务经理",
        "C": "项目经理",
        "D": "各专业工程师"
    },
    {
        "ANS": "B",
        "Q": "在项目优化实施前30天申报单位提交项目优化立项申报表相应策划立项一式三份并附相应优化方案对于超过申报时间未立项的原则上不予考核奖励",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "在招采策划这一管理环节容易造成无效成本产生的原因有哪些",
        "TYPE": "多选题",
        "A": "公开招标时间较短及招标信息未充分到达优质单位采购集中在小范围供应商内不能形成充分竞争环境",
        "B": "采购策划不全面风险点亏损点利润点辨识不全",
        "C": "招采策划未考虑进出口关税成本和货币汇率损益",
        "D": "国内资源或属地资源选择不合理用工模式等不符合项目要求"
    },
    {
        "ANS": "BC",
        "Q": "在招采合规性这一管理环节容易造成无效成本产生的原因有哪些",
        "TYPE": "多选题",
        "A": "价格谈判主动权丧失造成项目成本增加投资项目无法在投资结算时通过政府审计相关费用无法计入总投资",
        "B": "分供招采流程不合规如先进场后补合同首轮最高报价未执行废标要求等",
        "C": "以不正当理由排斥潜在投标人小范围招标导致分供商竞争不足",
        "D": "采购成本高"
    },
    {
        "ANS": "AC",
        "Q": "在招采计划这一管理环节容易造成无效成本产生的原因有哪些",
        "TYPE": "多选题",
        "A": "招采计划不及时或未制定符合实际需求的计划执行过程缺少监督合同签订延误",
        "B": "采购滞后影响工期",
        "C": "物资采购计划不准确与施工进度不匹配",
        "D": "投入增加增加材料仓储管理费和仓储损耗占用项目现金流或采购滞后影响工期"
    },
    {
        "ANS": "ABCD",
        "Q": "在柱顶纵向钢筋构造中柱筋作为梁上部钢筋使用时需要再柱箍筋内侧设置角部附加钢筋说法正确的是",
        "TYPE": "多选题",
        "A": "间距150",
        "B": "不少于3根",
        "C": "直径不小于10",
        "D": "总长度为600"
    },
    {
        "ANS": "B",
        "Q": "暂列金额由投标人根据工程特点按有关计价规定估算",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "造价工程师制度属于国家统一规划的制度范围",
        "TYPE": "单选题",
        "A": "技术职称",
        "B": "岗位职务",
        "C": "职业资格",
        "D": "技术职务"
    },
    {
        "ANS": "C",
        "Q": "责任成本是指",
        "TYPE": "单选题",
        "A": "以项目实现履约为前提经组织商务策划并确定项目管理目标后二级单位和项目部协商一致确定的由项目部控制的成本总额",
        "B": "以项目实现履约为前提经组织一级策划并确定项目管理目标后三级单位和项目部协商一致确定的由项目部控制的成本总额",
        "C": "以项目实现履约为前提经组织一级策划并确定项目管理目标后二级单位和项目部协商一致确定的由项目部控制的成本总额",
        "D": "以项目实现履约为前提经组织一级策划并确定项目管理目标后二级单位和项目部协商一致确定的由分公司商务法务部控制的成本总额"
    },
    {
        "ANS": "B",
        "Q": "责任明确灵活方便手续简单和易于组织管理的采购方式为出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "远期合同采购",
        "B": "现货采购",
        "C": "间接采购",
        "D": "集中采购"
    },
    {
        "ANS": "ABC",
        "Q": "增值税附加税包括指以增值税税额作计税依据实行分区域差别比例税率包括具体以纳税人所在城市区县或镇等不同的行政区划分为准",
        "TYPE": "多选题",
        "A": "城市维护建设税",
        "B": "教育费附加",
        "C": "地方教育费附加",
        "D": "印花税"
    },
    {
        "ANS": "A",
        "Q": "增值税指以单位和个人生产经营过程中取得的为课税对象征收实行",
        "TYPE": "单选题",
        "A": "增值额价外税",
        "B": "增值额价内税",
        "C": "增收额价外税",
        "D": "增值税价外税"
    },
    {
        "ANS": "A",
        "Q": "账面利润指按建造合同会计准则确认的财务账面反映的项目所有利润具体以财务账面为准",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "账面利润指按建造合同会计准则确认的实际账面反映的项目所有利润具体以财务账面为准",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "招标策划时招标方式选择不合理标段范围划分不合理导致的结果是出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "影响现金流",
        "B": "造成安全事故",
        "C": "容易造成分包索赔",
        "D": "影响工期质量增加项目成本"
    },
    {
        "ANS": "C",
        "Q": "招标代理机构应当拥有一定数量的取得的专业人员",
        "TYPE": "单选题",
        "A": "造价执业资格",
        "B": "监理执业资格",
        "C": "招标职业资格",
        "D": "采购职业资格"
    },
    {
        "ANS": "ABDE",
        "Q": "招标工程量清单应由组成",
        "TYPE": "多选题",
        "A": "分部分项工程项目清单",
        "B": "措施项目清单",
        "C": "风险项目清单",
        "D": "其他项目清单",
        "E": "规费和税金项目清单"
    },
    {
        "ANS": "A",
        "Q": "招标工程量清单与计价表中列明的所有需要填写单价和合价的项目投标人均应填写且只允许有一个报价未填写单价和合价的项目可视为此项费用已包含在已标价工程量清单中其他项目的单价和合价之中当竣工结算时此项目不得重新组价予以调整",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "招标工程如设标底标底应根据提供的设计图纸和有关要求施工现场实际情况合理的施工方法以及按照省自治区直辖市建设行政主管部门制定的有关工程造价计价办法进行编制",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "招标公告的报名时间未满48小时招标公告未明确供方资质要求等核心要素属于不合规行为出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCE",
        "Q": "招标公告应当载明哪些内容",
        "TYPE": "多选题",
        "A": "招标人的名称和地址",
        "B": "招标项目的性质",
        "C": "获取招标文件的办法",
        "D": "招标项目的评委",
        "E": "招标项目的实施地点"
    },
    {
        "ANS": "B",
        "Q": "招标过程中可以淘汰不在三公司本级资源库中的分供方出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "招标过程中涉及到技术难度较大方案难以确定的情形可组织两阶段招标第一阶段开技术标第二阶段开商务标出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "招标过程中涉及到技术难度较大方案难以确定的情形可组织两阶段招标第一阶段开商务标第二阶段开技术标出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "招标控制价主责部门是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "商务管理部",
        "B": "采购管理部",
        "C": "财务资金部",
        "D": "施工管理部"
    },
    {
        "ANS": "AE",
        "Q": "招标签约全时长是指从到的时间",
        "TYPE": "多选题",
        "A": "创建采购任务",
        "B": "招标公告发布",
        "C": "开标",
        "D": "招标完成",
        "E": "合同签订完"
    },
    {
        "ANS": "B",
        "Q": "招标全时长是指从到合同签订完成的时间出题来源采购管理部采购全链条指导手册",
        "TYPE": "单选题",
        "A": "提交招标资料",
        "B": "创建采购任务",
        "C": "招标公告发布",
        "D": "开标"
    },
    {
        "ANS": "B",
        "Q": "招标人不能对已发出的资格预审文件或者招标文件进行澄清或者修改",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABC",
        "Q": "招标人是否接受联合体投标应当在中载明",
        "TYPE": "多选题",
        "A": "资格预审公告",
        "B": "招标公告",
        "C": "投标邀请书",
        "D": "资格预审文件",
        "E": "投标文件"
    },
    {
        "ANS": "B",
        "Q": "招标人应当根据项目规模和技术复杂程度等因素合理确定评标时间超过的评标委员会成员认为评标时间不够的招标人应当适当延长",
        "TYPE": "单选题",
        "A": "四分之一",
        "B": "三分之一",
        "C": "五分之一",
        "D": "二分之一"
    },
    {
        "ANS": "B",
        "Q": "招标人应当在招标文件中载明投标有效期投标有效期从之日起算",
        "TYPE": "单选题",
        "A": "公告发布",
        "B": "提交投标文件的截止",
        "C": "开标结束",
        "D": "开中标通知书"
    },
    {
        "ANS": "ABD",
        "Q": "招标人有下列哪些情形由有关行政监督部门责令改正可以处10万元以下的罚款",
        "TYPE": "多选题",
        "A": "依法应当公开招标而采用邀请招",
        "B": "招标文件资格预审文件的发售澄清修改的时限或者确定的提交资格预审申请文件投标文件的时限不符合招标投标法及其实施条例规定",
        "C": "接受通过资格预审的单位或者个人参加投标",
        "D": "接受应当拒收的投标文件",
        "E": "依法应当公开招标的项目不按照规定在指定媒介发布招标公告"
    },
    {
        "ANS": "AD",
        "Q": "招标时长是指从到的时间",
        "TYPE": "多选题",
        "A": "创建采购任务",
        "B": "招标公告发布",
        "C": "开标",
        "D": "招标完成",
        "E": "合同签订完"
    },
    {
        "ANS": "BDE",
        "Q": "招标文件中措施项目清单编制的主要依据有",
        "TYPE": "多选题",
        "A": "投标人拟定的施工方案",
        "B": "相关的工程验收规范",
        "C": "施工承包合同",
        "D": "拟定的招标文件",
        "E": "设计文件"
    },
    {
        "ANS": "B",
        "Q": "针对Ⅱ类风险等级治理标准是年度项目扭亏率不低于",
        "TYPE": "单选题",
        "A": "50",
        "B": "60",
        "C": "70",
        "D": "80"
    },
    {
        "ANS": "A",
        "Q": "针对工程招标文件中对物资设备技术参数品牌档次的要求充分进行市场调研利用战略合作供应商资源引导物资设备的品牌选型出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "针对公司集采项目可单独议标进行二次谈判项目单独签订合同价格及条件不得高于集采结果出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "AD",
        "Q": "针对基础底面钢筋的保护层厚度说法正确的是",
        "TYPE": "多选题",
        "A": "有垫层时应从垫层顶面算起",
        "B": "有垫层时应从垫层底面算起",
        "C": "有垫层时可以小于40",
        "D": "有垫层时且不应小于40"
    },
    {
        "ANS": "ABCD",
        "Q": "针对梁的注写方式说法正确的有",
        "TYPE": "多选题",
        "A": "集中标注表达梁的通用数值",
        "B": "原位标注表达梁的特殊数值",
        "C": "集中标注的数值不一定适用于梁的任何部位",
        "D": "原位标注取值优先"
    },
    {
        "ANS": "B",
        "Q": "针对围标串标的描述有误的是出题来源采购管理部采购合规管控要点",
        "TYPE": "单选题",
        "A": "关联单位同时投标",
        "B": "分供方投标后线上集中一人审批",
        "C": "不同投标单位的投标文件一致或相似",
        "D": "业务部门或招标经办人员默许授意陪标和串围标行为甚至操纵招标"
    },
    {
        "ANS": "AC",
        "Q": "针对纵向受力钢筋搭接区范围内箍筋说法正确的是",
        "TYPE": "多选题",
        "A": "直径不小于d4d为搭接钢筋最大直径",
        "B": "直径不大于d4d为搭接钢筋最大直径",
        "C": "间距不应大于100且不大于5dd为搭接钢筋最小直径",
        "D": "间距不应大于100且不大于5dd为搭接钢筋最大直径"
    },
    {
        "ANS": "B",
        "Q": "正常施工条件下完成单位合格建筑产品所需某材料的不可避免损耗量为090kg已知该材料的损耗率为720则其总消耗量为",
        "TYPE": "单选题",
        "A": "1350kg",
        "B": "1341kg",
        "C": "1250kg",
        "D": "1160kg"
    },
    {
        "ANS": "B",
        "Q": "正常施工条件下完成单位合格建筑产品所需某材料的不可避免损耗量为090kg已知该材料的损耗率为720则其总消耗量为",
        "TYPE": "单选题",
        "A": "1350kg",
        "B": "1340kg",
        "C": "1250kg",
        "D": "1160kg"
    },
    {
        "ANS": "AB",
        "Q": "支付结算是的行为",
        "TYPE": "多选题",
        "A": "调解",
        "B": "资金清算",
        "C": "商品采购",
        "D": "商品销售"
    },
    {
        "ANS": "AB",
        "Q": "支付结算是的行为",
        "TYPE": "多选题",
        "A": "货币给付",
        "B": "资金清算",
        "C": "商品采购",
        "D": "商品销售"
    },
    {
        "ANS": "A",
        "Q": "支座两侧筏板厚度有变化时板上部筋深入支座应满足什么要求",
        "TYPE": "单选题",
        "A": "伸入支座不小于La",
        "B": "伸入支座12d且伸到支座中心线",
        "C": "不小于500mm",
        "D": "15d"
    },
    {
        "ANS": "B",
        "Q": "执行新计价办法后依法招标的工程可以不执行新计价办法",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "直接工程费由人工费材料费施工机械使用费三部分组成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "直接邀请三家及以上分供方就采购事宜进行谈判的采购方式是出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "公开招标",
        "B": "邀请招标",
        "C": "询价采购",
        "D": "竞争性谈判"
    },
    {
        "ANS": "D",
        "Q": "直形非框架梁下部带肋钢筋在中间支座处锚固长度为",
        "TYPE": "单选题",
        "A": "Lae",
        "B": "05Hc5d",
        "C": "05Hc",
        "D": "12d"
    },
    {
        "ANS": "C",
        "Q": "直形非框架梁下部光圆钢筋在中间支座处锚固长度为",
        "TYPE": "单选题",
        "A": "Lae",
        "B": "05Hc5d",
        "C": "15d",
        "D": "12d"
    },
    {
        "ANS": "A",
        "Q": "只有采取适当的保证目标控制的组织工作明确完善才能使目标控制取得良好效果",
        "TYPE": "单选题",
        "A": "组织措施",
        "B": "经济措施",
        "C": "技术措施",
        "D": "合同措施"
    },
    {
        "ANS": "B",
        "Q": "质保金比例不得高于国家规定的上限工程建设中不准收取4类保证金之外的保证金",
        "TYPE": "单选题",
        "A": "1",
        "B": "3",
        "C": "5"
    },
    {
        "ANS": "A",
        "Q": "中标供应商数量选择要求拟中标人数量N3时有效投标人数量不少于拟中标人数量N3时要求有效投标人数量不少于特殊情况提交招标小组组长批准出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "2N1N3",
        "B": "2N2N2",
        "C": "2N3N3",
        "D": "2N1N2"
    },
    {
        "ANS": "A",
        "Q": "中国建筑精神是",
        "TYPE": "单选题",
        "A": "忠诚担当使命必达",
        "B": "军魂匠心家国情怀",
        "C": "令行禁止使命必达",
        "D": "品质保障价值创造"
    },
    {
        "ANS": "ABC",
        "Q": "中国人民解放军基本建设工程兵的十二字方针是",
        "TYPE": "多选题",
        "A": "劳武结合",
        "B": "能攻能战",
        "C": "以工为主",
        "D": "全力攻坚"
    },
    {
        "ANS": "B",
        "Q": "中国人民解放军基本建设工程兵第211大队组建成立的时间是",
        "TYPE": "单选题",
        "A": "8164",
        "B": "8166",
        "C": "8168",
        "D": "8169"
    },
    {
        "ANS": "A",
        "Q": "中建八局采购管理风险防控工作完善机制出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "单选题",
        "A": "公开监督",
        "B": "公开招标",
        "C": "公开采购"
    },
    {
        "ANS": "A",
        "Q": "中建八局采购管理风险防控工作完善公开监督机制出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "中建八局采购管理风险防控工作完善公开招标机制出题来源采购管理部中建八局采购合规管控实施细则",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "中建八局采购管理价值创造能力提升实施方案中以下哪项不是工作安排中的内容出题来源采购管理部中建八局采购管理价值创造能力提升实施方案",
        "TYPE": "单选题",
        "A": "提高认识重在落地",
        "B": "系统联动形成合力",
        "C": "总结经验固化成果",
        "D": "考核评价逆向激励"
    },
    {
        "ANS": "A",
        "Q": "中建八局的企业作风",
        "TYPE": "单选题",
        "A": "令行禁止使命必达",
        "B": "红色基因薪火相传",
        "C": "军魂匠心家国情怀",
        "D": "红色基因蓝色力量绿色发展"
    },
    {
        "ANS": "A",
        "Q": "中建八局三公司安装公司代表中建总公司承建的阿尔及利亚松树喜来登大酒店举办了",
        "TYPE": "单选题",
        "A": "非洲统一组织首脑会议",
        "B": "东盟会议",
        "C": "WTO会议",
        "D": "金砖国家峰会"
    },
    {
        "ANS": "A",
        "Q": "中建八局三公司的前身是基建工程兵",
        "TYPE": "单选题",
        "A": "211大队团",
        "B": "201大队团",
        "C": "212大队团",
        "D": "222大队团"
    },
    {
        "ANS": "A",
        "Q": "中建八局三公司六个项目首次获得ISA国际安全大奖",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCD",
        "Q": "中建八局项目商务策划管理原则是什么",
        "TYPE": "多选题",
        "A": "全面覆盖",
        "B": "策划前置",
        "C": "分级负责",
        "D": "系统联动",
        "E": "科学计量"
    },
    {
        "ANS": "A",
        "Q": "中建集团的企业使命",
        "TYPE": "单选题",
        "A": "拓展幸福空间",
        "B": "建造业主满意工程",
        "C": "品质保证",
        "D": "价值创造"
    },
    {
        "ANS": "B",
        "Q": "中央媒体对公司的负面报道事件在风险等级中划分为重大风险等级",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "重大风险项目竣工结算策划由组织二级单位相关部门人员参加",
        "TYPE": "单选题",
        "A": "总经理",
        "B": "二级单位总经济师",
        "C": "二级单位商务部",
        "D": "三级单位总经济师"
    },
    {
        "ANS": "A",
        "Q": "重点关注案件指因违规对外融资借贷对外担保虚假交易保理等问题导致的案件或产生重大影响的案件",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "主体二次结构定标环节需按照要求上传标前交底书出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "主体二次结构及超授权招标推荐由审批出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "二级单位生产副总经理",
        "B": "二级单位施工管理部经理",
        "C": "公司工程管理部经理",
        "D": "公司生产副总经理"
    },
    {
        "ANS": "B",
        "Q": "主体二次结构劳务招标前在公司管理平台进行分包商推荐推荐表必须在资审时上传云筑网出题来源采购管理部采购全链条指导手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "主体二次结构资审定标需审批到公司层级出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "主体结构二次结构劳务资格审查表审批至三公司工程管理部出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "主要材料设备采购履约监控表需要在后进入履约阶段实施履约监控出题来源采购管理部项目采购策划管理指引",
        "TYPE": "单选题",
        "A": "合同签订后",
        "B": "定标完成后",
        "C": "发起招标",
        "D": "项目开工后"
    },
    {
        "ANS": "B",
        "Q": "主要采购方式包括MRO云筑电商采购出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "主要采购方式不包括出题来源采购管理部采购管理手册",
        "TYPE": "单选题",
        "A": "公开招标",
        "B": "邀请招标",
        "C": "询价采购",
        "D": "MRO云筑电商采购"
    },
    {
        "ANS": "B",
        "Q": "住宅类项目大型机械使用费",
        "TYPE": "单选题",
        "A": "25元m建筑面积",
        "B": "30元m建筑面积",
        "C": "35元m建筑面积",
        "D": "40元m建筑面积"
    },
    {
        "ANS": "ABD",
        "Q": "住宅楼梯面层工程包括",
        "TYPE": "多选题",
        "A": "踏步",
        "B": "休息平台",
        "C": "楼梯井",
        "D": "楼层连接梁",
        "E": "踢脚板"
    },
    {
        "ANS": "A",
        "Q": "柱的第一根箍筋距基础顶面的距离是",
        "TYPE": "单选题",
        "A": "50mm",
        "B": "100mm",
        "C": "箍筋加密区间距",
        "D": "箍筋加密区间距2"
    },
    {
        "ANS": "C",
        "Q": "柱箍筋加密范围不包括",
        "TYPE": "单选题",
        "A": "节点范围",
        "B": "底层刚性地面上面500mm",
        "C": "基础顶面嵌固部位向上16Hn",
        "D": "搭接范围"
    },
    {
        "ANS": "C",
        "Q": "柱净高与柱截面长边尺寸的比值Hnhc4时柱箍筋的加密范围为",
        "TYPE": "单选题",
        "A": "底层刚性地面上下500mm",
        "B": "基础顶面嵌固部位向上16Hn",
        "C": "全高加密",
        "D": "搭接范围"
    },
    {
        "ANS": "D",
        "Q": "柱面装饰板清单工程量应按设计图示饰面外围尺寸以面积计算且",
        "TYPE": "单选题",
        "A": "扣除柱帽柱墩面积",
        "B": "扣除柱墩不扣柱帽",
        "C": "扣除柱帽不扣柱墩",
        "D": "柱帽柱墩并入柱饰面工程量中"
    },
    {
        "ANS": "D",
        "Q": "柱面装饰板清单工程量应按设计图示饰面外围尺寸以面积计算且",
        "TYPE": "单选题",
        "A": "扣除柱帽柱墩面积",
        "B": "扣除柱墩不扣柱帽",
        "C": "扣除柱帽不扣柱墩",
        "D": "柱帽柱墩并入柱饰面工程量中"
    },
    {
        "ANS": "BC",
        "Q": "柱平法施工图系在柱平面布置图上采用方式表达",
        "TYPE": "多选题",
        "A": "平面注写",
        "B": "列表注写",
        "C": "截面注写",
        "D": "设计注写"
    },
    {
        "ANS": "A",
        "Q": "柱上板带底部筋在端支座处的构造为",
        "TYPE": "单选题",
        "A": "伸至支座边弯折15d",
        "B": "伸入支座内h",
        "C": "伸入支座内max12d支座宽2",
        "D": "伸入支座内max5d支座宽2"
    },
    {
        "ANS": "D",
        "Q": "柱贴大理石板面层工程量应按计算",
        "TYPE": "单选题",
        "A": "层高柱截面结构周长",
        "B": "净高柱截面结构周长",
        "C": "层高柱截面实铺周长",
        "D": "净高柱截面实铺周长"
    },
    {
        "ANS": "C",
        "Q": "柱中间层纵筋长度计算公式为",
        "TYPE": "单选题",
        "A": "本层层高下层底部非连接区本层底部非连接区",
        "B": "本层层高下层底部非连接区上部底部非连接区",
        "C": "本层层高本层底部非连接区上层底部非连接区",
        "D": "本层层高本层底部非连接区上层底部连接区"
    },
    {
        "ANS": "C",
        "Q": "柱纵筋采用焊接时图集中纵筋错开距离为",
        "TYPE": "单选题",
        "A": "35d",
        "B": "37d",
        "C": "max35d500",
        "D": "max37d500"
    },
    {
        "ANS": "A",
        "Q": "柱纵筋采用机械连接时图集中纵筋错开距离为",
        "TYPE": "单选题",
        "A": "35d",
        "B": "37d",
        "C": "max35d500",
        "D": "max37d500"
    },
    {
        "ANS": "BC",
        "Q": "铸石作为耐磨耐腐蚀衬里其主要特性为",
        "TYPE": "多选题",
        "A": "抗腐蚀性能强能耐氢氟酸腐蚀",
        "B": "耐磨性好比锰钢高510倍",
        "C": "硬度高仅次于金刚石和刚玉",
        "D": "应用广可用于各种管道防腐内衬"
    },
    {
        "ANS": "B",
        "Q": "筑牢廉洁从业防线需强化与纪检与等部门的联动利用专项培训培训主题教育等方式定期开展警示教育提升采购管理人员风险防范意识营造廉洁从业环境",
        "TYPE": "单选题",
        "A": "商务",
        "B": "审计",
        "C": "物资",
        "D": "工程"
    },
    {
        "ANS": "ABCD",
        "Q": "专业板块成本总结包括",
        "TYPE": "多选题",
        "A": "盈亏原因分析",
        "B": "成本管控分析",
        "C": "主要经验教训",
        "D": "启示"
    },
    {
        "ANS": "C",
        "Q": "专业项目商务策划效益率控制指标为",
        "TYPE": "单选题",
        "A": "10",
        "B": "12",
        "C": "15",
        "D": "20"
    },
    {
        "ANS": "BCE",
        "Q": "砖基中不扣除等所占体积",
        "TYPE": "多选题",
        "A": "钢砼柱",
        "B": "放脚T形接头重叠部分",
        "C": "砂浆防潮层",
        "D": "防水地圈梁",
        "E": "钢筋铁件"
    },
    {
        "ANS": "A",
        "Q": "转包指承包单位承包工程后不履行合同约定的责任和义务将其承包的全部工程或者将其承包的全部工程肢解后以分包的名义分别转给其他单位或个人施工的行为出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "转换柱部分纵筋延伸到上层剪力墙楼板顶原则为",
        "TYPE": "单选题",
        "A": "伸到楼板顶截断",
        "B": "能通则通",
        "C": "不通打断",
        "D": "弯折15d"
    },
    {
        "ANS": "C",
        "Q": "转角墙外侧水平分布钢筋在转角处搭接搭接长度为",
        "TYPE": "单选题",
        "A": "lle",
        "B": "12lae",
        "C": "16lae",
        "D": "16lle"
    },
    {
        "ANS": "C",
        "Q": "转角墙外侧水平分布钢筋在转角处搭接搭接长度为",
        "TYPE": "单选题",
        "A": "lle",
        "B": "12lae",
        "C": "16lae",
        "D": "16lle"
    },
    {
        "ANS": "BCD",
        "Q": "装饰定额楼地面工程中的零星项目适用于",
        "TYPE": "多选题",
        "A": "踢脚板",
        "B": "楼梯侧面",
        "C": "池槽",
        "D": "面积1m2以内",
        "E": "点缀"
    },
    {
        "ANS": "ABC",
        "Q": "装饰工程地区基价有那几部分组成",
        "TYPE": "多选题",
        "A": "人工费",
        "B": "材料费",
        "C": "机械费",
        "D": "未计价材料费",
        "E": "未计价机械费"
    },
    {
        "ANS": "C",
        "Q": "装饰工程满堂脚手架按室内净面积计算其基本层分为内",
        "TYPE": "单选题",
        "A": "3m5m",
        "B": "2m3m",
        "C": "5m8m",
        "D": "3m8m"
    },
    {
        "ANS": "BD",
        "Q": "资格审查的原则是",
        "TYPE": "多选题",
        "A": "按照采购需求及报名数量进行资格审查",
        "B": "资格审查阶段无正当理由的禁止不予通过资格审查",
        "C": "按照报名顺序进行资格审查",
        "D": "不得以不合理的条件限制排斥潜在投标人"
    },
    {
        "ANS": "A",
        "Q": "资审结果不符合招标公告要求未按要求上传资审结果附件均属于不合规行为出题来源采购管理部采购合规管控要点",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "资源的分布生产企业的生产能力属于材料采购信息中的出题来源采购管理部采购业务知识",
        "TYPE": "单选题",
        "A": "资源信息",
        "B": "供应信息",
        "C": "市场信息",
        "D": "价格信息"
    },
    {
        "ANS": "ABCD",
        "Q": "自流坪楼地面按设计图示尺寸以面积计算扣除凸出地面等所占面积",
        "TYPE": "多选题",
        "A": "构筑物",
        "B": "设备基础",
        "C": "室内铁道",
        "D": "地沟",
        "E": "间壁墙"
    },
    {
        "ANS": "A",
        "Q": "自施产值是指已完成工程工作中自施部分按承包合同约定的计价条款确定的工程造价自施合同收入包含总承包服务费和定点类分包缴纳总包管理费",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "自施产值是指已完成工程工作中自施部分按承包合同约定的计价条款确定的工程造价自施合同收入不包含总承包服务费和定点类分包缴纳总包管理费",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCDEF",
        "Q": "自施成本包含",
        "TYPE": "多选题",
        "A": "本项目直接工程费",
        "B": "本项目问接费",
        "C": "上缴投资收费或管理费融投资项目",
        "D": "本项目奖金",
        "E": "计提维修费",
        "F": "扣除调按费"
    },
    {
        "ANS": "ABCDE",
        "Q": "自施成本包含",
        "TYPE": "多选题",
        "A": "融资带动施工总承包项目上缴外部单位管理费或投资收益费在总包结算时未扣除时计入项目成本",
        "B": "临时设施等因定资产计算机软件等无形资产应计折旧摊销分期计入项目实际成本如项目中途撤场长时问停工则未摊销完未折旧完的余额一次性计入当期项目成本",
        "C": "在项目投标及履约过程中发生的营销奖费履约奖专项奖过程兑现奖励等费用计入项目成本",
        "D": "统计竣工项目的成本时已经发生的保修费用均计入项目成本另按照工程造价的一定比例进行维修费用计提并计入成本",
        "E": "项目竣工考核兑现奖励按项目目标管理责任书测算值预计入项目成本"
    },
    {
        "ANS": "BC",
        "Q": "自施合同额10亿元以上的重点项目由哪个部门牵头组织商务策划其余项目由哪个部门牵头组织商务策划",
        "TYPE": "多选题",
        "A": "项目经理",
        "B": "公司商务管理部",
        "C": "二级单位商务法务部",
        "D": "项目商务经理"
    },
    {
        "ANS": "A",
        "Q": "自施合同额10亿元以上项目商务策划书审批权限是",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务部经理",
        "C": "二级单位总经济师",
        "D": "二级单位总经理"
    },
    {
        "ANS": "A",
        "Q": "自施合同额10亿元以上项目商务策划书由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务管理部经理",
        "C": "公司总经济师",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "C",
        "Q": "自施合同额10亿元以下项目商务策划书审批权限是",
        "TYPE": "单选题",
        "A": "公司商务部经理",
        "B": "二级单位商务部经理",
        "C": "二级单位总经济师",
        "D": "二级单位总经理"
    },
    {
        "ANS": "D",
        "Q": "自施合同额10亿元以下项目商务策划书由审批",
        "TYPE": "单选题",
        "A": "公司商务管理部经理",
        "B": "二级单位商务管理部经理",
        "C": "公司总经济师",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "B",
        "Q": "自施合同额50亿以上项目新型业务领导项目或代表性项目由牵头开展项目商务策划和专家会诊工作",
        "TYPE": "单选题",
        "A": "股份公司",
        "B": "局总部",
        "C": "二级单位",
        "D": "三级单位"
    },
    {
        "ANS": "CD",
        "Q": "自施合同额50亿以上项目新型业务领导项目或代表性项目由牵头开展项目商务策划和专家会诊工作",
        "TYPE": "多选题",
        "A": "股份公司",
        "B": "局总部",
        "C": "二级单位",
        "D": "由局组建专家团队授权二级单位"
    },
    {
        "ANS": "C",
        "Q": "自施合同额50亿元以上项目新型业务领域项目或代表性项目由牵头开展项目商务策划和专家会诊工作",
        "TYPE": "单选题",
        "A": "二级单位",
        "B": "三级单位",
        "C": "局总部",
        "D": "项目部"
    },
    {
        "ANS": "ABCDE",
        "Q": "自施合同额不含",
        "TYPE": "多选题",
        "A": "专业暂估价",
        "B": "暂列金额",
        "C": "指定分包",
        "D": "独立分包",
        "E": "内部配合"
    },
    {
        "ANS": "A",
        "Q": "自施合同额指发承包双方签订的工程承包合同额中承包人自行施工部分对应的合同额即承包人自主决定合同收入和实际成本自主与发包人办理竣工结算自主组织招议标确定分包分供单位的工作范围内的合同额",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABDE",
        "Q": "综合单价包含以下哪些内容",
        "TYPE": "多选题",
        "A": "人工费材料费机械费",
        "B": "企业管理费",
        "C": "预备费",
        "D": "利润",
        "E": "一定范围内的风险费用"
    },
    {
        "ANS": "B",
        "Q": "综合单价是完成工程量清单中一个规定计量单位项目所需的人工费材料费机械使用费和利润",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABD",
        "Q": "综合评标法中要求对投标人的等指标进行分别评标赋分按照综合评分由高到底的顺序选择中标分供方",
        "TYPE": "多选题",
        "A": "资格资质",
        "B": "技术方案",
        "C": "合作记录",
        "D": "商务报价"
    },
    {
        "ANS": "A",
        "Q": "综合评估法一般适用于技术难度大要求高的施工分包物资如钢结构高支模地下暗挖大型机械租赁单边支模爬架爬模租赁等高大精尖难项目或工期超出定额工期20以上分包需要采取特殊措施抢工的项目出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABCDE",
        "Q": "总包结算核对达成一致意见时可以定案时须会签后方能签字盖章",
        "TYPE": "多选题",
        "A": "项目商务经理",
        "B": "项目总工",
        "C": "项目经理",
        "D": "二级单位总经济师",
        "E": "经理"
    },
    {
        "ANS": "B",
        "Q": "总包结算监控由负责动态跟踪项目结算计划完成情况并每周通报",
        "TYPE": "单选题",
        "A": "项目商务经理",
        "B": "二级单位商务法务部计量中心",
        "C": "二级单位总经济师",
        "D": "项目经理"
    },
    {
        "ANS": "A",
        "Q": "总包结算内部费用确认总包结算报出前协同各单位按合同约定确认扣减费用或费率如在总包结算上报发包人后未确认的则按双方合同约定执行",
        "TYPE": "单选题",
        "A": "项目商务经理",
        "B": "项目经理",
        "C": "三级单位总经济师",
        "D": "三级单位商务管理部"
    },
    {
        "ANS": "B",
        "Q": "总包结算由对合同内清单组价缺漏项及技术核定单总包签证进行复核",
        "TYPE": "单选题",
        "A": "项目经理",
        "B": "商务法务部计量中心",
        "C": "经理",
        "D": "总经济师"
    },
    {
        "ANS": "A",
        "Q": "总包结算资料不齐全结算书未上报前项目主要管理人员不得调离",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "A",
        "Q": "总包签证管理要求超过200万元的单项签证提交发包人前经二级单位商务法务部审核总经济师审批后报出",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "D",
        "Q": "总包签证索赔50万元以上的单项签证由审批",
        "TYPE": "单选题",
        "A": "公司总经理",
        "B": "公司总经济师",
        "C": "二级单位总经理",
        "D": "二级单位总经济师"
    },
    {
        "ANS": "D",
        "Q": "总包签证索赔涉及补偿的函件或者补偿报告超过万元的经二级单位商务管理部审核总经济师审批后报出",
        "TYPE": "单选题",
        "A": "100万元",
        "B": "20万元",
        "C": "30万元",
        "D": "50万元"
    },
    {
        "ANS": "A",
        "Q": "总包签证索赔涉及补偿的函件或者补偿报告超过万元的经商务管理部审核总经济师审批后报出",
        "TYPE": "单选题",
        "A": "500万元",
        "B": "100万元",
        "C": "200万元",
        "D": "300万元"
    },
    {
        "ANS": "B",
        "Q": "总部各部门和二级单位需每月10日前形成全面风险排查和处置情况简报并按要求报公司商务管理部由商务管理部汇总形成公司月度简报",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "总承包项目规模为1015亿元的项目整体预留额度是30万元",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "C",
        "Q": "总承包项目项目经理预留风险金规定基数的",
        "TYPE": "单选题",
        "A": "10",
        "B": "15",
        "C": "20",
        "D": "25"
    },
    {
        "ANS": "D",
        "Q": "总价措施项目清单与计价表中不包含",
        "TYPE": "单选题",
        "A": "安全文明施工费",
        "B": "夜间施工费",
        "C": "二次搬运费",
        "D": "社会保险费"
    },
    {
        "ANS": "ABDE",
        "Q": "总价项目进度款支付分解表内容包括",
        "TYPE": "多选题",
        "A": "安全文明施工费",
        "B": "夜间施工费",
        "C": "劳务分包费用",
        "D": "社会保险费",
        "E": "住房公积金"
    },
    {
        "ANS": "ABDE",
        "Q": "总价项目进度款支付分解表内容包括",
        "TYPE": "多选题",
        "A": "规费",
        "B": "夜间施工费",
        "C": "劳务分包费用",
        "D": "社会保险费",
        "E": "住房公积金"
    },
    {
        "ANS": "A",
        "Q": "总经理办公会是本单位经理层关于合规管理的决策机构主要合规管理职责包括建立健全合规管理组织架构批准合规管理具体制度批准合规管理计划采取措施确保合规制度得到有效执行明确合规管理流程及时制止并纠正不合规的经营行为",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "ABDE",
        "Q": "总平面设计包括",
        "TYPE": "多选题",
        "A": "占地面积和土地利用情况",
        "B": "厂址方案",
        "C": "建设标准和产品",
        "D": "外部运输",
        "E": "水电气及其他外部协作条件"
    },
    {
        "ANS": "ABC",
        "Q": "纵向受拉钢筋绑扎搭接机械连接焊接的连接长度分别为",
        "TYPE": "多选题",
        "A": "13ll或13lle",
        "B": "35d",
        "C": "35d且500",
        "D": "12lae"
    },
    {
        "ANS": "ABC",
        "Q": "组织总包结算评审与竣工成本对比若发现未达到上缴利润率情况则立即组织相关部门研究分析原因依据初审结果调整结算后由哪些人员签字确认结算目标值报二级单位商务法务部",
        "TYPE": "多选题",
        "A": "项目经理",
        "B": "项目总工",
        "C": "项目商务经理",
        "D": "项目副经理",
        "E": "物资主管"
    },
    {
        "ANS": "A",
        "Q": "最低投标价法但投标价低于成本的除外一般适用于技术难度一般没有特殊要求的施工分包物资出题来源采购管理部采购管理手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "B",
        "Q": "最终结清时承包人被预留的质量保证金不足以抵减发包人工程缺陷修复费用的应的补偿责任",
        "TYPE": "单选题",
        "A": "由发包人承担不足部分",
        "B": "由承包人承担不足部分",
        "C": "双方各承担50",
        "D": "由承包人双倍承担不足部分"
    },
    {
        "ANS": "B",
        "Q": "遵循毛主席一定要把淮河修好指示建成的远东第一坝工程是",
        "TYPE": "单选题",
        "A": "南湾水库",
        "B": "佛子岭水库及配套工程",
        "C": "横山水库",
        "D": "榆林水库"
    },
    {
        "答案必填": "A",
        "题目必填": "中建集团的企业使命",
        "题型必填": "单选题",
        "选项A": "拓展幸福空间",
        "选项B": "建造业主满意工程",
        "选项C": "品质保证",
        "选项D": "价值创造"
    },
    {
        "答案必填": "A",
        "题目必填": "中国建筑精神是",
        "题型必填": "单选题",
        "选项A": "忠诚担当使命必达",
        "选项B": "敬业求实创新争先",
        "选项C": "诚信创新超越共赢",
        "选项D": "品质保障价值创造"
    },
    {
        "答案必填": "B",
        "题目必填": "始终秉承通过高品质的服务实现与各利益相关方的共赢和价值的最大化",
        "题型必填": "单选题",
        "选项A": "廉洁文化",
        "选项B": "绩效文化",
        "选项C": "铁军文化",
        "选项D": "奋斗文化"
    },
    {
        "答案必填": "A",
        "题目必填": "中国建筑始终传承服务党和国家事业发展勇于改革创新推进高质量发展始终将使命追求融入中华民族伟大复兴中国梦与时代同行与祖国共进",
        "题型必填": "单选题",
        "选项A": "红色基因",
        "选项B": "蓝色力量",
        "选项C": "绿色发展"
    },
    {
        "答案必填": "B",
        "题目必填": "年国家建工总局在香港注册成立了中国海外建筑工程有限公司从事对外工程承包和劳务合作",
        "题型必填": "单选题",
        "选项A": "1978",
        "选项B": "1979",
        "选项C": "1980",
        "选项D": "1981"
    },
    {
        "答案必填": "D",
        "题目必填": "1996年中国建筑在深圳地王大厦创造了两天半一个结构层的",
        "题型必填": "单选题",
        "选项A": "中国速度",
        "选项B": "中建速度",
        "选项C": "深圳速度",
        "选项D": "新深圳速度"
    },
    {
        "答案必填": "A",
        "题目必填": "年中国建筑首次亮相财富世界500强位列486位",
        "题型必填": "单选题",
        "选项A": "2006",
        "选项B": "2007",
        "选项C": "2008",
        "选项D": "2009"
    },
    {
        "答案必填": "A",
        "题目必填": "是我们的立业之基",
        "题型必填": "单选题",
        "选项A": "诚信",
        "选项B": "奋斗",
        "选项C": "爱国",
        "选项D": "求实"
    },
    {
        "答案必填": "D",
        "题目必填": "是我们的工作作风",
        "题型必填": "单选题",
        "选项A": "诚信",
        "选项B": "奋斗",
        "选项C": "超越",
        "选项D": "求实"
    },
    {
        "答案必填": "B",
        "题目必填": "是我们的价值追求",
        "题型必填": "单选题",
        "选项A": "创新",
        "选项B": "共赢",
        "选项C": "超越",
        "选项D": "奉献"
    },
    {
        "答案必填": "C",
        "题目必填": "是我们的精神品格",
        "题型必填": "单选题",
        "选项A": "爱国",
        "选项B": "诚信",
        "选项C": "奉献",
        "选项D": "求实"
    },
    {
        "答案必填": "D",
        "题目必填": "提高是国有企业做好一切工作的首要前提国有企业的最大优势是政治优势作为我国建筑领域唯一一家由中央直接管理的国有重要骨干企业集团必须旗帜鲜明讲政治把提高政治站位摆在首位",
        "题型必填": "单选题",
        "选项A": "企业效益",
        "选项B": "责任担当",
        "选项C": "职业素养",
        "选项D": "政治站位"
    },
    {
        "答案必填": "C",
        "题目必填": "用众人之力则无不胜也形容的是十典九章中的哪项内容",
        "题型必填": "单选题",
        "选项A": "规范高效",
        "选项B": "品质之上",
        "选项C": "协同联动",
        "选项D": "清正廉洁"
    },
    {
        "答案必填": "B",
        "题目必填": "功崇惟志业广惟勤形容的是十典九章中的哪项内容",
        "题型必填": "单选题",
        "选项A": "规范高效",
        "选项B": "专业敬业",
        "选项C": "品质之上",
        "选项D": "笃诚守信"
    },
    {
        "答案必填": "C",
        "题目必填": "年中国建筑工程总公司更名为中国建筑集团有限公司",
        "题型必填": "单选题",
        "选项A": "2015",
        "选项B": "2016",
        "选项C": "2017",
        "选项D": "2018"
    },
    {
        "答案必填": "D",
        "题目必填": "年中国建筑位列财富世界500强第9位",
        "题型必填": "单选题",
        "选项A": "2019",
        "选项B": "2020",
        "选项C": "2021",
        "选项D": "2022"
    },
    {
        "答案必填": "C",
        "题目必填": "是我们跨越发展永葆生机和活力的动力之源我们遵循市场经济规律和企业发展规律主动识别适应外部环境变化致力营造激发组织和个人活力的创新氛围",
        "题型必填": "单选题",
        "选项A": "规范高效",
        "选项B": "专业敬业",
        "选项C": "守正创新",
        "选项D": "接续奋斗"
    },
    {
        "答案必填": "D",
        "题目必填": "十典九章中礼仪九章的随俗细则包含肢体语言随俗宴请时随俗",
        "题型必填": "单选题",
        "选项A": "着装随俗",
        "选项B": "称呼随俗",
        "选项C": "赠礼随俗",
        "选项D": "交谈话题随俗"
    },
    {
        "答案必填": "A",
        "题目必填": "是我们契约精神和高品质履约的体现是我们的生命线",
        "题型必填": "单选题",
        "选项A": "笃诚守信",
        "选项B": "专业敬业",
        "选项C": "守正创新",
        "选项D": "规范高效"
    },
    {
        "答案必填": "C",
        "题目必填": "是我们跨越发展永葆生机和活力的动力之源",
        "题型必填": "单选题",
        "选项A": "品质至上",
        "选项B": "协同联动",
        "选项C": "守正创新",
        "选项D": "规范高效"
    },
    {
        "答案必填": "B",
        "题目必填": "是我们必须坚守的政治操守和工作底线意味着我们以廉为规行有所止崇德兼爱尚廉守矩",
        "题型必填": "单选题",
        "选项A": "品质至上",
        "选项B": "清正廉洁",
        "选项C": "专业敬业",
        "选项D": "守正创新"
    },
    {
        "答案必填": "A",
        "题目必填": "中建集团文化深化133工作体系中的1个意见是指",
        "题型必填": "单选题",
        "选项A": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见",
        "选项B": "关于进一步提升中建集团企业文化影响力的实施意见",
        "选项C": "关于进一步深化中建集团党员干部企业文化认识的指导意见",
        "选项D": "关于进一步强化中建集团企业文化影响力的指导意见"
    },
    {
        "答案必填": "BCD",
        "题目必填": "以下不属于中建集团文化深化133工作体系中的3个手册的是",
        "题型必填": "单选题",
        "选项A": "铁军宣言2024版",
        "选项B": "十典九章2024版",
        "选项C": "中建信条十典九章海外文化融合版",
        "选项D": "中建信条2024版"
    },
    {
        "答案必填": "BCD",
        "题目必填": "下列不属于中建集团文化深化133工作体系中的工作方法的是",
        "题型必填": "单选题",
        "选项A": "统筹兼顾",
        "选项B": "提高认识",
        "选项C": "把握要义",
        "选项D": "统筹推进"
    },
    {
        "答案必填": "C",
        "题目必填": "结合国家全民文明礼貌月科技创新周集团质量月纪法教育月等将每年月设置为集团文明有礼月集中开展系列文明有礼主题活动",
        "题型必填": "单选题",
        "选项A": "8月",
        "选项B": "12月",
        "选项C": "3月",
        "选项D": "7月"
    },
    {
        "答案必填": "B",
        "题目必填": "回应相关方期望践行优良传统通过设置专用信箱邮箱员工接待日等了解员工思想动态回应实际诉求",
        "题型必填": "单选题",
        "选项A": "服务基层",
        "选项B": "四下基层",
        "选项C": "基层导向",
        "选项D": "问题导向"
    },
    {
        "答案必填": "B",
        "题目必填": "中建集团文化深化133工作体系是集团的重要成果及长效机制之一",
        "题型必填": "单选题",
        "选项A": "第一批主题教育",
        "选项B": "第二批主题教育",
        "选项C": "第一轮巡视",
        "选项D": "党史学习教育"
    },
    {
        "答案必填": "C",
        "题目必填": "规范网络言行开展干部职工网络行为专项培训严格落实集团",
        "题型必填": "单选题",
        "选项A": "干部职工媒介素养提升行动方案",
        "选项B": "干部职工新闻媒体采访行为规范指导意见",
        "选项C": "干部职工媒体采访行为规范十条",
        "选项D": "中建集团推进网络文明专项行动方案实施细则"
    },
    {
        "答案必填": "D",
        "题目必填": "落实安全文化在项目运用持续提升全员日常安全管理意识和管理水平",
        "题型必填": "单选题",
        "选项A": "施工安全三步法",
        "选项B": "文明施工四步法",
        "选项C": "安全生产六步法",
        "选项D": "行为安全七步法"
    },
    {
        "答案必填": "A",
        "题目必填": "践行合规文化组建面向项目部管理人员开展合规培训交流举办合规知识竞赛制作推广合规海报微视频广泛营造合规氛围",
        "题型必填": "单选题",
        "选项A": "合规讲师团",
        "选项B": "合规宣讲团",
        "选项C": "合规考察组",
        "选项D": "合规调研队"
    },
    {
        "答案必填": "B",
        "题目必填": "选树中建榜样组织宣讲团进基层进项目宣讲身边榜样先进事迹",
        "题型必填": "单选题",
        "选项A": "红色先锋",
        "选项B": "建证力量",
        "选项C": "建证先锋",
        "选项D": "红色基石"
    },
    {
        "答案必填": "A",
        "题目必填": "中建集团企业文化管理的组织架构体系在总部二级单位三级及以下单位三个层面中各级党组织企业文化管理部门各职能部门有效联动以为原则充分发挥党组织把方向管大局保落实的领导作用全面领会普遍原理学深悟透国企篇章运用党的创新理论共同完成企业文化建设相关工作",
        "题型必填": "单选题",
        "选项A": "坚持党对一切工作的领导",
        "选项B": "文化强企",
        "选项C": "文化自信",
        "选项D": "党管文化"
    },
    {
        "答案必填": "D",
        "题目必填": "集团总部层面是中建集团企业文化管理的最高领导机构对全系统企业文化建设与管理进行总体决策与指导",
        "题型必填": "单选题",
        "选项A": "集团党建工作部",
        "选项B": "集团企业文化部",
        "选项C": "集团董事会",
        "选项D": "集团党组"
    },
    {
        "答案必填": "B",
        "题目必填": "集团总部层面对全系统企业文化建设重大事项进行研究提出意见和建议",
        "题型必填": "单选题",
        "选项A": "集团宣传意识形态工作领导小组",
        "选项B": "集团宣传思想文化工作领导小组",
        "选项C": "集团宣传企业文化工作领导小组",
        "选项D": "集团企业品牌文化建设工作领导小组"
    },
    {
        "答案必填": "C",
        "题目必填": "集团总部层面是中建集团企业文化建设及管理工作执行管理机构对各单位企业文化建设进行指导管理与监督",
        "题型必填": "单选题",
        "选项A": "集团党组",
        "选项B": "集团宣传思想文化工作领导小组",
        "选项C": "总部党建工作部",
        "选项D": "集团董事会"
    },
    {
        "答案必填": "B",
        "题目必填": "集团总部层面是本部门企业文化建设及管理工作的第一责任人主要负责本部门文化建设及管理工作的开展与专项文化的推进",
        "题型必填": "单选题",
        "选项A": "部门分管领导",
        "选项B": "部门主管",
        "选项C": "分管文化宣传的部门副职",
        "选项D": "上级部门指定的部门企业文化管理人员"
    },
    {
        "答案必填": "B",
        "题目必填": "集团二级单位层面是该单位企业文化建设和管理的领导机构负责本单位企业文化建设与管理工作的整体把控推进母子文化对接和融合指导本单位文化工作的开展并对所属单位企业文化工作进行决策与指导",
        "题型必填": "单选题",
        "选项A": "二级单位党委工作部",
        "选项B": "二级单位党组织",
        "选项C": "二级单位企划部",
        "选项D": "二级单位宣传部"
    },
    {
        "答案必填": "D",
        "题目必填": "集团二级单位层面是该单位企业文化建设及管理工作的执行管理机构对其下属单位企业文化建设及管理工作进行管理服务与监督",
        "题型必填": "单选题",
        "选项A": "二级单位党委",
        "选项B": "二级单位宣传部",
        "选项C": "二级单位企划部",
        "选项D": "二级单位企业文化管理部门"
    },
    {
        "答案必填": "A",
        "题目必填": "集团二级单位层面是本部门企业文化建设及管理工作的第一责任人接受本单位党组织的指导负责本部门文化建设及管理工作的开展与专项文化的推进",
        "题型必填": "单选题",
        "选项A": "职能部门的部门主管",
        "选项B": "上级部门指定的部门企业文化管理人员",
        "选项C": "部门分管领导",
        "选项D": "分管文化宣传的部门副职"
    },
    {
        "答案必填": "C",
        "题目必填": "是中国建筑核心文化理念确立与变更的审批机构定义并更新中国建筑精神企业使命企业愿景核心价值观等核心理念",
        "题型必填": "单选题",
        "选项A": "集团宣传思想文化工作领导小组",
        "选项B": "集团董事会",
        "选项C": "集团党组",
        "选项D": "总部党建工作部企业文化部"
    },
    {
        "答案必填": "C",
        "题目必填": "研究指导核心文化理念的提炼与诠释",
        "题型必填": "单选题",
        "选项A": "集团党组",
        "选项B": "集团党建工作部企业文化部",
        "选项C": "集团宣传思想文化工作领导小组",
        "选项D": "集团董事会"
    },
    {
        "答案必填": "B",
        "题目必填": "组织提炼并诠释核心文化理念",
        "题型必填": "单选题",
        "选项A": "集团党组",
        "选项B": "集团党建工作部企业文化部",
        "选项C": "集团宣传思想文化工作领导小组",
        "选项D": "集团董事会"
    },
    {
        "答案必填": "D",
        "题目必填": "中建信条的变更和升级改版要以为指导充分考虑各单位的需求进行变更和升级",
        "题型必填": "单选题",
        "选项A": "二十大精神",
        "选项B": "习近平总书记关于国有企业改革的指示批示精神",
        "选项C": "集团党组制定的方针",
        "选项D": "习近平新时代中国特色社会主义思想"
    },
    {
        "答案必填": "A",
        "题目必填": "负责审批专项文化理念的确立与变更",
        "题型必填": "单选题",
        "选项A": "集团党组",
        "选项B": "集团党建工作部企业文化部",
        "选项C": "集团宣传思想文化工作领导小组",
        "选项D": "集团董事会"
    },
    {
        "答案必填": "C",
        "题目必填": "研究指导专项文化理念的提炼与诠释",
        "题型必填": "单选题",
        "选项A": "集团党组",
        "选项B": "集团党建工作部企业文化部",
        "选项C": "集团宣传思想文化工作领导小组",
        "选项D": "集团董事会"
    },
    {
        "答案必填": "A",
        "题目必填": "提炼专项文化理念提出专项文化口号编发相关专项文化建设管理要求组织策划专项文化宣贯并会商党建工作部企业文化部",
        "题型必填": "单选题",
        "选项A": "相关职能部门",
        "选项B": "集团宣传思想文化工作领导小组",
        "选项C": "相关部门分管领导",
        "选项D": "相关部门负责人"
    },
    {
        "答案必填": "B",
        "题目必填": "确保专项文化理念口号制度与集团核心文化理念口号及管理规定相一致",
        "题型必填": "单选题",
        "选项A": "集团宣传思想文化工作领导小组",
        "选项B": "总部党建工作部企业文化部",
        "选项C": "相关职能部门",
        "选项D": "相关部门分管领导"
    },
    {
        "答案必填": "C",
        "题目必填": "依托党建工作责任制考核对各二级单位企业文化建设工作进行评估",
        "题型必填": "单选题",
        "选项A": "集团总部人力资源管理部门",
        "选项B": "集团总部各职能部门",
        "选项C": "集团党建工作部企业文化部",
        "选项D": "集团总部巡视巡察部门"
    },
    {
        "答案必填": "B",
        "题目必填": "对集团三级及以下单位企业文化工作进行考核",
        "题型必填": "单选题",
        "选项A": "集团各二级单位人力资源部门",
        "选项B": "集团各二级单位企业文化管理部门",
        "选项C": "集团各二级单位党委",
        "选项D": "集团各二级单位巡视巡察部门"
    },
    {
        "答案必填": "D",
        "题目必填": "依托党建工作责任制考核评价结果作为改进和加强企业文化管理的重要依据",
        "题型必填": "单选题",
        "选项A": "集团人力资源部门",
        "选项B": "集团各职能部门",
        "选项C": "集团企划部门",
        "选项D": "集团党建工作部企业文化部"
    },
    {
        "答案必填": "B",
        "题目必填": "将企业文化建设评估结果作为领导干部评价使用和奖惩的重要依据巡视巡察部门将评价结果作为二级单位整改的重要依据",
        "题型必填": "单选题",
        "选项A": "集团党建工作部企业文化部",
        "选项B": "集团总部人力资源管理部门",
        "选项C": "集团企划部门",
        "选项D": "集团各职能部门"
    },
    {
        "答案必填": "A",
        "题目必填": "中国建筑廉洁文化",
        "题型必填": "单选题",
        "选项A": "崇德善建尚廉筑基",
        "选项B": "青春阳光廉洁有为",
        "选项C": "俭以筑廉清风中建",
        "选项D": "清风沐中建廉韵润初心"
    },
    {
        "答案必填": "A",
        "题目必填": "十典九章由部分内容组成",
        "题型必填": "单选题",
        "选项A": "二",
        "选项B": "三",
        "选项C": "四",
        "选项D": "五"
    },
    {
        "答案必填": "B",
        "题目必填": "苟日新日日新又日新对应十典九章中的",
        "题型必填": "单选题",
        "选项A": "专业敬业",
        "选项B": "守正创新",
        "选项C": "品质至上",
        "选项D": "接续奋斗"
    },
    {
        "答案必填": "C",
        "题目必填": "不以规矩不能成方圆对应十典九章中的",
        "题型必填": "单选题",
        "选项A": "守正创新",
        "选项B": "专业敬业",
        "选项C": "规范高效",
        "选项D": "笃诚守信"
    },
    {
        "答案必填": "B",
        "题目必填": "如切如磋如琢如磨对应十典九章中的",
        "题型必填": "单选题",
        "选项A": "适度适宜",
        "选项B": "品质至上",
        "选项C": "自律自省",
        "选项D": "协同联动"
    },
    {
        "答案必填": "D",
        "题目必填": "天行健君子以自强不息对应十典九章中的",
        "题型必填": "单选题",
        "选项A": "守正创新",
        "选项B": "专业敬业",
        "选项C": "主动担当",
        "选项D": "接续奋斗"
    },
    {
        "答案必填": "A",
        "题目必填": "惇信明义崇德报功垂拱而天下治对应十典九章中的",
        "题型必填": "单选题",
        "选项A": "清正廉洁",
        "选项B": "笃诚守信",
        "选项C": "品质至上",
        "选项D": "主动担当"
    },
    {
        "答案必填": "A",
        "题目必填": "我们与外界交往的核心原则是",
        "题型必填": "单选题",
        "选项A": "尊重平等",
        "选项B": "真诚宽容",
        "选项C": "适度适宜",
        "选项D": "自律自省"
    },
    {
        "答案必填": "B",
        "题目必填": "礼仪九章中体现出我们的社交风范",
        "题型必填": "单选题",
        "选项A": "尊重平等",
        "选项B": "真诚宽容",
        "选项C": "适度适宜",
        "选项D": "自律自省"
    },
    {
        "答案必填": "A",
        "题目必填": "是礼仪实践的最高技巧",
        "题型必填": "单选题",
        "选项A": "把握分寸",
        "选项B": "言行一致",
        "选项C": "豁达大度",
        "选项D": "善解人意"
    },
    {
        "答案必填": "D",
        "题目必填": "得体的仪表和举止源于良好的",
        "题型必填": "单选题",
        "选项A": "家庭教育",
        "选项B": "家风熏陶",
        "选项C": "教育背景",
        "选项D": "自我修养"
    },
    {
        "答案必填": "D",
        "题目必填": "每一位员工在对外交往中都代表着",
        "题型必填": "单选题",
        "选项A": "员工个人",
        "选项B": "员工所在部门",
        "选项C": "员工所在行业",
        "选项D": "中国建筑"
    },
    {
        "答案必填": "B",
        "题目必填": "在国际商务场合男士着正装时鞋公文包腰带以同色或近色为宜着装颜色控制在以内",
        "题型必填": "单选题",
        "选项A": "2种",
        "选项B": "3种",
        "选项C": "4种",
        "选项D": "5种"
    },
    {
        "答案必填": "ABC",
        "题目必填": "下列属于举止协调的是",
        "题型必填": "多选题",
        "选项A": "坐姿端庄",
        "选项B": "站姿挺拔",
        "选项C": "行姿稳健",
        "选项D": "坐姿挺拔"
    },
    {
        "答案必填": "A",
        "题目必填": "作为全体中建人的行为规范和标准是中国建筑文化体系的重要组成部分是中国建筑精神统领下的文化理念在员工行为层面外化的结果",
        "题型必填": "单选题",
        "选项A": "行为十典",
        "选项B": "礼仪九章",
        "选项C": "十典九章",
        "选项D": "中建信条"
    },
    {
        "答案必填": "B",
        "题目必填": "是中国建筑员工的礼仪规范按照全球化公司的标准阐明了员工在商务社交场合应注意的礼仪及行为细节是中国建筑员工提高职业修养提升沟通技能树立企业形象的礼仪遵循",
        "题型必填": "单选题",
        "选项A": "行为十典",
        "选项B": "礼仪九章",
        "选项C": "十典九章",
        "选项D": "中建信条"
    },
    {
        "答案必填": "ACD",
        "题目必填": "关于礼仪九章细则中称呼规范的表述正确的有",
        "题型必填": "多选题",
        "选项A": "在正式的官方交往中称主要职务",
        "选项B": "对专家学者或学术方面有造诣的人士称所在机构担任职务",
        "选项C": "对专家学者或学术方面有造诣的人士称学术头衔",
        "选项D": "其它场合可以泛尊称如先生夫人女士等"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "关于礼仪九章细则中网络使用规范的表述正确的有",
        "题型必填": "多选题",
        "选项A": "未经报批同意不擅自以工作职务或单位名义接受媒体采访",
        "选项B": "不以单位名义工作身份在网络平台开通个人账号",
        "选项C": "不发表违法违规等不当言论不擅自针对社会热点敏感议题发表评论",
        "选项D": "不发布涉及企业和工作内容的非公开图片文字视频及相关负面敏感信息",
        "选项E": "不造谣不信谣不传谣"
    },
    {
        "答案必填": "ABD",
        "题目必填": "关于礼仪九章细则中有序握手的表述正确的有",
        "题型必填": "多选题",
        "选项A": "上下级之间上级伸手后下级才能接握",
        "选项B": "长辈与晚辈之间长辈伸手后晚辈才能伸手相握",
        "选项C": "男士和女士之间男士伸手后女士才能伸手相握",
        "选项D": "客人到达时主人先伸手道别时客人先伸手"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "礼仪九章细则中协调具体包括",
        "题型必填": "多选题",
        "选项A": "着装与场合相协调",
        "选项B": "着装色彩协调",
        "选项C": "妆容佩饰协调",
        "选项D": "举止协调"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "自律自省要求我们在社会交往中",
        "题型必填": "多选题",
        "选项A": "严于律己",
        "选项B": "遵时守约",
        "选项C": "遵循规范",
        "选项D": "提高自身修养",
        "选项E": "按章办事"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "在人际交往中要真诚待人理解他人个人行动和自我判断的自由真诚宽容要求我们既要又要",
        "题型必填": "多选题",
        "选项A": "言行一致",
        "选项B": "表里如一",
        "选项C": "豁达大度",
        "选项D": "善解人意"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "适度适宜要求我们在社会交往中一定要具体情况具体分析恰当处理",
        "题型必填": "多选题",
        "选项A": "因人",
        "选项B": "因事",
        "选项C": "因时",
        "选项D": "因地"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "行为十典中主动担当的反对行为包括",
        "题型必填": "多选题",
        "选项A": "借故推辞拈轻怕重",
        "选项B": "推诿扯皮各扫门前雪",
        "选项C": "盲目冒进虎头蛇尾",
        "选项D": "回避与推脱责任",
        "选项E": "不求有功但求无过"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "行为十典中协同联动的反对行为包括",
        "题型必填": "多选题",
        "选项A": "占山头抢资源争眼球",
        "选项B": "个人主义只考虑自己的一亩三分地",
        "选项C": "当面不说背后议论",
        "选项D": "互相拆台营造壁垒损人利己",
        "选项E": "固步自封藏私保留"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "下列属于行为十典中规范高效反对行为的有",
        "题型必填": "多选题",
        "选项A": "损害党和国家利益妄议中央",
        "选项B": "上有政策下有对策",
        "选项C": "不按规则办事对人和事采取双重标准",
        "选项D": "无效工作无价值工作",
        "选项E": "得过且过无所追求"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "行为十典中守正创新的反对行为包括",
        "题型必填": "多选题",
        "选项A": "安于现状因循守旧",
        "选项B": "盲从权威和经验",
        "选项C": "保守自闭闭门造车",
        "选项D": "忽视实效性为创新而创新",
        "选项E": "将创新停留在口号上而非实际的行动和成效上"
    },
    {
        "答案必填": "ABD",
        "题目必填": "行为十典中品质至上的反对行为包括",
        "题型必填": "多选题",
        "选项A": "多一事不如少一事",
        "选项B": "工作抱有差不多心态缺乏高标准",
        "选项C": "得过且过无所追求",
        "选项D": "以次充好低品质换取高速度"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "行为十典中专业敬业的反对行为包括",
        "题型必填": "多选题",
        "选项A": "玩忽职守敷衍了事",
        "选项B": "坐而论道不调研就发言",
        "选项C": "得过且过无所追求",
        "选项D": "走马观花好高骛远"
    },
    {
        "答案必填": "ABDEF",
        "题目必填": "下列属于行为十典中接续奋斗反对行为有",
        "题型必填": "多选题",
        "选项A": "贪图安逸不愿吃苦出力",
        "选项B": "骄傲自满怠惰松懈消极躺平",
        "选项C": "缺乏高标准",
        "选项D": "困难面前当逃兵",
        "选项E": "三分钟热情缺乏韧劲",
        "选项F": "工作缺乏激情放弃更高目标追求"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "下列属于行为十典中清正廉洁反对行为有",
        "题型必填": "多选题",
        "选项A": "搞形象工程做表面文章",
        "选项B": "徇私舞弊徇情枉法",
        "选项C": "拉帮结派任人唯亲",
        "选项D": "掩饰错误诿过他人",
        "选项E": "输送利益吃拿卡要",
        "选项F": "贪图安逸不愿吃苦出力"
    },
    {
        "答案必填": "ABCDEF",
        "题目必填": "下列属于行为十典中绿色人文反对行为有",
        "题型必填": "多选题",
        "选项A": "破坏自然污染环境浪费资源施工扰民损坏公物",
        "选项B": "贪图享受铺张浪费攀比炫富",
        "选项C": "只关注员工使用价值不关注员工情感与发展",
        "选项D": "无视分包分供方合理诉求与困难侵犯合法权益",
        "选项E": "轻视安全漠视生命",
        "选项F": "实施家庭暴力纵容配偶子女干扰邻里生活"
    },
    {
        "答案必填": "ABCDEF",
        "题目必填": "关于十典九章下列描述正确的是",
        "题型必填": "多选题",
        "选项A": "是对习近平文化思想的贯彻落实",
        "选项B": "是实施公民道德建设工程的中建方案",
        "选项C": "是践行中建信条的行动指南",
        "选项D": "以社会主义核心价值观为引领",
        "选项E": "围绕中国建筑文化核心理念落实落地的需求",
        "选项F": "着重从职业素养与礼仪举止对员工的行为提出具体要求"
    },
    {
        "答案必填": "ABCDEF",
        "题目必填": "礼仪九章细则中规范具体内容包括",
        "题型必填": "多选题",
        "选项A": "手机使用规范",
        "选项B": "称呼规范",
        "选项C": "名片使用规范",
        "选项D": "会议规范",
        "选项E": "网络使用规范",
        "选项F": "社交媒体使用规范"
    },
    {
        "答案必填": "ACD",
        "题目必填": "礼仪九章细则中适时具体内容包括",
        "题型必填": "多选题",
        "选项A": "适时接听和结束通话",
        "选项B": "适时用肢体语言表达情感",
        "选项C": "适时通过面部表情表达情感",
        "选项D": "外事交往中适时赠送与接受礼品"
    },
    {
        "答案必填": "BCD",
        "题目必填": "礼仪九章细则中随俗具体内容包括",
        "题型必填": "多选题",
        "选项A": "面部表情随俗",
        "选项B": "肢体语言随俗",
        "选项C": "宴请时随俗",
        "选项D": "交谈话题随俗"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "礼仪九章细则中有序具体内容包括",
        "题型必填": "多选题",
        "选项A": "有序握手",
        "选项B": "有序介绍",
        "选项C": "有序乘梯",
        "选项D": "有序引导",
        "选项E": "有序就座"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "我们聚焦一创五强战略目标以创建的世界一流企业为牵引不断强化价值创造力创新引领力品牌影响力国际竞争力以及文化软实力",
        "题型必填": "多选题",
        "选项A": "产品卓越",
        "选项B": "品牌卓著",
        "选项C": "创新领先",
        "选项D": "治理现代"
    },
    {
        "答案必填": "ACD",
        "题目必填": "我们以为标准聚焦效益效率核心指标创新驱动发展国家战略落实致力效能提升可持续发展共建共享体系能力建设等纬度开展价值创造",
        "题型必填": "多选题",
        "选项A": "为国家担当",
        "选项B": "为民族争光",
        "选项C": "为人民奉献",
        "选项D": "为世界大同"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "随着党中央作出开展三线建设的重大战略决策部署中国建筑的先辈们闻令而动怀着坚定的信念昂扬的激情挺进大西南大西北掀起大三线建设高潮建设完成等国家工业基础建设重点项目以及一系列重点国防工程参与了唐山大地震震后援建高质量高效率完成党中央赋予的重任也在艰苦条件下铸就了未来企业的核心队伍",
        "题型必填": "多选题",
        "选项A": "攀枝花钢铁基地",
        "选项B": "荆门炼油厂",
        "选项C": "贵州赤水天然气化肥厂",
        "选项D": "辽阳石油化学纤维总厂"
    },
    {
        "答案必填": "ABD",
        "题目必填": "在建设时期19491982年铁军精神的核心为",
        "题型必填": "多选题",
        "选项A": "甘于奉献",
        "选项B": "艰苦奋斗",
        "选项C": "吃苦耐劳",
        "选项D": "敢闯敢拼"
    },
    {
        "答案必填": "AC",
        "题目必填": "1989年中国建筑吸收日本大成公司在中国创造的鲁布革经验开启项目管理变革之路提出的改革思路成为国内第一家实现项目管理与劳务分离的建筑企业",
        "题型必填": "多选题",
        "选项A": "对外发展总承包",
        "选项B": "对外开辟",
        "选项C": "对内实行项目法",
        "选项D": "对内改革"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "以下哪些构成了中国建筑改革发展的文化基石",
        "题型必填": "多选题",
        "选项A": "绩效文化",
        "选项B": "铁军文化",
        "选项C": "争先文化",
        "选项D": "品质文化",
        "选项E": "奋斗文化"
    },
    {
        "答案必填": "ABC",
        "题目必填": "十典九章中礼仪九章的总则是自律自省",
        "题型必填": "多选题",
        "选项A": "尊重平等",
        "选项B": "真诚宽容",
        "选项C": "适度适宜",
        "选项D": "协调有序"
    },
    {
        "答案必填": "BCD",
        "题目必填": "十典九章中笃诚守信的反对行为包含哪些方面",
        "题型必填": "多选题",
        "选项A": "重诺守信言行一致",
        "选项B": "虚假承诺言行不一",
        "选项C": "虚报瞒报言过其实",
        "选项D": "诋毁他人搞小动作"
    },
    {
        "答案必填": "BCDE",
        "题目必填": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律其中造福社会包含以下哪些方面",
        "题型必填": "多选题",
        "选项A": "坚持以人为本",
        "选项B": "坚持以人民为中心的发展思想",
        "选项C": "聚焦国家双碳目标树立双碳发展观",
        "选项D": "全面参与新型城镇化建设",
        "选项E": "落实全球发展倡议"
    },
    {
        "答案必填": "BD",
        "题目必填": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律其中成就员工包含以下哪些方面",
        "题型必填": "多选题",
        "选项A": "关注员工利益和需求",
        "选项B": "坚持以人为本",
        "选项C": "获得员工恒久信赖",
        "选项D": "全力打造全球建造的重要人才中心"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "一创五强包括",
        "题型必填": "多选题",
        "选项A": "价值创造力强",
        "选项B": "创新引领力强",
        "选项C": "品牌影响力强",
        "选项D": "国际竞争力强",
        "选项E": "文化软实力强"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "一六六战略路径中六个致力包括致力现代企业治理",
        "题型必填": "多选题",
        "选项A": "致力科技创新驱动",
        "选项B": "致力人才智力支撑",
        "选项C": "致力资本资产运营",
        "选项D": "致力组织机构建强",
        "选项E": "致力低碳数字转型"
    },
    {
        "答案必填": "AC",
        "题目必填": "品质保障的管理要点做人要坚持",
        "题型必填": "多选题",
        "选项A": "品德为先",
        "选项B": "立场为先",
        "选项C": "绩效为重",
        "选项D": "能力为重"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "十典九章中行为十典包括笃诚守信专业敬业主动担当接续奋斗清正廉洁绿色人文",
        "题型必填": "多选题",
        "选项A": "守正创新",
        "选项B": "规范高效",
        "选项C": "品质至上",
        "选项D": "协同联动"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "十典九章中礼仪九章的细则包含以下哪些内容",
        "题型必填": "多选题",
        "选项A": "协调",
        "选项B": "规范",
        "选项C": "适时",
        "选项D": "随俗",
        "选项E": "有序"
    },
    {
        "答案必填": "ABD",
        "题目必填": "十典九章中主动担当要求我们在做到对本职工作尽职尽责的基础上努力达成最佳工作效果对结果负责面对失误敢于承担责任",
        "题型必填": "多选题",
        "选项A": "勇于突破岗位边界",
        "选项B": "挑最重的担子啃最硬的骨头",
        "选项C": "咬定目标不放松把成绩当起点把困难当阶梯",
        "选项D": "敢于斗争善于斗争"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "十典九章中笃诚守信要求我们",
        "题型必填": "多选题",
        "选项A": "诚信正直坦诚相待",
        "选项B": "信守承诺有诺必践不打折扣",
        "选项C": "宁愿丧失利益也不丢失信誉",
        "选项D": "尊重事实传递真实可靠信息",
        "选项E": "珍惜每一天做实每件事"
    },
    {
        "答案必填": "D",
        "题目必填": "项目分级参照公司项目临时设施标准化管理办法中临建分级管理规定执行分为个级别",
        "题型必填": "单选题",
        "选项A": "3",
        "选项B": "4",
        "选项C": "5",
        "选项D": "6"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "CI管理的原则包括",
        "题型必填": "多选题",
        "选项A": "分级管理",
        "选项B": "分级管理",
        "选项C": "分步实施",
        "选项D": "成本控制"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "下列属于项目CI及文明施工管理目的的有",
        "题型必填": "多选题",
        "选项A": "突出全过程全方位价值创造持续强化无效成本管控",
        "选项B": "规范全公司CI及文明施工管理流程",
        "选项C": "统一CI及文明施工标准",
        "选项D": "有效控制CI及文明施工投入成本",
        "选项E": "避免CI及文明施工过度投入"
    },
    {
        "答案必填": "ABD",
        "题目必填": "CI管理主要应对的风险包括",
        "题型必填": "多选题",
        "选项A": "标准不一多次配置造成成本剧增的风险",
        "选项B": "过度投入随意制作造成资源浪费的风险",
        "选项C": "设计不美观不亮眼没有展现企业特色",
        "选项D": "使用不当管理不善造成资产损失的风险"
    },
    {
        "答案必填": "ACD",
        "题目必填": "CI及文明施工类费用包括",
        "题型必填": "多选题",
        "选项A": "安全宣传类费用",
        "选项B": "外部媒体宣传费用",
        "选项C": "文明施工类费用",
        "选项D": "CI类费用"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "项目CI及文明施工投入内容清单中文明施工费用包括",
        "题型必填": "多选题",
        "选项A": "现场围挡的墙面美化",
        "选项B": "材料堆放标牌覆盖",
        "选项C": "室外LED显示",
        "选项D": "其他文明施工类费用"
    },
    {
        "答案必填": "ABCDEF",
        "题目必填": "项目CI及文明施工投入内容清单中CI费用包括",
        "题型必填": "多选题",
        "选项A": "标识标牌",
        "选项B": "企业标志及企业宣传图",
        "选项C": "企业各类图表",
        "选项D": "会议室形象墙",
        "选项E": "彩旗",
        "选项F": "党建团建类"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见中主要任务包括",
        "题型必填": "多选题",
        "选项A": "聚焦凝心铸魂提升思想觉悟",
        "选项B": "聚焦教育引导提升道德水准",
        "选项C": "聚焦实践养成提升文明素养",
        "选项D": "聚焦成风化人强化氛围营造"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦凝心铸魂提升思想觉悟具体举措包括",
        "题型必填": "多选题",
        "选项A": "筑牢理想信念之基",
        "选项B": "践行社会主义核心价值观",
        "选项C": "传承中华优秀传统文化",
        "选项D": "弘扬中国建筑精神",
        "选项E": "提升职业道德"
    },
    {
        "答案必填": "BCDE",
        "题目必填": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦教育引导提升道德水准具体举措包括",
        "题型必填": "多选题",
        "选项A": "传承中华优秀传统文化",
        "选项B": "践行社会公德",
        "选项C": "提升职业道德",
        "选项D": "涵育家庭美德",
        "选项E": "锤炼个人品德"
    },
    {
        "答案必填": "ACDE",
        "题目必填": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦实践养成提升文明素养具体举措包括",
        "题型必填": "多选题",
        "选项A": "深化精神文明创建",
        "选项B": "锤炼个人品德",
        "选项C": "注重礼仪礼节教化作用",
        "选项D": "加强网上道德实践",
        "选项E": "提高国际沟通素养"
    },
    {
        "答案必填": "ABCE",
        "题目必填": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦成风化人强化氛围营造具体举措包括",
        "题型必填": "多选题",
        "选项A": "以中建榜样引领道德风尚",
        "选项B": "以正确舆论营造良好氛围",
        "选项C": "以文艺作品陶冶道德情操",
        "选项D": "加强网上道德实践",
        "选项E": "以廉洁文化构建清廉生态"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "各单位改进和加强企业文化建设的方法步骤包括",
        "题型必填": "多选题",
        "选项A": "评估查找差距",
        "选项B": "发现问题",
        "选项C": "分析原因",
        "选项D": "有针对性地制定有效措施"
    },
    {
        "答案必填": "BD",
        "题目必填": "集团二级及以下单位依照对本单位党员干部职工行为规范进行调整和完善开展榜样选树宣传引导党员干部职工提升思想道德素养",
        "题型必填": "多选题",
        "选项A": "铁军宣言",
        "选项B": "中建信条",
        "选项C": "中国建筑企业文化管理手册",
        "选项D": "十典九章"
    },
    {
        "答案必填": "AB",
        "题目必填": "集团总部职能部门推动企业文化融入",
        "题型必填": "多选题",
        "选项A": "专项战略制定",
        "选项B": "规章制度及员工行为规范",
        "选项C": "企业文化管理规范",
        "选项D": "文化管理体系"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "各单位参加上级单位企业文化交流分享传播平台主要工作包括",
        "题型必填": "多选题",
        "选项A": "参加上级单位组织的文化交流文化宣贯",
        "选项B": "定期归纳总结及分享自身企业文化管理的优秀经验",
        "选项C": "提交企业文化建设成果",
        "选项D": "为企业文化管理提供素材",
        "选项E": "开展企业文化传播"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "针对专项文化管理各单位需做到",
        "题型必填": "多选题",
        "选项A": "理解把握专项文化理念",
        "选项B": "使用专项文化口号",
        "选项C": "组织开展专项文化宣贯",
        "选项D": "践行专项文化要求",
        "选项E": "推动专项文化落实落地"
    },
    {
        "答案必填": "ACE",
        "题目必填": "以下属于集团总部层面关于企业文化落地方面主要工作的是",
        "题型必填": "多选题",
        "选项A": "深化对国有企业新使命新任务的思考认识",
        "选项B": "推动企业文化融入专项战略制定规章制度及员工行为规范",
        "选项C": "建立健全企业文化建设管理体系",
        "选项D": "建立健全企业文化建设管理制度",
        "选项E": "构建企业文化管理规范"
    },
    {
        "答案必填": "ABCD",
        "题目必填": "以下属于集团二级及以下单位层面关于企业文化落地方面主要工作的是",
        "题型必填": "多选题",
        "选项A": "严守企业文化管理规范",
        "选项B": "落实文化管理体系",
        "选项C": "建立健全企业文化建设管理制度",
        "选项D": "推动企业文化融入本单位战略管理日常运营及员工管理"
    },
    {
        "答案必填": "ACDE",
        "题目必填": "党建带团建带工建深化建证党建品牌创建工作筑牢基层战斗堡垒结合活动主题依托等载体开展基层项目青年员工座谈青年工作调研和青年活动将理念深植青年心中带好中国建筑未来生力军",
        "题型必填": "多选题",
        "选项A": "三会一课",
        "选项B": "项目文化示范点",
        "选项C": "主题党日",
        "选项D": "主题团日",
        "选项E": "文明有礼",
        "选项F": "争当中建先锋"
    },
    {
        "答案必填": "BD",
        "题目必填": "组织文明有礼宣贯要做好和坚决杜绝低级红高级黑",
        "题型必填": "多选题",
        "选项A": "内容收集",
        "选项B": "内容审核",
        "选项C": "舆情处置",
        "选项D": "舆情防范"
    },
    {
        "答案必填": "ABC",
        "题目必填": "中建集团文化深化133工作体系中的3个手册包括",
        "题型必填": "多选题",
        "选项A": "中建信条2024版",
        "选项B": "十典九章2024版",
        "选项C": "中建信条十典九章海外文化融合版",
        "选项D": "中建宣言2024版",
        "选项E": "铁军宣言2024版"
    },
    {
        "答案必填": "ACD",
        "题目必填": "中建集团文化深化133工作体系中的3个制度方案是指",
        "题型必填": "多选题",
        "选项A": "中建集团企业文化建设管理规定2024版",
        "选项B": "中建集团中建信条十典九章宣贯实施细则2024版",
        "选项C": "中建信条2024版十典九章2024版中建信条十典九章海外文化融合版宣贯深植方案",
        "选项D": "争做文明有礼中建人活动实施方案"
    },
    {
        "答案必填": "ABD",
        "题目必填": "以下关于中建集团文化深化133工作体系中的133描述正确的是",
        "题型必填": "多选题",
        "选项A": "1个意见",
        "选项B": "3个制度",
        "选项C": "3个方案",
        "选项D": "3个手册"
    },
    {
        "答案必填": "BD",
        "题目必填": "中建集团文化深化133工作体系是集团第二批主题教育的重要成果及长效机制之一是集团全面深化企业文化建设提升党员干部职工思想道德素养的",
        "题型必填": "多选题",
        "选项A": "压舱石",
        "选项B": "路线图",
        "选项C": "指向标",
        "选项D": "方法论"
    },
    {
        "答案必填": "ACDEF",
        "题目必填": "以下属于争做文明有礼中建人活动实施方案中落实十项任务的是",
        "题型必填": "多选题",
        "选项A": "设置文明有礼月",
        "选项B": "夯实基础管理",
        "选项C": "组织文明有礼宣贯",
        "选项D": "践行合规文化",
        "选项E": "选树中建榜样",
        "选项F": "回应相关方期望"
    },
    {
        "答案必填": "ABCDE",
        "题目必填": "弘扬劳动精神劳模精神工匠精神深入开展等建好用好等载体平台提升干部职工职业技能",
        "题型必填": "多选题",
        "选项A": "青年精神素养提升工程",
        "选项B": "中国梦劳动美主题宣教",
        "选项C": "职工劳动和技能竞赛",
        "选项D": "建证幸福书屋",
        "选项E": "素质和技能提升站"
    },
    {
        "答案必填": "错",
        "题目必填": "礼仪九章是对全体员工的关键行为和习惯的倡导及要求",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "行为十典是中国建筑员工的礼仪规范按照全球化公司的标准阐明了员工在商务社交场合应注意的礼仪及行为细节是中国建筑员工提高职业修养提升沟通技能树立企业形象的礼仪遵循",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "行为十典中关键行为明确标准规范对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线对背离中国建筑文化倡导的行为进行高压警示",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "集团三级及以下单位层面遵照中国建筑企业文化管理组织设计的相关规定按照二级单位的要求进行文化管理组织的设计并承担履行相应职责",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "集团宣传思想文化工作领导小组审定企业文化建设总体目标中长期发展规划年度工作计划和重大事项",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "集团层面总部党建工作部企业文化部依据集团党组关于企业文化建设的总体安排编制并完善集团企业文化中长期发展规划年度工作计划规划年度重大事项督促二级单位制定本单位的企业文化年度工作计划",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "集团层面总部党建工作部企业文化部制定部门文化建设工作计划与专项文化推进计划在职能线统筹推进落实",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "集团二级单位党组织负责审定落实本单位企业文化建设年度工作计划可列入年度党建宣传思想思想政治工作计划中年度重大事项",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "集团二级单位层面企业文化管理部门制定并落实企业文化建设年度工作计划可列入年度党建宣传思想思想政治工作计划中规划年度重大事项引领三级及以下单位企业文化建设方向并提供实施指导",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "集团二级单位层面企业文化管理部门落实上级职能部门专项文化建设工作计划或方案实施文化建设工作计划",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "集团党建工作部企业文化部负责收集整理全系统对中建信条修订的意见和建议将中建信条修订版提交到集团宣传思想文化工作领导小组研究报请集团党组审批经集团党组审定后方可面向全系统发布贯彻落实",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "集团三级及以下单位原则上不能编制文化手册只能制定文化执行手册重在贯彻集团核心文化理念和二级单位特定理念在路径和方法上体现特色",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "集团二级单位整合及丰富企业文化物质载体完善企业文化设施搭建企业文化交流分享平台规范企业文化传播渠道",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "集团二级及以下单位制定并落实企业文化宣贯方案将企业文化纳入各级党委工作部的培训体系中开展相关企业文化宣贯",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中国建筑集团有限公司企业文化建设管理规定2024版定自2024年1月5日起施行",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中国建筑集团有限公司企业文化建设管理规定2024版由集团党建工作部企业文化部负责解释修订",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "CI管理流程中项目等级审批在项目进场前参照临建等级审批执行一级项目逐级报公司总经理审批二级及以下项目报公司副总经理生产审批",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "CI管理流程中公司管理平台立项20天内由项目经理根据项目策划组织编制CI及文明施工投入方案方案应包括项目投入内容清单配置标准资金来源投入概算使用周期管理职责分工等内容",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "CI管理流程中项目方案审批完成后3天内依据项目方案编制投入预算并提交预算审批表",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "企业廉洁文化包括高尚的品德廉洁的操行",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线对背离中国建筑文化倡导行为进行高压警示",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中建信条既是中建人对七十余载薪火相传信仰信念的高度凝练也是中建人面向新时代开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉总结提炼中国建筑精神使文化基因与新时代发展相协调形成中国建筑在新形势下团结奋斗的思想基础引领企业上下一心厚植政治优势汇聚发展动能以高质量党建引领和保障高质量发展",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "1997年在天上无飞鸟地上石头跑的巴丹吉林沙漠高质量完成酒泉卫星发射中心建设任务创出三项世界第一一项亚洲第一三项中国第一的建筑奇迹",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "2019年中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中国建筑精神是全体中建人理想信念责任担当价值追求精神风貌政治品格的概括和凝练外化为全体中建人共同具有的工作倾向和态度具体表现为爱国奋斗求实奉献诚信创新超越共赢等维度",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "品质保障的管理要点思想上要树立品质重于泰山品质高于一切的坚定信念",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "在会议中与别人洽谈或用餐时关闭手机或调到静音状态尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "未经报批同意不擅自以工作职务或单位名义接受媒体采访不以单位名义工作身份在网络平台开通个人账号个人账号可随意针对社会热点敏感议题发表评论不发布涉及企业和工作内容的非公开图片文字视频及相关负面敏感信息不造谣不信谣不传谣",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中建信条系统展现中国建筑所坚信并奉行的价值核心是中国建筑为利益相关方所信任并委以重托的依据",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "创新是我们的立业之基",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "发展是我们的价值追求",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "企业廉洁文化包括高尚的品德廉洁的操行",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线对背离中国建筑文化倡导行为进行高压警示",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中建信条既是中建人对七十余载薪火相传信仰信念的高度凝练也是中建人面向新时代开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉总结提炼中国建筑精神使文化基因与新时代发展相协调形成中国建筑在新形势下团结奋斗的思想基础引领企业上下一心厚植政治优势汇聚发展动能以高质量党建引领和保障高质量发展",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "1997年在天上无飞鸟地上石头跑的巴丹吉林沙漠高质量完成酒泉卫星发射中心建设任务创出三项世界第一一项亚洲第一三项中国第一的建筑奇迹",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "2019年中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中国建筑精神是全体中建人理想信念责任担当价值追求精神风貌政治品格的概括和凝练外化为全体中建人共同具有的工作倾向和态度具体表现为爱国奋斗求实奉献诚信创新超越共赢等维度",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "品质保障的管理要点思想上要树立品质重于泰山品质高于一切的坚定信念",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "在会议中与别人洽谈或用餐时关闭手机或调到静音状态尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "未经报批同意不擅自以工作职务或单位名义接受媒体采访不以单位名义工作身份在网络平台开通个人账号个人账号可随意针对社会热点敏感议题发表评论不发布涉及企业和工作内容的非公开图片文字视频及相关负面敏感信息不造谣不信谣不传谣",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "中建信条系统展现中国建筑所坚信并奉行的价值核心是中国建筑为利益相关方所信任并委以重托的依据",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "创新是我们的立业之基",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "1996年6月中建总公司在建筑行业率先导入CI战略进行了CI的设计和推广以内联素质外塑形象推动企业发展",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "2000年12月中建总公司发出中建总公司行为识别规范手册和中建总公司理念识别规范手册",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "1999年4月中建八局承建的酒泉卫星发射基地被评为国家科技进步一等奖为中国建筑行业第一个科技进步奖",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "2010年9月中国建筑向国家商标局申请注册的中国建筑和中国建筑CSCEC各45个类别的商标获得批准中国建筑成为中国建筑股份有限公司的注册商标",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "2008年5月12日汶川地震在抗震救灾过程中中国建筑为四川甘肃等地援建临时安置型住房110万平方米居全国之最中国建筑近年来在地震灾区的51个竣工项目71个在建项目建筑结构主体均未出现问题",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "在北京奥运会工程建设中中建系统共承建了北京奥运会40的场馆及配套设施建设任务",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "2011年2月利比亚战乱经过精心组织中国建筑成功完成10241名中建驻利比亚中国员工及957名孟加拉越南籍员工的利比亚大撤离时任中建八局副局长张作合主持本次大撤离工作",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "1994年6月7日中国工程院公布首批院士96人名单中国建筑西北设计研究院总建筑师全国工程勘察设计大师张锦秋当选为工程院院士这是中建历史上第一个院士",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "2013年12月19日中国工程院公布2013年院士增选结果中建总公司肖绪文同志当选院士这是中建历史上第二个院士",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "2024年4月组织公司领导班子集体学习中建集团文化133工作体系要求和中建集团2024版手册",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "各基层党支部2024年3月依托三会一课主题党日等形式通过集中学习专题研讨座谈交流等形式组织党员开展专题学习",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "人力资源部要将中建集团2024版手册作为公司内部各类培训的基础内容纳入新员工入职培训党员培训等",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "海外分公司要在5月组织好海外员工学习中建信条十典九章海外文化融合版",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "党委工作部要遵循中建集团2024版文化手册局新版铁军宣言文化手册修订公司执行文化手册并报局审阅7月完成发布梳理2015年后三公司还有在局甚至中建系统多少个第一打造个性化",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "依据中建集团2024版手册内容修订CI规范更新机关挂画项目图牌确保各级机关总部项目部实现文化理念全覆盖在建项目6月完成新开项目按新标准执行",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "企划部要将2024版手册中国建筑精神企业使命企业愿景核心价值观等提法与阐释融入企业发展战略和管理制度中使各项制度与企业文化理念保持一致",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "党委工作部要按照中建集团争做文明有礼中建人活动要求宣贯八局相关倡议书组织三公司员工制作主题标语主题海报并积极投稿活动9月完成",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "党群系统要组织项目部积极参与六有六强项目文化示范点创建宣贯新版示范点创建标准细化创建规定性动作督促督导各单位指导项目开展好项目经理接待日分包分供方沟通会文明工地文明班组评比等形式多样的主题活动做好公司年度示范点打擂评比并推荐参加局擂台赛等",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "党群系统要组织开展干部职工网络行为专项培训和舆情应对专项培训组织干部职工媒体采访行为规范十条专项考试开展干部职工言行媒体网络行为个人账号管理等专项治理规范公司员工职业行为提升全员媒介素养与社会沟通能力最迟9月完成",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "公司各业务系统各条线结合业务特点年度工作将文明有礼内容纳入学习培训宣讲宣教竞赛比赛中",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "错",
        "题目必填": "掘选树先进典型和身边榜样培育选树宣传一批在践行中建文化助人为乐见义勇为诚实守信敬业奉献孝老爱亲等方面做出表率的身边榜样在七一之前完成",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "加强贯彻落实中建集团文化深植133工作体系组织领导由党委书记任第一责任人分管领导任直接责任人班子其他成员按照一岗双责要求抓好分管部门和领域的文化建设工作党委工作部牵头组织协调落实",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "公司总部各部门要认真贯彻落实集团要求按照公司工作方案结合本部门工作制定切实可行的工作计划明确时间节点细化责任分工确保宣贯工作取得实效",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },
    {
        "答案必填": "对",
        "题目必填": "党委工作部要将总结推广工作中涌现的好经验好做法组织评选优秀案例并将工作开展情况纳入月度考核和年度党建工作责任制考核",
        "题型必填": "判断题",
        "选项A": "对",
        "选项B": "错"
    },


    {
        "ANS": "A",
        "Q": "中建集团的企业使命",
        "TYPE": "单选题",
        "A": "拓展幸福空间",
        "B": "建造业主满意工程",
        "C": "品质保证",
        "D": "价值创造"
    },
    {
        "ANS": "A",
        "Q": "中国建筑精神是",
        "TYPE": "单选题",
        "A": "忠诚担当使命必达",
        "B": "敬业求实创新争先",
        "C": "诚信创新超越共赢",
        "D": "品质保障价值创造"
    },
    {
        "ANS": "B",
        "Q": "始终秉承通过高品质的服务实现与各利益相关方的共赢和价值的最大化",
        "TYPE": "单选题",
        "A": "廉洁文化",
        "B": "绩效文化",
        "C": "铁军文化",
        "D": "奋斗文化"
    },
    {
        "ANS": "A",
        "Q": "中国建筑始终传承服务党和国家事业发展勇于改革创新推进高质量发展始终将使命追求融入中华民族伟大复兴中国梦与时代同行与祖国共进",
        "TYPE": "单选题",
        "A": "红色基因",
        "B": "蓝色力量",
        "C": "绿色发展"
    },
    {
        "ANS": "B",
        "Q": "年国家建工总局在香港注册成立了中国海外建筑工程有限公司从事对外工程承包和劳务合作",
        "TYPE": "单选题",
        "A": "1978",
        "B": "1979",
        "C": "1980",
        "D": "1981"
    },
    {
        "ANS": "D",
        "Q": "1996年中国建筑在深圳地王大厦创造了两天半一个结构层的",
        "TYPE": "单选题",
        "A": "中国速度",
        "B": "中建速度",
        "C": "深圳速度",
        "D": "新深圳速度"
    },
    {
        "ANS": "A",
        "Q": "年中国建筑首次亮相财富世界500强位列486位",
        "TYPE": "单选题",
        "A": "2006",
        "B": "2007",
        "C": "2008",
        "D": "2009"
    },
    {
        "ANS": "A",
        "Q": "是我们的立业之基",
        "TYPE": "单选题",
        "A": "诚信",
        "B": "奋斗",
        "C": "爱国",
        "D": "求实"
    },
    {
        "ANS": "D",
        "Q": "是我们的工作作风",
        "TYPE": "单选题",
        "A": "诚信",
        "B": "奋斗",
        "C": "超越",
        "D": "求实"
    },
    {
        "ANS": "B",
        "Q": "是我们的价值追求",
        "TYPE": "单选题",
        "A": "创新",
        "B": "共赢",
        "C": "超越",
        "D": "奉献"
    },
    {
        "ANS": "C",
        "Q": "是我们的精神品格",
        "TYPE": "单选题",
        "A": "爱国",
        "B": "诚信",
        "C": "奉献",
        "D": "求实"
    },
    {
        "ANS": "D",
        "Q": "提高是国有企业做好一切工作的首要前提国有企业的最大优势是政治优势作为我国建筑领域唯一一家由中央直接管理的国有重要骨干企业集团必须旗帜鲜明讲政治把提高政治站位摆在首位",
        "TYPE": "单选题",
        "A": "企业效益",
        "B": "责任担当",
        "C": "职业素养",
        "D": "政治站位"
    },
    {
        "ANS": "C",
        "Q": "用众人之力则无不胜也形容的是十典九章中的哪项内容",
        "TYPE": "单选题",
        "A": "规范高效",
        "B": "品质之上",
        "C": "协同联动",
        "D": "清正廉洁"
    },
    {
        "ANS": "B",
        "Q": "功崇惟志业广惟勤形容的是十典九章中的哪项内容",
        "TYPE": "单选题",
        "A": "规范高效",
        "B": "专业敬业",
        "C": "品质之上",
        "D": "笃诚守信"
    },
    {
        "ANS": "C",
        "Q": "年中国建筑工程总公司更名为中国建筑集团有限公司",
        "TYPE": "单选题",
        "A": "2015",
        "B": "2016",
        "C": "2017",
        "D": "2018"
    },
    {
        "ANS": "D",
        "Q": "年中国建筑位列财富世界500强第9位",
        "TYPE": "单选题",
        "A": "2019",
        "B": "2020",
        "C": "2021",
        "D": "2022"
    },
    {
        "ANS": "C",
        "Q": "是我们跨越发展永葆生机和活力的动力之源我们遵循市场经济规律和企业发展规律主动识别适应外部环境变化致力营造激发组织和个人活力的创新氛围",
        "TYPE": "单选题",
        "A": "规范高效",
        "B": "专业敬业",
        "C": "守正创新",
        "D": "接续奋斗"
    },
    {
        "ANS": "D",
        "Q": "十典九章中礼仪九章的随俗细则包含肢体语言随俗宴请时随俗",
        "TYPE": "单选题",
        "A": "着装随俗",
        "B": "称呼随俗",
        "C": "赠礼随俗",
        "D": "交谈话题随俗"
    },
    {
        "ANS": "A",
        "Q": "是我们契约精神和高品质履约的体现是我们的生命线",
        "TYPE": "单选题",
        "A": "笃诚守信",
        "B": "专业敬业",
        "C": "守正创新",
        "D": "规范高效"
    },
    {
        "ANS": "C",
        "Q": "是我们跨越发展永葆生机和活力的动力之源",
        "TYPE": "单选题",
        "A": "品质至上",
        "B": "协同联动",
        "C": "守正创新",
        "D": "规范高效"
    },
    {
        "ANS": "B",
        "Q": "是我们必须坚守的政治操守和工作底线意味着我们以廉为规行有所止崇德兼爱尚廉守矩",
        "TYPE": "单选题",
        "A": "品质至上",
        "B": "清正廉洁",
        "C": "专业敬业",
        "D": "守正创新"
    },
    {
        "ANS": "A",
        "Q": "中建集团文化深化133工作体系中的1个意见是指",
        "TYPE": "单选题",
        "A": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见",
        "B": "关于进一步提升中建集团企业文化影响力的实施意见",
        "C": "关于进一步深化中建集团党员干部企业文化认识的指导意见",
        "D": "关于进一步强化中建集团企业文化影响力的指导意见"
    },
    {
        "ANS": "BCD",
        "Q": "以下不属于中建集团文化深化133工作体系中的3个手册的是",
        "TYPE": "单选题",
        "A": "铁军宣言2024版",
        "B": "十典九章2024版",
        "C": "中建信条十典九章海外文化融合版",
        "D": "中建信条2024版"
    },
    {
        "ANS": "BCD",
        "Q": "下列不属于中建集团文化深化133工作体系中的工作方法的是",
        "TYPE": "单选题",
        "A": "统筹兼顾",
        "B": "提高认识",
        "C": "把握要义",
        "D": "统筹推进"
    },
    {
        "ANS": "C",
        "Q": "结合国家全民文明礼貌月科技创新周集团质量月纪法教育月等将每年月设置为集团文明有礼月集中开展系列文明有礼主题活动",
        "TYPE": "单选题",
        "A": "8月",
        "B": "12月",
        "C": "3月",
        "D": "7月"
    },
    {
        "ANS": "B",
        "Q": "回应相关方期望践行优良传统通过设置专用信箱邮箱员工接待日等了解员工思想动态回应实际诉求",
        "TYPE": "单选题",
        "A": "服务基层",
        "B": "四下基层",
        "C": "基层导向",
        "D": "问题导向"
    },
    {
        "ANS": "B",
        "Q": "中建集团文化深化133工作体系是集团的重要成果及长效机制之一",
        "TYPE": "单选题",
        "A": "第一批主题教育",
        "B": "第二批主题教育",
        "C": "第一轮巡视",
        "D": "党史学习教育"
    },
    {
        "ANS": "C",
        "Q": "规范网络言行开展干部职工网络行为专项培训严格落实集团",
        "TYPE": "单选题",
        "A": "干部职工媒介素养提升行动方案",
        "B": "干部职工新闻媒体采访行为规范指导意见",
        "C": "干部职工媒体采访行为规范十条",
        "D": "中建集团推进网络文明专项行动方案实施细则"
    },
    {
        "ANS": "D",
        "Q": "落实安全文化在项目运用持续提升全员日常安全管理意识和管理水平",
        "TYPE": "单选题",
        "A": "施工安全三步法",
        "B": "文明施工四步法",
        "C": "安全生产六步法",
        "D": "行为安全七步法"
    },
    {
        "ANS": "A",
        "Q": "践行合规文化组建面向项目部管理人员开展合规培训交流举办合规知识竞赛制作推广合规海报微视频广泛营造合规氛围",
        "TYPE": "单选题",
        "A": "合规讲师团",
        "B": "合规宣讲团",
        "C": "合规考察组",
        "D": "合规调研队"
    },
    {
        "ANS": "B",
        "Q": "选树中建榜样组织宣讲团进基层进项目宣讲身边榜样先进事迹",
        "TYPE": "单选题",
        "A": "红色先锋",
        "B": "建证力量",
        "C": "建证先锋",
        "D": "红色基石"
    },
    {
        "ANS": "A",
        "Q": "中建集团企业文化管理的组织架构体系在总部二级单位三级及以下单位三个层面中各级党组织企业文化管理部门各职能部门有效联动以为原则充分发挥党组织把方向管大局保落实的领导作用全面领会普遍原理学深悟透国企篇章运用党的创新理论共同完成企业文化建设相关工作",
        "TYPE": "单选题",
        "A": "坚持党对一切工作的领导",
        "B": "文化强企",
        "C": "文化自信",
        "D": "党管文化"
    },
    {
        "ANS": "D",
        "Q": "集团总部层面是中建集团企业文化管理的最高领导机构对全系统企业文化建设与管理进行总体决策与指导",
        "TYPE": "单选题",
        "A": "集团党建工作部",
        "B": "集团企业文化部",
        "C": "集团董事会",
        "D": "集团党组"
    },
    {
        "ANS": "B",
        "Q": "集团总部层面对全系统企业文化建设重大事项进行研究提出意见和建议",
        "TYPE": "单选题",
        "A": "集团宣传意识形态工作领导小组",
        "B": "集团宣传思想文化工作领导小组",
        "C": "集团宣传企业文化工作领导小组",
        "D": "集团企业品牌文化建设工作领导小组"
    },
    {
        "ANS": "C",
        "Q": "集团总部层面是中建集团企业文化建设及管理工作执行管理机构对各单位企业文化建设进行指导管理与监督",
        "TYPE": "单选题",
        "A": "集团党组",
        "B": "集团宣传思想文化工作领导小组",
        "C": "总部党建工作部",
        "D": "集团董事会"
    },
    {
        "ANS": "B",
        "Q": "集团总部层面是本部门企业文化建设及管理工作的第一责任人主要负责本部门文化建设及管理工作的开展与专项文化的推进",
        "TYPE": "单选题",
        "A": "部门分管领导",
        "B": "部门主管",
        "C": "分管文化宣传的部门副职",
        "D": "上级部门指定的部门企业文化管理人员"
    },
    {
        "ANS": "B",
        "Q": "集团二级单位层面是该单位企业文化建设和管理的领导机构负责本单位企业文化建设与管理工作的整体把控推进母子文化对接和融合指导本单位文化工作的开展并对所属单位企业文化工作进行决策与指导",
        "TYPE": "单选题",
        "A": "二级单位党委工作部",
        "B": "二级单位党组织",
        "C": "二级单位企划部",
        "D": "二级单位宣传部"
    },
    {
        "ANS": "D",
        "Q": "集团二级单位层面是该单位企业文化建设及管理工作的执行管理机构对其下属单位企业文化建设及管理工作进行管理服务与监督",
        "TYPE": "单选题",
        "A": "二级单位党委",
        "B": "二级单位宣传部",
        "C": "二级单位企划部",
        "D": "二级单位企业文化管理部门"
    },
    {
        "ANS": "A",
        "Q": "集团二级单位层面是本部门企业文化建设及管理工作的第一责任人接受本单位党组织的指导负责本部门文化建设及管理工作的开展与专项文化的推进",
        "TYPE": "单选题",
        "A": "职能部门的部门主管",
        "B": "上级部门指定的部门企业文化管理人员",
        "C": "部门分管领导",
        "D": "分管文化宣传的部门副职"
    },
    {
        "ANS": "C",
        "Q": "是中国建筑核心文化理念确立与变更的审批机构定义并更新中国建筑精神企业使命企业愿景核心价值观等核心理念",
        "TYPE": "单选题",
        "A": "集团宣传思想文化工作领导小组",
        "B": "集团董事会",
        "C": "集团党组",
        "D": "总部党建工作部企业文化部"
    },
    {
        "ANS": "C",
        "Q": "研究指导核心文化理念的提炼与诠释",
        "TYPE": "单选题",
        "A": "集团党组",
        "B": "集团党建工作部企业文化部",
        "C": "集团宣传思想文化工作领导小组",
        "D": "集团董事会"
    },
    {
        "ANS": "B",
        "Q": "组织提炼并诠释核心文化理念",
        "TYPE": "单选题",
        "A": "集团党组",
        "B": "集团党建工作部企业文化部",
        "C": "集团宣传思想文化工作领导小组",
        "D": "集团董事会"
    },
    {
        "ANS": "D",
        "Q": "中建信条的变更和升级改版要以为指导充分考虑各单位的需求进行变更和升级",
        "TYPE": "单选题",
        "A": "二十大精神",
        "B": "习近平总书记关于国有企业改革的指示批示精神",
        "C": "集团党组制定的方针",
        "D": "习近平新时代中国特色社会主义思想"
    },
    {
        "ANS": "A",
        "Q": "负责审批专项文化理念的确立与变更",
        "TYPE": "单选题",
        "A": "集团党组",
        "B": "集团党建工作部企业文化部",
        "C": "集团宣传思想文化工作领导小组",
        "D": "集团董事会"
    },
    {
        "ANS": "C",
        "Q": "研究指导专项文化理念的提炼与诠释",
        "TYPE": "单选题",
        "A": "集团党组",
        "B": "集团党建工作部企业文化部",
        "C": "集团宣传思想文化工作领导小组",
        "D": "集团董事会"
    },
    {
        "ANS": "A",
        "Q": "提炼专项文化理念提出专项文化口号编发相关专项文化建设管理要求组织策划专项文化宣贯并会商党建工作部企业文化部",
        "TYPE": "单选题",
        "A": "相关职能部门",
        "B": "集团宣传思想文化工作领导小组",
        "C": "相关部门分管领导",
        "D": "相关部门负责人"
    },
    {
        "ANS": "B",
        "Q": "确保专项文化理念口号制度与集团核心文化理念口号及管理规定相一致",
        "TYPE": "单选题",
        "A": "集团宣传思想文化工作领导小组",
        "B": "总部党建工作部企业文化部",
        "C": "相关职能部门",
        "D": "相关部门分管领导"
    },
    {
        "ANS": "C",
        "Q": "依托党建工作责任制考核对各二级单位企业文化建设工作进行评估",
        "TYPE": "单选题",
        "A": "集团总部人力资源管理部门",
        "B": "集团总部各职能部门",
        "C": "集团党建工作部企业文化部",
        "D": "集团总部巡视巡察部门"
    },
    {
        "ANS": "B",
        "Q": "对集团三级及以下单位企业文化工作进行考核",
        "TYPE": "单选题",
        "A": "集团各二级单位人力资源部门",
        "B": "集团各二级单位企业文化管理部门",
        "C": "集团各二级单位党委",
        "D": "集团各二级单位巡视巡察部门"
    },
    {
        "ANS": "D",
        "Q": "依托党建工作责任制考核评价结果作为改进和加强企业文化管理的重要依据",
        "TYPE": "单选题",
        "A": "集团人力资源部门",
        "B": "集团各职能部门",
        "C": "集团企划部门",
        "D": "集团党建工作部企业文化部"
    },
    {
        "ANS": "B",
        "Q": "将企业文化建设评估结果作为领导干部评价使用和奖惩的重要依据巡视巡察部门将评价结果作为二级单位整改的重要依据",
        "TYPE": "单选题",
        "A": "集团党建工作部企业文化部",
        "B": "集团总部人力资源管理部门",
        "C": "集团企划部门",
        "D": "集团各职能部门"
    },
    {
        "ANS": "A",
        "Q": "中国建筑廉洁文化",
        "TYPE": "单选题",
        "A": "崇德善建尚廉筑基",
        "B": "青春阳光廉洁有为",
        "C": "俭以筑廉清风中建",
        "D": "清风沐中建廉韵润初心"
    },
    {
        "ANS": "A",
        "Q": "十典九章由部分内容组成",
        "TYPE": "单选题",
        "A": "二",
        "B": "三",
        "C": "四",
        "D": "五"
    },
    {
        "ANS": "B",
        "Q": "苟日新日日新又日新对应十典九章中的",
        "TYPE": "单选题",
        "A": "专业敬业",
        "B": "守正创新",
        "C": "品质至上",
        "D": "接续奋斗"
    },
    {
        "ANS": "C",
        "Q": "不以规矩不能成方圆对应十典九章中的",
        "TYPE": "单选题",
        "A": "守正创新",
        "B": "专业敬业",
        "C": "规范高效",
        "D": "笃诚守信"
    },
    {
        "ANS": "B",
        "Q": "如切如磋如琢如磨对应十典九章中的",
        "TYPE": "单选题",
        "A": "适度适宜",
        "B": "品质至上",
        "C": "自律自省",
        "D": "协同联动"
    },
    {
        "ANS": "D",
        "Q": "天行健君子以自强不息对应十典九章中的",
        "TYPE": "单选题",
        "A": "守正创新",
        "B": "专业敬业",
        "C": "主动担当",
        "D": "接续奋斗"
    },
    {
        "ANS": "A",
        "Q": "惇信明义崇德报功垂拱而天下治对应十典九章中的",
        "TYPE": "单选题",
        "A": "清正廉洁",
        "B": "笃诚守信",
        "C": "品质至上",
        "D": "主动担当"
    },
    {
        "ANS": "A",
        "Q": "我们与外界交往的核心原则是",
        "TYPE": "单选题",
        "A": "尊重平等",
        "B": "真诚宽容",
        "C": "适度适宜",
        "D": "自律自省"
    },
    {
        "ANS": "B",
        "Q": "礼仪九章中体现出我们的社交风范",
        "TYPE": "单选题",
        "A": "尊重平等",
        "B": "真诚宽容",
        "C": "适度适宜",
        "D": "自律自省"
    },
    {
        "ANS": "A",
        "Q": "是礼仪实践的最高技巧",
        "TYPE": "单选题",
        "A": "把握分寸",
        "B": "言行一致",
        "C": "豁达大度",
        "D": "善解人意"
    },
    {
        "ANS": "D",
        "Q": "得体的仪表和举止源于良好的",
        "TYPE": "单选题",
        "A": "家庭教育",
        "B": "家风熏陶",
        "C": "教育背景",
        "D": "自我修养"
    },
    {
        "ANS": "D",
        "Q": "每一位员工在对外交往中都代表着",
        "TYPE": "单选题",
        "A": "员工个人",
        "B": "员工所在部门",
        "C": "员工所在行业",
        "D": "中国建筑"
    },
    {
        "ANS": "B",
        "Q": "在国际商务场合男士着正装时鞋公文包腰带以同色或近色为宜着装颜色控制在以内",
        "TYPE": "单选题",
        "A": "2种",
        "B": "3种",
        "C": "4种",
        "D": "5种"
    },
    {
        "ANS": "ABC",
        "Q": "下列属于举止协调的是",
        "TYPE": "单选题",
        "A": "坐姿端庄",
        "B": "站姿挺拔",
        "C": "行姿稳健",
        "D": "坐姿挺拔"
    },
    {
        "ANS": "A",
        "Q": "作为全体中建人的行为规范和标准是中国建筑文化体系的重要组成部分是中国建筑精神统领下的文化理念在员工行为层面外化的结果",
        "TYPE": "单选题",
        "A": "行为十典",
        "B": "礼仪九章",
        "C": "十典九章",
        "D": "中建信条"
    },
    {
        "ANS": "B",
        "Q": "是中国建筑员工的礼仪规范按照全球化公司的标准阐明了员工在商务社交场合应注意的礼仪及行为细节是中国建筑员工提高职业修养提升沟通技能树立企业形象的礼仪遵循",
        "TYPE": "单选题",
        "A": "行为十典",
        "B": "礼仪九章",
        "C": "十典九章",
        "D": "中建信条"
    },
    {
        "ANS": "ACD",
        "Q": "关于礼仪九章细则中称呼规范的表述正确的有",
        "TYPE": "多选题",
        "A": "在正式的官方交往中称主要职务",
        "B": "对专家学者或学术方面有造诣的人士称所在机构担任职务",
        "C": "对专家学者或学术方面有造诣的人士称学术头衔",
        "D": "其它场合可以泛尊称如先生夫人女士等"
    },
    {
        "ANS": "ABCDE",
        "Q": "关于礼仪九章细则中网络使用规范的表述正确的有",
        "TYPE": "多选题",
        "A": "未经报批同意不擅自以工作职务或单位名义接受媒体采访",
        "B": "不以单位名义工作身份在网络平台开通个人账号",
        "C": "不发表违法违规等不当言论不擅自针对社会热点敏感议题发表评论",
        "D": "不发布涉及企业和工作内容的非公开图片文字视频及相关负面敏感信息",
        "E": "不造谣不信谣不传谣"
    },
    {
        "ANS": "ABD",
        "Q": "关于礼仪九章细则中有序握手的表述正确的有",
        "TYPE": "多选题",
        "A": "上下级之间上级伸手后下级才能接握",
        "B": "长辈与晚辈之间长辈伸手后晚辈才能伸手相握",
        "C": "男士和女士之间男士伸手后女士才能伸手相握",
        "D": "客人到达时主人先伸手道别时客人先伸手"
    },
    {
        "ANS": "ABCD",
        "Q": "礼仪九章细则中协调具体包括",
        "TYPE": "多选题",
        "A": "着装与场合相协调",
        "B": "着装色彩协调",
        "C": "妆容佩饰协调",
        "D": "举止协调"
    },
    {
        "ANS": "ABCD",
        "Q": "自律自省要求我们在社会交往中",
        "TYPE": "多选题",
        "A": "严于律己",
        "B": "遵时守约",
        "C": "遵循规范",
        "D": "提高自身修养",
        "E": "按章办事"
    },
    {
        "ANS": "ABCD",
        "Q": "在人际交往中要真诚待人理解他人个人行动和自我判断的自由真诚宽容要求我们既要又要",
        "TYPE": "多选题",
        "A": "言行一致",
        "B": "表里如一",
        "C": "豁达大度",
        "D": "善解人意"
    },
    {
        "ANS": "ABCD",
        "Q": "适度适宜要求我们在社会交往中一定要具体情况具体分析恰当处理",
        "TYPE": "多选题",
        "A": "因人",
        "B": "因事",
        "C": "因时",
        "D": "因地"
    },
    {
        "ANS": "ABCDE",
        "Q": "行为十典中主动担当的反对行为包括",
        "TYPE": "多选题",
        "A": "借故推辞拈轻怕重",
        "B": "推诿扯皮各扫门前雪",
        "C": "盲目冒进虎头蛇尾",
        "D": "回避与推脱责任",
        "E": "不求有功但求无过"
    },
    {
        "ANS": "ABCDE",
        "Q": "行为十典中协同联动的反对行为包括",
        "TYPE": "多选题",
        "A": "占山头抢资源争眼球",
        "B": "个人主义只考虑自己的一亩三分地",
        "C": "当面不说背后议论",
        "D": "互相拆台营造壁垒损人利己",
        "E": "固步自封藏私保留"
    },
    {
        "ANS": "ABCD",
        "Q": "下列属于行为十典中规范高效反对行为的有",
        "TYPE": "多选题",
        "A": "损害党和国家利益妄议中央",
        "B": "上有政策下有对策",
        "C": "不按规则办事对人和事采取双重标准",
        "D": "无效工作无价值工作",
        "E": "得过且过无所追求"
    },
    {
        "ANS": "ABCDE",
        "Q": "行为十典中守正创新的反对行为包括",
        "TYPE": "多选题",
        "A": "安于现状因循守旧",
        "B": "盲从权威和经验",
        "C": "保守自闭闭门造车",
        "D": "忽视实效性为创新而创新",
        "E": "将创新停留在口号上而非实际的行动和成效上"
    },
    {
        "ANS": "ABD",
        "Q": "行为十典中品质至上的反对行为包括",
        "TYPE": "多选题",
        "A": "多一事不如少一事",
        "B": "工作抱有差不多心态缺乏高标准",
        "C": "得过且过无所追求",
        "D": "以次充好低品质换取高速度"
    },
    {
        "ANS": "ABCD",
        "Q": "行为十典中专业敬业的反对行为包括",
        "TYPE": "多选题",
        "A": "玩忽职守敷衍了事",
        "B": "坐而论道不调研就发言",
        "C": "得过且过无所追求",
        "D": "走马观花好高骛远"
    },
    {
        "ANS": "ABDEF",
        "Q": "下列属于行为十典中接续奋斗反对行为有",
        "TYPE": "多选题",
        "A": "贪图安逸不愿吃苦出力",
        "B": "骄傲自满怠惰松懈消极躺平",
        "C": "缺乏高标准",
        "D": "困难面前当逃兵",
        "E": "三分钟热情缺乏韧劲",
        "F": "工作缺乏激情放弃更高目标追求"
    },
    {
        "ANS": "ABCDE",
        "Q": "下列属于行为十典中清正廉洁反对行为有",
        "TYPE": "多选题",
        "A": "搞形象工程做表面文章",
        "B": "徇私舞弊徇情枉法",
        "C": "拉帮结派任人唯亲",
        "D": "掩饰错误诿过他人",
        "E": "输送利益吃拿卡要",
        "F": "贪图安逸不愿吃苦出力"
    },
    {
        "ANS": "ABCDEF",
        "Q": "下列属于行为十典中绿色人文反对行为有",
        "TYPE": "多选题",
        "A": "破坏自然污染环境浪费资源施工扰民损坏公物",
        "B": "贪图享受铺张浪费攀比炫富",
        "C": "只关注员工使用价值不关注员工情感与发展",
        "D": "无视分包分供方合理诉求与困难侵犯合法权益",
        "E": "轻视安全漠视生命",
        "F": "实施家庭暴力纵容配偶子女干扰邻里生活"
    },
    {
        "ANS": "ABCDEF",
        "Q": "关于十典九章下列描述正确的是",
        "TYPE": "多选题",
        "A": "是对习近平文化思想的贯彻落实",
        "B": "是实施公民道德建设工程的中建方案",
        "C": "是践行中建信条的行动指南",
        "D": "以社会主义核心价值观为引领",
        "E": "围绕中国建筑文化核心理念落实落地的需求",
        "F": "着重从职业素养与礼仪举止对员工的行为提出具体要求"
    },
    {
        "ANS": "ABCDEF",
        "Q": "礼仪九章细则中规范具体内容包括",
        "TYPE": "多选题",
        "A": "手机使用规范",
        "B": "称呼规范",
        "C": "名片使用规范",
        "D": "会议规范",
        "E": "网络使用规范",
        "F": "社交媒体使用规范"
    },
    {
        "ANS": "ACD",
        "Q": "礼仪九章细则中适时具体内容包括",
        "TYPE": "多选题",
        "A": "适时接听和结束通话",
        "B": "适时用肢体语言表达情感",
        "C": "适时通过面部表情表达情感",
        "D": "外事交往中适时赠送与接受礼品"
    },
    {
        "ANS": "BCD",
        "Q": "礼仪九章细则中随俗具体内容包括",
        "TYPE": "多选题",
        "A": "面部表情随俗",
        "B": "肢体语言随俗",
        "C": "宴请时随俗",
        "D": "交谈话题随俗"
    },
    {
        "ANS": "ABCDE",
        "Q": "礼仪九章细则中有序具体内容包括",
        "TYPE": "多选题",
        "A": "有序握手",
        "B": "有序介绍",
        "C": "有序乘梯",
        "D": "有序引导",
        "E": "有序就座"
    },
    {
        "ANS": "ABCD",
        "Q": "我们聚焦一创五强战略目标以创建的世界一流企业为牵引不断强化价值创造力创新引领力品牌影响力国际竞争力以及文化软实力",
        "TYPE": "多选题",
        "A": "产品卓越",
        "B": "品牌卓著",
        "C": "创新领先",
        "D": "治理现代"
    },
    {
        "ANS": "ACD",
        "Q": "我们以为标准聚焦效益效率核心指标创新驱动发展国家战略落实致力效能提升可持续发展共建共享体系能力建设等纬度开展价值创造",
        "TYPE": "多选题",
        "A": "为国家担当",
        "B": "为民族争光",
        "C": "为人民奉献",
        "D": "为世界大同"
    },
    {
        "ANS": "ABCD",
        "Q": "随着党中央作出开展三线建设的重大战略决策部署中国建筑的先辈们闻令而动怀着坚定的信念昂扬的激情挺进大西南大西北掀起大三线建设高潮建设完成等国家工业基础建设重点项目以及一系列重点国防工程参与了唐山大地震震后援建高质量高效率完成党中央赋予的重任也在艰苦条件下铸就了未来企业的核心队伍",
        "TYPE": "多选题",
        "A": "攀枝花钢铁基地",
        "B": "荆门炼油厂",
        "C": "贵州赤水天然气化肥厂",
        "D": "辽阳石油化学纤维总厂"
    },
    {
        "ANS": "ABD",
        "Q": "在建设时期19491982年铁军精神的核心为",
        "TYPE": "多选题",
        "A": "甘于奉献",
        "B": "艰苦奋斗",
        "C": "吃苦耐劳",
        "D": "敢闯敢拼"
    },
    {
        "ANS": "AC",
        "Q": "1989年中国建筑吸收日本大成公司在中国创造的鲁布革经验开启项目管理变革之路提出的改革思路成为国内第一家实现项目管理与劳务分离的建筑企业",
        "TYPE": "多选题",
        "A": "对外发展总承包",
        "B": "对外开辟",
        "C": "对内实行项目法",
        "D": "对内改革"
    },
    {
        "ANS": "ABCD",
        "Q": "以下哪些构成了中国建筑改革发展的文化基石",
        "TYPE": "多选题",
        "A": "绩效文化",
        "B": "铁军文化",
        "C": "争先文化",
        "D": "品质文化",
        "E": "奋斗文化"
    },
    {
        "ANS": "ABC",
        "Q": "十典九章中礼仪九章的总则是自律自省",
        "TYPE": "多选题",
        "A": "尊重平等",
        "B": "真诚宽容",
        "C": "适度适宜",
        "D": "协调有序"
    },
    {
        "ANS": "BCD",
        "Q": "十典九章中笃诚守信的反对行为包含哪些方面",
        "TYPE": "多选题",
        "A": "重诺守信言行一致",
        "B": "虚假承诺言行不一",
        "C": "虚报瞒报言过其实",
        "D": "诋毁他人搞小动作"
    },
    {
        "ANS": "BCDE",
        "Q": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律其中造福社会包含以下哪些方面",
        "TYPE": "多选题",
        "A": "坚持以人为本",
        "B": "坚持以人民为中心的发展思想",
        "C": "聚焦国家双碳目标树立双碳发展观",
        "D": "全面参与新型城镇化建设",
        "E": "落实全球发展倡议"
    },
    {
        "ANS": "BD",
        "Q": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律其中成就员工包含以下哪些方面",
        "TYPE": "多选题",
        "A": "关注员工利益和需求",
        "B": "坚持以人为本",
        "C": "获得员工恒久信赖",
        "D": "全力打造全球建造的重要人才中心"
    },
    {
        "ANS": "ABCDE",
        "Q": "一创五强包括",
        "TYPE": "多选题",
        "A": "价值创造力强",
        "B": "创新引领力强",
        "C": "品牌影响力强",
        "D": "国际竞争力强",
        "E": "文化软实力强"
    },
    {
        "ANS": "ABCDE",
        "Q": "一六六战略路径中六个致力包括致力现代企业治理",
        "TYPE": "多选题",
        "A": "致力科技创新驱动",
        "B": "致力人才智力支撑",
        "C": "致力资本资产运营",
        "D": "致力组织机构建强",
        "E": "致力低碳数字转型"
    },
    {
        "ANS": "AC",
        "Q": "品质保障的管理要点做人要坚持",
        "TYPE": "多选题",
        "A": "品德为先",
        "B": "立场为先",
        "C": "绩效为重",
        "D": "能力为重"
    },
    {
        "ANS": "ABCD",
        "Q": "十典九章中行为十典包括笃诚守信专业敬业主动担当接续奋斗清正廉洁绿色人文",
        "TYPE": "多选题",
        "A": "守正创新",
        "B": "规范高效",
        "C": "品质至上",
        "D": "协同联动"
    },
    {
        "ANS": "ABCDE",
        "Q": "十典九章中礼仪九章的细则包含以下哪些内容",
        "TYPE": "多选题",
        "A": "协调",
        "B": "规范",
        "C": "适时",
        "D": "随俗",
        "E": "有序"
    },
    {
        "ANS": "ABD",
        "Q": "十典九章中主动担当要求我们在做到对本职工作尽职尽责的基础上努力达成最佳工作效果对结果负责面对失误敢于承担责任",
        "TYPE": "多选题",
        "A": "勇于突破岗位边界",
        "B": "挑最重的担子啃最硬的骨头",
        "C": "咬定目标不放松把成绩当起点把困难当阶梯",
        "D": "敢于斗争善于斗争"
    },
    {
        "ANS": "ABCD",
        "Q": "十典九章中笃诚守信要求我们",
        "TYPE": "多选题",
        "A": "诚信正直坦诚相待",
        "B": "信守承诺有诺必践不打折扣",
        "C": "宁愿丧失利益也不丢失信誉",
        "D": "尊重事实传递真实可靠信息",
        "E": "珍惜每一天做实每件事"
    },
    {
        "ANS": "D",
        "Q": "项目分级参照公司项目临时设施标准化管理办法中临建分级管理规定执行分为个级别",
        "TYPE": "单选题",
        "A": "3",
        "B": "4",
        "C": "5",
        "D": "6"
    },
    {
        "ANS": "ABCD",
        "Q": "CI管理的原则包括",
        "TYPE": "多选题",
        "A": "分级管理",
        "B": "分级管理",
        "C": "分步实施",
        "D": "成本控制"
    },
    {
        "ANS": "ABCDE",
        "Q": "下列属于项目CI及文明施工管理目的的有",
        "TYPE": "多选题",
        "A": "突出全过程全方位价值创造持续强化无效成本管控",
        "B": "规范全公司CI及文明施工管理流程",
        "C": "统一CI及文明施工标准",
        "D": "有效控制CI及文明施工投入成本",
        "E": "避免CI及文明施工过度投入"
    },
    {
        "ANS": "ABD",
        "Q": "CI管理主要应对的风险包括",
        "TYPE": "多选题",
        "A": "标准不一多次配置造成成本剧增的风险",
        "B": "过度投入随意制作造成资源浪费的风险",
        "C": "设计不美观不亮眼没有展现企业特色",
        "D": "使用不当管理不善造成资产损失的风险"
    },
    {
        "ANS": "ACD",
        "Q": "CI及文明施工类费用包括",
        "TYPE": "多选题",
        "A": "安全宣传类费用",
        "B": "外部媒体宣传费用",
        "C": "文明施工类费用",
        "D": "CI类费用"
    },
    {
        "ANS": "ABCD",
        "Q": "项目CI及文明施工投入内容清单中文明施工费用包括",
        "TYPE": "多选题",
        "A": "现场围挡的墙面美化",
        "B": "材料堆放标牌覆盖",
        "C": "室外LED显示",
        "D": "其他文明施工类费用"
    },
    {
        "ANS": "ABCDEF",
        "Q": "项目CI及文明施工投入内容清单中CI费用包括",
        "TYPE": "多选题",
        "A": "标识标牌",
        "B": "企业标志及企业宣传图",
        "C": "企业各类图表",
        "D": "会议室形象墙",
        "E": "彩旗",
        "F": "党建团建类"
    },
    {
        "ANS": "ABCD",
        "Q": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见中主要任务包括",
        "TYPE": "多选题",
        "A": "聚焦凝心铸魂提升思想觉悟",
        "B": "聚焦教育引导提升道德水准",
        "C": "聚焦实践养成提升文明素养",
        "D": "聚焦成风化人强化氛围营造"
    },
    {
        "ANS": "ABCD",
        "Q": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦凝心铸魂提升思想觉悟具体举措包括",
        "TYPE": "多选题",
        "A": "筑牢理想信念之基",
        "B": "践行社会主义核心价值观",
        "C": "传承中华优秀传统文化",
        "D": "弘扬中国建筑精神",
        "E": "提升职业道德"
    },
    {
        "ANS": "BCDE",
        "Q": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦教育引导提升道德水准具体举措包括",
        "TYPE": "多选题",
        "A": "传承中华优秀传统文化",
        "B": "践行社会公德",
        "C": "提升职业道德",
        "D": "涵育家庭美德",
        "E": "锤炼个人品德"
    },
    {
        "ANS": "ACDE",
        "Q": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦实践养成提升文明素养具体举措包括",
        "TYPE": "多选题",
        "A": "深化精神文明创建",
        "B": "锤炼个人品德",
        "C": "注重礼仪礼节教化作用",
        "D": "加强网上道德实践",
        "E": "提高国际沟通素养"
    },
    {
        "ANS": "ABCE",
        "Q": "关于进一步提升中建集团党员干部职工思想道德素养的实施意见的主要任务中聚焦成风化人强化氛围营造具体举措包括",
        "TYPE": "多选题",
        "A": "以中建榜样引领道德风尚",
        "B": "以正确舆论营造良好氛围",
        "C": "以文艺作品陶冶道德情操",
        "D": "加强网上道德实践",
        "E": "以廉洁文化构建清廉生态"
    },
    {
        "ANS": "ABCD",
        "Q": "各单位改进和加强企业文化建设的方法步骤包括",
        "TYPE": "多选题",
        "A": "评估查找差距",
        "B": "发现问题",
        "C": "分析原因",
        "D": "有针对性地制定有效措施"
    },
    {
        "ANS": "BD",
        "Q": "集团二级及以下单位依照对本单位党员干部职工行为规范进行调整和完善开展榜样选树宣传引导党员干部职工提升思想道德素养",
        "TYPE": "多选题",
        "A": "铁军宣言",
        "B": "中建信条",
        "C": "中国建筑企业文化管理手册",
        "D": "十典九章"
    },
    {
        "ANS": "AB",
        "Q": "集团总部职能部门推动企业文化融入",
        "TYPE": "多选题",
        "A": "专项战略制定",
        "B": "规章制度及员工行为规范",
        "C": "企业文化管理规范",
        "D": "文化管理体系"
    },
    {
        "ANS": "ABCDE",
        "Q": "各单位参加上级单位企业文化交流分享传播平台主要工作包括",
        "TYPE": "多选题",
        "A": "参加上级单位组织的文化交流文化宣贯",
        "B": "定期归纳总结及分享自身企业文化管理的优秀经验",
        "C": "提交企业文化建设成果",
        "D": "为企业文化管理提供素材",
        "E": "开展企业文化传播"
    },
    {
        "ANS": "ABCDE",
        "Q": "针对专项文化管理各单位需做到",
        "TYPE": "多选题",
        "A": "理解把握专项文化理念",
        "B": "使用专项文化口号",
        "C": "组织开展专项文化宣贯",
        "D": "践行专项文化要求",
        "E": "推动专项文化落实落地"
    },
    {
        "ANS": "ACE",
        "Q": "以下属于集团总部层面关于企业文化落地方面主要工作的是",
        "TYPE": "多选题",
        "A": "深化对国有企业新使命新任务的思考认识",
        "B": "推动企业文化融入专项战略制定规章制度及员工行为规范",
        "C": "建立健全企业文化建设管理体系",
        "D": "建立健全企业文化建设管理制度",
        "E": "构建企业文化管理规范"
    },
    {
        "ANS": "ABCD",
        "Q": "以下属于集团二级及以下单位层面关于企业文化落地方面主要工作的是",
        "TYPE": "多选题",
        "A": "严守企业文化管理规范",
        "B": "落实文化管理体系",
        "C": "建立健全企业文化建设管理制度",
        "D": "推动企业文化融入本单位战略管理日常运营及员工管理"
    },
    {
        "ANS": "ACDE",
        "Q": "党建带团建带工建深化建证党建品牌创建工作筑牢基层战斗堡垒结合活动主题依托等载体开展基层项目青年员工座谈青年工作调研和青年活动将理念深植青年心中带好中国建筑未来生力军",
        "TYPE": "多选题",
        "A": "三会一课",
        "B": "项目文化示范点",
        "C": "主题党日",
        "D": "主题团日",
        "E": "文明有礼",
        "F": "争当中建先锋"
    },
    {
        "ANS": "BD",
        "Q": "组织文明有礼宣贯要做好和坚决杜绝低级红高级黑",
        "TYPE": "多选题",
        "A": "内容收集",
        "B": "内容审核",
        "C": "舆情处置",
        "D": "舆情防范"
    },
    {
        "ANS": "ABC",
        "Q": "中建集团文化深化133工作体系中的3个手册包括",
        "TYPE": "多选题",
        "A": "中建信条2024版",
        "B": "十典九章2024版",
        "C": "中建信条十典九章海外文化融合版",
        "D": "中建宣言2024版",
        "E": "铁军宣言2024版"
    },
    {
        "ANS": "ACD",
        "Q": "中建集团文化深化133工作体系中的3个制度方案是指",
        "TYPE": "多选题",
        "A": "中建集团企业文化建设管理规定2024版",
        "B": "中建集团中建信条十典九章宣贯实施细则2024版",
        "C": "中建信条2024版十典九章2024版中建信条十典九章海外文化融合版宣贯深植方案",
        "D": "争做文明有礼中建人活动实施方案"
    },
    {
        "ANS": "ABD",
        "Q": "以下关于中建集团文化深化133工作体系中的133描述正确的是",
        "TYPE": "多选题",
        "A": "1个意见",
        "B": "3个制度",
        "C": "3个方案",
        "D": "3个手册"
    },
    {
        "ANS": "BD",
        "Q": "中建集团文化深化133工作体系是集团第二批主题教育的重要成果及长效机制之一是集团全面深化企业文化建设提升党员干部职工思想道德素养的",
        "TYPE": "多选题",
        "A": "压舱石",
        "B": "路线图",
        "C": "指向标",
        "D": "方法论"
    },
    {
        "ANS": "ACDEF",
        "Q": "以下属于争做文明有礼中建人活动实施方案中落实十项任务的是",
        "TYPE": "多选题",
        "A": "设置文明有礼月",
        "B": "夯实基础管理",
        "C": "组织文明有礼宣贯",
        "D": "践行合规文化",
        "E": "选树中建榜样",
        "F": "回应相关方期望"
    },
    {
        "ANS": "ABCDE",
        "Q": "弘扬劳动精神劳模精神工匠精神深入开展等建好用好等载体平台提升干部职工职业技能",
        "TYPE": "多选题",
        "A": "青年精神素养提升工程",
        "B": "中国梦劳动美主题宣教",
        "C": "职工劳动和技能竞赛",
        "D": "建证幸福书屋",
        "E": "素质和技能提升站"
    },
    {
        "ANS": "错",
        "Q": "礼仪九章是对全体员工的关键行为和习惯的倡导及要求",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "行为十典是中国建筑员工的礼仪规范按照全球化公司的标准阐明了员工在商务社交场合应注意的礼仪及行为细节是中国建筑员工提高职业修养提升沟通技能树立企业形象的礼仪遵循",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "行为十典中关键行为明确标准规范对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线对背离中国建筑文化倡导的行为进行高压警示",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "集团三级及以下单位层面遵照中国建筑企业文化管理组织设计的相关规定按照二级单位的要求进行文化管理组织的设计并承担履行相应职责",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "集团宣传思想文化工作领导小组审定企业文化建设总体目标中长期发展规划年度工作计划和重大事项",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "集团层面总部党建工作部企业文化部依据集团党组关于企业文化建设的总体安排编制并完善集团企业文化中长期发展规划年度工作计划规划年度重大事项督促二级单位制定本单位的企业文化年度工作计划",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "集团层面总部党建工作部企业文化部制定部门文化建设工作计划与专项文化推进计划在职能线统筹推进落实",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "集团二级单位党组织负责审定落实本单位企业文化建设年度工作计划可列入年度党建宣传思想思想政治工作计划中年度重大事项",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "集团二级单位层面企业文化管理部门制定并落实企业文化建设年度工作计划可列入年度党建宣传思想思想政治工作计划中规划年度重大事项引领三级及以下单位企业文化建设方向并提供实施指导",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "集团二级单位层面企业文化管理部门落实上级职能部门专项文化建设工作计划或方案实施文化建设工作计划",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "集团党建工作部企业文化部负责收集整理全系统对中建信条修订的意见和建议将中建信条修订版提交到集团宣传思想文化工作领导小组研究报请集团党组审批经集团党组审定后方可面向全系统发布贯彻落实",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "集团三级及以下单位原则上不能编制文化手册只能制定文化执行手册重在贯彻集团核心文化理念和二级单位特定理念在路径和方法上体现特色",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "集团二级单位整合及丰富企业文化物质载体完善企业文化设施搭建企业文化交流分享平台规范企业文化传播渠道",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "集团二级及以下单位制定并落实企业文化宣贯方案将企业文化纳入各级党委工作部的培训体系中开展相关企业文化宣贯",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中国建筑集团有限公司企业文化建设管理规定2024版定自2024年1月5日起施行",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中国建筑集团有限公司企业文化建设管理规定2024版由集团党建工作部企业文化部负责解释修订",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "CI管理流程中项目等级审批在项目进场前参照临建等级审批执行一级项目逐级报公司总经理审批二级及以下项目报公司副总经理生产审批",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "CI管理流程中公司管理平台立项20天内由项目经理根据项目策划组织编制CI及文明施工投入方案方案应包括项目投入内容清单配置标准资金来源投入概算使用周期管理职责分工等内容",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "CI管理流程中项目方案审批完成后3天内依据项目方案编制投入预算并提交预算审批表",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "企业廉洁文化包括高尚的品德廉洁的操行",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线对背离中国建筑文化倡导行为进行高压警示",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中建信条既是中建人对七十余载薪火相传信仰信念的高度凝练也是中建人面向新时代开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉总结提炼中国建筑精神使文化基因与新时代发展相协调形成中国建筑在新形势下团结奋斗的思想基础引领企业上下一心厚植政治优势汇聚发展动能以高质量党建引领和保障高质量发展",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "1997年在天上无飞鸟地上石头跑的巴丹吉林沙漠高质量完成酒泉卫星发射中心建设任务创出三项世界第一一项亚洲第一三项中国第一的建筑奇迹",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "2019年中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中国建筑精神是全体中建人理想信念责任担当价值追求精神风貌政治品格的概括和凝练外化为全体中建人共同具有的工作倾向和态度具体表现为爱国奋斗求实奉献诚信创新超越共赢等维度",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "品质保障的管理要点思想上要树立品质重于泰山品质高于一切的坚定信念",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "在会议中与别人洽谈或用餐时关闭手机或调到静音状态尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "未经报批同意不擅自以工作职务或单位名义接受媒体采访不以单位名义工作身份在网络平台开通个人账号个人账号可随意针对社会热点敏感议题发表评论不发布涉及企业和工作内容的非公开图片文字视频及相关负面敏感信息不造谣不信谣不传谣",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中建信条系统展现中国建筑所坚信并奉行的价值核心是中国建筑为利益相关方所信任并委以重托的依据",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "创新是我们的立业之基",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "发展是我们的价值追求",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "企业廉洁文化包括高尚的品德廉洁的操行",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "行为十典是对全体员工的关键行为和习惯的倡导及要求其中关键行为明确标准规范对中国建筑全体员工的日常行为进行重点引领和倡导反对行为明确行为底线对背离中国建筑文化倡导行为进行高压警示",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中建信条既是中建人对七十余载薪火相传信仰信念的高度凝练也是中建人面向新时代开创长青基业的发展密码它深入挖掘中国建筑跨越发展背后的力量源泉总结提炼中国建筑精神使文化基因与新时代发展相协调形成中国建筑在新形势下团结奋斗的思想基础引领企业上下一心厚植政治优势汇聚发展动能以高质量党建引领和保障高质量发展",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "1997年在天上无飞鸟地上石头跑的巴丹吉林沙漠高质量完成酒泉卫星发射中心建设任务创出三项世界第一一项亚洲第一三项中国第一的建筑奇迹",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "2019年中国建筑成为国务院国资委确定的10家创建世界一流示范企业之一",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中国建筑精神是全体中建人理想信念责任担当价值追求精神风貌政治品格的概括和凝练外化为全体中建人共同具有的工作倾向和态度具体表现为爱国奋斗求实奉献诚信创新超越共赢等维度",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "满意用户成就员工回报股东造福社会共同构成我们使命的主旋律",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "品质保障的管理要点思想上要树立品质重于泰山品质高于一切的坚定信念",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "在会议中与别人洽谈或用餐时关闭手机或调到静音状态尽可能避免使用手机进入有特殊要求的重要场所禁止带入手机",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "未经报批同意不擅自以工作职务或单位名义接受媒体采访不以单位名义工作身份在网络平台开通个人账号个人账号可随意针对社会热点敏感议题发表评论不发布涉及企业和工作内容的非公开图片文字视频及相关负面敏感信息不造谣不信谣不传谣",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "中建信条系统展现中国建筑所坚信并奉行的价值核心是中国建筑为利益相关方所信任并委以重托的依据",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "创新是我们的立业之基",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "1996年6月中建总公司在建筑行业率先导入CI战略进行了CI的设计和推广以内联素质外塑形象推动企业发展",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "2000年12月中建总公司发出中建总公司行为识别规范手册和中建总公司理念识别规范手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "1999年4月中建八局承建的酒泉卫星发射基地被评为国家科技进步一等奖为中国建筑行业第一个科技进步奖",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "2010年9月中国建筑向国家商标局申请注册的中国建筑和中国建筑CSCEC各45个类别的商标获得批准中国建筑成为中国建筑股份有限公司的注册商标",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "2008年5月12日汶川地震在抗震救灾过程中中国建筑为四川甘肃等地援建临时安置型住房110万平方米居全国之最中国建筑近年来在地震灾区的51个竣工项目71个在建项目建筑结构主体均未出现问题",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "在北京奥运会工程建设中中建系统共承建了北京奥运会40的场馆及配套设施建设任务",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "2011年2月利比亚战乱经过精心组织中国建筑成功完成10241名中建驻利比亚中国员工及957名孟加拉越南籍员工的利比亚大撤离时任中建八局副局长张作合主持本次大撤离工作",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "1994年6月7日中国工程院公布首批院士96人名单中国建筑西北设计研究院总建筑师全国工程勘察设计大师张锦秋当选为工程院院士这是中建历史上第一个院士",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "2013年12月19日中国工程院公布2013年院士增选结果中建总公司肖绪文同志当选院士这是中建历史上第二个院士",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "2024年4月组织公司领导班子集体学习中建集团文化133工作体系要求和中建集团2024版手册",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "各基层党支部2024年3月依托三会一课主题党日等形式通过集中学习专题研讨座谈交流等形式组织党员开展专题学习",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "人力资源部要将中建集团2024版手册作为公司内部各类培训的基础内容纳入新员工入职培训党员培训等",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "海外分公司要在5月组织好海外员工学习中建信条十典九章海外文化融合版",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "党委工作部要遵循中建集团2024版文化手册局新版铁军宣言文化手册修订公司执行文化手册并报局审阅7月完成发布梳理2015年后三公司还有在局甚至中建系统多少个第一打造个性化",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "依据中建集团2024版手册内容修订CI规范更新机关挂画项目图牌确保各级机关总部项目部实现文化理念全覆盖在建项目6月完成新开项目按新标准执行",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "企划部要将2024版手册中国建筑精神企业使命企业愿景核心价值观等提法与阐释融入企业发展战略和管理制度中使各项制度与企业文化理念保持一致",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "党委工作部要按照中建集团争做文明有礼中建人活动要求宣贯八局相关倡议书组织三公司员工制作主题标语主题海报并积极投稿活动9月完成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "党群系统要组织项目部积极参与六有六强项目文化示范点创建宣贯新版示范点创建标准细化创建规定性动作督促督导各单位指导项目开展好项目经理接待日分包分供方沟通会文明工地文明班组评比等形式多样的主题活动做好公司年度示范点打擂评比并推荐参加局擂台赛等",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "党群系统要组织开展干部职工网络行为专项培训和舆情应对专项培训组织干部职工媒体采访行为规范十条专项考试开展干部职工言行媒体网络行为个人账号管理等专项治理规范公司员工职业行为提升全员媒介素养与社会沟通能力最迟9月完成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "公司各业务系统各条线结合业务特点年度工作将文明有礼内容纳入学习培训宣讲宣教竞赛比赛中",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "错",
        "Q": "掘选树先进典型和身边榜样培育选树宣传一批在践行中建文化助人为乐见义勇为诚实守信敬业奉献孝老爱亲等方面做出表率的身边榜样在七一之前完成",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "加强贯彻落实中建集团文化深植133工作体系组织领导由党委书记任第一责任人分管领导任直接责任人班子其他成员按照一岗双责要求抓好分管部门和领域的文化建设工作党委工作部牵头组织协调落实",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "公司总部各部门要认真贯彻落实集团要求按照公司工作方案结合本部门工作制定切实可行的工作计划明确时间节点细化责任分工确保宣贯工作取得实效",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    },
    {
        "ANS": "对",
        "Q": "党委工作部要将总结推广工作中涌现的好经验好做法组织评选优秀案例并将工作开展情况纳入月度考核和年度党建工作责任制考核",
        "TYPE": "判断题",
        "A": "对",
        "B": "错"
    }
];

(function() {
    'use strict';
    var inputbtn = document.createElement('input');
    inputbtn.id="mybtn";
    inputbtn.type="button";
    inputbtn.value="加载成功";
    document.getElementsByClassName("el-card__body")[0].appendChild(inputbtn);

    //if_1 日常模式提醒位置：题干
    if(document.getElementsByClassName("title").length === 0){
        document.getElementsByClassName("mtb-16 size-16 bold")[0].addEventListener("mouseover",function(){ HINT_Daily();});
        return;
    }
    //if_2 考试模式提醒位置：题干
    if(document.getElementsByClassName("title").length > 0){
        //document.getElementsByClassName("flex_l")[0].addEventListener("mouseover",function(){ HINT_Exam();});
        document.getElementsByClassName("mtb-16 size-16 bold")[0].addEventListener("mouseover",function () {HINT_Exam();});
        return;
    }
    // Your code here...
})();

// 只提取汉字英文数字
function GetChineseEnglishNumber (strValue) {
    var str='';
    if (strValue !== null && strValue !== '') {
        const reg = /[\u4e00-\u9fa5a-zA-Z0-9ⅠⅡⅢⅣⅤ]/g;
        str= strValue.match(reg).join('')
        return str;
    }return str;
}


//单选题|判断题|多选题  题干
function get_Question () {
    var Q=document.getElementsByClassName("mtb-16 size-16 bold")[0];
    console.log(typeof(Q));
    var rQ=GetChineseEnglishNumber(Q.textContent);
    return rQ;
}

//取得题型
function get_Question_Type () {
    var check=document.getElementsByClassName("title").length;
    if (check>=1) {
        //考试模式
        var Type=document.getElementsByClassName("size-16")[0].textContent;
        Type=Type.trim().split("、")[1].substring(0,3);
        return Type;
    }
    var Type=document.getElementsByClassName("flex_l")[2].textContent.trim().substring(2,);
    //console.log(Type);
    return Type;
}

//单选题|判断题|多选题  选项答案document.getElementsByClassName("el-radio__label")
//取得选项AB，多条件筛选
function get_AnswerA ( ) {
    var As=document.getElementsByClassName("el-radio__label");
    //闯关练习选项获取
    if ( As.length < 1 ) {
        As=document.getElementsByClassName("el-checkbox__label");
    }
    //    for(var i = 0; i <As.length; i++) {
    //        console.log(As[i].textContent);
    //    }
    var mod_Ans = GetChineseEnglishNumber(As[0].textContent);
    if (mod_Ans.length === 1){
        return mod_Ans;
    }else{
        return mod_Ans.substring(1,);
    }
}

function get_AnswerB ( ) {
    var As=document.getElementsByClassName("el-radio__label");
    //闯关练习选项获取
    if ( As.length < 1 ) {
        As=document.getElementsByClassName("el-checkbox__label");
    }
    //    for(var i = 0; i <As.length; i++) {
    //        console.log(As[i].textContent);
    //    }
    var mod_Ans = GetChineseEnglishNumber(As[1].textContent);
    if (mod_Ans.length === 1){
        return mod_Ans;
    }else{
        return mod_Ans.substring(1,);
    }
}

function showFAQ(FOUND){
    for (const [key, value] of Object.entries(FOUND)) {
        console.log("            --> "+`${key}: ${value}`);
    }
}

function HINT_Exam () {
    //先清空
    //再添加提示
    var hostdiv = document.getElementsByClassName("size-14 blue")[0];
    var hostdivChild =hostdiv.childNodes.length;
    for (var ii=hostdivChild-1;ii>0;ii--) {
        hostdiv.removeChild(hostdiv.childNodes[ii]);
    }


    var ANSList = fuck_exam ();

    if(ANSList.length<1){
        var mydiv = document.createElement("div");
        hostdiv.appendChild(mydiv);
        mydiv.innerText="________________________________\n随便来一个吧题库没有：   ";
        mydiv.addEventListener("mouseover",function(){ mydiv.remove();});
        return ANSList;
    }

    paint_exam(ANSList);
    for(var i=0;i<ANSList.length;i++){
        var mydiv = document.createElement("div");
        hostdiv.appendChild(mydiv);
        mydiv.innerText="________________________________\n建议选择：   "+ANSList[i].ANS+"\n"+ANSList[i].Q+"\n"+"A "+ANSList[i].A+"\nB "+ANSList[i].B+"\nC "+ANSList[i].C+"\nD "+ANSList[i].D+"\nE "+ANSList[i].E+"\nF "+ANSList[i].F+"\nG "+ANSList[i].G;
        mydiv.addEventListener("mouseover",function(){ mydiv.remove();});
    }
    //考试模式暂不自动选择，有时间再改
    //选项乱序，瞪眼看吧
    //chooseAuto(ANSList);
    return ANSList;
}

function HINT_Daily () {
    //先清空
    //再添加提示
    var hostdiv = document.getElementsByClassName("size-14 blue")[0];
    var hostdivChild =hostdiv.childNodes.length;
    for (var ii=hostdivChild-1;ii>0;ii--) {
        hostdiv.removeChild(hostdiv.childNodes[ii]);
    }


    var ANSList = fuck_question ();

    if(ANSList.length<1){
        var mydiv = document.createElement("div");
        hostdiv.appendChild(mydiv);
        mydiv.innerText="________________________________\n随便来一个吧题库没有：   ";
        mydiv.addEventListener("mouseover",function(){ mydiv.remove();});
        return ANSList;
    }

    paint_question(ANSList);
    for(var i=0;i<ANSList.length;i++){
        var mydiv = document.createElement("div");
        hostdiv.appendChild(mydiv);
        mydiv.innerText="________________________________\n建议选择：   "+ANSList[i].ANS+"\n"+ANSList[i].Q+"\n"+"A "+ANSList[i].A+"\nB "+ANSList[i].B+"\nC "+ANSList[i].C+"\nD "+ANSList[i].D+"\nE "+ANSList[i].E+"\nF "+ANSList[i].F+"\nG "+ANSList[i].G;
        mydiv.addEventListener("mouseover",function(){ mydiv.remove();});
    }
    chooseAuto(ANSList);
    return ANSList;
}


function fuck_question () {

    //控制台打印全部匹配到的题库，返回题库
    var Q = get_Question ();
    console.log("-*--*---*--正在比对题库--*---*--*-");

    var ANS = FAQ.filter((item) => {
        //题干题型选项AB多条件筛选
        return item.Q == get_Question() && item.TYPE == get_Question_Type() && item.A == get_AnswerA();
    });
    console.log("    | 匹配到以下题库");
    if ( ANS.length < 1 ) {
        console.log("        | NOTHING");
    } else {
        for(var i = 0; i <ANS.length; i++) {
            console.log("        | "+ANS[i].TYPE+": "+ANS[i].Q+" | "+ANS[i].ANS);
            showFAQ(ANS[i]);
        }
    }

    return ANS;
}

function fuck_exam () {

    //控制台打印全部匹配到的题库，返回题库
    var Q = get_Question ();
    console.log("-*--*---*--正在比对题库--*---*--*-");

    var ANS = FAQ.filter((item) => {
        //考试模式只匹配题干，选项乱序，瞪眼看吧
        return item.Q == get_Question() && item.TYPE == get_Question_Type();
    });
    console.log("    | 匹配到以下题库");
    if ( ANS.length < 1 ) {
        console.log("        | NOTHING");
    } else {
        for(var i = 0; i <ANS.length; i++) {
            console.log("        | "+ANS[i].TYPE+": "+ANS[i].Q+" | "+ANS[i].ANS);
            showFAQ(ANS[i]);
        }
    }

    return ANS;
}


//单选题|判断题|×××  选项按钮document.getElementsByClassName("el-radio__input")[0].click()
//×××|×××|多选题  选项按钮document.getElementsByClassName("el-checkbox__input")[0].click()
function chooseAuto (ANSLIST) {
    var questionType = get_Question_Type();
    if (questionType === '多选题') {
        console.log("detect multi");
        //多选题暂无法实现
        for(var ans= 1000 ;ans < ANSLIST[0].ANS.length ; ans ++){
            switch( (ANSLIST[0].ANS)[ans] ){
                case 'A':
                    document.getElementsByClassName("el-checkbox")[0].click();
                    //document.getElementsByClassName("el-checkbox__input")[0].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[0].classList.add("is-checked");
                    break;
                case 'B':
                    document.getElementsByClassName("el-checkbox")[1].click();
                    //document.getElementsByClassName("el-checkbox__input")[1].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[1].classList.add("is-checked");
                    break;
                case 'C':
                    document.getElementsByClassName("el-checkbox")[2].click();
                    //document.getElementsByClassName("el-checkbox__input")[2].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[2].classList.add("is-checked");
                    break;
                case 'D':
                    document.getElementsByClassName("el-checkbox")[3].click();
                    //document.getElementsByClassName("el-checkbox__input")[3].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[3].classList.add("is-checked");
                    break;
                case 'E':
                    document.getElementsByClassName("el-checkbox")[4].click();
                    //document.getElementsByClassName("el-checkbox__input")[4].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[4].classList.add("is-checked");
                    break;
                case 'F':
                    document.getElementsByClassName("el-checkbox")[5].click();
                    //ocument.getElementsByClassName("el-checkbox__input")[5].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[5].classList.add("is-checked");
                    break;
                case 'G':
                    document.getElementsByClassName("el-checkbox")[6].click();
                    //document.getElementsByClassName("el-checkbox__input")[6].classList.add("is-checked");
                    //document.getElementsByClassName("el-checkbox")[6].classList.add("is-checked");
                    break;
                default:
                    break;
            }
        }

    } else {
        console.log("detect single");
                if(ANSLIST[0].ANS === "对"){document.getElementsByClassName("el-radio__input")[0].click();return;}
                if(ANSLIST[0].ANS === "错"){document.getElementsByClassName("el-radio__input")[1].click();return;}
        if(ANSLIST[0].ANS === "A"){document.getElementsByClassName("el-radio__input")[0].click();return;}
        if(ANSLIST[0].ANS === "B"){document.getElementsByClassName("el-radio__input")[1].click();return;}
        if(ANSLIST[0].ANS === "C"){document.getElementsByClassName("el-radio__input")[2].click();return;}
        if(ANSLIST[0].ANS === "D"){document.getElementsByClassName("el-radio__input")[3].click();return;}
        if(ANSLIST[0].ANS === "E"){document.getElementsByClassName("el-radio__input")[4].click();return;}        //document.getElementsByClassName("el-radio__input")

    }

}

function paint_question(fuck){

    var As=document.getElementsByClassName("el-radio__label");
    //闯关练习选项获取
    if ( As.length < 1 ) {
        As=document.getElementsByClassName("el-checkbox__label");
    }

    var ANSLIST=fuck[0].ANS;

    for(var i=0;i<=ANSLIST.length-1;i++){
        if(ANSLIST[i] === "A"){As[0].style.backgroundColor = "red";}
        if(ANSLIST[i] === "B"){As[1].style.backgroundColor = "red";}
        if(ANSLIST[i] === "C"){As[2].style.backgroundColor = "red";}
        if(ANSLIST[i] === "D"){As[3].style.backgroundColor = "red";}
        if(ANSLIST[i] === "E"){As[4].style.backgroundColor = "red";}
        if(ANSLIST[i] === "F"){As[5].style.backgroundColor = "red";}
        if(ANSLIST[i] === "G"){As[6].style.backgroundColor = "red";}
    }
    return 0;

}
function paint_exam(fuck){

    var As=document.getElementsByClassName("el-radio__label");
    //闯关练习选项获取
    if ( As.length < 1 ) {
        As=document.getElementsByClassName("el-checkbox__label");
    }
    //遍历选项，匹配答案
    for(var i =0;i<=As.length-1;i++){
        for(var j=0;j<=fuck[0].ANS.length-1;j++){
            var single = fuck[0].ANS[j];
            console.log(single);
            if( get_Answer(i) === fuck[0][single]){
                As[i].style.backgroundColor = "red";
               }
        }

    }


    return 0;

}

function get_Answer ( i ) {
    //0A 1B 2C 3D 4E 5F 6G
    var As=document.getElementsByClassName("el-radio__label");
    //闯关练习选项获取
    if ( As.length < 1 ) {
        As=document.getElementsByClassName("el-checkbox__label");
    }
    //    for(var i = 0; i <As.length; i++) {
    //        console.log(As[i].textContent);
    //    }
    var mod_Ans = GetChineseEnglishNumber(As[i].textContent);
    if (mod_Ans.length === 1){
        return mod_Ans;
    }else{
        return mod_Ans.substring(1,);
    }
}