// ==UserScript==
// @version      2025.21
// @name         2025普法考试-ks.cqsdx.cn
// @namespace    http://tampermonkey.net/
// @description  As you know, the fastest is often not the best.
// @author       YFF
// @license      MIT
// @match        https://ks.cqsdx.cn/exam/user*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=undefined.
// @require      https://cdn.jsdelivr.net/npm/tesseract.js@5/dist/tesseract.min.js
// @grant        none
 
// @downloadURL https://update.greasyfork.org/scripts/519039/2025%E6%99%AE%E6%B3%95%E8%80%83%E8%AF%95-kscqsdxcn.user.js
// @updateURL https://update.greasyfork.org/scripts/519039/2025%E6%99%AE%E6%B3%95%E8%80%83%E8%AF%95-kscqsdxcn.meta.js
// ==/UserScript==
 
//   视频倍速请使用  document.getElementsByClassName("video-container")[0].children[0].children[0].playbackRate = 10
 
(function() {
    'use strict';
    // 创建按钮
// 创建按钮
    var btnnext
    var hasda=0
    var Thejson = [
{"name":"务接待中，住宿应当安排在定点饭店或者机关内部接待场所，执行协议价格。（）","type":"1","value":"A","id":"0","anw":"正确"}
,
{"name":"作需要，接待单位安排接待对象用餐的，可以按当地接待标准提供工作餐，但不得多次 陪餐。（）","type":"1","value":"A","id":"1","anw":"正确"}
,
{"name":"党政机关国内公务接待管理规定》，接待单位可以根据实际情况超标准接待。（）","type":"1","value":"B","id":"2","anw":"错误"}
,
{"name":"机关国内公务接待管理规定》允许接待单位在接待费中列支少量接待对象的私人消费。（）","type":"1","value":"B","id":"3","anw":"错误"}
,
{"name":"机关厉行节约反对浪费条例》规定，严禁出租出借办公用房，但可以改变办公用房使用功 能。（）","type":"1","value":"B","id":"4","anw":"错误"}
,
{"name":"机关厉行节约反对浪费条例》规定，出差人员住宿、就餐由接待单位协助安排的，必须按 标准交纳住宿费、餐费。（）","type":"1","value":"A","id":"5","anw":"正确"}
,
{"name":"机关厉行节约反对浪费条例》鼓励党政机关按规定组织异地部门间学习交流。（）","type":"1","value":"B","id":"6","anw":"错误"}
,
{"name":"机关厉行节约反对浪费条例》规定，党政机关不得以任何名义新建、改建、扩建所属宾馆、 招待所等具有接待功能的设施或者场所。（）","type":"1","value":"A","id":"7","anw":"正确"}
,
{"name":"共产党思想政治工作条例》强调，要把思想政治工作作为治党治国的重要方式。（）","type":"1","value":"A","id":"8","anw":"正确"}
,
{"name":"国共产党思想政治工作条例》规定，各级党委（党组）应当建立健全思想政治工作责任制。 （）","type":"1","value":"A","id":"9","anw":"正确"}
,
{"name":"国共产党思想政治工作条例》是党支部（党总支）书记履行思想政治工作职责的基本遵循。 （）","type":"1","value":"A","id":"10","anw":"正确"}
,
{"name":"批准不得开展包含“国家”、“中国”、“中华”、“全国”、“亚洲”、“全球”、 “世界”、“人民”、“功勋”、“荣誉称号”和类似含义字样，以及未冠以上述字样但实质是上 述含义的评比表彰和创建示范活动。（）","type":"1","value":"A","id":"11","anw":"正确"}
,
{"name":"批注可以根据实际开展“城市”、“之乡”、“基地”等授牌命名活动。（）","type":"1","value":"B","id":"12","anw":"错误"}
,
{"name":"《整治形式主义为基层减负若干规定》，上级部门可以通过 QQ 群、微信群、政务 APP 等 随意向下布置任务、提出工作要求。（）","type":"1","value":"B","id":"13","anw":"错误"}
,
{"name":"《整治形式主义为基层减负若干规定》，可以开展网络投票、点赞、转发等活动作为评价 工作的依据。（）","type":"1","value":"B","id":"14","anw":"错误"}
,
{"name":"治形式主义为基层减负若干规定》明确，除专门文件外，文件原则上不对机构编制、干部 配备、工资福利待遇、创建示范、达标、“一票否决”和签订责任状等事项提出具体要求。（）","type":"1","value":"A","id":"15","anw":"正确"}
,
{"name":"治形式主义为基层减负若干规定》明确，对清理后保留的“一票否决”、签订责任状事项 以及涉及城市评选评比表彰的各类创建活动，要实行清单管理。（）","type":"1","value":"A","id":"16","anw":"正确"}
,
{"name":"治形式主义为基层减负若干规定》明确，地方和部门制发文件应当进行与为基层减负一致 性评估，加强政策性、合法合规性审查，一般不提出报送贯彻落实情况，制定配套文件的要求。（）","type":"1","value":"A","id":"17","anw":"正确"}
,
{"name":"治形式主义为基层减负若干规定》要求，配套文件应当直接提出具体落实措施，不得简单 照抄照搬上位文件。（）","type":"1","value":"A","id":"18","anw":"正确"}
,
{"name":"治形式主义为基层减负若干规定》要求，除部署综合性工作外，地方和部门文件一般不超","type":"1","value":"A","id":"19","anw":"正确"}
,
{"name":"、经营、储存、使用危险物品的车间、商店、仓库可以与员工宿舍在同一座建筑物内。（）","type":"1","value":"B","id":"20","anw":"错误"}
,
{"name":"经营单位的安全生产管理人员应当根据本单位的生产经营特点，对安全生产状况进行经常 性检查；对检查中发现的安全问题，应当立即处理；不能处理的，应当及时报告本单位有关负责人， 有关负责人应当及时处理。（）","type":"1","value":"A","id":"21","anw":"正确"}
,
{"name":"人员有权对本单位安全生产工作中存在的问题提出批评、检举、控告。（）","type":"1","value":"A","id":"22","anw":"正确"}
,
{"name":"经营单位自主选择参加工伤保险，为从业人员缴纳保险费。（）","type":"1","value":"B","id":"23","anw":"错误"}
,
{"name":"鼓励公民、法人和其他组织为突发事件应对工作提供物资、资金、技术支持和捐赠。接受 捐赠的单位应当及时公开接受捐赠的情况和受赠财产的使用、管理情况，接受社会监督。（）","type":"1","value":"A","id":"24","anw":"正确"}
,
{"name":"企业应当根据协议，按照县级以上地方人民政府要求，进行应急救援物资、生活必需品和 应急处置装备的生产、供给，并确保符合国家有关产品质量的标准和要求。（）","type":"1","value":"A","id":"25","anw":"正确"}
,
{"name":"、法人和其他组织有义务参与突发事件应对工作。（）","type":"1","value":"A","id":"26","anw":"正确"}
,
{"name":"突发事件信息发布制度的规定，有关人民政府和部门应当及时向社会公布突发事件相关信 息和有关突发事件应对的决定、命令、措施等信息。（）","type":"1","value":"A","id":"27","anw":"正确"}
,
{"name":"学阶段应当重点加强交通安全、预防溺水、饮食卫生安全、消防安全、应对自然灾害、防 范校园伤害等方面的教育。（）","type":"1","value":"A","id":"28","anw":"正确"}
,
{"name":"安全生产监督管理职责的部门应当利用相关安全生产数据，对有关行业、领域定期开展安 全风险辨识分析、评估控制，及时发布预警提示信息，开展风险防控信息交流和成果运用，强化综 合管控和源头治理。（）","type":"1","value":"A","id":"29","anw":"正确"}
,
{"name":"《重庆市安全生产条例》，当次生产活动结束后，从业人员应当再次进行岗位安全检查， 防止非生产时间发生事故。（）","type":"1","value":"A","id":"30","anw":"正确"}
,
{"name":"经营单位的从业人员上岗前，无需对本岗位负责的设备、设施、作业场地、安全防护装置、 物品堆放等进行岗位安全检查，可以直接进行操作。（）","type":"1","value":"B","id":"31","anw":"错误"}
,
{"name":"经营单位使用被派遣劳动者的，被派遣劳动者数量不用计入生产经营单位从业人员总数。 （）","type":"1","value":"B","id":"32","anw":"错误"}
,
{"name":"人民政府及有关部门应当采取多种形式普及安全生产法律法规和安全生产知识，开展安全","type":"1","value":"A","id":"33","anw":"正确"}
,
{"name":"学校、中等职业学校以及科研机构等事业单位专业技术人员按照规定离岗创办科技型中小 企业的，或者到小型微型企业任职提供技术支持的，经批准可以在国家规定的期限内保留人事关系。 （）","type":"1","value":"A","id":"34","anw":"正确"}
,
{"name":"条件的创业人员和小型微型企业可以按照规定向人力社保部门申请创业担保贷款。（）","type":"1","value":"A","id":"35","anw":"正确"}
,
{"name":"性融资担保机构在依法合规和稳健可持续经营的前提下可以逐步提高担保放大倍数，提升 风险容忍度。（）","type":"1","value":"A","id":"36","anw":"正确"}
,
{"name":"企业的合法权益受法律保护，除特殊情况外，任何单位和个人不得侵犯。（）","type":"1","value":"B","id":"37","anw":"错误"}
,
{"name":"机关应当优化税费征管流程，主动帮助中小企业享受税费优惠政策，优化税务执法方式， 注重包容审慎监管。（）","type":"1","value":"A","id":"38","anw":"正确"}
,
{"name":"政、发展改革等部门应当落实国家对中小企业政府性基金、行政事业性收费减免等优惠政 策。（）","type":"1","value":"A","id":"39","anw":"正确"}
,
{"name":"民政府设立的产业投资基金应当支持中小企业发展，主要用于引导和带动社会资金支持初 创期、成长期的中小企业，培育专精特新中小企业。（）","type":"1","value":"A","id":"40","anw":"正确"}
,
{"name":"区县（自治县）人民政府有关部门应当将中小企业发展专项资金支持企业或者具体项目的 情况，必要时向社会公示。（）","type":"1","value":"B","id":"41","anw":"错误"}
,
{"name":"企业发展专项资金应当重点支持中小企业转型升级、创新能力提升、市场开拓等，资金不 能向任何一类企业倾斜。（）","type":"1","value":"B","id":"42","anw":"错误"}
,
{"name":"区县（自治县）人民政府应当将支持中小企业发展相关指标纳入高质量发展绩效评价体系。 （）","type":"1","value":"A","id":"43","anw":"正确"}
,
{"name":"收到手机短信，表示有人正在登录你的手机银行，可能你正在遭遇诈骗，要立即中断任何 屏幕共享软件，同时登录手机银行 App 查看或致电银行客服。（）","type":"1","value":"A","id":"44","anw":"正确"}
,
{"name":"单返现”诈骗的通常套路是：“客服”会先让受害人先刷一单，成功返现尝到甜头来骗取 受害人的信任。（）","type":"1","value":"A","id":"45","anw":"正确"}
,
{"name":"不清楚是否遭遇诈骗时，可以主动拨打 110 或 96110 进行咨询。（）","type":"1","value":"A","id":"46","anw":"正确"}
,
{"name":"接到电话或收到短信称你的银行卡在异地有消费记录，如有疑问请拨打某电话查询时，应 该跟官方客服核实。（）","type":"1","value":"A","id":"47","anw":"正确"}
,
{"name":"因出售银行卡而卷入案值较高或情节严重的案件，将以涉嫌“帮助信息网络犯罪活动罪” 定罪量刑，最高可判处三年有期徒刑。（）","type":"1","value":"A","id":"48","anw":"正确"}
,
{"name":"和政府、公检法单位之间的电话能够自由转接。（）","type":"1","value":"B","id":"49","anw":"错误"}
,
{"name":"对于买卖、出租、出借银行账户的个人，可以采取惩戒措施，5 年内暂停其银行账户非柜 面所有业务，并不得为其开设新账户。（）","type":"1","value":"A","id":"50","anw":"正确"}
,
{"name":"网络诈骗是指通过电话、网络或短信方式，编造虚假信息，设置骗局，对被害人实施远程、 非接触式的诈骗，诱使被害人打款或转账的犯罪行为。（）","type":"1","value":"A","id":"51","anw":"正确"}
,
{"name":"机关、检察机关、法院为调查案件，可能让犯罪嫌疑人转账到安全账户验资。（）","type":"1","value":"B","id":"52","anw":"错误"}
,
{"name":"人员在 QQ 或微信上收到老板发来要求转账的消息时，应打电话或当面与老板确认真假后 再决定。（）","type":"1","value":"A","id":"53","anw":"正确"}
,
{"name":"嫌疑人检举、揭发重大犯罪的其他共同犯罪人或者提供侦破重大案件的重要线索或者证据， 同案处理可能导致其本人或者近亲属有人身危险的，可以分案处理。（）","type":"1","value":"A","id":"54","anw":"正确"}
,
{"name":"组织、领导黑社会性质组织被判处刑罚的人员，街道派出所可以决定其自刑罚执行完毕之 日起，按照国家有关规定向公安机关报告个人财产及日常活动。报告期限不超过三年。（）","type":"1","value":"B","id":"55","anw":"错误"}
,
{"name":"判处十年以上有期徒刑、无期徒刑、死刑缓期二年执行的黑社会性质组织的组织者、领导 者或者恶势力组织的首要分子减刑的，执行机关应当依法提出减刑建议，报经设区的市一级监狱管 理机关复核后，提请人民法院裁定。（）","type":"1","value":"B","id":"56","anw":"错误"}
,
{"name":"网络实施的犯罪，符合《中华人民共和国反有组织犯罪法》关于有组织犯罪情形的，应当 认定为有组织犯罪。（）","type":"1","value":"A","id":"57","anw":"正确"}
,
{"name":"组织犯罪活动提供资金、场所等支持、协助、便利，尚不构成犯罪的不追究任何责任。（","type":"1","value":"B","id":"58","anw":"错误"}
,
{"name":"机关工作人员实施包庇黑社会性质组织的犯罪行为，构成包庇罪。（）","type":"1","value":"B","id":"59","anw":"错误"}
,
{"name":"、容留卖淫不属于九类涉恶犯罪。（）","type":"1","value":"A","id":"60","anw":"正确"}
,
{"name":"刑事处罚的人员不能纳入黑社会性质组织成员。（）","type":"1","value":"B","id":"61","anw":"错误"}
,
{"name":"社会性质组织的组织者、领导者，应当依法并处没收财产。（）","type":"1","value":"A","id":"62","anw":"正确"}
,
{"name":"有组织犯罪案件中，对于被冻结的债券、股票、基金份额等财产，只要经权利人申请，便 可以依法先行出售。（）","type":"1","value":"B","id":"63","anw":"错误"}
,
{"name":"未成年人参加黑社会性质组织、境外的黑社会性质组织，教唆、诱骗未成年人实施有组织 犯罪，或者实施有组织犯罪侵害未成年人合法权益的，依法从重追究刑事责任。（）","type":"1","value":"A","id":"64","anw":"正确"}
,
{"name":"组织犯罪的组织者、领导者和骨干成员取保候审的，由办案的公安机关主要负责人决定。 （）","type":"1","value":"B","id":"65","anw":"错误"}
,
{"name":"人或者设计人可以在专利文件中写明自己是发明人或者设计人。（）","type":"1","value":"A","id":"66","anw":"正确"}
,
{"name":"创造是否违反社会公德不影响专利权的授予。（）","type":"1","value":"B","id":"67","anw":"错误"}
,
{"name":"权既包括决定是否署名的权利，也包括署真名、假名或者艺名等的权利。（）","type":"1","value":"A","id":"68","anw":"正确"}
,
{"name":"科学研究和实验而使用有关专利的视为侵犯他人专利权。（）","type":"1","value":"B","id":"69","anw":"错误"}
,
{"name":"制作者使用他人已经合法录制为录音制品的音乐作品制作录音制品，可以不经著作权人许 可，但应当按照规定支付报酬；著作权人声明不许使用的不得使用。（）","type":"1","value":"A","id":"70","anw":"正确"}
,
{"name":"发明创造申请专利的权利属于该单位，申请被批准后，该单位为专利权人。（）","type":"1","value":"A","id":"71","anw":"正确"}
,
{"name":"知识产权的行为不可能受到刑事制裁。（）","type":"1","value":"B","id":"72","anw":"错误"}
,
{"name":"窃、贿赂、欺诈、胁迫或者其他不正当手段，获取权利人的商业秘密的行为是侵犯商业秘 密的行为。（）","type":"1","value":"A","id":"73","anw":"正确"}
,
{"name":"商标法的规定，地理标志在我国可以注册为普通商标受到法律保护。（）","type":"1","value":"B","id":"74","anw":"错误"}
,
{"name":"产权是一种法律所确认和保护的权利，属于私权。（）","type":"1","value":"A","id":"75","anw":"正确"}
,
{"name":"我国《专利法》规定，中国单位或个人在国内申请专利和办理其他专利事务的，应当委托 依法设立的专利代理机构办理。（）","type":"1","value":"B","id":"76","anw":"错误"}
,
{"name":"注册商标的，商标注册人对其在同一种或者类似商品上注册的相同或相近似的商标，应当 一并转让。（）","type":"1","value":"A","id":"77","anw":"正确"}
,
{"name":"中国注册的商标，一律不受我国商标法的保护。（）","type":"1","value":"B","id":"78","anw":"错误"}
,
{"name":"音制品用于有线或者无线公开传播，应当向录音制作者支付报酬。（）","type":"1","value":"A","id":"79","anw":"正确"}
,
{"name":"我国现行专利法的规定，取得实施强制许可的单位或者个人，应当付给专利权人合理的使 用费，使用费的数额可以由双方协商确定。（）","type":"1","value":"A","id":"80","anw":"正确"}
,
{"name":"法所称相关公众，是指与商标所标识的某类商品或者服务有关的消费者和与前述商品或者 服务的营销有密切关系的其他经营者。（）","type":"1","value":"A","id":"81","anw":"正确"}
,
{"name":"鼓励被授予专利权的单位实行产权激励，采取股权、期权、分红等方式，使发明人或者设 计人合理分享创新收益。（）","type":"1","value":"A","id":"82","anw":"正确"}
,
{"name":"环境损害赔偿诉讼的时效期间为三年，从损害发生时起计算。（）","type":"1","value":"B","id":"83","anw":"错误"}
,
{"name":"排污许可管理的企业事业单位和其他生产经营者应当按照排污许可证的要求排放污染物； 未取得排污许可证的，不得排放污染物。（）","type":"1","value":"A","id":"84","anw":"正确"}
,
{"name":"设区的市级人民政府环境保护主管部门和其他负有环境保护监督管理职责的部门应当依法 公开环境信息。（）","type":"1","value":"B","id":"85","anw":"错误"}
,
{"name":"级以上人民政府应当将环境保护工作纳入国民经济和社会发展规划。（）","type":"1","value":"B","id":"86","anw":"错误"}
,
{"name":"保护主管部门除了现场检查之外，还被赋予查封、扣押、限制生产、停产整治等权力。（）","type":"1","value":"A","id":"87","anw":"正确"}
,
{"name":"影响评价机构、环境监测机构以及从事环境监测设备和防治污染设施维护、运营的机构， 在有关环境服务活动中弄虚作假，对造成的环境污染和生态破坏负有责任的，除依照有关法律法规 规定予以处罚外，还应当与造成环境污染和生态破坏的其他责任者承担连带责任。（）","type":"1","value":"A","id":"88","anw":"正确"}
,
{"name":"业当月 31 日收到责令改正违法行为决定书，若 15 日复查时仍未改正其违法行为，按日 计罚天数为 1 天。（）","type":"1","value":"A","id":"89","anw":"正确"}
,
{"name":"过国家重点污染物排放总量控制指标或者未完成国家确定的环境质量目标的地区，省级以 上人民政府环境保护主管部门应当暂停审批其新增重点污染物排放总量的建设项目环境影响评价文 件。（）","type":"1","value":"A","id":"90","anw":"正确"}
,
{"name":"通过暗管、渗井、渗坑、灌注或者篡改、伪造监测数据，或者不正常运行防治污染设施等 逃避监管的方式违法排放污染物。（）","type":"1","value":"A","id":"91","anw":"正确"}
,
{"name":"各级人民政府应当对本行政区域的环境质量负责。（）","type":"1","value":"A","id":"92","anw":"正确"}
,
{"name":"保护坚持保护优先、预防为主、综合治理、公众参与、损害担责的原则。（）","type":"1","value":"A","id":"93","anw":"正确"}
,
{"name":"市场经济基础制度是构建高水平社会主义市场经济体制的重要内容。（）","type":"1","value":"A","id":"94","anw":"正确"}
,
{"name":"步全面深化改革要注重系统集成、注重突出重点、注重改革实效。（）","type":"1","value":"A","id":"95","anw":"正确"}
,
{"name":"定》提出的改革举措没有覆盖外交建设的领域。（）","type":"1","value":"A","id":"96","anw":"正确"}
,
{"name":"步全面深化改革的总目标是继续完善和发展中国特色社会主义制度、推进国家治理体系和 治理能力现代化。（）","type":"1","value":"A","id":"97","anw":"正确"}
,
{"name":"进改革过程中，要把平均主义贯穿改革各方面全过程。（）","type":"1","value":"B","id":"98","anw":"错误"}
,
{"name":"毫不动摇巩固和发展公有制经济，要严格控制非公有制经济的发展和扩张，保证各种所有 制经济依法平等使用生产要素、公平参与市场竞争、同等受到法律保护，促进各种所有制经济优势 互补、共同发展。（）","type":"1","value":"B","id":"99","anw":"错误"}
,
{"name":"的二十届三中全会提出了构建支持全面创新体制机制等改革举措，重视科技创新体制机制 的构建。（）","type":"1","value":"A","id":"100","anw":"正确"}
,
{"name":"一步全面深化改革的根本保证是坚持党的全面领导。（）","type":"1","value":"A","id":"101","anw":"正确"}
,
{"name":"外开放是中国式现代化的本质要求，必须坚持对外开放基本国策，坚持以开放促改革，依 托我国超大规模市场优势，在扩大国际合作中提升开放能力，建设更高水平开放型经济新体制。（）","type":"1","value":"B","id":"102","anw":"错误"}
,
{"name":"一步全面深化改革，必须紧紧围绕全面建成小康社会这个主题来展开。（）","type":"1","value":"B","id":"103","anw":"错误"}
,
{"name":"的二十届三中全会于 2024 年 7 月 15 日至 18 日在北京举行。（）","type":"1","value":"A","id":"104","anw":"正确"}
,
{"name":"上级检查、视察工作或者向上级汇报、报告工作时对应当报告的事项不报告或者不如实报 告，造成严重损害或者严重不良影响的，对直接责任者和领导责任者，给予警告或者严重警告处分； 情节严重的，给予撤销党内职务或者留党察看处分。（）","type":"1","value":"A","id":"105","anw":"正确"}
,
{"name":"用管理和服务对象的钱款、住房、车辆等，可能影响公正执行公务，情节较重的，给予警 告或者严重警告处分；情节严重的，给予撤销党内职务、留党察看或者开除党籍处分。（）","type":"1","value":"A","id":"106","anw":"正确"}
,
{"name":"于严重违犯党纪、本身又不能纠正的党组织，上一级党的委员会在查明核实后，根据情节 严重的程度，应当予以改组。（）","type":"1","value":"B","id":"107","anw":"错误"}
,
{"name":"党员领导干部采取弄虚作假手段把不符合党员条件的人发展为党员，根据新修订的《中国 共产党纪律处分条例》，其违反了工作纪律。（）","type":"1","value":"B","id":"108","anw":"错误"}
,
{"name":"活奢靡、铺张浪费、贪图享乐、追求低级趣味，造成不良影响的，给予撤销党内职务处分。 （）","type":"1","value":"B","id":"109","anw":"错误"}
,
{"name":"彻党中央决策部署只表态不落实，或者落实党中央决策部署不坚决，打折扣、搞变通，在 政治上造成不良影响或者严重后果的，给予警告或者严重警告处分；情节严重的，给予撤销党内职 务、留党察看或者开除党籍处分。（）","type":"1","value":"A","id":"110","anw":"正确"}
,
{"name":"级党组织拒不执行或者擅自改变上级党组织决定的，对所有责任者，给予警告或者严重警 告处分。（）","type":"1","value":"B","id":"111","anw":"错误"}
,
{"name":"经组织批准参加其他集会、游行、示威等活动，情节较轻的，给予警告或者严重警告处分； 情节较重的，给予撤销党内职务或者留党察看处分；情节严重的，给予开除党籍处分。（）","type":"1","value":"A","id":"112","anw":"正确"}
,
{"name":"反有关规定取得、持有、实际使用运动健身卡、会所和俱乐部会员卡、高尔夫球卡等各种 消费卡（券），或者违反有关规定出入私人会所，给予警告或者严重警告处分。（）","type":"1","value":"B","id":"113","anw":"错误"}
,
{"name":"用职权、教养关系、从属关系或者其他相类似关系与他人发生性关系的，从重处分。（）","type":"1","value":"A","id":"114","anw":"正确"}
,
{"name":"于在党内担任两个以上职务的，党组织在作处分决定时，应当明确是撤销其一切职务还是 一个或者几个职务。如果决定撤销其一个职务，必须撤销其担任的最低职务。（）","type":"1","value":"B","id":"115","anw":"错误"}
,
{"name":"行统计造假，对直接责任者和领导责任者，情节较轻的，给予警告或者严重警告处分；情 节较重的，给予撤销党内职务或者留党察看处分；情节严重的，给予开除党籍处分。（）","type":"1","value":"A","id":"116","anw":"正确"}
,
{"name":"轻处分，是指在《中国共产党纪律处分条例》规定的违纪行为应当受到的处分幅度以内， 减轻一档给予处分。（）","type":"1","value":"B","id":"117","anw":"错误"}
,
{"name":"到国家财产和群众生命财产受到严重威胁时，能救而不救，情节较重的，给予警告、严重 警告或者撤销党内职务处分；情节严重的，给予留党察看或者开除党籍处分。","type":"1","value":"A","id":"118","anw":"正确"}
,
{"name":"瞒入党前严重错误，但入党多年且一贯表现好的，可以不予除名。（）","type":"1","value":"A","id":"119","anw":"正确"}
,
{"name":"作中不负责任或者疏于管理，贯彻执行、检查督促落实上级决策部署不力，给党、国家和 人民利益以及公共财产造成较大损失的，对直接责任者和领导责任者给予撤销党内职务、留党察看 或者开除党籍处分。（）","type":"1","value":"B","id":"120","anw":"错误"}
,
{"name":"按照规定公开党务、政务、厂务、村（居）务等，侵犯群众知情权，对直接责任者和领导","type":"1","value":"A","id":"121","anw":"正确"}
,
{"name":"推进领导干部能上能下工作中，搞好人主义，以组织调整代替党纪政务处分，对直接责任 者和领导责任者，情节严重的，给予开除党籍处分。（）","type":"1","value":"B","id":"122","anw":"错误"}
,
{"name":"员在党纪处分影响期内又受到党纪处分的，其影响期为原处分尚未执行的影响期与新处分 影响期之和。（）","type":"1","value":"A","id":"123","anw":"正确"}
,
{"name":"组织进行谈话函询时，不如实向组织说明问题，同时向组织提供虚假情况、掩盖事实的， 依照对抗组织审查行为处理。（）","type":"1","value":"A","id":"124","anw":"正确"}
,
{"name":"家秘密的保密期限已满的，自行解密。（）","type":"1","value":"A","id":"125","anw":"正确"}
,
{"name":"家秘密的密级分为绝密、机密、秘密、普通四级。（）","type":"1","value":"B","id":"126","anw":"错误"}
,
{"name":"密场所应当按照国家有关规定经相关部门的安全技术检测，与境外机构、人员住所保持相 应的安全距离。（）","type":"1","value":"A","id":"127","anw":"正确"}
,
{"name":"算机信息系统的保密管理应实行领导负责制，由单位主管领导负责本单位的计算机信息系 统的保密工作，并指定有关机构和人员具体承办。（）","type":"1","value":"A","id":"128","anw":"正确"}
,
{"name":"要涉密部门的人员选配，应当坚持“先审后用”的原则，并定期进行考核，不适合的应及 时调整。（）","type":"1","value":"A","id":"129","anw":"正确"}
,
{"name":"家秘密的保密期限届满的，需经申请批准后解密。（）","type":"1","value":"A","id":"130","anw":"正确"}
,
{"name":"文件标注“秘密”，表示该文件保密期限为 40 年。（）","type":"1","value":"B","id":"131","anw":"错误"}
,
{"name":"份文件为机密级，保密期限是 10 年，应当标注为“机密六10 年”。（）","type":"1","value":"A","id":"132","anw":"正确"}
,
{"name":"守国家秘密的工作实行积极防范、突出重点、依法管理的方针，以确保国家秘密安全又便 利信息资源合理利用。（）","type":"1","value":"A","id":"133","anw":"正确"}
,
{"name":"切国家机关、武装力量、政党、社会团体、企业事业单位和公民都有保守国家秘密的义务。 （）","type":"1","value":"A","id":"134","anw":"正确"}
,
{"name":"得保密资质的企业事业单位违反国家保密规定的，由保密行政管理部门责令限期整改，给予警告或者通报批评；有违法所得的，没收违法所得。（）","type":"1","value":"A","id":"135","anw":"正确"}
,
{"name":"级以上保密行政管理部门建立保密风险评估机制、监测预警制度、应急处置制度，会同有 关部门开展信息收集、分析、通报工作。（）","type":"1","value":"B","id":"136","anw":"错误"}
,
{"name":"密行政管理部门在保密检查和案件调查处理中，经申请审批后才能依法查阅有关材料、询 问人员、记录情况，先行登记保存有关设施、设备、文件资料等；必要时，可以进行保密技术检测。 （）","type":"1","value":"B","id":"137","anw":"错误"}
,
{"name":"严重违反国家保密规定的涉密人员，保密行政管理部门应当建议有关机关、单位将其调离 涉密岗位。（）","type":"1","value":"A","id":"138","anw":"正确"}
,
{"name":"密人员严重违反离岗离职及脱密期国家保密规定的，机关、单位应当及时报告上级保密行 政管理部门，由保密行政管理部门会同有关部门依法采取处置措施。（）","type":"1","value":"B","id":"139","anw":"错误"}
,
{"name":"家建立安全保密产品和保密技术装备抽检、复检制度，由国家保密行政管理部门设立或者","type":"1","value":"A","id":"140","anw":"正确"}
,
{"name":"级以上人民政府应当将保密工作纳入本级国民经济和社会发展规划，所需经费列入本级预 算。（）","type":"1","value":"A","id":"141","anw":"正确"}
,
{"name":"络服务提供者为未成年人提供信息发布、即时通讯等服务的，可以不要求未成年人或者其 监护人提供未成年人真实身份信息。（）","type":"1","value":"B","id":"142","anw":"错误"}
,
{"name":"育、卫生健康、市场监督管理等部门依据各自职责对从事未成年人沉迷网络预防和干预活 动的机构实施监督管理。（）","type":"1","value":"A","id":"143","anw":"正确"}
,
{"name":"络服务提供者通过未成年人私密信息发现未成年人可能遭受侵害的，应当立即采取必要措 施保存有关记录，并向网信部门报告。（）","type":"1","value":"B","id":"144","anw":"错误"}
,
{"name":"人信息处理者应当将审计情况及时报告网信等部门。（）","type":"1","value":"A","id":"145","anw":"正确"}
,
{"name":"人信息处理者不得自行对其处理未成年人个人信息遵守法律、行政法规的情况进行合规审 计。（）","type":"1","value":"B","id":"146","anw":"错误"}
,
{"name":"作人员访问未成年人个人信息的，经过相关负责人或者其授权的管理人员审批后即可，无 需记录访问情况。（）","type":"1","value":"B","id":"147","anw":"错误"}
,
{"name":"生或者可能发生未成年人个人信息泄露、篡改、丢失的，个人信息处理者难以逐一告知的， 应当直接采取公开的方式及时发布相关警示信息。（）","type":"1","value":"B","id":"148","anw":"错误"}
,
{"name":"人信息处理者对其工作人员应当以比例为原则设定信息访问权限，控制未成年人个人信息 知悉范围。（）","type":"1","value":"B","id":"149","anw":"错误"}
,
{"name":"成年人用户数量巨大或者对未成年人群体具有显著影响的网络平台服务提供者，应当按照 国家规定建立健全未成年人网络保护合规制度体系，成立主要由外部成员组成的独立机构，对未成 年人网络保护情况进行监督；（）","type":"1","value":"A","id":"150","anw":"正确"}
,
{"name":"人信息处理者应当严格遵守国家网信部门和有关部门关于网络产品和服务必要个人信息范 围的规定，不得因为未成年人或者其监护人不同意处理未成年人非必要个人信息或者撤回同意，拒 绝未成年人使用其基本功能服务。（）","type":"1","value":"A","id":"151","anw":"正确"}
,
{"name":"络直播服务提供者应当建立网络直播发布者真实身份信息动态核验机制，不得向不符合法 律规定情形的未成年人用户提供网络直播发布服务。（）","type":"1","value":"A","id":"152","anw":"正确"}
,
{"name":"未成年人为服务对象的在线教育网络产品和服务提供者，应提供统一的、标准化的产品和 服务。（）","type":"1","value":"B","id":"153","anw":"错误"}
,
{"name":"能终端产品制造者应当在产品出厂前安装未成年人网络保护软件，或者采用显著方式告知 用户安装渠道和方法。（）","type":"1","value":"A","id":"154","anw":"正确"}
,
{"name":"务院教育部门应当将网络素养教育纳入学校素质教育内容，并会同国家网信部门制定未成 年人网络素养测评指标。（）","type":"1","value":"A","id":"155","anw":"正确"}
,
{"name":"级以上地方人民政府应当通过为中小学校配备具有相应专业能力的指导教师、政府购买服 务或者鼓励中小学校自行采购相关服务等方式，为学生提供优质的网络素养教育课程。（）","type":"1","value":"A","id":"156","anw":"正确"}
,
{"name":"级以上人民政府应当科学规划、合理布局，促进公益性上网服务均衡协调发展，加强提供 公益性上网服务的公共文化设施建设，改善未成年人上网条件。（）","type":"1","value":"A","id":"157","anw":"正确"}
,
{"name":"民委员会、村民委员会应当将国防教育纳入社会主义精神文明建设的内容，结合征兵工作、 拥军优属以及重大节日、纪念日活动，对居民、村民进行国防教育。（）","type":"1","value":"A","id":"158","anw":"正确"}
,
{"name":"业事业组织应当将国防教育列入职工教育计划，结合政治教育、业务培训、文化体育等活 动，对职工进行国防教育。（）","type":"1","value":"A","id":"159","anw":"正确"}
,
{"name":"批准的军营应当按照军队有关规定向社会开放。（）","type":"1","value":"A","id":"160","anw":"正确"}
,
{"name":"民国防教育根据不同类别、不同地区使用相应的国防教育大纲。（）","type":"1","value":"B","id":"161","anw":"错误"}
,
{"name":"有设区的市级以上人民政府应当加强对具有国防教育意义的文物的调查、登记和保护工作。 （）","type":"1","value":"B","id":"162","anw":"错误"}
,
{"name":"备有明确的国防教育主题内容、有健全的管理机构和规章制度、有相应的国防教育设施、 有必要的经费保障、有显著的社会教育效果的场所，可以由县级以上全民国防教育主管部门会同同","type":"1","value":"B","id":"163","anw":"错误"}
,
{"name":"级人民政府应当将国防教育纳入国民经济和社会发展规划以及年度计划，将国防教育经费 纳入预算。（）","type":"1","value":"B","id":"164","anw":"错误"}
,
{"name":"防教育基地应当对军队人员、退役军人和学生免费开放，在全民国防教育日向社会免费开 放。（）","type":"1","value":"A","id":"165","anw":"正确"}
,
{"name":"学和初级中学可以根据需要聘请校外辅导员，协助学校开展多种形式的国防教育活动。（）","type":"1","value":"A","id":"166","anw":"正确"}
,
{"name":"校可自主决定是否将国防教育列入学校的工作和教学计划。（）","type":"1","value":"B","id":"167","anw":"错误"}
,
{"name":"防教育是建设和巩固国防的基础，是增强民族凝聚力、提高全民素质的重要途径。（）","type":"1","value":"A","id":"168","anw":"正确"}
,
{"name":"国法定的全民国防教育日是每年 9 月的第三个星期六。（）","type":"1","value":"A","id":"169","anw":"正确"}
,
{"name":"等学校、高级中学和相当于高级中学的学校应当将课堂教学与军事训练相结合，对学生进 行国防教育。（）","type":"1","value":"A","id":"170","anw":"正确"}
,
{"name":"校的国防教育是全民国防教育的基础，是实施素质教育的重要内容。（）","type":"1","value":"A","id":"171","anw":"正确"}
,
{"name":"生军事训练大纲由所在学校制定。（）","type":"1","value":"B","id":"172","anw":"错误"}
,
{"name":"一行政执法机关对同一市场主体实施多项行政检查的，或者不同行政执法机关对同一市场 主体实施行政检查的，可以多次开展，不必一次性实施。（）","type":"1","value":"B","id":"173","anw":"错误"}
,
{"name":"、区县（自治县）人民政府应当将行政执法工作纳入法治建设考核，加强考核结果的运用。 （）","type":"1","value":"A","id":"174","anw":"正确"}
,
{"name":"政执法机关应当向社会公开其职责范围、执法依据、执法程序等事项，接受社会监督。任 何组织和个人发现违法线索或者对行政执法行为存在异议的，可以通过电话、信函、电子邮件等渠 道进行投诉举报。（）","type":"1","value":"A","id":"175","anw":"正确"}
,
{"name":"政执法人员应当依法取得行政执法资格，并参加执法培训。行政执法人员从事行政执法活 动时，可以不主动出示有效的执法证件，待当事人要求再出示。（）","type":"1","value":"B","id":"176","anw":"错误"}
,
{"name":"政执法机关之间存在行政执法争议的，应当协商解决；不能协商解决的，由司法行政部门 协调处理，协调不成的，报同级人民代表大会及其常务委员会决定。（）","type":"1","value":"B","id":"177","anw":"错误"}
,
{"name":"政执法机关应当畅通投诉举报渠道，健全投诉举报处理机制，对收到的投诉举报事项，应 当按照首问负责制予以登记，依法及时处理或者移送。（）","type":"1","value":"A","id":"178","anw":"正确"}
,
{"name":"施专业性、技术性较强或者复杂、疑难行政执法事项时，有关行政执法机关可以向其他行 政执法机关提出执法协作请求，其他行政执法机关应当予以支持。（）","type":"1","value":"A","id":"179","anw":"正确"}
,
{"name":"司法行政部门应当会同市级行政执法部门、区县（自治县）人民政府定期对行政执法事项 运行效能开展评估，行政执法事项运行效能评估不可以委托第三方机构实施。（）","type":"1","value":"B","id":"180","anw":"错误"}
,
{"name":"政执法机关应当建立健全跨部门、跨区域、跨层级的行政执法协同工作机制，推进违法线 索、证据材料、执法标准、处理结果的互通、互认。（）","type":"1","value":"A","id":"181","anw":"正确"}
,
{"name":"安行政部门代表本级政府承担行政执法监督具体事务，负责指导监督本行政区域的行政执 法工作，统筹协调行政执法体制改革、行政执法争议等工作。（）","type":"1","value":"B","id":"182","anw":"错误"}
,
{"name":"招标过程中，评标委员会成员信息在中标结果确定前应当保密。（）","type":"1","value":"A","id":"183","anw":"正确"}
,
{"name":"标专家在招标投标有关活动中有违法行为受到行政处罚或者受到刑事处罚，应当及时解除 聘任关系，调整出综合评标专家库。（）","type":"1","value":"A","id":"184","anw":"正确"}
,
{"name":"庆市推进招标投标项目全过程公开管理，除涉及国家秘密或者商业秘密外，应当依法公开 项目招标、投标、开标、评标、中标等信息。（）","type":"1","value":"A","id":"185","anw":"正确"}
,
{"name":"家工作人员在招标投标活动及其监督管理中滥用职权、玩忽职守、徇私舞弊的，依法给予 处分；构成犯罪的，依法追究刑事责任。（）","type":"1","value":"A","id":"186","anw":"正确"}
,
{"name":"标人应当按照合同约定履行义务，完成中标项目。中标人不得向他人转让中标项目，也不 得将中标项目肢解后分别向他人转让。（）","type":"1","value":"A","id":"187","anw":"正确"}
,
{"name":"法必须进行招标的项目，招标人应当在收到评标报告后，在招标公告发布媒介公示中标候 选人等相关信息，在公示期间有异议的，作出答复前，无须暂停招标投标活动。（）","type":"1","value":"B","id":"188","anw":"错误"}
,
{"name":"发展改革部门应当加强招标代理从业人员培训，依法指导开展招标代理从业人员职业能力 评价，提升招标代理服务能力。（）","type":"1","value":"A","id":"189","anw":"正确"}
,
{"name":"及国家安全、国家秘密、抢险救灾的项目按照国家有关规定可以不进行招标。（）","type":"1","value":"A","id":"190","anw":"正确"}
,
{"name":"标投标交易场所运行服务机构可以与招标投标行政监督部门存在隶属关系，并且兼顾营利 目的。（）","type":"1","value":"B","id":"191","anw":"错误"}
,
{"name":"于成本考虑，部分单位和个人可以将进行招标的项目化整为零。（）","type":"1","value":"B","id":"192","anw":"错误"}
,
{"name":"人民政府应当采取措施，建立政府、企业、个人多元化的环境保护投融资机制，鼓励引导 民间资本和社会资金参与生态环境保护，推行有利于环境保护的经济政策。（）","type":"1","value":"A","id":"193","anw":"正确"}
,
{"name":"、区县（自治县）人民政府应当每年向本级人民代表大会或者其常务委员会报告环境状况 和环境保护目标完成情况。（）","type":"1","value":"A","id":"194","anw":"正确"}
,
{"name":"销、调整地方级自然保护区，应当经区县（自治县）人民政府批准。（）","type":"1","value":"B","id":"195","anw":"错误"}
,
{"name":"、区县（自治县）人民政府应当建立环境资源承载力监测预警机制，开展生态环境损害鉴 定评估，实施生态环境治理修复。（）","type":"1","value":"A","id":"196","anw":"正确"}
,
{"name":"抢修、抢险施工作业等特殊情况外，禁止夜间在噪声敏感建筑物集中区域进行产生噪声的","type":"1","value":"A","id":"197","anw":"正确"}
,
{"name":"市将耕地和集中式饮用水水源地周边陆域地带等区域划定为土壤环境保护优先区域，但目 前该区域内还可以新建有色金属、皮革制品、石油煤炭、化工医药、铅蓄电池制造等项目。（）","type":"1","value":"B","id":"198","anw":"错误"}
,
{"name":"业可以根据固体废物污染防治减量化、资源化、无害化的原则，自行处理倾倒工业固体废 物。（）","type":"1","value":"B","id":"199","anw":"错误"}
,
{"name":"产中使用有毒、有害原料或者排放有毒、有害物质的企业，应当实施强制性清洁生产审核， 并公布重点污染物排放及治理情况。（）","type":"1","value":"A","id":"200","anw":"正确"}
,
{"name":"位和个人都有保护环境的义务，不得干扰、损害他人正常生活、工作和学习环境，并对其 行为所产生的环境污染和生态损害承担相应责任。（）","type":"1","value":"A","id":"201","anw":"正确"}
,
{"name":"境保护坚持经济优先、监督为主、综合治理、公众参与、损害担责的原则。（）","type":"1","value":"B","id":"202","anw":"错误"}
,
{"name":"定《重庆市知识产权保护和促进条例》的目的是为了加强知识产权保护，激发全社会创新 活力，培育和发展新质生产力，建设知识产权强市，推动经济社会高质量发展。（）","type":"1","value":"A","id":"203","anw":"正确"}
,
{"name":"有知识产权管理职责的部门应当依法采取措施，防止不以真实发明创造活动为基础的非正 常专利申请、不以使用为目的的恶意商标注册申请等行为出现。（）","type":"1","value":"A","id":"204","anw":"正确"}
,
{"name":"子商务平台经营者应当遵守及时公示知识产权侵权通知、不存在侵权行为的声明及处理结 果的义务。（）","type":"1","value":"A","id":"205","anw":"正确"}
,
{"name":"知识产权部门原则上不能委托县级人民政府知识产权部门处理该行政区域内的专利侵权纠 纷行政裁决案件。（）","type":"1","value":"B","id":"206","anw":"错误"}
,
{"name":"事人可以采取公证的方式保全知识产权相关证明材料，为证明知识产权在先使用、公开在 先等提供证据支持。（）","type":"1","value":"A","id":"207","anw":"正确"}
,
{"name":"市建立完善知识产权纠纷多元化解机制，引导和鼓励当事人尽量通过诉讼方式解决知识产 权纠纷，推动知识产权调解、行政裁决、行政复议、仲裁、诉讼等纠纷解决途径的有效衔接。（）","type":"1","value":"B","id":"208","anw":"错误"}
,
{"name":"民法院、人民检察院应当加强知识产权司法保护，依法惩处知识产权违法犯罪行为，保护 知识产权权利人的合法权益，同时通过发布典型案例、类案办案指南、司法保护状况等方式，为知 识产权保护提供指引。（）","type":"1","value":"A","id":"209","anw":"正确"}
,
{"name":"、区县（自治县）人民政府应当落实知识产权保护属地责任，加强知识产权行政执法能力 建设，推动建立健全知识产权保护体系。（）","type":"1","value":"A","id":"210","anw":"正确"}
,
{"name":"政府应当综合运用各种政策措施，推动建立以政府为主体、财政为导向、产学研用服相结 合的知识产权创造与运用体系。（）","type":"1","value":"B","id":"211","anw":"错误"}
,
{"name":"房租赁经纪机构不得为出租不符合建筑、消防、燃气、室内装饰装修等方面的法律、法规、 规章或者强制性标准的住房提供经纪服务。（）","type":"1","value":"A","id":"212","anw":"正确"}
,
{"name":"房租赁经纪机构应当对收费服务项目明码标价，不得在标价之外加价或者收取未予标明的 费用。（）","type":"1","value":"A","id":"213","anw":"正确"}
,
{"name":"房、卫生间、阳台、过道、地下储藏室、车库等虽然为非居住空间，但是仍然可以单独出 租用于居住。（）","type":"1","value":"B","id":"214","anw":"错误"}
,
{"name":"房租赁企业应当自领取营业执照之日起 30 日内，向所在地省级人民政府房产管理部门报送 开业信息。房产管理部门应当将住房租赁企业开业信息向社会公开。（）","type":"1","value":"B","id":"215","anw":"错误"}
,
{"name":"房租赁企业、住房租赁经纪机构如果未按照规定报送开业信息，由县级以上地方人民政府 房产管理部门责令改正，给予警告；拒不改正的，处 2 万元以上 10 万元以下的罚款。（）","type":"1","value":"A","id":"216","anw":"正确"}
,
{"name":"住房租赁活动中，因押金返还、住房维修、住房腾退等产生纠纷的，由出租人和承租人协 商解决；协商不成的，可以依法申请调解，但不可以进行仲裁或者提起诉讼。（）","type":"1","value":"B","id":"217","anw":"错误"}
,
{"name":"房租赁企业应当建立住房租赁档案，如实记载相关信息，不得非法收集、使用、加工、传 输他人个人信息，不得非法买卖、提供或者公开他人个人信息。（）","type":"1","value":"A","id":"218","anw":"正确"}
,
{"name":"家鼓励居民家庭将自有房源用于租赁，支持出租人和承租人依法建立稳定的住房租赁关系。 （）","type":"1","value":"A","id":"219","anw":"正确"}
,
{"name":"房租赁市场发展应当贯彻党和国家路线方针政策、决策部署，坚持市场主导与政府引导相","type":"1","value":"A","id":"220","anw":"正确"}
,
{"name":"租人依法解除住房租赁合同的，应当通知承租人，并马上要求承租人腾退租赁住房。（）","type":"1","value":"B","id":"221","anw":"错误"}
,
{"name":"家依法采取必要措施，保护国家的海外利益不受威胁和侵害。（）","type":"1","value":"A","id":"222","anw":"正确"}
,
{"name":"家安全机关应当依法搜集涉及国家安全的情报信息，并且情报信息的报送应当及时、准确、 客观，不得迟报、漏报、瞒报和谎报。（）","type":"1","value":"A","id":"223","anw":"正确"}
,
{"name":"央军事委员会领导全国武装力量，决定军事战略和武装力量的作战方针，统一指挥维护国 家安全的军事行动。（）","type":"1","value":"A","id":"224","anw":"正确"}
,
{"name":"家坚持和完善民族区域自治制度，巩固和发展平等团结互助和谐的社会主义民族关系。（）","type":"1","value":"A","id":"225","anw":"正确"}
,
{"name":"民和组织应当履行及时报告危害国家安全活动的线索、如实提供所知悉的涉及危害国家安 全活动的证据、为国家安全工作提供便利条件或者其他协助等维护国家安全的义务。（）","type":"1","value":"A","id":"226","anw":"正确"}
,
{"name":"务院依照宪法规定，决定战争和和平的问题，行使宪法规定的涉及国家安全的其他职权。（）","type":"1","value":"B","id":"227","anw":"错误"}
,
{"name":"护国家安全，应当坚持预防为主、标本兼治，专门工作与群众路线相结合，充分发挥专门 机关和其他有关机关维护国家安全的职能作用。（）","type":"1","value":"A","id":"228","anw":"正确"}
,
{"name":"家安全工作应当坚持总体国家安全观，以人民安全为宗旨，以国际安全为根本。（）","type":"1","value":"B","id":"229","anw":"错误"}
,
{"name":"级以上人民政府食品安全监督管理部门发现可能误导消费者和社会舆论的食品安全信息， 应当立即组织有关部门、专业机构、相关食品生产经营者等进行核实、分析，并及时公布结果。（）","type":"1","value":"A","id":"230","anw":"正确"}
,
{"name":"反本法规定，造成人身、财产或者其他损害的，依法承担赔偿责任。生产经营者财产不足 以同时承担民事赔偿责任和缴纳罚款、罚金时，先缴纳罚款、罚金。","type":"1","value":"B","id":"231","anw":"错误"}
,
{"name":"反本法规定，县级以上地方人民政府隐瞒、谎报、缓报食品安全事故，对直接负责的主管 人员和其他直接责任人员给予记大过处分；情节较重的，给予降级或者撤职处分；情节严重的，给 予开除处分；造成严重后果的，其主要负责人还应当引咎辞职。（）","type":"1","value":"A","id":"232","anw":"正确"}
,
{"name":"品生产经营者在一年内累计两次因违反本法规定受到责令停产停业、吊销许可证以外处罚 的，由食品安全监督管理部门责令停产停业，直至吊销许可证。（）","type":"1","value":"B","id":"233","anw":"错误"}
,
{"name":"食品生产加工小作坊、食品摊贩等违法行为的处罚，依照当地县级人民政府制定的具体管 理办法执行。（）","type":"1","value":"B","id":"234","anw":"错误"}
,
{"name":"品经营者应当按照食品标签标示的警示标志、警示说明或者注意事项的要求销售食品。（）  A. 正确","type":"1","value":"A","id":"235","anw":"正确"}
,
{"name":"产经营转基因食品应当按照规定显著标示。（）","type":"1","value":"A","id":"236","anw":"正确"}
,
{"name":"品生产企业应当就原料、生产关键环节、检验、运输和交付制定并实施控制要求，保证所 生产的食品符合食品安全标准。（）","type":"1","value":"A","id":"237","anw":"正确"}
,
{"name":"品生产经营者应当按照食品安全国家标准使用食品添加剂。（）","type":"1","value":"A","id":"238","anw":"正确"}
,
{"name":"家对食品生产经营实行许可制度。从事食品生产、食品销售、餐饮服务，应当依法取得许 可，同时销售食用农产品和仅销售预包装食品的，也需要取得许可。（）","type":"1","value":"B","id":"239","anw":"错误"}
,
{"name":"地方特色食品，没有食品安全国家标准的，省、自治区、直辖市人民政府卫生行政部门可 以制定并公布食品安全地方标准，报国务院卫生行政部门备案。（）","type":"1","value":"A","id":"240","anw":"正确"}
,
{"name":"定食品安全标准，应当以促进经济发展为宗旨。（）","type":"1","value":"B","id":"241","anw":"错误"}
,
{"name":"会保险水平应当与当地社会经济发展水平和社会承受能力相适应。（）","type":"1","value":"A","id":"242","anw":"正确"}
,
{"name":"人单位以暴力、威胁或者非法限制人身自由的手段强迫劳动，或者侮辱、体罚、殴打、非 法搜查和拘禁劳动者，由公安机关对责任人员处以十五日以下拘留、罚款或者警告；构成犯罪的， 对责任人员依法追究刑事责任。（）","type":"1","value":"A","id":"243","anw":"正确"}
,
{"name":"人单位强令劳动者违章冒险作业，发生重大伤亡事故，造成严重后果的，对责任人员给予 治安管理处罚。（）","type":"1","value":"B","id":"244","anw":"错误"}
,
{"name":"人单位解除劳动合同后，未依照《中华人民共和国劳动法》规定给予劳动者经济补偿的， 由劳动行政部门责令支付劳动者的工资报酬、经济补偿，并可以责令支付赔偿金。（）","type":"1","value":"A","id":"245","anw":"正确"}
,
{"name":"必要时，可以安排女职工、未成年人从事矿山井下的劳动。（）","type":"1","value":"B","id":"246","anw":"错误"}
,
{"name":"家实行最低工资保障制度。最低工资的具体标准由当地县级人民政府规定，报国务院备案。 用人单位支付劳动者的工资不得低于当地最低工资标准。（）","type":"1","value":"B","id":"247","anw":"错误"}
,
{"name":"人单位在元旦、春节节日期间应当依法安排劳动者休假。（）","type":"1","value":"A","id":"248","anw":"正确"}
,
{"name":"家实行劳动者每日工作时间不超过八小时、平均每周工作时间不超过四十八小时的工时制 度。（）","type":"1","value":"B","id":"249","anw":"错误"}
,
{"name":"果用人单位未按照劳动合同约定支付劳动报酬或者提供劳动条件的，劳动者可以随时通知 用人单位解除劳动合同。（）","type":"1","value":"A","id":"250","anw":"正确"}
,
{"name":"动者解除劳动合同，应当提前三十日以书面形式通知用人单位。（）","type":"1","value":"A","id":"251","anw":"正确"}
,
{"name":"三在劳动合同试用期内实施犯罪，被依法追究刑事责任，此时用人单位可以立即解除劳动 合同。（）","type":"1","value":"A","id":"252","anw":"正确"}
,
{"name":"动合同可以约定试用期，试用期最长不得超过两年。（）","type":"1","value":"B","id":"253","anw":"错误"}
,
{"name":"动合同的无效需要由劳动争议仲裁委员会或者人民法院确认。（）","type":"1","value":"A","id":"254","anw":"正确"}
,
{"name":"止用人单位招用未满十八周岁的未成年人。（）","type":"1","value":"B","id":"255","anw":"错误"}
,
{"name":"外仲裁委员会可以从具有法律、经济贸易、科学技术等专门知识的外籍人士中聘任仲裁员。 （）","type":"1","value":"A","id":"256","anw":"正确"}
,
{"name":"事人在仲裁过程中有权进行辩论。辩论终结时，首席仲裁员或者独任仲裁员应当征询当事 人的最后意见。（）","type":"1","value":"A","id":"257","anw":"正确"}
,
{"name":"裁调解书经双方当事人签收后，即发生法律效力。（）","type":"1","value":"A","id":"258","anw":"正确"}
,
{"name":"裁庭在作出裁决前，可以先行调解。调解达成协议的，仲裁庭应当制作调解书或者根据协 议的结果制作裁决书，但是调解书的法律效力低于裁决书。（）","type":"1","value":"B","id":"259","anw":"错误"}
,
{"name":"裁庭仲裁纠纷时，其中一部分事实已经清楚，可以就该部分先行裁决。（）","type":"1","value":"A","id":"260","anw":"正确"}
,
{"name":"决书由仲裁员签名，加盖仲裁委员会印章。对裁决持不同意见的仲裁员，也必须签名。（）  A. 正确","type":"1","value":"B","id":"261","anw":"错误"}
,
{"name":"裁庭应当将开庭情况记入笔录。当事人和其他仲裁参与人认为对自己陈述的记录有遗漏或 者差错的，有权申请补正。如果不予补正，应当记录该申请。（）","type":"1","value":"A","id":"262","anw":"正确"}
,
{"name":"裁一般情况下应该公开进行。（）","type":"1","value":"B","id":"263","anw":"错误"}
,
{"name":"裁员私自会见当事人、代理人，或者接受当事人、代理人的请客送礼的，必须回避，当事 人也有权提出回避申请。（）","type":"1","value":"A","id":"264","anw":"正确"}
,
{"name":"事人达成仲裁协议，一方向人民法院起诉未声明有仲裁协议，人民法院受理后，另一方在","type":"1","value":"A","id":"265","anw":"正确"}
,
{"name":"裁委员会收到仲裁申请书之日起三十日内，认为符合受理条件的，应当受理，并通知当事 人。（）","type":"1","value":"B","id":"266","anw":"错误"}
,
{"name":"事人之间没有仲裁协议的，依然可以进行仲裁。（）","type":"1","value":"B","id":"267","anw":"错误"}
,
{"name":"及婚姻、收养、监护、扶养、继承方面纠纷内容的，不能仲裁。（）","type":"1","value":"A","id":"268","anw":"正确"}
,
{"name":"家、社会、学校、家庭加强协同配合，根据青少年的身心特点和成长需求，对青少年开展 法治宣传教育，普及青少年所必需的法律知识，教育引导青少年树立守法意识、规则意识、诚信意 识和防范违法犯罪的意识。（）","type":"1","value":"A","id":"269","anw":"正确"}
,
{"name":"家工作人员应当带头尊法学法守法用法，树立依法履职的法治观念，提高运用法治思维和 法治方式深化改革、推动发展、化解矛盾、维护稳定、应对风险的能力。（）","type":"1","value":"A","id":"270","anw":"正确"}
,
{"name":"占、破坏法治宣传教育设施，损毁展品、器材的，由有关主管部门责令限期改正，并给予 批评教育。（）","type":"1","value":"A","id":"271","anw":"正确"}
,
{"name":"育行政部门应当建立法治文化场所名录，向社会公布。（）","type":"1","value":"B","id":"272","anw":"错误"}
,
{"name":"级以上人民政府应当将法治宣传教育工作纳入本地区法治建设总体部署，纳入精神文明建 设和平安建设。（）","type":"1","value":"A","id":"273","anw":"正确"}
,
{"name":"加强法治宣传教育，报刊、广播、电视等新闻媒体和网络服务提供者应当通过开设法治专 栏专题、刊播法治公益广告、报道法治新闻等形式，提高公民法治素质。（）","type":"1","value":"A","id":"274","anw":"正确"}
,
{"name":"法行政部门应当加强法治教育师资培养和培训，建立稳定的专职或者兼职法治教育师资队 伍，同时应当加强对学校各类法治宣传教育活动的协调指导。（）","type":"1","value":"B","id":"275","anw":"错误"}
,
{"name":"国将逐渐实施领导干部应知应会党内法规和法律法规清单制度。有关部门、单位应当将宪 法和与履职密切相关的法律法规纳入领导干部应知应会法律法规清单，并动态调整。（）","type":"1","value":"A","id":"276","anw":"正确"}
,
{"name":"张参加今年中央、国家机关公务员录用考试，将可能会遇到有关法律知识的测试。（）","type":"1","value":"A","id":"277","anw":"正确"}
,
{"name":"律法规制定机关应当加强立法全过程宣传解读，积极采取多种形式发布信息、介绍情况、 回应关切。（）","type":"1","value":"A","id":"278","anw":"正确"}
,
{"name":"家加强对开展境外投资合作、对外援助的企业以及出境人员等的法治宣传教育，提供涉外 法律服务，引导其既需要遵守我国法律，也需要遵守他国当地法律。（）","type":"1","value":"A","id":"279","anw":"正确"}
,
{"name":"极吸收外国法治思想是现今我国法治宣传教育的主要内容之一。（）","type":"1","value":"B","id":"280","anw":"错误"}
,
{"name":"族事务部门应当以地方民族自治为主线，开展法治宣传教育。（）","type":"1","value":"B","id":"281","anw":"错误"}
,
{"name":"务院公安部门主管全国法治宣传教育工作。县级以上地方人民政府公安部门主管本行政区 域的法治宣传教育工作。（）","type":"1","value":"B","id":"282","anw":"错误"}
,
{"name":"级以上人民政府司法行政部门未依法履行法治宣传教育工作职责的，只能由本级人民政府 责令限期改正。（）","type":"1","value":"B","id":"283","anw":"错误"}
,
{"name":"家有权根据实际情况，设置法治宣传纪念日、开展一系列群众性法治宣传教育活动，持续 深入开展全民普法。（）","type":"1","value":"A","id":"284","anw":"正确"}
,
{"name":"家实行公民终身法治教育制度，将法治教育纳入国民教育、干部教育、社会教育体系。（）","type":"1","value":"A","id":"285","anw":"正确"}
,
{"name":"反《中华人民共和国法治宣传教育法》规定，造成他人损害的，依法承担民事责任或行政 处罚，不涉及刑事处罚。（）","type":"1","value":"B","id":"286","anw":"错误"}
,
{"name":"年 12 月 4 日为国家宪法日，国家通过多种形式开展宪法宣传教育活动。（）","type":"1","value":"A","id":"287","anw":"正确"}
,
{"name":"家机关按照“谁立法谁普法”的精神，实行普法责任制。（）","type":"1","value":"B","id":"288","anw":"错误"}
,
{"name":"他人没有法律根据，取得不当利益，受损失的人有权请求其返还不当利益。（）","type":"1","value":"A","id":"289","anw":"正确"}
,
{"name":"法人组织包括个人独资企业、合伙企业、不具有法人资格的专业服务机构等。（）","type":"1","value":"A","id":"290","anw":"正确"}
,
{"name":"母对未成年子女负有抚养、教育和保护的义务。父母未尽到义务的，成年子女对父母可以 拒绝承担赡养、扶助和保护的义务。（）","type":"1","value":"B","id":"291","anw":"错误"}
,
{"name":"然人的民事责任能力一律平等。（）","type":"1","value":"B","id":"292","anw":"错误"}
,
{"name":"法负担被监护人抚养费、赡养费、扶养费的父母、子女、配偶等，被人民法院撤销监护人 资格后，可以不继续履行负担的义务。（）","type":"1","value":"B","id":"293","anw":"错误"}
,
{"name":"然人以户籍登记或者其他有效身份登记记载的居所为住所；经常居所与住所不一致的，经 常居所视为住所。（）","type":"1","value":"A","id":"294","anw":"正确"}
,
{"name":"能辨认或者不能完全辨认自己行为的成年人，其利害关系人或者有关组织，可以向人民法 院申请认定该成年人为无民事行为能力人或者限制民事行为能力人。（）","type":"1","value":"A","id":"295","anw":"正确"}
,
{"name":"然人非因意外事件下落不明满二年的，利害关系人可以向人民法院申请宣告该自然人死亡。 （）","type":"1","value":"B","id":"296","anw":"错误"}
,
{"name":"张年满十七周岁后外出务工，完全以自己的劳动收入为主要生活来源，但因为其尚未年满 十八周岁，因此在法律上仍被视为限制民事行为能力人。（）","type":"1","value":"B","id":"297","anw":"错误"}
,
{"name":"然人死亡后，在特殊情况下仍享有民事权利，承担民事义务。（）","type":"1","value":"B","id":"298","anw":"错误"}
,
{"name":"理民事纠纷，应当依照法律，不得适用习惯，也不得违背公序良俗。（）","type":"1","value":"B","id":"299","anw":"错误"}
,
{"name":"事主体在民事活动中的法律地位一律平等。（）","type":"1","value":"A","id":"300","anw":"正确"}
,
{"name":"华人民共和国主席、副主席由全国人民代表大会常务委员会选举产生。有选举权和被选举 权的年满四十周岁的中华人民共和国公民可以被选为中华人民共和国主席、副主席。（）","type":"1","value":"B","id":"301","anw":"错误"}
,
{"name":"具有中华人民共和国国籍的人都是中华人民共和国公民。（）","type":"1","value":"A","id":"302","anw":"正确"}
,
{"name":"市的土地属于国家和集体共同所有。（）","type":"1","value":"B","id":"303","anw":"错误"}
,
{"name":"族自治地方的自治机关是自治区、自治州、自治县的人民代表大会和人民政府。（）","type":"1","value":"A","id":"304","anw":"正确"}
,
{"name":"家在必要时得设立特别行政区。在特别行政区内实行的制度按照具体情况由国务院以法律 规定。（）","type":"1","value":"B","id":"305","anw":"错误"}
,
{"name":"国《中华人民共和国宪法》规定，自治乡属于民族自治地方。（）","type":"1","value":"B","id":"306","anw":"错误"}
,
{"name":"会主义的公共财产神圣不可侵犯。国家保护社会主义的公共财产。禁止任何组织或者个人 用任何手段侵占或者破坏国家和集体的财产。（）","type":"1","value":"A","id":"307","anw":"正确"}
,
{"name":"华人民共和国全国人民代表大会常务委员会是最高国家权力机关。（）","type":"1","value":"B","id":"308","anw":"错误"}
,
{"name":"华人民共和国实行依法治国，建设社会主义法制国家。（）","type":"1","value":"B","id":"309","anw":"错误"}
,
{"name":"华人民共和国是工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家。（）","type":"1","value":"A","id":"310","anw":"正确"}
,
{"name":"加强理想信念教育，深入开展社会主义核心价值观和社会主义法治理念教育，推进法治专 门队伍革命化、正规化、专业化、职业化，确保做到忠于党、忠于国家、忠于人民、忠于法律。（）","type":"1","value":"A","id":"311","anw":"正确"}
,
{"name":"持全面推进民主立法、严格司法、公正执法、人民守法，要继续推进法治领域改革，解决 好立法、执法、司法、守法等领域的突出矛盾和问题。（）","type":"1","value":"B","id":"312","anw":"错误"}
,
{"name":"国特色社会主义法治体系是推进全面依法治国的总抓手。要加快形成完备的法律规范体系、 高效的法治实施体系、严密的法治监督体系、有力的法治保障体系，形成完善的党内法规体系。（）","type":"1","value":"A","id":"313","anw":"正确"}
,
{"name":"领导人民制定和实施宪法法律，党自身也要在宪法法律范围内活动。（）","type":"1","value":"A","id":"314","anw":"正确"}
,
{"name":"民当家作主是推进全面依法治国的根本保证。（）","type":"1","value":"B","id":"315","anw":"错误"}
,
{"name":"近平法治思想的根本立足点是坚持司法公正。（）","type":"1","value":"B","id":"316","anw":"错误"}
,
{"name":"会号召，全市各级党组织和广大党员、干部要更加紧密地团结在以习近平同志为核心的党 中央周围，以推动城市高质量发展、建设现代化人民城市的新气象新作为新成效，为奋力谱写中国 式现代化重庆篇章提供坚实支撑。（）","type":"1","value":"A","id":"317","anw":"正确"}
,
{"name":"会要求，要加强党对城市工作的全面领导，构建党建统领超大城市整体智治体系，完善党 建统领“141”基层智治体系，健全法规政策保障体系，激励广大党员干部干事创业、担当作为， 营造全社会共建现代化人民城市浓厚氛围。（）","type":"1","value":"A","id":"318","anw":"正确"}
,
{"name":"会对推进现代化人民城市建设的重点任务作了部署，着力优化城市空间布局，构建“一核 引领、多点支撑、协调发展”城镇体系。（）","type":"1","value":"A","id":"319","anw":"正确"}
,
{"name":"庆市委六届七次全会规划，到 2035 年，现代化人民城市建设取得新的重大进展，成为人 工智能时代具有普遍意义的治理范例，引领西部地区现代化的核心增长极动力源，展示中国式现代 化人民城市文明新形态的重要窗口。（）","type":"1","value":"B","id":"320","anw":"错误"}
,
{"name":"庆市委六届七次全会强调，要扎实推动习近平总书记重要指示要求和党中央关于城市工作 的重大决策部署落地见效，把学习贯彻习近平总书记关于城市工作的重要论述，与贯彻落实习近平 总书记视察重庆重要讲话重要指示精神和党中央决策部署结合起来。（）","type":"1","value":"A","id":"321","anw":"正确"}
,
{"name":"庆市委六届七次全会认为，在党中央召开的中央城市工作会议中，习近平总书记发表的重 要讲话，科学回答了城市发展为了谁、依靠谁以及建设什么样的城市、怎样建设城市等重大理论和 实践问题，是习近平新时代中国特色社会主义思想的“社会篇”。（）","type":"1","value":"B","id":"322","anw":"错误"}
,
{"name":"025 年 8 月 18 日中国共产党重庆市第六届委员会第七次全会审议通过了《中共重庆市委关 于全面贯彻落实习近平总书记重要讲话重要指示精神积极探索超大城市现代化治理新路子高水平建 设现代化人民城市的意见》。（）","type":"1","value":"A","id":"323","anw":"正确"}
,
{"name":"据《党政机关国内公务接待管理规定》，接待单位不得有以下哪些行为？（ ）。","type":"4","value":"ABCD","id":"324","anw":"在机场、车站、码头和辖区边界组织迎送活动  & 跨地区迎送  & 张贴悬挂标语横幅  & 安排群众迎送"}
,
{"name":"据《党政机关国内公务接待管理规定》，国内公务接待应当坚持的原则包括（ ）。","type":"4","value":"ABCD","id":"325","anw":"有利公务  & 务实节俭  & 严格标准  & 简化礼仪"}
,
{"name":"党政机关厉行节约反对浪费条例》规定，会议期间，不得（ ）。","type":"4","value":"ABCD","id":"326","anw":"安排宴请  & 组织旅游以及与会议无关的参观活动  & 发放纪念品  & 在会议费中列支公务接待费"}
,
{"name":"党政机关厉行节约反对浪费条例》的制定目的是（ ）。","type":"4","value":"ABCD","id":"327","anw":"推进党政机关厉行节约反对浪费  & 降低公务活动成本  & 加强廉政建设  & 遏制享乐主义和奢靡之风"}
,
{"name":"适用《评比表彰和创建示范活动管理办法》的评比表彰和创建示范活动是（","type":"4","value":"ABCD","id":"328","anw":"各单位面向本单位内设机构和人员开展的评比表彰和创建示范活动 & 年度考核、任期考核、绩效考核、目标考核、责任制考核，通报表扬，根据有关党内法规、法律 法规开展的记功、嘉奖等奖励活动  & 体育比赛、技能竞赛、练兵比武、劳动竞赛等比赛竞赛  & 改革试点、试验、先行等工作"}
,
{"name":"据《评比表彰和创建示范活动管理办法》，（ ）经批准可以开展评比表彰和创建示范活动。","type":"3","value":"ABC","id":"329","anw":"中央和国家机关部门、中央一级群团组织  & 省（自治区、直辖市）党委、人大、政府、政协、监委、法院、检察院  & 省（自治区、直辖市）党委和政府部门、群团组织"}
,
{"name":"中国共产党思想政治工作条例》规定，加强思想政治工作队伍建设的措施包括（ ）。","type":"4","value":"ABCD","id":"330","anw":"配齐配强工作力量  & 选优配强主要负责人  & 加强培养培训  & 落实待遇保障"}
,
{"name":"整治形式主义为基层减负若干规定》着力解决的问题包括（ ）。","type":"4","value":"ABCD","id":"331","anw":"党性不纯、政绩观错位  & 文山会海反弹回潮  & 督查检查考核过多过频、过度留痕 & 干部不敢担当作为"}
,
{"name":"整治形式主义为基层减负若干规定》要求，要下大力气解决（","type":"2","value":"AB","id":"332","anw":"重迹不重绩 & 留痕不留心"}
,
{"name":"整治形式主义为基层减负若干规定》强调，要严格控制涉村的（","type":"4","value":"ABCD","id":"333","anw":"各类会议 & 文件数量 & 督查检查 & 考核评比"}
,
{"name":"据《重庆市大综合一体化行政执法条例》第 22 条，关于行政执法保障，以下哪些说法正确 （）。","type":"4","value":"ABCD","id":"334","anw":"市、区县政府应加大行政执法投入  & 推进非现场执法、移动执法基础设施统筹建设和共享使用  & 保障行政执法工作经费、办公用房、执法装备  & 保障行政执法人员有关权益"}
,
{"name":"据《重庆市大综合一体化行政执法条例》第 21 条，关于行政执法辅助人员，以下哪些说法 正确（）。","type":"3","value":"ABD","id":"335","anw":"行政执法机关可根据需要合理配备辅助人员  & 辅助人员经培训合格后可辅助开展宣传教育、日常巡查等工作  & 行政执法机关应加强对辅助人员的监督管理"}
,
{"name":"据《重庆市大综合一体化行政执法条例》第 15 条，关于行业监管规则和标准，以下哪些说 法正确（）。","type":"3","value":"BCD","id":"336","anw":"规则和标准应明确监管对象、内容、方法、频次等  & 市司法行政部门可会同部门对规则和标准开展评估论证  & 市级行政执法部门应制定并公开行业监管规则和标准"}
,
{"name":"据《重庆市大综合一体化行政执法条例》第 5 条，关于行政执法体制，以下哪些说法正确 （）。","type":"3","value":"ABC","id":"337","anw":"本市实行以区县（自治县）为主的行政执法体制  & 市级行政执法部门负责重大违法案件查处和跨区域执法协调  & 法律、法规规定市和区县均可以实施的执法事项，一般由区县实施"}
,
{"name":"行政执法部门在数字化执法中，下列做法符合《重庆市大综合一体化行政执法条例》规定","type":"3","value":"BCD","id":"338","anw":"运用全市统一基础数据库数据  & 通过移动执法设备开展现场检查  & 采用非现场执法方式采集证据"}
,
{"name":"据《重庆市大综合一体化行政执法条例》规定，市司法行政部门在行政执法事项清单方面 的职责包括（）。","type":"4","value":"ABCD","id":"339","anw":"审核各行业领域的行政执法事项清单  & 汇总形成本市行政执法事项总清单  & 分类形成综合行政执法事项清单和部门行政执法事项清单  & 制定清单编制规范和管理运行办法"}
,
{"name":"据《重庆市大综合一体化行政执法条例》有关规定，关于“大综合一体化行政执法”的定 义，以下哪些说法符合条例规定（）？","type":"3","value":"ABD","id":"340","anw":"通过精简执法队伍、调整执法事项等方式构建  & 按照整体政府和数字政府理念构建  & 涉及创新执法监管、强化执法监督、统一执法平台"}
,
{"name":"据《重庆市大综合一体化行政执法条例》有关规定，以下表述正确的有（）。","type":"2","value":"CD","id":"341","anw":"行政执法机关应当畅通投诉举报渠道，健全投诉举报处理机制，对收到的投诉举报事项，应当按 照首问负责制予以登记，依法及时处理或者移送。  & 多个行政执法机关对同类市场主体实施监管的，可以创新执法方式，对执法事项、监管规则等进 行综合集成，提高执法效能。"}
,
{"name":"据《重庆市招标投标条例》，下列哪些关于全过程公开的说法正确（）。","type":"4","value":"ABCD","id":"342","anw":"除涉及国家秘密或商业秘密外，应依法公开招标投标信息  & 拟不招标或邀请招标的，应公示理由和依据  & 中标合同签订后，应公开合同基本信息  & 合同变更事由和价格应公开"}
,
{"name":"据《重庆市招标投标条例》，下列哪些关于招标档案的说法正确（）。","type":"3","value":"ABD","id":"343","anw":"依法必须进行招标的项目，招标人应当妥善保存招标档案  & 招标档案的保存期限自合同签订之日起不少于十五年  & 招标投标交易场所运行服务机构应当按照规定保存招标档案"}
,
{"name":"据《重庆市招标投标条例》，依法必须进行招标的项目，投标人少于三个的，应当如何处理 （）。","type":"3","value":"ABC","id":"344","anw":"应当依法重新招标  & 重新招标的投标人仍然少于三个的，按照法定程序开标和评标  & 重新招标经评审有有效投标人的，应当依法确定中标候选人"}
,
{"name":"据《重庆市招标投标条例》，在处理投诉过程中，发展改革部门可以行使下列哪些职权（）。","type":"3","value":"ACD","id":"345","anw":"对招标人、投标人等进行现场检查  & 询问相关单位和人员，核实情况  & 调取、查阅、复制与招标项目有关的文件资料"}
,
{"name":"据《重庆市招标投标条例》，评标委员会在评标过程中，应当自主完成下列哪些工作（）。","type":"4","value":"ABCD","id":"346","anw":"编制评标表格  & 计算汇总评分  & 撰写评标报告  & 处理投标人澄清、说明或补正"}
,
{"name":"据《重庆市招标投标条例》，关于投标保证金，下列哪些说法正确（）。","type":"3","value":"ABD","id":"347","anw":"投标保证金不得超过招标项目估算价的 2%  & 投标保证金的有效期应当与投标有效期一致  & 招标人可以委托交易场所运行服务机构代收代管"}
,
{"name":"据《重庆市招标投标条例》，关于异常低价警戒线，下列哪些说法正确（）。","type":"3","value":"ABC","id":"348","anw":"采用综合评估法时，招标人可以设置异常低价警戒线  & 采用经评审的最低投标价法时，招标人应当设置异常低价警戒线  & 异常低价警戒线应当科学合理，综合考虑项目社会平均成本"}
,
{"name":"据《重庆市招标投标条例》，评标专家应当具备下列哪些条件（）。","type":"3","value":"ABD","id":"349","anw":"品德良好，作风正派，公正廉洁履行职责  & 具备正常履行评标职责的身体条件  & 熟练掌握电子化评标技能或同等水平"}
,
{"name":"据《重庆市招标投标条例》，招标代理机构不得有下列哪些行为（）。","type":"4","value":"ABCD","id":"350","anw":"采取行贿、提供回扣等非法手段承揽业务  & 承担同一招标代理项目的投标代理或投标咨询业务  & 以他人名义或允许他人借自己名义承接业务  & 转让或拆分招标代理业务"}
,
{"name":"据《重庆市招标投标条例》，下列哪些情形属于必须进行招标的工程建设项目（）","type":"3","value":"ABC","id":"351","anw":"施工单项合同估算价在 400 万元人民币以上  & 重要设备、材料等货物采购，单项合同估算价在 200 万元人民币以上  & 勘察、设计、监理等服务采购，单项合同估算价在 100 万元人民币以上"}
,
{"name":"据《重庆市招标投标条例(2025 修订)》，按照国家有关规定可以不进行招标的情况有（）","type":"3","value":"ACD","id":"352","anw":"基础设施建设项目使用以工代赈专项资金  & 已通过招标方式选定的特许经营项目投资人依法能够自行建设、生产或者提供  & 需要向原中标人采购工程、货物或者服务，否则将影响施工或者功能配套要求"}
,
{"name":"据《重庆市环境保护条例》，以下哪些违法行为，由公安机关负责管理或处罚（ ）。","type":"2","value":"AB","id":"353","anw":"在城区广场使用高音喇叭进行商业宣传  & 夜间在住宅楼内进行产生噪声的室内装修活动"}
,
{"name":"《重庆市环境保护条例》，企业事业单位造成或可能造成突发环境事件时，应当立即采取的 措施包括（ ）。","type":"4","value":"ABCD","id":"354","anw":"立即启动突发环境事件应急预案  & 采取切断或者控制污染源等防止危害扩大的必要措施  & 向事发地生态环境主管部门报告  & 及时通报可能受到危害的单位和居民"}
,
{"name":"据《重庆市环境保护条例》，关于辐射工作单位，下列哪些说法是正确的（ ）。","type":"3","value":"ABD","id":"355","anw":"终止辐射工作时，必须处置或送贮放射性同位素和放射性废物  & 转让放射性同位素，转入单位需报市生态环境主管部门批准  & 应当编写安全和防护状况年度评估报告，并于次年一月底前报送"}
,
{"name":"据《重庆市环境保护条例》，在土壤环境保护优先区域内，禁止建设下列哪些项目（ ）。","type":"3","value":"BCD","id":"356","anw":"有色金属冶炼项目  & 化工医药项目  & 铅蓄电池制造项目"}
,
{"name":"据《重庆市环境保护条例》，重点排污单位应当公开的环境信息包括（ ）。","type":"3","value":"BCD","id":"357","anw":"主要污染物的名称、排放方式、排放浓度和总量  & 超标排放情况  & 防治污染设施的建设和运行情况"}
,
{"name":"据《重庆市环境保护条例》，关于建设项目环境保护设施验收，下列说法正确的是（ ）。","type":"3","value":"ACD","id":"358","anw":"环境保护设施应当与主体工程同时设计、同时施工、同时投产使用  & 编制环境影响报告书的建设项目投入生产前，应对环境保护设施进行验收  & 环境保护设施验收合格的，建设项目方可投入生产或者使用"}
,
{"name":"据《重庆市环境保护条例》，有下列哪些情形之一的，不得核发建设项目环境影响报告书或 者报告表批准书（ ）。","type":"3","value":"ABC","id":"359","anw":"建设项目的环境影响报告书、环境影响报告表的基础资料数据明显不实，内容存在重大缺陷、遗 & 建设项目类型及其选址、布局、规模等不符合环境保护法律法规和相关法定规划  & 所在区域环境质量未达到国家或者地方环境质量标准，且建设项目拟采取的措施不能满足区域环 境质量改善目标管理要求"}
,
{"name":"据《重庆市环境保护条例》，关于乡镇人民政府、街道办事处的环境保护职责，下列说法正 确的是（ ）。","type":"2","value":"BD","id":"360","anw":"做好辖区内环境保护基础设施的日常监督管理  & 负责饮用水水源保护巡查和污染源现场监督检查"}
,
{"name":"据《重庆市环境保护条例》，以下哪些原则是环境保护坚持的原则（ ）。","type":"4","value":"ABCD","id":"361","anw":"保护优先  & 预防为主  & 综合治理  & 公众参与"}
,
{"name":"据《重庆市环境保护条例》规定，下列说法正确的是（）。","type":"3","value":"ABC","id":"362","anw":"生态环境主管部门应当根据环境管理的需要和监测技术规范要求设置环境质量监测点（断面）及 污染源监测点。  & 乡镇人民政府、街道办事处在环境保护日常监督管理工作中，可以对本辖区企业事业单位和其他 生产经营者的污染防治情况、污染物排放情况、环境风险防范情况等进行现场检查，发现环境违法 & 违法排放污染物，造成或者可能造成严重污染的，生态环境主管部门和其他负有环境保护监督管 理职责的部门，可以查封、扣押造成污染物排放的设施、设备"}
,
{"name":"融机构要完善适合小型微型企业的信贷制度，提高小型微型企业不良贷款容忍度，增加小 型微型企业融资规模和比重，扩大（）。","type":"4","value":"ABCD","id":"363","anw":"信用贷款  & 中长期贷款  & 无还本续贷  & 首贷户覆盖面"}
,
{"name":"重庆市中小企业促进条例》所称中小企业，是指依法设立并符合国家中小企业划分标准的 （）。","type":"3","value":"ABC","id":"364","anw":"中型企业  & 小型企业  & 微型企业"}
,
{"name":"据《重庆市中小企业促进条例》，本市将促进中小企业发展作为长期发展战略，坚持各类企 业（ ）。","type":"3","value":"ABC","id":"365","anw":"权利平等  & 机会平等  & 规则平等"}
,
{"name":"重庆市中小企业促进条例》要求对中小企业特别是小型微型企业实行（ ）的方针。","type":"5","value":"ABCDE","id":"366","anw":"积极扶持  & 加强引导  & 完善服务  & 依法依规  & E. 保障权益"}
,
{"name":"重庆市中小企业促进条例》要求为中小企业创立和发展营造（）的良好环境。","type":"4","value":"ABCE","id":"367","anw":"稳定  & 公平  & 透明  & E. 可预期"}
,
{"name":"重庆市中小企业促进条例》要求市、区县（自治县）人民政府开展中小企业促进工作时，应 当（）。","type":"4","value":"BCDE","id":"368","anw":"统筹政策制定  & 督促政策落实  & 协调解决重大问题  & E. 建立健全协调机制"}
,
{"name":"重庆市中小企业促进条例》要求相关部门要组织实施国家和本市促进中小企业发展政策，对 中小企业促进工作进行（ ）。","type":"3","value":"ABC","id":"369","anw":"综合协调  & 服务指导  & 监督检查"}
,
{"name":"、区县（自治县）人民政府应当采取措施，鼓励、引导中小企业向（）发展，支持中小企 业积极融入和服务国家重大发展战略。","type":"4","value":"ABCD","id":"370","anw":"专业化  & 精细化  & 特色化  & 创新型"}
,
{"name":"人民政府及有关部门应当构建中小企业融资服务体系，综合运用云计算、大数据、人工智 能、区块链等现代技术手段，畅通金融服务通道，提升金融服务（）。","type":"2","value":"AC","id":"371","anw":"时效性  & 可获得性"}
,
{"name":"励金融机构为中小企业提供以（）等为担保品的担保融资。","type":"5","value":"ABCDE","id":"372","anw":"知识产权部门  & 特许经营收益权  & 股权  & 碳排放权  & E. 排污权"}
,
{"name":"据《重庆市知识产权保护和促进条例》，市、区县（自治县）人民政府应当加强知识产权人 才队伍建设，采取哪些措施（）。","type":"3","value":"ABC","id":"373","anw":"制定并组织实施知识产权专业人才培育和引进计划  & 将知识产权创造、运用情况纳入知识产权专业技术人员职称评价内容  & 支持符合条件的人员通过绿色通道申报职称评审"}
,
{"name":"据《重庆市知识产权保护和促进条例》，本市建立完善知识产权纠纷多元化解机制，推动哪 些纠纷解决途径的有效衔接（）。","type":"4","value":"ABCD","id":"374","anw":"调解  & 行政裁决  & 行政复议  & 仲裁"}
,
{"name":"据《重庆市知识产权保护和促进条例》，关于知识产权合规性承诺制度，以下哪些是正确的","type":"3","value":"BCD","id":"375","anw":"被依法认定承诺不实的，由有关主管部门取消其参与资格  & 依法撤销其所获荣誉，收回奖章、证书，追回已经拨付的资金或者其所获奖金等物质奖励  & 自然人、法人和非法人组织参加涉及知识产权的政府投资和政府采购项目应当提交未侵犯他人知 识产权的书面承诺解析："}
,
{"name":"据《重庆市知识产权保护和促进条例》，专业市场举办者应当采取哪些知识产权保护措施 （）。","type":"3","value":"ABC","id":"376","anw":"制定市场内知识产权保护规则  & 通过与场内经营者签订协议等方式明确知识产权保护的权利和义务  & 发现场内经营者有知识产权侵权、假冒等违法行为的，应当及时制止"}
,
{"name":"据《重庆市知识产权保护和促进条例》，展会活动的主办方、承办方应当遵守哪些规定（）","type":"3","value":"ABD","id":"377","anw":"督促参展方对参展项目及其展品、展板、相关宣传资料等进行知识产权风险排查  & 要求参展方作出参展项目不侵犯他人知识产权的承诺  & 公开知识产权投诉受理、处置的程序和规则"}
,
{"name":"据《重庆市知识产权保护和促进条例》，电子商务平台经营者应当遵守哪些规定（）。","type":"4","value":"ABCD","id":"378","anw":"建立知识产权保护规则  & 在显著位置公示知识产权侵权通知提交的主要渠道  & 不得采用限定渠道、限制次数等方式限制或者变相限制权利人提交通知  & 及时公示知识产权侵权通知、不存在侵权行为的声明及处理结果"}
,
{"name":"据《重庆市知识产权保护和促进条例》，市场监督管理部门应当引导、鼓励和支持哪些主体 建立健全商业秘密保护制度（）。","type":"3","value":"ACD","id":"379","anw":"企业  & 科研机构  & 高等学校"}
,
{"name":"据《重庆市知识产权保护和促进条例》，关于数据相关知识产权，以下哪些是正确的（）。","type":"3","value":"ABD","id":"380","anw":"市知识产权部门会同市大数据发展等部门建立数据相关知识产权保护和运用机制  & 探索建立数据相关知识产权登记制度  & 健全交易规范，促进价值实现"}
,
{"name":"据《重庆市知识产权保护和促进条例》，市、区县（自治县）人民政府应当建立健全地理标 志保护体系，采取哪些措施（）。","type":"3","value":"BCD","id":"381","anw":"建设地理标志产品保护示范区  & 培育地理标志产业  & 支持地理标志申请"}
,
{"name":"据《重庆市知识产权保护和促进条例》，以下哪些是关于知识产权宣传教育的正确表述（）","type":"3","value":"ABC","id":"382","anw":"市、区县（自治县）人民政府应当加强知识产权宣传教育  & 教育部门应当将知识产权相关知识纳入学校教育内容  & 新闻媒体应当开展知识产权相关知识的公益宣传"}
,
{"name":"据《重庆市知识产权保护和促进条例》的相关规定，以下哪些部门负责著作权保护和促进 的具体工作（）。","type":"2","value":"CD","id":"383","anw":"版权管理部门  & 文化旅游部门"}
,
{"name":"据《重庆市知识产权保护和促进条例》的相关规定，下列说法正确的是（）。","type":"3","value":"ACD","id":"384","anw":"市知识产权部门负责处理本行政区域内涉外、涉港澳台或者侵权行为地涉及两个以上区县（自治 县）的有重大影响的专利侵权纠纷行政裁决案件  & 鼓励商业秘密权利人与涉密人员等约定保密义务、签订竞业限制协议以及对载有商业秘密的载体 采取隔离、加密、加锁、反编译、标注保密标志、设立保密等级等合理保密措施，防止商业秘密泄 & 人民法院、人民检察院、负有知识产权管理职责的部门处理涉及专利、计算机软件、集成电路布 图设计、技术秘密、植物新品种等专业技术性较强的知识产权案件，可以选聘相关专业技术人员担"}
,
{"name":"据《住房租赁条例》，住房租赁企业未按照规定报送开业信息，可能受到什么处罚（）。","type":"3","value":"ABC","id":"385","anw":"责令改正  & 警告  & 罚款"}
,
{"name":"据《住房租赁条例》，将厨房单独出租用于居住，可能面临什么处罚（）。","type":"4","value":"ABCD","id":"386","anw":"责令改正  & 警告  & 罚款  & 没收违法所得"}
,
{"name":"据《住房租赁条例》，网络平台经营者在住房租赁信息发布服务中应当做什么（）。","type":"3","value":"ABD","id":"387","anw":"核验信息发布者的真实身份信息  & 知道违法情形时采取删除信息等措施  & 向有关部门报告"}
,
{"name":"据《住房租赁条例》，县级以上地方人民政府房产管理部门应当通过住房租赁管理服务平台 开展哪些工作（）。","type":"3","value":"ACD","id":"388","anw":"合同备案  & 统计监测  & 租赁住房信息管理"}
,
{"name":"据《住房租赁条例》，住房租赁经纪机构发布房源信息前应当做什么（）。","type":"4","value":"ABCD","id":"389","anw":"核对委托人身份信息  & 核对住房权属信息  & 实地查看房源  & 与委托人签订经纪服务合同"}
,
{"name":"据《住房租赁条例》，从事转租经营的住房租赁企业应当如何管理资金（）。","type":"3","value":"ABC","id":"390","anw":"设立住房租赁资金监管账户  & 向社会公示该账户  & 通过该账户办理资金收付业务"}
,
{"name":"据《住房租赁条例》，住房租赁企业不得从事哪些行为（）。","type":"2","value":"BC","id":"391","anw":"非法收集他人个人信息  & 非法买卖他人个人信息"}
,
{"name":"据《住房租赁条例》，住房租赁企业发布的房源信息应当符合哪些要求（）。","type":"3","value":"ABC","id":"392","anw":"真实、准确、完整  & 在不同渠道发布的信息一致  & 房源图片与实物一致"}
,
{"name":"据《住房租赁条例》，住房租赁企业是指哪些企业（）。","type":"2","value":"CD","id":"393","anw":"以自有住房开展住房租赁经营业务的企业  & 以依法取得经营管理权的他人住房开展住房租赁经营业务的企业"}
,
{"name":"据《住房租赁条例》，出租人应当遵守下列哪些规定（）。","type":"2","value":"AB","id":"394","anw":"向承租人出示身份证明和权属证明  & 核验承租人身份证明"}
,
{"name":"据《住房租赁条例》，关于住房租赁合同备案，下列说法正确的是（）。","type":"2","value":"BC","id":"395","anw":"承租人也可以办理备案  & 出租人应当办理备案"}
,
{"name":"据《住房租赁条例》，下列哪些部门负责住房租赁活动的监督管理工作（）。","type":"3","value":"ABC","id":"396","anw":"住房城乡建设主管部门  & 市场监督管理部门  & 公安部门"}
,
{"name":"据《住房租赁条例》，下列说法错误的有（）。","type":"2","value":"AD","id":"397","anw":"住房租赁经纪机构可以为单独出租厨房、卫生间、阳台、过道、地下储藏室、车库等非居住空间 用于居住提供经纪服务  & 住房租赁经纪机构应当将其从业人员名单向所在地县级以上地方人民政府房产管理部门备案。住 房租赁经纪机构的从业人员可以以个人名义承接住房租赁经纪业务"}
,
{"name":"据《中华人民共和国突发事件应对法(2024 修订)》规定，在突发事件应急处置中，关于个 人信息保护，下列哪些做法是符合法律规定的（）。","type":"3","value":"BCD","id":"398","anw":"因依法履行突发事件应对工作职责或者义务获取的个人信息，只用于突发事件应对  & 应急处置工作结束后，应对获取的个人信息予以销毁  & 确因作为证据使用需要留存个人信息的，应进行评估并采取保护措施"}
,
{"name":"据《中华人民共和国突发事件应对法(2024 修订)》规定，履行统一领导职责的人民政府在 自然灾害、事故灾难或公共卫生事件发生后，可以采取的应急处置措施包括（）。","type":"3","value":"ABC","id":"399","anw":"封锁危险场所，划定警戒区，实行交通管制  & 启用本级人民政府设置的财政预备费和储备的应急救援物资  & 依法从严惩处哄抬价格、哄抢财物等扰乱市场秩序和社会秩序的行为"}
,
{"name":"据《中华人民共和国突发事件应对法(2024 修订)》规定，发布三级、四级警报后，县级以 上地方人民政府可以采取的措施包括（）。","type":"3","value":"ABD","id":"400","anw":"启动应急预案  & 责令负有特定职责的人员及时收集、报告有关信息  & 定时向社会发布与公众有关的突发事件预测信息"}
,
{"name":"据《中华人民共和国突发事件应对法(2024 修订)》规定，关于应急预案，下列哪些说法是 正确的（）。","type":"3","value":"ACD","id":"401","anw":"国务院制定国家突发事件总体应急预案和专项应急预案  & 应急预案制定机关应当根据应急演练中发现的问题及时修订预案  & 应急预案应具体规定突发事件的预防与预警机制、处置程序等内容"}
,
{"name":"据《中华人民共和国突发事件应对法(2024 修订)》规定，下列关于县级以上人民政府设立 的突发事件应急指挥机构说法正确的是（）。","type":"3","value":"ABD","id":"402","anw":"由本级人民政府主要负责人、相关部门负责人等组成  & 可以依法发布有关突发事件应对的决定、命令、措施  & 其行为的法律责任由设立它的人民政府承担"}
,
{"name":"家在突发事件应对工作中，应当对（）等群体给予特殊、优先保护。","type":"3","value":"ABC","id":"403","anw":"未成年人、老年人、残疾人  & 孕产期和哺乳期的妇女  & 需要及时就医的伤病人员"}
,
{"name":"级以上地方各级人民政府应当组织有关部门建立完善安全风险评估与论证机制，按照安全 风险管控要求，进行产业规划和空间布局，并对（ ）的生产经营单位实施重大安全风险联防联控。","type":"3","value":"ABC","id":"404","anw":"行业相近  & 位置相邻  & 业态相似"}
,
{"name":"家建立（ ）的应急管理体制和综合协调、分类管理、分级负责、属地管理为主的工作体系。","type":"4","value":"ABCD","id":"405","anw":"统一指挥  & 反应灵敏  & 上下联动  & 专常兼备"}
,
{"name":"据《中华人民共和国突发事件应对法》，国务院应急管理部门会同（ ）等部门统筹、指导 全国应急避难场所的建设和管理工作，建立健全应急避难场所标准体系。","type":"3","value":"ABC","id":"406","anw":"卫生健康  & 自然资源  & 住房城乡建设"}
,
{"name":"据《中华人民共和国突发事件应对法》，国家建立有效的社会动员机制，组织动员（ ）等 各方力量依法有序参与突发事件应对工作。","type":"3","value":"ABD","id":"407","anw":"企业事业单位  & 志愿者  & 社会组织"}
,
{"name":"据《中华人民共和国突发事件应对法(2024 修订)》，下列说法错误的是（）。","type":"2","value":"CD","id":"408","anw":"省级和设区的市级人民政府应当对本行政区域内容易引发自然灾害、事故灾难和公共卫生事件的 危险源、危险区域进行调查、登记、风险评估，组织进行检查、监控，并责令有关单位采取安全防 范措施。  & 可以预警的自然灾害、事故灾难和公共卫生事件的预警级别，按照突发事件发生的紧急程度、发"}
,
{"name":"生或者可能发生未成年人个人信息泄露、篡改、丢失的，个人信息处理者应当（）。","type":"4","value":"ABCD","id":"409","anw":"立即启动个人信息安全事件应急预案  & 采取补救措施  & 及时向网信等部门报告，  & 按照国家有关规定将事件情况以邮件、信函、电话、信息推送等方式告知受影响的未成年人及其 监护人。"}
,
{"name":"成年人或者其监护人依法请求查阅、复制、更正、补充、删除未成年人个人信息的，个人 信息处理者应当遵守以下规定（）。","type":"4","value":"ABCD","id":"410","anw":"提供便捷的支持未成年人或者其监护人查阅未成年人个人信息种类、数量等的方法和途径，不得 对未成年人或者其监护人的合理请求进行限制。  & 提供便捷的支持未成年人或者其监护人复制、更正、补充、删除未成年人个人信息的功能，不得 设置不合理条件。  & 及时受理并处理未成年人或者其监护人查阅、复制、更正、补充、删除未成年人个人信息的申请， 拒绝未成年人或者其监护人行使权利的请求的，应当书面告知申请人并说明理由。  & 对未成年人或者其监护人依法提出的转移未成年人个人信息的请求，符合国家网信部门规定条件 的，个人信息处理者应当提供转移的途径。"}
,
{"name":"据《未成年人网络保护条例》，以下说法正确的是（）。","type":"3","value":"BCD","id":"411","anw":"网络服务提供者为未成年人提供信息发布、即时通讯等服务的，应当依法要求未成年人或者其监 护人提供未成年人真实身份信息。  & 网络产品和服务提供者应当建立健全网络欺凌行为的预警预防、识别监测和处置机制，设置便利 未成年人及其监护人保存遭受网络欺凌记录、行使通知权利的功能、渠道，提供便利未成年人设置 屏蔽陌生用户、本人发布信息可见范围、禁止转载或者评论本人发布信息、禁止向本人发送信息等 网络欺凌信息防护选项。  & 网络产品和服务提供者应当建立健全网络欺凌信息特征库，优化相关算法模型，采用人工智能、 大数据等技术手段和人工审核相结合的方式加强对网络欺凌信息的识别监测。"}
,
{"name":"据《未成年人网络保护条例》，以下说法正确的是（）。","type":"3","value":"BCD","id":"412","anw":"网络产品和服务提供者不得通过自动化决策方式向未成年人进行商业营销。  & 任何组织和个人不得向未成年人发送、推送或者诱骗、强迫未成年人接触含有危害或者可能影响 未成年人身心健康内容的网络信息。  & 任何组织和个人不得通过网络以文字、图片、音视频等形式，组织、教唆、胁迫、引诱、欺骗、 帮助未成年人实施违法犯罪行为。"}
,
{"name":"下哪些部门或组织在《未成年人网络保护条例》中明确有职责参与未成年人网络保护工作？","type":"4","value":"ABCD","id":"413","anw":"国家网信部门  & 国务院教育部门  & 卫生健康部门  & 市场监督管理部门"}
,
{"name":"据《未成年人网络保护条例》，以下哪些措施是网络平台服务提供者应当采取的，以保护未 成年人免受网络侵害？","type":"3","value":"ABC","id":"414","anw":"提供未成年人模式或未成年人专区  & 定期开展未成年人网络保护影响评估  & 对违反法律的平台内产品或者服务提供者停止提供服务"}
,
{"name":"据《未成年人网络保护条例》，关于未成年人的个人信息，以下说法正确的是（）。","type":"3","value":"BCD","id":"415","anw":"个人信息处理者不得强制要求未成年人或者其监护人同意非必要的个人信息处理行为  & 个人信息处理者不得因为未成年人或者其监护人不同意处理未成年人非必要个人信息或者撤回同 意，拒绝未成年人使用其基本功能服务  & 未成年人的监护人应当教育引导未成年人增强个人信息保护意识和能力"}
,
{"name":"据《未成年人网络保护条例》，以下哪些部门有权直接对从事未成年人沉迷网络预防和干预 活动的机构实施监督管理？","type":"3","value":"ABC","id":"416","anw":"教育部门  & 卫生健康部门  & 市场监督管理部门"}
,
{"name":"成年人用户数量巨大或者对未成年人群体具有显著影响的网络平台服务提供者，下列选项 中属于其应当履行的义务的是（）。","type":"3","value":"ABD","id":"417","anw":"在网络平台服务的设计、研发、运营等阶段，充分考虑未成年人身心健康发展特点，定期开展未 成年人网络保护影响评估  & 提供未成年人模式或者未成年人专区等，便利未成年人获取有益身心健康的平台内产品或者服务  & 对违反法律、行政法规严重侵害未成年人身心健康或者侵犯未成年人其他合法权益的平台内产品 或者服务提供者，停止提供服务"}
,
{"name":"于智能终端产品，《未成年人网络保护条例》规定（）。","type":"3","value":"ACD","id":"418","anw":"智能终端产品制造者应当在产品出厂前安装未成年人网络保护软件，或者采用显著方式告知用户 安装渠道和方法  & 未成年人网络保护软件、专门供未成年人使用的智能终端产品应当具有有效识别违法信息和可能 影响未成年人身心健康的信息、保护未成年人个人信息权益、预防未成年人沉迷网络、便于监护人 履行监护职责等功能  & 未成年人的监护人应当合理使用并指导未成年人使用网络保护软件、智能终端产品等，创造良好 的网络使用家庭环境"}
,
{"name":"据《未成年人网络保护条例》，以下说法正确的是（）。","type":"4","value":"ABCD","id":"419","anw":"未成年人的监护人应当加强家庭家教家风建设，提高自身网络素养，规范自身使用网络的行为， 加强对未成年人使用网络行为的教育、示范、引导和监督。  & 国家鼓励和支持研发、生产和使用专门以未成年人为服务对象、适应未成年人身心健康发展规律 和特点的网络保护软件、智能终端产品和未成年人模式、未成年人专区等网络技术、产品、服务， 加强网络无障碍环境建设和改造，促进未成年人开阔眼界、陶冶情操、提高素质。  & 学校应当将提高学生网络素养等内容纳入教育教学活动，并合理使用网络开展教学活动，建立健 全学生在校期间上网的管理制度，依法规范管理未成年学生带入学校的智能终端产品，帮助学生养 成良好上网习惯，培养学生网络安全和网络法治意识，增强学生对网络信息的获取和分析判断能力。 & 未成年人网络保护软件、专门供未成年人使用的智能终端产品应当具有有效识别违法信息和可能 影响未成年人身心健康的信息、保护未成年人个人信息权益、预防未成年人沉迷网络、便于监护人 履行监护职责等功能。"}
,
{"name":"于网络素养促进，以下说法正确的是（）。","type":"3","value":"BCD","id":"420","anw":"学校应当将提高学生网络素养等内容纳入教育教学活动，并合理使用网络开展教学活动，建立健 全学生在校期间上网的管理制度，依法规范管理未成年学生带入学校的智能终端产品，帮助学生养 成良好上网习惯，培养学生网络安全和网络法治意识，增强学生对网络信息的获取和分析判断能力。 & 未成年人的监护人应当加强家庭家教家风建设，提高自身网络素养，规范自身使用网络的行为， 加强对未成年人使用网络行为的教育、示范、引导和监督。  & 国家鼓励和支持研发、生产和使用专门以未成年人为服务对象、适应未成年人身心健康发展规律 和特点的网络保护软件、智能终端产品和未成年人模式、未成年人专区等网络技术、产品、服务， 加强网络无障碍环境建设和改造，促进未成年人开阔眼界、陶冶情操、提高素质。"}
,
{"name":"于网络素养促进，以下说法正确的是（）。","type":"2","value":"BD","id":"421","anw":"教育部门应当指导、支持学校开展未成年人网络素养教育，围绕网络道德意识形成、网络法治观 念培养、网络使用能力建设、人身财产安全保护等，培育未成年人网络安全意识、文明素养、行为 习惯和防护技能  & 县级以上地方人民政府应当通过为中小学校配备具有相应专业能力的指导教师、政府购买服务或 者鼓励中小学校自行采购相关服务等方式，为学生提供优质的网络素养教育课程"}
,
{"name":"据《未成年人网络保护条例》，以下说法正确的是（）。","type":"3","value":"ABD","id":"422","anw":"学校、家庭应当教育引导未成年人参加有益身心健康的活动，科学、文明、安全、合理使用网络， 预防和干预未成年人沉迷网络。  & 网络产品和服务提供者、个人信息处理者、智能终端产品制造者和销售者应当遵守法律、行政法 规和国家有关规定，尊重社会公德，遵守商业道德，诚实信用，履行未成年人网络保护义务，承担 社会责任。  & 网络相关行业组织应当加强行业自律，制定未成年人网络保护相关行业规范，指导会员履行未成 年人网络保护义务，加强对未成年人的网络保护。"}
,
{"name":"据《未成年人网络保护条例》，以下说法错误的是（）。","type":"3","value":"ACD","id":"423","anw":"国务院教育部门负责统筹协调未成年人网络保护工作，并依据职责做好未成年人网络保护工作。  & 乡镇地方人民政府及其有关部门依据各自职责做好未成年人网络保护工作。  & 国家网信部门负责协助未成年人网络保护工作。"}
,
{"name":"据《中华人民共和国国防教育法》，以下说法正确的是（）。","type":"3","value":"ACD","id":"424","anw":"全民国防教育使用统一的国防教育大纲。  & 各级全民国防教育主管部门应当组织、协调有关部门做好国防教育教员的选拔、培训和管理工作， 加强国防教育师资队伍建设。  & 国防教育教员应当从热爱国防教育事业、具有扎实的国防理论、知识和必要的军事技能的人员中 选拔，同等条件下优先招录、招聘退役军人。"}
,
{"name":"于国防教育基地，以下说法正确的是（）。","type":"3","value":"BCD","id":"425","anw":"要求具备有明确的国防教育主题内容  & 要求具备有健全的管理机构和规章制度  & 国防教育基地应当加强建设，不断完善，充分发挥国防教育功能"}
,
{"name":"于国防教育经费，以下说法正确的是（）。","type":"3","value":"BCD","id":"426","anw":"企业开展国防教育所需经费，在本单位职工教育经费中列支。  & 国家机关、事业组织、群团组织开展国防教育所需经费，在本单位预算经费内列支。  & 学校组织学生军事训练所需经费，按照国家有关规定执行。"}
,
{"name":"据《中华人民共和国国防教育法》，以下说法正确的是（）。","type":"4","value":"ABCD","id":"427","anw":"各地区、各部门应当利用重大节日、纪念日和重大主题活动等，广泛开展群众性国防教育活动  & 在全民国防教育日集中开展主题鲜明、形式多样的国防教育活动  & 国防教育基地应当对军队人员、退役军人和学生免费开放，在全民国防教育日向社会免费开放  & 各地区、各部门应当利用重大节日、纪念日和重大主题活动等，广泛开展群众性国防教育活动； 在全民国防教育日集中开展主题鲜明、形式多样的国防教育活动。"}
,
{"name":"据《中华人民共和国国防教育法》，以下说法正确的是（）。","type":"3","value":"ACD","id":"428","anw":"居民委员会、村民委员会应当将国防教育纳入社会主义精神文明建设的内容，结合征兵工作、拥 军优属以及重大节日、纪念日活动，对居民、村民进行国防教育。  & 预备役人员所在单位应当按照有关规定开展预备役人员教育训练。  & 中央和省、自治区、直辖市以及设区的市的广播电台、电视台、报刊、新闻网站等媒体应当开设 国防教育节目或者栏目，普及国防知识。"}
,
{"name":"于社会国防教育，以下说法正确的是（）。","type":"4","value":"ABCD","id":"429","anw":"企业事业组织应当将国防教育列入职工教育计划，结合政治教育、业务培训、文化体育等活动， 对职工进行国防教育。  & 承担国防科研生产、国防设施建设、国防交通保障等任务的企业事业组织，应当根据所担负的任 务，制定相应的国防教育计划，有针对性地对职工进行国防教育。  & 社会组织应当根据各自的活动特点开展国防教育。  & 民兵国防教育，应当以基干民兵和担任领导职务的民兵为重点，建立和完善制度，保证受教育的 人员、教育时间和教育内容的落实。"}
,
{"name":"于社会国防教育，以下说法正确的是（）。","type":"3","value":"ABC","id":"430","anw":"国家机关应当根据各自的工作性质和特点，采取多种形式对工作人员进行国防教育。  & 国家机关工作人员应当具备较高的国防素养，发挥在全民国防教育中的模范带头作用。从事国防 建设事业的国家机关工作人员，应当学习和掌握履行职责所必需的国防理论、知识和技能等。  & 各地区、各部门的领导人员应当依法履行组织、领导本地区、本部门开展国防教育的职责。"}
,
{"name":"于学生的军事训练，以下说法正确的是（）。","type":"2","value":"AD","id":"431","anw":"中央全民国防教育主管部门、国务院教育行政部门、中央军事委员会机关有关部门负责全国学生 军事训练工作。  & 普通高等学校应当按照学生军事训练大纲，加强军事技能训练，磨练学生意志品质，增强组织纪 律性，提高军事训练水平"}
,
{"name":"于学生的军事训练，以下说法正确的是（）。","type":"3","value":"ABD","id":"432","anw":"学校组织军事训练活动，应当采取措施，加强安全保障。  & 驻地军事机关应当协助学校组织学生军事训练。  & 驻地军事机关应当协助学校组织学生军事训练。"}
,
{"name":"于高中阶段、普通高等学校的国防教育，以下说法正确的是（）。","type":"4","value":"ABCD","id":"433","anw":"普通高等学校、高中阶段学校应当按照规定组织学生军事训练  & 高中阶段学校应当在有关课程中安排专门的国防教育内容，将课堂教学与军事训练相结合，使学 生掌握基本的国防理论、知识和技能，具备基本的国防观念。  & 普通高等学校、高中阶段学校应当按照规定组织学生军事训练  & 普通高等学校、高中阶段学校学生的军事训练，由学校负责军事训练的机构或者军事教员组织实"}
,
{"name":"于小学和初级中学开展国防教育，以下说法正确的是（）。","type":"3","value":"BCD","id":"434","anw":"使小学生掌握初步的国防知识和国防技能  & 小学和初级中学可以组织学生开展以国防教育为主题的少年军校活动。教育行政部门  & 共产主义青年团和其他有关部门应当加强对少年军校活动的指导与管理。 小学和初级中学可以根 据需要聘请校外辅导员，协助学校开展多种形式的国防教育活动。"}
,
{"name":"于学校国防教育，以下说法正确的是（）。","type":"3","value":"BCD","id":"435","anw":"教育行政部门应当将国防教育列入工作计划，加强对学校国防教育的组织、指导和监督，  & 教育行政部门应当对学校国防教育工作定期进行考核  & 学校应当将国防教育列入学校的工作和教学计划，采取有效措施，保证国防教育的质量和效果"}
,
{"name":"同主体如何开展国防教育？（）","type":"4","value":"ABCD","id":"436","anw":"中国人民解放军、中国人民武装警察部队按照中央军事委员会的有关规定开展国防教育  & 国家支持、鼓励社会组织和个人开展有益于国防教育的活动  & 国防动员、兵役、退役军人事务、国防科研生产、边防海防、人民防空、国防交通等工作的主管 部门，依照本法和有关法律、法规的规定，开展国防教育  & 工会、共产主义青年团、妇女联合会和其他群团组织，应当在各自的工作范围内开展国防教育"}
,
{"name":"据《中华人民共和国国防教育法》，以下说法正确的是（）。","type":"3","value":"ABC","id":"437","anw":"中华人民共和国公民都有接受国防教育的权利和义务  & 普及和加强国防教育是全社会的共同责任  & 一切国家机关和武装力量、各政党和各人民团体、企业事业组织、社会组织和其他组织，都应当 组织本地区、本部门、本单位开展国防教育"}
,
{"name":"据《中华人民共和国国防教育法》，以下说法正确的是（）。","type":"3","value":"ABD","id":"438","anw":"国家在全体公民中开展以爱国主义为核心，以履行国防义务为目的，与国防和军队建设有关的理 论、知识、技能以及科技、法律、心理等方面的国防教育  & 国防教育是建设和巩固国防的基础，是增强民族凝聚力、提高全民素质的重要途径  & 国防教育贯彻全民参与、长期坚持、讲求实效的方针"}
,
{"name":"据《中华人民共和国环境保护法》，符合条件的社会组织对污染环境、破坏生态，损害社会 公共利益的行为，可以向人民法院提起诉讼，以下说法正确的是（）。","type":"3","value":"ABC","id":"439","anw":"该社会组织是依法在设区的市级以上人民政府民政部门登记的社会组织。  & 该社会组织专门从事环境保护公益活动连续五年以上且无违法记录  & 符合规定的社会组织向人民法院提起诉讼，人民法院应当依法受理。"}
,
{"name":"据《中华人民共和国环境保护法》，以下说法正确的是（）。","type":"2","value":"CD","id":"440","anw":"负责审批建设项目环境影响评价文件的部门在收到建设项目环境影响报告书后，发现建设项目未 充分征求公众意见的，应当责成建设单位征求公众意见。  & 县级以上地方人民政府环境保护主管部门和其他负有环境保护监督管理职责的部门，应当将企业 事业单位和其他生产经营者的环境违法信息记入社会诚信档案，及时向社会公布违法者名单。"}
,
{"name":"于防治污染和其他公害，以下说法正确的是（）。","type":"3","value":"BCD","id":"441","anw":"防治污染的设施应当符合经批准的环境影响评价文件的要求，不得擅自拆除或者闲置。  & 排放污染物的企业事业单位，应当建立环境保护责任制度，明确单位负责人和相关人员的责任。  & 重点排污单位应当按照国家有关规定和监测规范安装使用监测设备，保证监测设备正常运行，保 存原始监测记录。"}
,
{"name":"级人民政府对（）应当采取措施予以保护，严禁破坏。","type":"4","value":"ABCD","id":"442","anw":"具有代表性的各种类型的自然生态系统区域，珍稀、濒危的野生动植物自然分布区域  & 重要的水源涵养区域  & 具有重大科学文化价值的地质构造、著名溶洞和化石分布区、冰川、火山、温泉等自然遗迹  & 人文遗迹、古树名木"}
,
{"name":"据《中华人民共和国环境保护法》，以下说法正确的是（）。","type":"2","value":"CD","id":"443","anw":"依法应当给予行政处罚，而有关环境保护主管部门不给予行政处罚的，上级人民政府环境保护主 管部门可以直接作出行政处罚的决定。  & 因污染环境和破坏生态造成损害的，应当依照《中华人民共和国侵权责任法》的有关规定承担侵 权责任。"}
,
{"name":"下属于县级地方人民政府环境保护主管部门和其他负有环境保护监督管理职责的部门的职 责的是（）。","type":"3","value":"BCD","id":"444","anw":"应当依法公开环境质量、环境监测、突发环境事件以及环境行政许可、行政处罚、排污费的征收 & 应当将企业事业单位和其他生产经营者的环境违法信息记入社会诚信档案  & 及时向社会公布违法者名单"}
,
{"name":"据《中华人民共和国环境保护法》，以下说法正确的是（）。","type":"2","value":"AD","id":"445","anw":"各级人民政府及其有关部门和企业事业单位，应当依照《中华人民共和国突发事件应对法》的规 定，做好突发环境事件的风险控制、应急准备、应急处置和事后恢复等工作。  & 突发环境事件应急处置工作结束后，有关人民政府应当立即组织评估事件造成的环境影响和损失， 并及时将评估结果向社会公布。"}
,
{"name":"下关于环境保护的监督管理的说法，正确的是（）。","type":"3","value":"ABD","id":"446","anw":"县级以上人民政府应当将环境保护工作纳入国民经济和社会发展规划。  & 国务院环境保护主管部门会同有关部门，根据国民经济和社会发展规划编制国家环境保护规划， 报国务院批准并公布实施。  & 环境保护规划的内容应当包括生态保护和污染防治的目标、任务、保障措施等，并与主体功能区 规划、土地利用总体规划和城乡规划等相衔接。"}
,
{"name":"列关于保护环境的义务的说法正确的是（）。","type":"4","value":"ABCD","id":"447","anw":"一切单位和个人都有保护环境的义务。  & 地方各级人民政府应当对本行政区域的环境质量负责。  & 企业事业单位和其他生产经营者应当防止、减少环境污染和生态破坏，对所造成的损害依法承担 责任。  & 公民应当增强环境保护意识，采取低碳、节俭的生活方式，自觉履行环境保护义务。"}
,
{"name":"境保护坚持（）的原则。","type":"5","value":"ABCDE","id":"448","anw":"保护优先  & 预防为主  & 综合治理  & 公众参与  & E.损害担责"}
,
{"name":"据我国法律规定，认定驰名商标需要考虑下列哪些因素（）。","type":"4","value":"ABCD","id":"449","anw":"相关公众对该商标的知晓程度  & 该商标使用的持续时间  & 该商标的任何宣传工作的持续时间、程度和地理范围  & 该商标作为驰名商标受保护的记录"}
,
{"name":"列关于专利的说法正确的有（）。","type":"3","value":"ABC","id":"450","anw":"专利要求发明创造人向国家提出申请  & 获得专利权以向社会公开发明创造的内容为前提  & 获得专利权以发明创造不违反法律的强制性规定为前提"}
,
{"name":"列属于发明构成要件的有（）。","type":"4","value":"ABCD","id":"451","anw":"是正确利用自然规律的结果  & 具有新颖性  & 具有创造性  & 具有实用性"}
,
{"name":"列构成侵犯注册商标专用权的行为有哪些（）。","type":"4","value":"ABCD","id":"452","anw":"销售侵犯注册商标专用权的商品的  & 未经商标注册人同意，更换其注册商标并将该更换商标的商品又投入市场的  & 伪造、擅自制造他人注册商标标识或者销售伪造、擅自制造的注册商标标识的  & 故意为侵犯他人商标专用权行为提供便利条件，帮助他人实施侵犯商标专用权行为的"}
,
{"name":"列侵权行为，应当根据情况，承担停止侵害、消除影响、赔礼道歉、赔偿损失等民事责任 的是（）。","type":"4","value":"ABCD","id":"453","anw":"未经著作权人许可发表其作品的  & 没有参加创作，为谋取个人名利，在他人作品上署名的  & 歪曲篡改他人作品的  & 剽窃他人作品的"}
,
{"name":"列关于知识产权说法正确的是（）。","type":"3","value":"ABD","id":"454","anw":"属于法律制度体系的一部分  & 通过赋予发明创造者私有产权，促进科技进步  & 知识产权法律制度起源自近代西方"}
,
{"name":"法律、法规另有规定的外，未经软件著作权人许可，修改、翻译其软件的，其侵权责任有 （）。","type":"2","value":"AD","id":"455","anw":"停止侵害  & 赔偿损失"}
,
{"name":"列关于专利侵权纠纷救济的有关说法，正确的有（）。","type":"3","value":"ABC","id":"456","anw":"国务院管理专利工作的部门可以处理在全国具有重大影响的专利侵权纠纷  & 重庆市知识产权局可以处理重庆市内发生的专利侵权纠纷  & 重庆市江北区知识产权局可以处理该辖区内发生的专利侵权纠纷"}
,
{"name":"关口述作品的说法正确的是（）。","type":"3","value":"ABD","id":"457","anw":"口述作品必须是以口头语言形式表现出来的  & 事先有文字稿的演讲不是口述作品  & 口述作品必须是即兴创作的"}
,
{"name":"们在听一首流行歌曲时，这首流行歌曲中可能包含的著作权有（）。","type":"4","value":"ABCD","id":"458","anw":"词作者的著作权  & 曲作者的著作权  & 演唱者的邻接权  & 录音制作者的邻接权"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，国家支持电信业务经营者、银行业金融机构等研 究开发有关电信网络诈骗反制技术，用于（）。","type":"3","value":"ABC","id":"459","anw":"监测识别涉诈异常信息、活动  & 动态封堵涉诈异常信息、活动  & 处置涉诈异常信息、活动"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，金融机构在传输交易信息时应当（）。","type":"3","value":"ACD","id":"460","anw":"完整、准确传输直接提供商品或者服务的商户名称。  & 保证交易信息的真实、完整和支付全流程中的一致性。  & 完整、准确传输收付款客户名称及账号等交易信息。"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，互联网服务提供者在提供哪些服务时应当要求用 户提供真实身份信息（）。","type":"4","value":"ABCD","id":"461","anw":"提供互联网接入服务。  & 提供网络代理等网络地址转换服务。  & 提供互联网域名注册、服务器托管等服务。  & 提供信息、软件发布服务。"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，关于物联网卡，电信业务经营者应当采取哪些措施（）。","type":"4","value":"ABCD","id":"462","anw":"建立物联网卡用户风险评估制度，评估未通过的，不得销售物联网卡。  & 严格登记物联网卡用户身份信息。  & 采取有效技术措施限定物联网卡开通功能、使用场景和适用设备。  & 对物联网卡的使用建立监测预警机制，对异常使用采取处置措施。"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，办理电话卡时，以下说法正确的是（）。","type":"2","value":"BC","id":"463","anw":"对经识别存在异常办卡情形的，电信业务经营者有权加强核查或者拒绝办卡。  & 国务院电信主管部门建立电话用户开卡数量核验机制和风险信息共享机制。"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，电信业务经营者在电话用户实名制方面有哪些责任（）。","type":"3","value":"ACD","id":"464","anw":"依法全面落实电话用户真实身份信息登记制度。  & 在协议中明确代理商实名制登记的责任和有关违约处置措施。  & 承担对代理商落实电话用户实名制管理责任。"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，反电信网络诈骗工作坚持的原则包括哪些（）。","type":"4","value":"ABCD","id":"465","anw":"坚持以人民为中心，统筹发展和安全。  & 坚持系统观念、法治思维，注重源头治理、综合治理。  & 坚持齐抓共管、群防群治，全面落实打防管控各项措施。  & 坚持精准防治，保障正常生产经营活动和群众生活便利。"}
,
{"name":"据《中华人民共和国反电信网络诈骗法》，公安机构应当会同哪些组织机构建立预警劝阻系统（）。","type":"4","value":"ABCD","id":"466","anw":"金融、电信、网信部门组织银行业金融机构  & 非银行支付机构  & 电信业务经营者  & 互联网服务提供者"}
,
{"name":"据《中华人民共和国反有组织犯罪法》规定，关于涉案财产的处置，以下哪些说法是正确的（）。","type":"3","value":"BCD","id":"467","anw":"对于与案件无关的财物，应当在三日以内解除查封、扣押、冻结  & 涉案财产无法找到的，可以追缴其他等值财产  & 查封、扣押、冻结涉案财物时，应当严格区分违法所得与合法财产"}
,
{"name":"据《中华人民共和国反有组织犯罪法》规定，关于保障措施中的保护，以下哪些说法是正","type":"3","value":"ABD","id":"468","anw":"因在有组织犯罪案件中作证，近亲属人身安全面临危险的，可以采取保护措施  & 保护措施包括不公开真实姓名、住址等个人信息  & 对配合侦查有组织犯罪的人员，可以参照证人保护的规定执行"}
,
{"name":"据《中华人民共和国反有组织犯罪法》规定，关于国际合作，以下哪些说法是正确的（）。","type":"2","value":"BD","id":"469","anw":"国务院公安部门可以推动与有关国家和地区建立警务合作机制  & 涉及有组织犯罪的引渡依照有关法律的规定办理"}
,
{"name":"据《中华人民共和国反有组织犯罪法》规定，关于案件办理中的财产措施，以下哪些是正 确的（）。","type":"3","value":"ABD","id":"470","anw":"公安机关核查黑社会性质组织犯罪线索，发现涉案财产有灭失风险的，可以采取紧急止付措施  & 紧急止付措施的期限不得超过四十八小时  & 临时冻结措施需要设区的市级以上公安机关负责人批准"}
,
{"name":"社会性质的组织应当同时具备下列（）特征。","type":"3","value":"ABC","id":"471","anw":"形成稳定的犯罪组织，人数较多，有明确的组织者  & 有组织地多次进行违法犯罪  & 通过违法犯罪获取经济利益，具有经济实力"}
,
{"name":"、乙两村因水源发生纠纷。甲村 20 名村民手持铁锹等农具，在两村交界处强行修建引水 设施。乙村 18 名村民随即赶到，手持木棍、铁锹等与甲村村民互相谩骂、互扔石块，甲村 3 人被 砸成重伤。因警察及时疏导，两村村民才逐渐散去。关于本案，下列说法不正确的是（）。","type":"2","value":"BC","id":"472","anw":"不分一般参加斗殴还是积极参加斗殴，甲、乙两村村民均触犯聚众斗殴罪  & 因警察及时疏导，两村未发生持械斗殴，属于聚众斗殴未遂"}
,
{"name":"社会性质组织的组织者、领导者或者恶势力组织的首要分子被判处（ ），应当跨省、自治 区、直辖市异地执行刑罚。","type":"3","value":"BCD","id":"473","anw":"十年以上有期徒刑的  & 无期徒刑的  & 死刑缓期二年执行的"}
,
{"name":"于有组织犯罪的预防和治理，以下说法正确的是（  ）","type":"4","value":"ABCD","id":"474","anw":"承担有组织犯罪预防和治理职责的部门应当开展反有组织犯罪宣传教育，增强公民的反有组织犯 罪意识和能力  & 公安机关可以会同有关部门根据本地有组织犯罪情况，确定预防和治理的重点区域、行业领域或 者场所  & 村民委员会、居民委员会应当协助人民政府以及有关部门开展有组织犯罪预防和治理工作  & 有组织犯罪的罪犯刑满释放后，司法行政机关应当会同有关部门落实安置帮教等必要措施，促进 其顺利融入社会"}
,
{"name":"被判处刑罚的黑社会性质组织的组织者、领导者或者恶势力组织的首要分子开办企业或者 在企业中担任（  ）的，相关行业主管部门应当依法审查，对其经营活动加强监督管理。","type":"4","value":"ABCD","id":"475","anw":"经理  & 副经理  & 财务负责人  & 上市公司董事会秘书"}
,
{"name":"于有组织犯罪案件办理，以下说法正确的是（  ）。","type":"3","value":"BCD","id":"476","anw":"为谋取非法利益或者形成非法影响，有组织地进行滋扰、纠缠、哄闹、聚众造势等，对他人形成 心理强制，足以限制人身自由、危及人身财产安全，影响正常社会秩序、经济秩序的，可以认定为 有组织犯罪的犯罪手段  & 对有组织犯罪案件的犯罪嫌疑人、被告人，根据办理案件和维护监管秩序的需要，可以采取异地 羁押、分别羁押或者单独羁押等措施  & 犯罪嫌疑人、被告人检举、揭发重大犯罪的其他共同犯罪人或者提供侦破重大案件的重要线索或 者证据，同案处理可能导致其本人或者近亲属有人身危险的，可以分案处理"}
,
{"name":"据《中华人民共和国国家安全法》，国家在维护国家安全任务中，包括以下哪些领域（）。","type":"4","value":"ABCD","id":"477","anw":"加强边防、海防和空防建设  & 健全粮食安全保障体系  & 坚持和平利用核能和核技术  & 完善生态环境保护制度体系"}
,
{"name":"于宗教信仰，根据《中华人民共和国国家安全法》，以下哪些说法正确（）。","type":"3","value":"BCD","id":"478","anw":"坚持宗教独立自主自办的原则  & 防范、制止和依法惩治利用宗教名义进行危害国家安全的违法犯罪活动  & 国家依法保护公民宗教信仰自由和正常宗教活动"}
,
{"name":"于外层空间、国际海底区域和极地，根据《中华人民共和国国家安全法》，以下哪些说法正 确（）。","type":"3","value":"ABC","id":"479","anw":"国家坚持和平探索和利用  & 增强安全进出、科学考察、开发利用的能力  & 加强国际合作"}
,
{"name":"据《中华人民共和国国家安全法》，关于国家安全的定义，以下哪些说法是正确的（）。","type":"2","value":"AB","id":"480","anw":"国家安全是指国家政权、主权、统一和领土完整相对处于没有危险和不受内外威胁的状态  & 国家安全包括保障持续安全状态的能力"}
,
{"name":"于维护国家安全的职责，下列说法正确的是（）。","type":"3","value":"BCD","id":"481","anw":"中央军事委员会领导全国武装力量，决定军事战略和武装力量的作战方针，统一指挥维护国家安 全的军事行动，制定涉及国家安全的军事法规，发布有关决定和命令  & 地方各级人民代表大会和县级以上地方各级人民代表大会常务委员会在本行政区域内，保证国家 安全法律法规的遵守和执行  & 香港特别行政区、澳门特别行政区应当履行维护国家安全的责任"}
,
{"name":"家安全工作中，公民和组织的支持和协助受到什么保护（）。","type":"3","value":"ABC","id":"482","anw":"法律保护  & 国家补偿  & 安全保护"}
,
{"name":"家安全宣传教育的主要目标是什么（）。","type":"2","value":"AB","id":"483","anw":"增强全民安全意识  & 提高政府人员素质"}
,
{"name":"发生国家安全危机时，哪些机构无权决定进入紧急状态（）。","type":"3","value":"ACD","id":"484","anw":"中央政府  & 各地方政府  & 中央国家安全领导机构"}
,
{"name":"于国家安全审查的说法，正确的有哪些（）。","type":"2","value":"AC","id":"485","anw":"涉及外商投资的项目需要审查  & 各省市也需负责区域内的审查"}
,
{"name":"家安全风险评估机制的主要作用是什么（）。","type":"2","value":"AC","id":"486","anw":"定期开展安全风险调查  & 向中央提交评估报告"}
,
{"name":"家安全领导机构的工作机制包括哪些特点（）。","type":"3","value":"ABD","id":"487","anw":"统分结合  & 协调高效  & 资源共享"}
,
{"name":"中华人民共和国国家安全法》的目的包括（）。","type":"2","value":"AD","id":"488","anw":"维护国家的独立与安全  & 防范和打击危害国家安全的行为"}
,
{"name":"关、单位应当加强对互联网使用的保密管理。机关、单位工作人员使用智能终端产品等应 当符合国家保密规定，不得违反有关规定使用非涉密信息系统、信息设备（）国家秘密。","type":"3","value":"ABC","id":"489","anw":"存储国家秘密  & 处理国家秘密  & 传输国家秘密"}
,
{"name":"络运营者应当遵守保密法律法规和国家有关规定，建立保密违法行为（）制度，完善受理 和处理工作机制，制定泄密应急预案。","type":"4","value":"ABCD","id":"490","anw":"投诉  & 举报  & 发现  & 处置"}
,
{"name":"关、单位对不属于本机关、本单位确定的国家秘密，认为符合保密法有关解除或者变更规 定的，可以向（）或者（）提出建议。","type":"2","value":"BC","id":"491","anw":"原定密机关、单位  & 上级机关、单位"}
,
{"name":"关、单位应当在国家秘密产生的同时，由承办人依据有关保密事项范围（）、（）和（），报 定密责任人审核批准，并采取相应保密措施。","type":"3","value":"ABD","id":"492","anw":"拟定密级  & 保密期限  & 知悉范围"}
,
{"name":"密责任人在职责范围内承担国家秘密确定、变更和解除工作，指导、监督职责范围内的定 密工作。具体职责是（）。","type":"4","value":"ABCD","id":"493","anw":"审核批准承办人拟定的国家秘密的密级、保密期限和知悉范围  & 对本机关、本单位确定的尚在保密期限内的国家秘密进行审核  & 参与制定修订本机关、本单位国家秘密事项一览表  & 对是否属于国家秘密和属于何种密级不明确的事项先行拟定密级、保密期限和知悉范围，并按照 规定的程序报保密行政管理部门确定"}
,
{"name":"关、单位主要负责人为本机关、单位法定定密责任人，根据工作需要，可以明确（）为指 定定密责任人。","type":"2","value":"AB","id":"494","anw":"本机关、本单位其他负责人  & 本机关、本单位内设机构负责人"}
,
{"name":"关、单位应当定期对本机关、单位工作人员进行哪些方面的教育培训（）。","type":"5","value":"ABCDE","id":"495","anw":"保密工作优良传统  & 保密形势任务  & 保密法律法规  & 保密技术防范  & E. 保密违法案例警示"}
,
{"name":"据《中华人民共和国保守国家秘密法》，以下关于保密制度的说法正确的是（）。","type":"3","value":"ACD","id":"496","anw":"属于国家秘密的设备、产品的研制、生产、运输、使用、保存、维修和销毁，应当符合国家保密 规定。  & 国家秘密载体的制作、收发、传递、使用、复制、保存、维修和销毁，应当符合国家保密规定。  & 禁止未按照国家保密规定和标准采取有效保密措施，在互联网及其他公共信息网络或者有线和无 线通信中传递国家秘密。"}
,
{"name":"据《中华人民共和国保守国家秘密法》，以下说法正确的是（）。","type":"3","value":"ACD","id":"497","anw":"机关、单位应当每年审核所确定的国家秘密。  & 机关、单位对是否属于国家秘密或者属于何种密级不明确或者有争议的，由国家保密行政管理部 & 国家秘密的密级、保密期限和知悉范围，应当根据情况变化及时变更。国家秘密的密级、保密期 限和知悉范围的变更，只能由原定密机关、单位决定。"}
,
{"name":"下关于国家秘密的知悉范围说法正确的是（）。","type":"3","value":"ACD","id":"498","anw":"国家秘密的知悉范围，应当根据工作需要限定在最小范围。  & 国家秘密的知悉范围以外的人员，因工作需要知悉国家秘密的，应当经过机关、单位主要负责人 或者其指定的人员批准。原定密机关、单位对扩大国家秘密的知悉范围有明确规定的，应当遵守其 规定。  & 国家秘密的知悉范围可以由机关、单位限定到具体人员。"}
,
{"name":"下关于国家秘密的保密期限说法正确的是（）。","type":"3","value":"BCD","id":"499","anw":"机关、单位应当根据工作需要，确定具体的保密期限、解密时间或者解密条件。  & 国家秘密的保密期限，应当根据事项的性质和特点，按照维护国家安全和利益的需要，限定在必 要的期限内。  & 国家秘密的保密期限不能确定期限的，应当确定解密的条件。"}
,
{"name":"家秘密的密级分为（）。","type":"3","value":"ACD","id":"500","anw":"绝密  & 机密  & 秘密"}
,
{"name":"下属于国家保密工作的原则的有（）。","type":"4","value":"ABCD","id":"501","anw":"党管保密  & 突出重点  & 技管并重  & 创新发展"}
,
{"name":"反《中华人民共和国食品安全法(2025 修正)》规定，未取得食品生产经营许可从事食品生 产经营活动，将受到以下哪些处罚（）。","type":"4","value":"ABCD","id":"502","anw":"没收违法所得和违法生产经营的食品、食品添加剂  & 没收用于违法生产经营的工具、设备、原料等物品  & 货值金额不足一万元的，并处五万元以上十万元以下罚款  & 货值金额一万元以上的，并处货值金额十倍以上二十倍以下罚款"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，国家建立食品召回制度。以下哪些说法正 确（）。","type":"3","value":"ABC","id":"503","anw":"食品生产者发现其生产的食品不符合食品安全标准，应当立即停止生产，召回已经上市销售的食 & 食品经营者发现其经营的食品不符合食品安全标准，应当立即停止经营  & 对因标签、标志或者说明书不符合食品安全标准而被召回的食品，食品生产者在采取补救措施且 能保证食品安全的情况下可以继续销售"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，网络食品交易第三方平台提供者应当履行 以下哪些义务（）。","type":"4","value":"ABCD","id":"504","anw":"对入网食品经营者进行实名登记  & 明确其食品安全管理责任  & 依法应当取得许可证的，应当审查其许可证  & 发现违法行为应当及时制止并报告"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，食品生产经营者应当建立并执行从业人员 健康管理制度。以下哪些说法正确（）。","type":"2","value":"CD","id":"505","anw":"患有国务院卫生行政部门规定的有碍食品安全疾病的人员，不得从事接触直接入口食品的工作  & 从事接触直接入口食品工作的食品生产经营人员应当每年进行健康检查"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，国家建立食品安全全程追溯制度，食品生 产经营者应当建立食品安全追溯体系。以下哪些说法正确（）。","type":"3","value":"ABC","id":"506","anw":"国家鼓励食品生产经营者采用信息化手段采集、留存生产经营信息  & 国务院食品安全监督管理部门会同国务院农业行政等有关部门建立食品安全全程追溯协作机制  & 食品追溯体系保证食品可追溯"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，食品添加剂的生产和使用，以下哪些说法正确（）。","type":"3","value":"BCD","id":"507","anw":"食品添加剂应当在技术上确有必要且经过风险评估证明安全可靠  & 食品生产经营者应当按照食品安全国家标准使用食品添加剂  & 国家对食品添加剂生产实行许可制度"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，以下哪些活动需要向国务院卫生行政部门 提交安全性评估材料（）。","type":"3","value":"ACD","id":"508","anw":"利用新的食品原料生产食品  & 生产食品相关产品新品种  & 生产食品添加剂新品种"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，国家对食品生产经营实行许可制度，但以 下哪些主体或情况不需要取得许可（）。","type":"2","value":"AD","id":"509","anw":"销售食用农产品  & 仅销售预包装食品"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，国家建立食品安全风险监测制度，对以下 哪些内容进行监测（）。","type":"3","value":"ABC","id":"510","anw":"食源性疾病  & 食品污染  & 食品中的有害因素"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，食品安全工作实行以下哪些原则（）。","type":"4","value":"ABCD","id":"511","anw":"预防为主  & 风险管理  & 全程控制  & 社会共治"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》，以下哪些活动应当遵守本法（）。","type":"3","value":"ACD","id":"512","anw":"食品生产和加工  & 食品添加剂的生产经营  & 食品的贮存和运输"}
,
{"name":"据《中华人民共和国食品安全法(2025 修正)》规定，县级以上人民政府食品安全监督管理 部门履行食品安全监督管理职责，对生产经营者遵守食品安全法的情况进行监督检查，有权采取的 措施有（）。","type":"3","value":"ABD","id":"513","anw":"对生产经营的食品、食品添加剂、食品相关产品进行抽样检验  & 查阅、复制有关合同、票据、账簿以及其他有关资料  & 查封违法从事生产经营活动的场所"}
,
{"name":"据《中华人民共和国突发公共卫生事件应对法》，居民委员会、村民委员会在突发公共卫生 事件应对中的职责包括哪些（）。","type":"3","value":"ABC","id":"514","anw":"协助开展应对有关工作  & 协助做好宣传教育和健康提示  & 组织城乡居民依法有序参与应对活动"}
,
{"name":"据《中华人民共和国突发公共卫生事件应对法》，突发公共卫生事件应急指挥机构可以做什 么（）。","type":"3","value":"ABD","id":"515","anw":"组织、协调、指挥有关部门和下级人民政府开展应对工作  & 发布有关突发公共卫生事件应对的决定、命令、措施  & 组建专家组提供咨询意见"}
,
{"name":"据《中华人民共和国突发公共卫生事件应对法》，突发公共卫生事件的分级标准由谁制定 （）。","type":"2","value":"AB","id":"516","anw":"国务院卫生健康主管部门  & 国务院疾病预防控制等部门"}
,
{"name":"据《中华人民共和国突发公共卫生事件应对法》，单位和个人在突发公共卫生事件应对中的","type":"3","value":"ACD","id":"517","anw":"支持突发公共卫生事件应对工作  & 立即报告任何可能发生的事件  & 执行依法采取的突发公共卫生事件应对措施"}
,
{"name":"病预防控制机构违反《中华人民共和国突发公共卫生事件应对法》规定，可能面临哪些处 罚（）。","type":"4","value":"ABCD","id":"518","anw":"通报批评  & 对直接责任人员依法给予处分  & 责令有关责任人员暂停执业活动直至吊销执业证书  & 责令改正，给予警告"}
,
{"name":"据《中华人民共和国突发公共卫生事件应对法》，在突发公共卫生事件应对中，个人信息处 理的要求包括哪些（）。","type":"3","value":"ABD","id":"519","anw":"遵循合法、正当、必要和诚信原则  & 采取必要措施确保个人信息安全  & 不得非法买卖、提供或者公开他人个人信息"}
,
{"name":"发公共卫生事件应对工作的管理体制包括哪些（）。","type":"3","value":"ABC","id":"520","anw":"党委领导、政府负责  & 部门协同联动、社会共同参与  & 属地管理和分类管理相结合"}
,
{"name":"据《中华人民共和国突发公共卫生事件应对法》，下列哪些属于突发公共卫生事件的定义 （）。","type":"4","value":"ABCD","id":"521","anw":"重大传染病疫情  & 群体性不明原因疾病  & 群体性中毒  & 其他严重影响公众生命安全和身体健康的事件"}
,
{"name":"中华人民共和国突发公共卫生事件应对法》已由中华人民共和国第十四届全国人民代表大会 常务委员会第十七次会议于 2025 年 9 月 12 日通过，自 2025 年 11 月 1 日起施行。该法第 39 条 规定，县级以上人民政府启动应急响应，应当组织有关部门按照突发公共卫生事件应急预案进行处 置。下列属于县级以上人民政府处置突发公共卫生事件时可以在一定范围内采取的应急处置措施的 有（）。","type":"4","value":"ABCD","id":"522","anw":"控制风险源，封闭或者封存被污染的公共饮用水源、物品，封闭可能造成危害扩散的场所  & 疏散、转移并妥善安置易受突发公共卫生事件危害的人员  & 实施人员排查、健康监测、医学观察、预防性服药  & 启用临时应急处置场所，调用应急处置所需的设备、物资、交通工具"}
,
{"name":"于劳动合同的无效，下列哪些说法是正确的（）。","type":"2","value":"AC","id":"523","anw":"劳动合同部分无效，不影响其他部分效力  & 采取欺诈手段订立的劳动合同，从订立时起就没有法律约束力"}
,
{"name":"人单位有下列哪些侵害劳动者合法权益的情形，劳动行政部门可以责令其支付工资报酬、 经济补偿，并可以责令支付赔偿金（）。","type":"2","value":"AD","id":"524","anw":"用人单位未有经营困难的情形，却连续半年迟发工资  & 与员工协商一致解除劳动合同后，未支付经济补偿金"}
,
{"name":"于劳动争议的解决程序，下列哪些说法是正确的（）。","type":"3","value":"BCD","id":"525","anw":"当事人可以不经调解直接向劳动争议仲裁委员会申请仲裁  & 对劳动争议仲裁委员会作出的裁决不服，可以向人民法院提起诉讼  & 当事人对生效的仲裁裁决必须履行，否则另一方可以申请法院强制执行"}
,
{"name":"列哪些行为是《劳动法》明确禁止用人单位对女职工采取的（）。","type":"3","value":"ACD","id":"526","anw":"安排在怀孕期间的女职工从事国家规定的第三级体力劳动强度的劳动  & 安排哺乳未满 1 周岁婴儿的女职工上夜班  & 安排经期女职工在低温冷水的作业环境中劳动"}
,
{"name":"据《劳动法》，确定和调整最低工资标准应当综合参考下列哪些因素（）。","type":"3","value":"ABD","id":"527","anw":"劳动者本人及平均赡养人口的最低生活费用  & 社会平均工资水平  & 地区之间经济发展水平的差异"}
,
{"name":"于工作时间和休息休假，下列哪些做法符合《劳动法》规定（）。","type":"2","value":"AB","id":"528","anw":"某公司实行标准工时制，规定员工每日工作 8 小时，每周工作 5 天  & 某工厂因生产特点无法保证周末休息，经劳动行政部门批准，实行综合计算工时工作制"}
,
{"name":"列哪些情形下，用人单位可以单方解除劳动合同，且无需提前三十日书面通知，也无需支 付经济补偿（）。","type":"3","value":"ACD","id":"529","anw":"员工甲在试用期间被证明不符合录用条件  & 员工丙严重违反操作规程，导致一台重要机器损坏，造成重大经济损失  & 员工丁因盗窃公司财物被依法追究刑事责任"}
,
{"name":"据《中华人民共和国劳动法(2018 修正)》，下列哪些属于劳动者的基本权利（）。","type":"4","value":"ABCD","id":"530","anw":"平等就业和选择职业的权利  & 取得劳动报酬的权利  & 休息休假的权利  & 接受职业技能培训的权利"}
,
{"name":"列哪些情形下，用人单位不得依据《中华人民共和国劳动法(2018 修正)》第二十六条、第 二十七条规定解除劳动合同（）。","type":"3","value":"ABC","id":"531","anw":"患职业病或因工负伤并被确认丧失或部分丧失劳动能力  & 患病或负伤，在规定的医疗期内  & 女职工在孕期、产期、哺乳期内"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，关于仲裁保全，下列哪些说法正确（）。","type":"4","value":"ABCD","id":"532","anw":"当事人可以申请财产保全  & 当事人可以申请证据保全  & 仲裁机构应当将保全申请提交人民法院  & 人民法院应当依法及时处理"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，关于中国仲裁协会，下列哪些说法正确（）。","type":"4","value":"ABCD","id":"533","anw":"中国仲裁协会是社会团体法人  & 仲裁机构是中国仲裁协会的会员  & 中国仲裁协会是仲裁机构的自律性组织  & 中国仲裁协会制定示范仲裁规则"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，关于仲裁调解，下列哪些说法正确（）。","type":"4","value":"ABCD","id":"534","anw":"仲裁庭在作出裁决前，可以先行调解  & 当事人自愿调解的，仲裁庭应当调解  & 调解达成协议的，仲裁庭应当制作调解书或裁决书  & 调解书与裁决书具有同等法律效力"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，当事人申请仲裁应当符合哪些条件（）。","type":"3","value":"ACD","id":"535","anw":"有仲裁协议  & 属于仲裁机构的受理范围  & 有具体的仲裁请求和事实、理由"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，当事人可以申请撤销裁决的情形包括哪些（）。","type":"4","value":"ABCD","id":"536","anw":"没有仲裁协议  & 裁决的事项不属于仲裁协议的范围  & 仲裁程序违反法定程序  & 裁决所根据的证据是伪造的"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，关于仲裁裁决，下列哪些说法正确（）。","type":"3","value":"BCD","id":"537","anw":"仲裁庭不能形成多数意见时，裁决应当按照首席仲裁员的意见作出  & 裁决书由仲裁员签名，对裁决持不同意见的仲裁员可以不签名  & 裁决应当按照多数仲裁员的意见作出"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，在哪些情况下，仲裁协议无效（）。","type":"3","value":"ABC","id":"538","anw":"约定的仲裁事项超出法律规定的仲裁范围  & 无民事行为能力人订立的仲裁协议  & 一方采取胁迫手段订立的仲裁协议"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，关于仲裁庭的组成，下列哪些说法正确（）。","type":"3","value":"ABD","id":"539","anw":"仲裁庭可以由三名仲裁员或一名仲裁员组成  & 由三名仲裁员组成的，设首席仲裁员  & 当事人没有约定仲裁庭组成方式的，由仲裁机构主任指定"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，仲裁协议应当包括哪些内容（）。","type":"3","value":"ABC","id":"540","anw":"请求仲裁的意思表示  & 仲裁事项  & 选定的仲裁机构"}
,
{"name":"据《中华人民共和国仲裁法(2025 修订)》，关于仲裁的范围，下列哪些纠纷不能仲裁（）。","type":"2","value":"BC","id":"541","anw":"婚姻纠纷  & 行政争议"}
,
{"name":"据《中华人民共和国法治宣传教育法》，某全国性行业协会在履行普法责任时，其工作重点 应侧重于（）。","type":"3","value":"ABC","id":"542","anw":"提高会员维护自身合法权益的能力  & 提高会员防范法律风险的能力  & 提升本行业治理的法治化水平"}
,
{"name":"据《中华人民共和国法治宣传教育法》，下列哪些选项属于“其他应当纳入法治宣传教育的 内容”可能涵盖的范围（）。","type":"3","value":"ABD","id":"543","anw":"新颁布的、与社会生活密切相关的法律  & 国家关于法治建设的最新政策和精神  & 与平安建设、社会治理相关的法律知识"}
,
{"name":"据《中华人民共和国法治宣传教育法》，县级以上人民政府司法行政部门在法治宣传教育工 作中的核心职能定位是（）。","type":"2","value":"AC","id":"544","anw":"主管本行政区域的法治宣传教育工作  & 对同级部门、单位履行普法职责的情况进行监督"}
,
{"name":"据《中华人民共和国法治宣传教育法》的整体精神，法治宣传教育工作的评价标准应侧重 于哪些方面（）。","type":"3","value":"BCD","id":"545","anw":"全民法治素养的实际提升程度  & 社会治理法治化水平的进步  & 全社会尊法学法守法用法氛围的形成情况"}
,
{"name":"据《中华人民共和国法治宣传教育法》，下列关于“法治宣传教育队伍”建设的说法，正确 的有（）。","type":"3","value":"ABD","id":"546","anw":"司法行政部门应当推进法治宣传教育专家库建设  & 普法讲师团的成员主要从优秀法治人才中选聘  & 在基层群众中培养具有较好法治素养和基层工作经验，能发挥示范作用的人员"}
,
{"name":"据《中华人民共和国法治宣传教育法》，下列哪些规定体现了对“涉外法治宣传教育”的重 视（）。","type":"4","value":"ABCD","id":"547","anw":"加强对开展境外投资合作企业的法治宣传教育  & 提升法治文化国际传播能力  & 鼓励和支持开展法治宣传教育国际交流合作  & 引导出境人员遵守我国和当地法律，防范法律风险"}
,
{"name":"据《中华人民共和国法治宣传教育法》，关于领导干部的法治教育，下列哪些说法是正确的 （）。","type":"3","value":"ABC","id":"548","anw":"实行应知应会党内法规和法律法规清单制度  & 清单内容应动态调整  & 学法用法情况应列入年度述职内容"}
,
{"name":"高校法学院学生计划成立一个普法志愿者社团。根据《法治宣传教育法》，他们的活动可以 得到哪些支持或依据（）。","type":"3","value":"ABD","id":"549","anw":"法律鼓励和支持个人参与法治宣传教育  & 他们可以参与有关部门和单位组织的法律咨询、法治讲座等活动  & 他们可以申请使用司法行政部门建立的法治文化场所名录中的场地"}
,
{"name":"据《中华人民共和国法治宣传教育法》，关于媒体的公益普法责任，下列说法不正确的是 （）。","type":"2","value":"AC","id":"550","anw":"网络服务提供者不属于承担媒体公益普法责任的主体  & 履行公益普法责任会影响媒体的商业运营，故可适当减免"}
,
{"name":"据《中华人民共和国法治宣传教育法》，在青少年法治宣传教育中，学校的具体职责包括哪 些（）。","type":"3","value":"ACD","id":"551","anw":"开设法治教育课程，并明确其教学目标和评价要求  & 按照要求聘任法治副校长，并可聘任校外法治辅导员  & 将法治素养纳入学生综合素质评价范围"}
,
{"name":"据《中华人民共和国法治宣传教育法》，下列关于我国法治教育宣传保障与监督的说法，哪 些是正确的（）。","type":"3","value":"BCD","id":"552","anw":"各级人大常委会可以通过执法检查、专题询问等方式进行监督  & 司法行政部门组织对法治宣传教育规划实施情况进行评估，并将评估结果向社会公布  & 国家机关、群团组织、事业单位应当合理安排经费保障普法工作"}
,
{"name":"据《中华人民共和国法治宣传教育法》，以下哪些情形可能导致法律责任（）。","type":"2","value":"AB","id":"553","anw":"司法行政部门未依法履职，经责令改正后逾期未改  & 侵占、破坏法治宣传教育设施，损毁展品、器材"}
,
{"name":"中华人民共和国法治宣传教育法》规定，法律法规制定机关应当加强立法全过程宣传解读， 并积极采取多种形式。下列哪些属于法定形式（）。","type":"3","value":"BCD","id":"554","anw":"通过公开征求意见扩大社会参与  & 召开座谈会、论证会、听证会  & 设立基层立法联系点"}
,
{"name":"据《中华人民共和国法治宣传教育法》规定，关于国家工作人员法治宣传教育，下列说法 正确的是（）。","type":"4","value":"ABCD","id":"555","anw":"国家工作人员应当加强宪法学习，树立宪法意识，恪守宪法原则，弘扬宪法精神，履行宪法使命  B. 录用国家工作人员，应当将有关法律知识纳入录用考试内容  & 健全国家工作人员日常学法制度。国家工作人员所在单位应当根据工作性质和特点，采取多种形 式开展法治教育  & 国家工作人员应当带头尊法学法守法用法，树立依法履职的法治观念，提高运用法治思维和法治 方式深化改革、推动发展、化解矛盾、维护稳定、应对风险的能力"}
,
{"name":"社区发现近期针对老年人的诈骗案件频发，计划开展专项普法。根据《中华人民共和国法 治宣传教育法》，对该社区的老年人开展法治宣传教育，下列哪些做法是正确的（）。","type":"3","value":"ABD","id":"556","anw":"重点讲解防范养老诈骗和电信网络诈骗的知识  & 发放采用大字版、语音播报的宣传材料  & 提高其依法维护自身合法权益的意识和能力"}
,
{"name":"市市场监督管理局查处一批涉及产品质量不符合国家标准的违法案件，根据《中华人民共 和国法治宣传教育法》，普法宣传教育该如何展开（）。","type":"2","value":"AC","id":"557","anw":"在执法过程中对当事人进行释法说理  & 发布典型案例进行解读，以案普法"}
,
{"name":"据《中华人民共和国法治宣传教育法》，关于各主体在国家法治宣传教育中的职责，下列说 法正确的是（）。","type":"4","value":"ABCD","id":"558","anw":"省、自治区、直辖市应当依据全国法治宣传教育规划，结合实际情况制定本行政区域相关规划。  & 国务院司法行政部门主管全国法治宣传教育工作。  & 鼓励和支持企业、其他组织以及个人开展和参与法治宣传教育。  & 国家机关和武装力量、各政党和各群团组织、事业单位，应当结合各自的职责组织开展法治宣传 教育。"}
,
{"name":"法治宣讲团准备为下个月的普法活动拟订宣讲材料，下列属于材料里应该包括的内容有（）。","type":"3","value":"ABD","id":"559","anw":"习近平法治思想  & 宪法的规定、原则和精神  & 社会主义法治文化、中华优秀传统法律文化"}
,
{"name":"据《中华人民共和国法治宣传教育法》第四条，国家实行的公民终身法治教育制度，将法 治教育纳入了哪些体系（）。","type":"3","value":"ABC","id":"560","anw":"国民教育体系  & 社会教育体系  & 干部教育体系"}
,
{"name":"市欲于 2026 年制定该年度法治宣传教育工作计划，统筹部署本市法治教育工作布局，根 据《中华人民共和国法治宣传教育法》，该市的法治宣传教育工作必须坚持下列哪些原则和指导思想 （）。","type":"3","value":"ABD","id":"561","anw":"坚持中国共产党的领导，贯彻习近平法治思想  & 坚持以人民为中心，与法治实践相融合  & 坚持依法治国和依规治党有机统一"}
,
{"name":"据《中华人民共和国民法典》，关于夫妻债务，下列哪些说法是正确的（）。","type":"3","value":"ACD","id":"562","anw":"夫妻共同签名的债务属于共同债务  & 一方为家庭日常生活需要所负债务属于共同债务  & 债权人能证明债务用于共同生活的属于共同债务"}
,
{"name":"据《中华人民共和国民法典》，下列哪些情形推定医疗机构有过错（）。","type":"3","value":"ABD","id":"563","anw":"违反诊疗规范  & 隐匿或拒绝提供病历资料  & 遗失、伪造、篡改或违法销毁病历资料"}
,
{"name":"据《中华人民共和国民法典》，下列哪些部分属于业主共有（）。","type":"3","value":"ABC","id":"564","anw":"建筑区划内的道路（城镇公共道路除外）  & 建筑区划内的绿地（城镇公共绿地或明示个人除外）  & 建筑区划内的物业服务用房"}
,
{"name":"据《中华人民共和国民法典》，下列哪些遗嘱形式需两个以上见证人（）。","type":"3","value":"BCD","id":"565","anw":"代书遗嘱  & 打印遗嘱  & 录音录像遗嘱"}
,
{"name":"据《中华人民共和国民法典》，下列哪些情形下婚姻无效（）。","type":"3","value":"ABC","id":"566","anw":"重婚  & 有禁止结婚的亲属关系  & 未到法定婚龄"}
,
{"name":"据《中华人民共和国民法典》，关于保证合同，下列哪些说法是正确的（）。","type":"3","value":"ABD","id":"567","anw":"保证合同是主债权债务合同的从合同  & 主合同无效，保证合同无效（法律另有规定除外）  & 保证方式未约定时按一般保证承担"}
,
{"name":"据《中华人民共和国民法典》，下列哪些事项需由业主共同决定（）。","type":"4","value":"ABCD","id":"568","anw":"制定和修改业主大会议事规则  & 选聘和解聘物业服务企业  & 筹集建筑物维修资金  & 改变共有部分的用途"}
,
{"name":"根据《中华人民共和国民法典》，下列哪些合同属于无效合同（）。","type":"3","value":"ACD","id":"569","anw":"违反法律、行政法规强制性规定的合同  & 行为人与相对人恶意串通损害他人权益的合同  & 违背公序良俗的合同"}
,
{"name":"据《中华人民共和国民法典》，关于诉讼时效，下列哪些说法是正确的（）。","type":"4","value":"ABCD","id":"570","anw":"普通诉讼时效期间为三年  & 诉讼时效期间自权利人知道权利受损害及义务人之日起计算  & 诉讼时效届满后，义务人同意履行的不得以时效届满抗辩  & 人民法院不得主动适用诉讼时效"}
,
{"name":"据《中华人民共和国民法典》，下列哪些财产属于夫妻共同财产（）。","type":"3","value":"BCD","id":"571","anw":"生产、经营的收益  & 知识产权的收益  & 工资、奖金"}
,
{"name":"据《中华人民共和国民法典》，关于居住权，下列哪些说法是正确的（）。","type":"4","value":"ABCD","id":"572","anw":"居住权人有权对他人的住宅占有、使用  & 居住权无偿设立，但当事人可另有约定  & 居住权不得转让、继承  & 设立居住权的住宅不得出租，但当事人可另有约定"}
,
{"name":"据《中华人民共和国民法典》，关于监护人的确定，下列哪些说法是正确的（）。","type":"3","value":"ABC","id":"573","anw":"父母是未成年子女的监护人  & 未成年人的父母死亡后，祖父母、外祖父母是第一顺序监护人  & 对监护人的确定有争议时，可由法院指定"}
,
{"name":"据《中华人民共和国民法典》，关于自然人的民事权利能力，下列哪些说法是正确的（）。","type":"3","value":"ABD","id":"574","anw":"自然人从出生时起到死亡时止，具有民事权利能力  & 自然人的民事权利能力一律平等  & 胎儿在涉及遗产继承时视为具有民事权利能力"}
,
{"name":"某、李某和贺某三人共同出资购买重庆市渝北区一套房屋，并约定按照出资比例共有该房 屋的所有权。其中王某出资占 40%、李某占 35%、贺某占 25%。下列说法正确的是（）。","type":"2","value":"BD","id":"575","anw":"李某经商失败，急需大量资金，因此请求分割该共有的房屋，三人可以协商确定分割方式。因分 割造成了王某和贺某损害，李某应当赔偿  & 三人决议将房屋出租给张某居住一年，因房屋年久失修房顶垮塌，压伤了正在熟睡的张某，对于"}
,
{"name":"据《中华人民共和国民法典》关于隐私权保护的规定，除法律另有规定或者权利人明确同 意外，任何组织或者个人不得实施的行为有（）。","type":"4","value":"ABCD","id":"576","anw":"以电话、短信、即时通讯工具、电子邮件、传单等方式侵扰他人的私人生活安宁  & 拍摄、窥视、窃听、公开他人的私密活动  & 进入、拍摄、窥视他人的住宅、宾馆房间等私密空间  & 处理他人的私密信息"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于公民的私有财产权，下列哪些选项是正 确的","type":"3","value":"BCD","id":"577","anw":"国家依照法律规定保护公民的私有财产权和继承权  & 国家为了公共利益的需要，可以依照法律规定对公民的私有财产实行征收或征用并给予补偿  & 公民的合法的私有财产不受侵犯"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于人民法院和人民检察院，下列哪些选项 是正确的（）。","type":"4","value":"ABCD","id":"578","anw":"人民法院是国家的审判机关  & 人民检察院是国家的法律监督机关  & 人民法院和人民检察院依照法律规定独立行使审判权和检察权  & 最高人民法院监督地方各级人民法院和专门人民法院的审判工作"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于监察委员会，下列哪些选项符合宪法规 定（）。","type":"4","value":"ABCD","id":"579","anw":"各级监察委员会是国家的监察机关  & 国家监察委员会是最高监察机关  & 监察委员会依照法律规定独立行使监察权  & 监察委员会主任连续任职不得超过两届"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于民族自治地方的自治机关，下列哪些选 项是正确的（）。","type":"3","value":"ABC","id":"580","anw":"民族自治地方的自治机关是自治区、自治州、自治县的人民代表大会和人民政府  & 自治区主席、自治州州长、自治县县长由实行区域自治的民族的公民担任  & 民族自治地方的自治机关有权依照当地民族的特点制定自治条例和单行条例"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于地方各级人民代表大会，下列哪些选项 是正确的（）。","type":"3","value":"ABD","id":"581","anw":"地方各级人民代表大会是地方国家权力机关  & 县级以上的地方各级人民代表大会设立常务委员会  & 省、直辖市的人民代表大会可以制定地方性法规"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于中华人民共和国主席的职权，下列哪些 选项是正确的（）。","type":"3","value":"ACD","id":"582","anw":"根据全国人大和全国人大常委会的决定，公布法律  & 代表中华人民共和国，进行国事活动  & 宣布进入紧急状态"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于全国人民代表大会常务委员会的职权， 下列哪些选项是正确的（）。","type":"3","value":"BCD","id":"583","anw":"解释宪法，监督宪法的实施  & 决定全国总动员或局部动员  & 决定特赦"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于全国人民代表大会的职权，下列哪些选 项是正确的（）。","type":"3","value":"ABD","id":"584","anw":"修改宪法  & 选举国家监察委员会主任  & 决定战争和和平的问题"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于公民的基本义务，下列哪些选项符合宪 法规定（）。","type":"4","value":"ABCD","id":"585","anw":"公民有维护国家统一和全国各民族团结的义务  & 公民有依照法律纳税的义务  & 公民有服兵役和参加民兵组织的义务  & 公民有遵守公共秩序和尊重社会公德的义务"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于公民的基本权利，下列哪些选项是正确 的（）。","type":"3","value":"ACD","id":"586","anw":"公民有言论、出版、集会、结社、游行、示威的自由  & 公民的人身自由不受侵犯，禁止非法逮捕  & 公民的通信自由和通信秘密受法律保护"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于土地制度，下列哪些选项符合宪法规定 （）。","type":"3","value":"BCD","id":"587","anw":"城市的土地属于国家所有  & 土地的使用权可以依照法律的规定转让  & 国家为了公共利益的需要，可以依照法律规定对土地实行征收或征用并给予补偿"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于依法治国原则，下列哪些选项是正确的 （）。","type":"3","value":"ACD","id":"588","anw":"一切法律、行政法规和地方性法规都不得同宪法相抵触  & 国家维护社会主义法制的统一和尊严  & 任何组织或者个人都不得有超越宪法和法律的特权"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》规定，关于民族平等和民族团结，下列哪些选项符 合宪法规定（）。","type":"3","value":"ABC","id":"589","anw":"国家保障各少数民族的合法的权利和利益  & 禁止对任何民族的歧视和压迫  & 各民族都有使用和发展自己的语言文字的自由"}
,
{"name":"中华人民共和国宪法(2018 修正)》规定，中华人民共和国的一切权力属于人民。我国宪法 明确规定人民行使国家权力的机关是（）。","type":"2","value":"AB","id":"590","anw":"全国人民代表大会  & 地方各级人民代表大会"}
,
{"name":"据《中华人民共和国宪法(2018 修正)》和《国务院组织法》的相关规定,下列说法正确的 是哪些（）。","type":"3","value":"ACD","id":"591","anw":" 国务院常务会议由总理、副总理、国务委员和秘书长组成  & 国务院实行总理负责制,国务院组成部门实行部长(主任、行长、审计长)负责制  & 国务院全体会议的主要任务是讨论决定政府工作报告、国民经济和社会发展规划等国务院工作中 的重大事项,部署国务院的重要工作"}
,
{"name":"中华人民共和国宪法(2018 修正)》规定“国家在社会主义初级阶段,坚持公有制为主体、多 种所有制经济共同发展的基本经济制度,坚持按劳分配为主体、多种分配方式并存的分配制度”。关 于我国的基本经济制度,下列说法正确的是（）。","type":"3","value":"BCD","id":"592","anw":" 集体经济是社会主义公有制经济的重要组成部分,国家鼓励、指导和帮助集体经济的发展  & 在法律规定范围内的个体经济、私营经济等非公有制经济,是社会主义市场经济的重要组成部分  & 国家鼓励、支持和引导非公有制经济的发展,并对非公有制经济依法实行监督和管理"}
,
{"name":"过网络、广播、电视、报刊、传单、书籍等，或者利用讲座、论坛、报告会、座谈会等方 式，有下列行为（）之一，情节较轻的，给予警告或者严重警告处分；情节较重的，给予撤销党内 职务或者留党察看处分；情节严重的，给予开除党籍处分。","type":"4","value":"ABCD","id":"593","anw":"公开发表违背四项基本原则，违背、歪曲党的改革开放决策  & 公开发表有严重政治问题的文章、演说、宣言、声明等  & 妄议党中央大政方针，破坏党的集中统一  & 丑化党和国家形象，或者诋毁、诬蔑党和国家领导人、英雄模范"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"2","value":"AC","id":"594","anw":"执行党纪处分决定的机关或者受处分党员所在单位，应当在六个月内将处分决定的执行情况向作 出或者批准处分决定的机关报告  & 通过网络、广播、电视、报刊、传单、书籍等，或者利用讲座、论坛、报告会、座谈会等方式， 公开发表坚持资产阶级自由化立场、反对四项基本原则，反对党的改革开放决策的文章、演说、宣 言、声明等的，给予开除党籍处分"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"2","value":"CD","id":"595","anw":"党员对所受党纪处分不服的，可以依照党章及有关规定提出申诉  & 担任职级、单独职务序列等级的党员干部违犯党纪受到处分，需要对其职级、单独职务序列等级 进行调整的，参照本条例关于党外职务的规定执行"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"3","value":"BCD","id":"596","anw":"《中国共产党纪律处分条例》所称领导责任者，包括主要领导责任者和重要领导责任者  & 计算经济损失应当计算立案时已经实际造成的全部财产损失，包括为挽回违纪行为所造成损失而 支付的各种开支、费用。  & 对于违纪行为所获得的经济利益，应当收缴或者责令退赔。对于主动上交的违纪所得和经济损失 赔偿，应当予以接收，并按照规定收缴或者返还有关单位、个人。"}
,
{"name":"据《中国共产党纪律处分条例》，违纪行为有关责任人员区分为（）。","type":"3","value":"BCD","id":"597","anw":"直接责任者  & 主要领导责任者  & 重要领导责任者"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"3","value":"BCD","id":"598","anw":"对违纪后下落不明的党员，应当区别情况作出处理  & 违纪党员在党组织作出处分决定前死亡，或者在死亡之后发现其曾有严重违纪行为，对于应当给 予开除党籍处分的，开除其党籍  & 党员犯罪情节轻微，人民检察院依法作出不起诉决定的，或者人民法院依法作出有罪判决并免予 刑事处罚的，应当给予撤销党内职务、留党察看或者开除党籍处分"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"3","value":"ABC","id":"599","anw":"党员依法受到刑事责任追究的，党组织应当根据司法机关的生效判决、裁定、决定及其认定的事 实、性质和情节，依照本条例规定给予党纪处分，是公职人员的由监察机关给予相应政务处分或者 由任免机关（单位）给予相应处分  & 党员违反国家法律法规、企事业单位或者其他社会组织的规章制度受到其他处分，应当追究党纪 责任的，党组织在对有关方面认定的事实、性质和情节进行核实后，依照规定给予相应党纪处分或 者组织处理  & 党组织作出党纪处分或者组织处理决定后，监察机关、司法机关、行政机关等依法改变原生效判 决、裁定、决定等，对原党纪处分或者组织处理决定产生影响的，党组织应当根据改变后的生效判"}
,
{"name":"当给予开除党籍处分的党员犯罪情形有（）。","type":"3","value":"BCD","id":"600","anw":"被单处或者附加剥夺政治权利  & 因过失犯罪，被依法判处三年以上（不含三年）有期徒刑  & 因过失犯罪被判处三年以下有期徒刑或者被判处管制、拘役的，一般应当开除党籍。对于个别可 以不开除党籍的，应当对照处分违纪党员批准权限的规定，报请再上一级党组织批准"}
,
{"name":"于对违法犯罪党员的纪律处分，以下说法正确的是（）。","type":"3","value":"BCD","id":"601","anw":"党组织在纪律审查中发现党员有贪污贿赂、滥用职权、玩忽职守、权力寻租、利益输送、徇私舞 弊、浪费国家资财等违反法律涉嫌犯罪行为的，应当给予撤销党内职务、留党察看或者开除党籍处 & 党员有嫖娼或者吸食、注射毒品等丧失党员条件，严重败坏党的形象行为的，应当给予开除党籍 处分  & 党员被依法留置、逮捕的，党组织应当按照管理权限中止其表决权、选举权和被选举权等党员权"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"3","value":"ABD","id":"602","anw":" 二人以上共同故意违纪的，对为首者，从重处分,《中国共产党纪律处分条例》另有规定的除外  & 对于经济方面共同违纪的，按照个人参与数额及其所起作用，分别给予处分  & 教唆他人违纪的，应当按照其在共同违纪中所起的作用追究党纪责任。"}
,
{"name":"据《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"3","value":"ACD","id":"603","anw":"从轻处分，是指在本条例规定的违纪行为应当受到的处分幅度以内，给予较轻的处分。  & 减轻处分，是指在本条例规定的违纪行为应当受到的处分幅度以外，减轻一档给予处分。  & 党员在党纪处分影响期内又受到党纪处分的，其影响期为原处分尚未执行的影响期与新处分影响 期之和。"}
,
{"name":"据《中国共产党纪律处分条例》，应当从重或者加重处分的情形有（）。","type":"4","value":"ABCD","id":"604","anw":"强迫、唆使他人违纪  & 拒不上交或者退赔违纪所得  & 违纪受处分后又因故意违纪应当受到党纪处分  & 违纪受处分后，又被发现其受处分前没有交代的其他应当受到党纪处分的问题"}
,
{"name":"据《中国共产党纪律处分条例》，可以从轻或者减轻处分的情形有（）。","type":"4","value":"ABCD","id":"605","anw":"主动交代本人应当受到党纪处分的问题  & 检举同案人或者其他人应当受到党纪处分或者法律追究的问题，经查证属实，或者有其他立功表 & 主动挽回损失、消除不良影响或者有效阻止危害结果发生  & 主动上交或者退赔违纪所得"}
,
{"name":"《中国共产党纪律处分条例》，以下说法正确的是（）。","type":"2","value":"BC","id":"606","anw":"党员受到留党察看处分，其党内职务自然撤销  & 对于受到留党察看处分一年的党员，期满后仍不符合恢复党员权利条件的，应当延长一年留党察 看期限"}
,
{"name":"员受留党察看处分期间，没有（）。","type":"3","value":"ABC","id":"607","anw":"表决权  & 选举权  & 被选举权"}
,
{"name":"据《中国共产党纪律处分条例》，留党察看处分，分为（）。","type":"2","value":"BC","id":"608","anw":"留党察看一年  & 留党察看二年"}
,
{"name":"据《中国共产党纪律处分条例》，党员受到警告处分一年内（）。","type":"2","value":"AB","id":"609","anw":"不得在党内提拔职务或者进一步使用  & 不得向党外组织推荐担任高于其原任职务的党外职务或者进一步使用"}
,
{"name":"于严重违犯党纪、本身又不能纠正的党组织，上一级党的委员会在查明核实后，根据情节 严重的程度，可以予以（）。","type":"2","value":"AB","id":"610","anw":"改组  & 解散"}
,
{"name":"下属于党的纪律处分工作遵循的原则的是（）。","type":"4","value":"ABCD","id":"611","anw":"坚持党要管党、全面从严治党。  & 党纪面前一律平等。  & 实事求是。  & 惩前毖后、治病救人。"}
,
{"name":"以下属于对党员的纪律处分的有（）。","type":"3","value":"ABC","id":"612","anw":"警告  & 严重警告  & 开除党籍"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》,全会强调要通过进一步全面深 化改革来激发动力活力，具体措施包括（）。","type":"4","value":"ABCD","id":"613","anw":"创新“大综合一体化”城市综合治理体制机制  & 建立可持续的城市建设运营投融资体系  & 健全城市共建共治共享机制  & 推进城乡融合体制机制改革"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》,加强党对城市工作全面领导的 举措包括（）。","type":"4","value":"ABCD","id":"614","anw":"构建党建统领超大城市整体智治体系  & 完善党建统领“141”基层智治体系  & 健全法规政策保障体系  & 激励广大党员干部干事创业、担当作为"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》,增强超大城市数智化协同高效 治理能力的具体路径包括（）。","type":"3","value":"ACD","id":"615","anw":"迭代升级城市数智底座  & 深化人工智能赋能超大城市发展服务治理  & 打造高能级城市运行和治理智能中枢"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》,推动城市全面绿色低碳转型的","type":"3","value":"BCD","id":"616","anw":"推行绿色低碳生产生活方式  & 塑造全市域整体大美格局  & 深化全域城市环境治理攻坚"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》,全会对提升城市宜居功能品质 的部署包括（）。","type":"4","value":"ABCD","id":"617","anw":"营造高品质城市生活空间  & 高质量开展城市更新  & 完善现代化城市基础设施体系  & 构建为民利民惠民高效精准服务体系"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》，全会提出到 2030 年，现代化 人民城市建设要成为什么（）。","type":"3","value":"ABD","id":"618","anw":"人工智能时代具有普遍意义的治理范例  & 引领西部地区现代化的核心增长极动力源  & 展示中国式现代化人民城市文明新形态的重要窗口"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》，市委牢记习近平总书记殷殷嘱 托，突出以哪两方面为牵引，推动超大城市发展服务治理质效提升（）。","type":"2","value":"AB","id":"619","anw":"数字重庆建设  & “大综合一体化”城市综合治理体制机制创新"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》，“六个建设”包括以下哪些 （）。","type":"3","value":"ABC","id":"620","anw":"创新城市  & 宜居城市  & 智慧城市"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》，城市内涵式发展的战略取向要 求加快转变哪些方面（）。","type":"2","value":"CD","id":"621","anw":"发展理念、方式、动力  & 重心、方法"}
,
{"name":"据《中国共产党重庆市第六届委员会第七次全体会议决议》，当前我国城镇化和发展阶段正 处于怎样的转变时期（）。","type":"2","value":"AB","id":"622","anw":"从快速增长期转向稳定发展期  & 从大规模增量扩张阶段转向存量提质增效为主的阶段"}
,
{"name":"国共产党重庆市第六届委员会第七次全体会议于 2025 年 8 月 18 日召开。会议提出了到 2027 年现代化人民城市建设的“六个新”目标。下列选项中，哪些属于该“六个新”目标的准确 表述（）。","type":"3","value":"ACD","id":"623","anw":"全面培育创新开放富有活力的城市发展新动能  & 全面优化韧性可靠敏捷高效的本质安全新体系  & 全面构筑舒适便利普惠可及的高品质生活新图景"}
,
{"name":"的二十届三中全会提出：”进一步全面深化改革的总目标。继续完善和发展中国特色社会 主义制度，推进国家治理体系和治理能力现代化。“以下说法正确的是（）。","type":"3","value":"BCD","id":"624","anw":"聚焦提高党的领导水平和长期执政能力，创新和改进领导方式和执政方式，深化党的建设制度改 革，健全全面从严治党体系。  & 聚焦建设更高水平平安中国，健全国家安全体系，强化一体化国家战略体系，增强维护国家安全 能力，创新社会治理体制机制和手段，有效构建新安全格局。  & 聚焦建设美丽中国，加快经济社会发展全面绿色转型，健全生态环境治理体系，推进生态优先、 节约集约、绿色低碳发展，促进人与自然和谐共生。"}
,
{"name":"下说法正确的是（）。","type":"3","value":"ABC","id":"625","anw":"改革开放是党和人民事业大踏步赶上时代的重要法宝  & 党的十一届三中全会是划时代的，开启了改革开放和社会主义现代化建设新时期  & 党的十八届三中全会也是划时代的，开启了新时代全面深化改革、系统整体设计推进改革新征程， 开创了我国改革开放全新局面"}
,
{"name":"国式现代化是走和平发展道路的现代化，对外工作必须坚持（）。","type":"3","value":"BCD","id":"626","anw":"践行全人类共同价值  & 落实全球发展倡议、全球安全倡议、全球文明倡议  & 倡导平等有序的世界多极化、普惠包容的经济全球化"}
,
{"name":"何确保党始终成为中国特色社会主义事业的坚强领导核心？（）","type":"3","value":"BCD","id":"627","anw":"加强党的创新理论武装，建立健全以学铸魂、以学增智、以学正风、以学促干长效机制  & 深化干部人事制度改革，鲜明树立选人用人正确导向，大力选拔政治过硬、敢于担当、锐意改革、 实绩突出、清正廉洁的干部，着力解决干部乱作为、不作为、不敢为、不善为问题  & 树立和践行正确政绩观，健全有效防范和纠治政绩观偏差工作机制。落实“三个区分开来”"}
,
{"name":"督执纪“四种形态”是指（）。","type":"4","value":"ABCD","id":"628","anw":"经常开展批评和自我批评，及时进行谈话提醒、批评教育、责令检查、诫勉，让“红红脸、出出 & 党纪轻处分、组织调整成为违纪处理的大多数  & 党纪重处分、重大职务调整的成为少数  & 严重违纪涉嫌犯罪追究刑事责任的成为极少数"}
,
{"name":"据党的二十届三中全会，以下说法正确的是（）。","type":"2","value":"BC","id":"629","anw":"国家安全是中国式现代化行稳致远的重要基础  & 中国式现代化是人与自然和谐共生的现代化"}
,
{"name":"何提高党对进一步全面深化改革、推进中国式现代化的领导水平？（）","type":"3","value":"BCD","id":"630","anw":"坚持用改革精神和严的标准管党治党  & 完善党的自我革命制度规范体系  & 确保党始终成为中国特色社会主义事业的坚强领导核心。"}
,
{"name":"于党的二十届三中全会提出的健全社会治理体系，以下说法正确的是（）。","type":"3","value":"ABC","id":"631","anw":"健全党组织领导的自治、法治、德治相结合的城乡基层治理体系  & 提高市域社会治理能力  & 探索建立全国统一的人口管理制度"}
,
{"name":"于健全社会保障体系，以下说法正确的是（）。","type":"3","value":"ABC","id":"632","anw":"完善基本养老保险全国统筹制度  & 健全灵活就业人员、农民工、新就业形态人员社保制度  & 扩大失业、工伤、生育保险覆盖面"}
,
{"name":"据党的二十届三中全会审议通过的《中共中央关于进一步全面深化改革   推进中国式现代 化的决定八、健全全过程人民民主制度体系》，如何优化文化服务和文化产品供给机制？（）","type":"3","value":"ABC","id":"633","anw":"坚持以人民为中心的创作导向  & 建立文化遗产保护传承工作协调机构  & 完善全民健身公共服务体系，改革完善竞技体育管理体制和运行机制。"}
,
{"name":"于理想信念教育，以下说法正确的是（）。","type":"3","value":"ABC","id":"634","anw":"完善培育和践行社会主义核心价值观制度机制  & 优化英模人物宣传学习机制  & 创新爱国主义教育和各类群众性主题活动组织机制"}
,
{"name":"于公共法律服务体系，以下属于党的二十届三中全会提到应当深化改革的有（）。","type":"3","value":"ABC","id":"635","anw":"律师制度  & 公证体制  & 仲裁制度"}
,
{"name":"于中国特色社会主义法治体系，以下说法正确的是（）。","type":"2","value":"BD","id":"636","anw":"必须全面贯彻实施宪法，维护宪法权威  & 健全党内法规同国家法律法规衔接协调机制"}
,
{"name":"于健全协商民主机制，以下说法正确的是（）。","type":"3","value":"ABC","id":"637","anw":"人民政协是专门协商机构  & 健全深度协商互动、意见充分表达、广泛凝聚共识的机制  & 加强人民政协反映社情民意、联系群众、服务人民机制建设。"}
,
{"name":"于高质量共建“一带一路”机制，以下哪些措施是党的二十届三中全会提出的？（）","type":"3","value":"ABD","id":"638","anw":"完善陆海天网一体化布局  & 统筹推进重大标志性工程和“小而美”民生项目  & 继续实施“一带一路”科技创新行动计划"}
,
{"name":"据党的二十届三中全会审议通过的《中共中央关于进一步全面深化改革   推进中国式现代 化的决定八、健全全过程人民民主制度体系》，如何优化区域开放布局？（）","type":"3","value":"BCD","id":"639","anw":"加快建设海南自由贸易港  & 巩固东部沿海地区开放先导地位  & 提高中西部和东北地区开放水平"}
,
{"name":"据党的二十届三中全会审议通过的《中共中央关于进一步全面深化改革   推进中国式现代 化的决定八、健全全过程人民民主制度体系》，巩固和完善农村基本经营制度应当（）。","type":"2","value":"CD","id":"640","anw":"完善农业经营体系，完善承包地经营权流转价格形成机制  & 发展新型农村集体经济，构建产权明晰、分配合理的运行机制，赋予农民更加充分的财产权益。"}
,
{"name":"下说法正确的是（）。","type":"3","value":"ABD","id":"641","anw":"科学的宏观调控、有效的政府治理是发挥社会主义市场经济体制优势的内在要求。  & 城乡融合发展是中国式现代化的必然要求。  & 发展全过程人民民主是中国式现代化的本质要求。"}
,
{"name":"据党的二十届三中全会审议通过的《中共中央关于进一步全面深化改革   推进中国式现代 化的决定八、健全全过程人民民主制度体系》，构建高水平社会主义市场经济体制应当（）。","type":"3","value":"ABC","id":"642","anw":"完善要素市场制度和规则  & 构建全国统一大市场  & 加快培育完整内需体系"}
,
{"name":"中共中央关于进一步全面深化改革 推进中国式现代化的决定八、健全全过程人民民主制度","type":"4","value":"ABCD","id":"643","anw":"加强人民当家作主制度建设。  & 健全协商民主机制。  & 健全基层民主制度。  & 完善大统战工作格局。"}
,
{"name":"于司法体制改革，习近平法治思想强调 “深化司法体制综合配套改革”。下面哪些属于其 重点任务或措施（）。","type":"3","value":"ACD","id":"644","anw":"完善司法责任制  & 领导干部不断提高运用法治思维和法治方式的能力  & 坚持建设德才兼备的高素质法治工作队伍"}
,
{"name":"近平在谈及中国特色社会主义法治道路时指出，不走“宪政”“三权鼎立”“司法独立” 等模式。下列说法中，哪些与这一论断相一致（）。","type":"3","value":"ABD","id":"645","anw":"中国法治不能简单照搬西方模式  & 要坚决反对和抵制西方“司法独立”等错误观点  & 制度选择要符合中国国情"}
,
{"name":"于“依法治国”与“以德治国”的关系，习近平法治思想认为（）。","type":"2","value":"BC","id":"646","anw":"必须两者结合、相辅相成  & 法律的有效实施有赖于道德支持，道德践行也离不开法律约束"}
,
{"name":"近平总书记指出：“我们党要履行好执政兴国的重大历史使命、赢得具有许多新的历史特 点的伟大斗争胜利、实现党和国家的长治久安，必须坚持依法治国与制度治党、依规治党统筹推进、 一体建设”。下面哪些说法正确（）。","type":"3","value":"BCD","id":"647","anw":"党内法规体系是法治体系的一个子体系  & 党内法规应严于国家法律  & 党内法规与国家法律的价值取向一致"}
,
{"name":"近平总书记指出：“每一种法治形态背后都有一套政治理论。每一种法治模式里都有一种 政治逻辑。” 这句话强调的是法治与政治关系的哪一种认识（）。","type":"3","value":"ACD","id":"648","anw":"法治是政治的产物  & 法治与政治不可分割  & 法治是政治逻辑的表达"}
,
{"name":"列哪几项属于习近平法治思想强调要推进的 “法治领域”（）。","type":"4","value":"ABCD","id":"649","anw":"依法治网  & 法治社会  & 法治经济  & 依法执政"}
,
{"name":"近平在法治领域强调，要“坚持党的领导、人民当家作主、依法治国有机统一”。这句话 体现了哪几个方面的有机统一（）。","type":"3","value":"ABD","id":"650","anw":"党与国家的关系统一  & 人民主权与法治保障统一  & 治国理政方式与法治方式统一"}
,
{"name":"于习近平法治思想和全面依法治国,下列说法正确的是哪些（）。","type":"4","value":"ABCD","id":"651","anw":"党的领导是中国特色社会主义法治之魂  & 中国特色社会主义法治道路是中国建设社会主义法治国家、法治体系的唯一正确道路  & 以人民为中心是全面依法治国的根本立场  & 坚持依法治国首先要坚持依宪治国，坚持依法执政首先要坚持依宪执政"}
,
{"name":"近平法治思想提出了法治国家、法治政府和法治社会一体建设的发展方略,其中法治国家是 法治建设的目标,法治政府是建设法治国家的主体,法治社会是构筑法治国家的基础。关于法治政府的 建设标准,下列说法正确的是（）。","type":"3","value":"ABC","id":"652","anw":"廉洁诚信  & 权责法定  & 职能科学"}
,
{"name":"据《党政机关国内公务接待管理规定》，国内公务接待的出行活动应当安排集中乘车，合理使用车型，严格控制随行车辆。接待单位应当严格按照_____使用公务用车。（  ）","type":"1","value":"B","id":"653","anw":"规定用途"}
,
{"name":"据《党政机关国内公务接待管理规定》，公务接待对象应当按照规定标准自行用餐。确因工 作需要，接待单位可以安排工作餐一次，并严格控制陪餐人数。接待对象在 10 人以内的，陪餐人 数不得超过____人。（ ）","type":"1","value":"B","id":"654","anw":"3"}
,
{"name":"党政机关厉行节约反对浪费条例》规定，建立健全办公用房____管理制度，对办公用房实行 统一调配、统一权属登记。（  ）","type":"1","value":"A","id":"655","anw":"集中统一"}
,
{"name":"党政机关厉行节约反对浪费条例》规定，党政机关办公用房建设应当从严控制，凡是违反规 定的拟建办公用房项目，必须____ 。（  ）","type":"1","value":"B","id":"656","anw":"坚决终止"}
,
{"name":"党政机关厉行节约反对浪费条例》规定，改革公务用车实物配给方式，取消一般公务用车， 保留必要的____ 用车和按规定配备的其他车辆。（  ）","type":"1","value":"A","id":"657","anw":"机要通信、应急、特种专业技术"}
,
{"name":"中国共产党思想政治工作条例》强调，要坚持党要管党、全面从严治党，以党的____ 为统领， 把思想政治工作贯穿党的建设和国家治理各领域各方面各环节。（  ）","type":"1","value":"B","id":"658","anw":"政治建设"}
,
{"name":"中国共产党思想政治工作条例》明确，加强和改进思想政治工作，是____ 的必然要求。（  ）","type":"1","value":"D","id":"659","anw":"以上都是"}
,
{"name":"据《中国共产党思想政治工作条例》，思想政治工作坚持____ 的领导，坚持围绕中心、服务 大局，坚持遵循规律、改革创新，坚持齐抓共管、形成合力。（  ）","type":"1","value":"A","id":"660","anw":"党中央集中统一"}
,
{"name":"据《评比表彰和创建示范活动管理办法》，申请设立、调整、撤销评比表彰和创建示范项目， 应当至少提前____ 个月按程序报批。（  ）","type":"1","value":"C","id":"661","anw":"3"}
,
{"name":"据《评比表彰和创建示范活动管理办法》，评比表彰和创建示范项目实行 ____ 审批制度。 （  ）","type":"1","value":"B","id":"662","anw":"中央和省（自治区、直辖市）两级"}
,
{"name":"据《评比表彰和创建示范活动管理办法》，____ 经批准可以开展评比表彰活动，不得开展创 建示范活动。（  ）","type":"1","value":"D","id":"663","anw":"市、县级党委和政府"}
,
{"name":"整治形式主义为基层减负若干规定》要求，要清理规范基层报表台账，建立健全数据共享机 制，避免____。（  ）","type":"1","value":"B","id":"664","anw":"层层报数"}
,
{"name":"据《整治形式主义为基层减负若干规定》，除中央统一部署外，未经批准，任何部门不得组 织全域性的____，防止政出多门、政策效应相互抵消。（  ）","type":"1","value":"D","id":"665","anw":"评比表彰"}
,
{"name":"整治形式主义为基层减负若干规定》要求，要严格控制各类简报和内部刊物，能压缩的尽量 压缩，能停办的坚决停办。对内容相近、功能重复的简报和内部刊物，应当____。（  ）","type":"1","value":"A","id":"666","anw":"合并规范"}
,
{"name":"整治形式主义为基层减负若干规定》强调，要改进调查研究，注重实效，到基层调研务求 （ ），不干扰基层正常工作。（  ）","type":"1","value":"B","id":"667","anw":"深入扎实"}
,
{"name":"整治形式主义为基层减负若干规定》要求，要少开会、开短会，开管用的会。中央部门工作 会议原则上只开到 ____ 一级。（  ）","type":"1","value":"A","id":"668","anw":"省部"}
,
{"name":"整治形式主义为基层减负若干规定》要求，要严格控制 ____ ，从中央层面做起，省市两级 要大幅度精简，确保发给县级以下的文件、召开的会议减少 30%—50%。（  ）","type":"1","value":"C","id":"669","anw":"层层发文、层层开会"}
,
{"name":"整治形式主义为基层减负若干规定》强调，要改进督查检查考核方式方法，注重（  ），引导 干部树立正确政绩观。（  ）","type":"1","value":"C","id":"670","anw":"解决实际问题、减轻基层负担"}
,
{"name":"整治形式主义为基层减负若干规定》明确提出，要精简文件简报，严格控制发文数量和发文 规格。属于部门职权范围内的工作，____ 发文或者部门联合发文。（  ）","type":"1","value":"D","id":"671","anw":"由主管部门单独"}
,
{"name":"整治形式主义为基层减负若干规定》强调，要严格控制层层发文、层层开会，着力解决文山 会海反弹回潮的问题。对于上级文件，下级单位在制定贯彻落实措施时，____。（  ）","type":"1","value":"C","id":"672","anw":"可结合实际制定务实管用的措施，不再制定贯彻落实意见和实施细则"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，该条例自____起施行。（  ）","type":"1","value":"C","id":"673","anw":"2024 年 12 月 15 日"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，全市行政执法以及执法监督数字应用设由____负 责。（  ）","type":"1","value":"B","id":"674","anw":"市司法局"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，乡镇（街道）层面的综合行政执法人员由____统 筹管理。（  ）","type":"1","value":"D","id":"675","anw":"乡镇人民政府、街道办事处统筹使用与管理"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，对收到的投诉举报事项，应当____。（ ）","type":"1","value":"C","id":"676","anw":"实行首问负责制登记并及时处理或移送"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，应建立健全____机制以提高执法协同效能。（  ）","type":"1","value":"A","id":"677","anw":"跨部门、跨区域、跨层级的行政执法协同"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，行政执法事项应当实行____。（  ）","type":"1","value":"B","id":"678","anw":"清单化管理"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，下列哪些部门可以被纳入综合行政执法机构行使 执法职责？（  ）","type":"1","value":"D","id":"679","anw":"城市管理、市场监管、生态环境、交通运输、应急管理、农业、文化旅游等部门"}
,
{"name":"据《重庆市大综合一体化行政执法条例》，市、区县人民政府在本行政区域内应当____。（ ）","type":"1","value":"A","id":"680","anw":"统一领导行政执法工作，建立执法协调监督体系"}
,
{"name":"重庆市大综合一体化行政执法条例》适用于____。（  ）","type":"1","value":"C","id":"681","anw":"本市行政区域内推进大综合一体化行政执法及其相关工作"}
,
{"name":"据《重庆市大综合一体化行政执法条例》的规定，“大综合一体化行政执法”是指____。 （  ）","type":"1","value":"B","id":"682","anw":"通过精简执法队伍、统一平台、强化监督等方式构建整合的执法机制"}
,
{"name":"标人在中标候选人公示前若发现评标委员会审核存在错误，有权____。（  ）","type":"1","value":"C","id":"683","anw":"要求评标委员会复核纠正"}
,
{"name":"于评标报告存在错误或重大缺陷，评标委员会应____。（  ）","type":"1","value":"D","id":"684","anw":"停止评标并书面说明情况，修改招标文件并重新招标"}
,
{"name":"标委员会成员如对某一评分异常，应_____。（  ）","type":"1","value":"A","id":"685","anw":"要求其书面说明理由，必要时由其他成员平均替代"}
,
{"name":"据《重庆市招标投标条例》，在开标、评标过程中，招标人不得____。（  ）","type":"1","value":"C","id":"686","anw":"干涉资格审查或评标"}
,
{"name":"重庆市招标投标条例》规定，投标保证金不得超过____。（ ）","type":"1","value":"A","id":"687","anw":"招标项目估算价的 2%"}
,
{"name":"标候选人公示期内如无人提出异议，中标通知书应在公示期结束后____内发出。（ ）","type":"1","value":"B","id":"688","anw":"5 个工作日"}
,
{"name":"据《重庆市招标投标条例》，经评审的最低投标价法一般适用于下列哪类招标项目？（  ）  A. 技术复杂、创新性强、需要专家综合判断的项目","type":"1","value":"C","id":"689","anw":"具有通用技术、性能标准或者招标人对技术、性能没有特殊要求的项目"}
,
{"name":"重庆市招标投标条例》规定，对招标投标交易所运行服务机构违法行为如不按规定退还投标 保证金的，可____。（ ）","type":"1","value":"A","id":"690","anw":"责令退还并处罚款"}
,
{"name":"重庆市招标投标条例》规定，招标投标活动应遵循____。（ ）","type":"1","value":"A","id":"691","anw":"公开、公平、公正与诚实信用原则"}
,
{"name":"重庆市招标投标条例》规定，重庆市行政区域内的招标、投标、开标、评标、中标、合同签 订等活动及其监督管理____。（  ）","type":"1","value":"C","id":"692","anw":"在本市行政区域内一律适用本条例"}
,
{"name":"区生态环境主管部门在例行检查中，发现一家化工企业在排放废水时疑似超标，于是依法 进厂进行现场检查。执法人员出示证件后要求调取排放记录并对排污口进行采样，但企业负责人以 “企业技术资料涉及商业机密”为由拒绝配合检查，并阻止执法人员拍照取证。 根据《重庆市生态 环境保护条例》第三十五条的规定，该企业的做法应认定为_____。（ ）","type":"1","value":"C","id":"693","anw":"违反规定，拒绝、阻挠现场检查的行为"}
,
{"name":"据《重庆市生态环境保护条例》第三十三条，负责组织建立生态环境监测网络并开展全市 生态环境质量监测和考核工作的部门是____。（  ）","type":"1","value":"C","id":"694","anw":"市生态环境主管部门"}
,
{"name":"据《重庆市生态环境保护条例》第二十条，下列哪一情形下不得核发建设项目环境影响报 告书或者报告表批准书？（  ）","type":"1","value":"C","id":"695","anw":"建设项目环境影响报告书基础数据明显不实、存在重大缺陷"}
,
{"name":"据《重庆市生态环境保护条例》第十七条，市生态环境主管部门在收到环境影响报告书后， 应当如何处理？（  ）","type":"1","value":"C","id":"696","anw":"召集有关部门代表和专家组成审查小组进行审查"}
,
{"name":"据《重庆市环境保护条例》，规划编制机关对可能造成不良环境影响并直接涉及公众环境权 益的专项规划，应当在规划草案报送审批前，采取________等形式公开征求意见。（  ）","type":"1","value":"B","id":"697","anw":"调查问卷、座谈会、论证会、听证会"}
,
{"name":"据《重庆市生态环境保护条例》第十三条，下列哪一项环境功能区划应当由市生态环境主 管部门会同有关部门划分，并报市人民政府批准后公布实施？（  ）","type":"1","value":"C","id":"698","anw":"主城区环境噪声功能区划"}
,
{"name":"据《重庆市生态环境保护条例》，下列哪一情形下生态环境主管部门不得对有关设施、物品 予以查封、扣押？（  ）","type":"1","value":"A","id":"699","anw":"企业因设备老化导致排放超标，但已主动停产整改"}
,
{"name":"据《重庆市环境保护条例》，重庆市及区、县人民政府应建立____，将环境保护纳入重要考 核内容。（  ）","type":"1","value":"B","id":"700","anw":"人民政府负责制与目标责任制"}
,
{"name":"据《重庆市环境保护条例》，建设项目中配套的环境保护设施应当实行“三同时”制度，即 环境保护设施应当与主体工程____。（  ）","type":"1","value":"C","id":"701","anw":"同时设计、同时施工、同时投产使用"}
,
{"name":"据《重庆市中小企业促进条例》的规定，行政机关在对中小企业进行检查时，应当如何开 展？（  ）","type":"1","value":"D","id":"702","anw":"依法依规、列入检查计划、统筹安排，避免重复检查"}
,
{"name":"据《重庆市中小企业促进条例》，无形资产是中小企业重要的创新资源，下列哪一项均属于 条例支持的无形资产形式？（  ）","type":"1","value":"A","id":"703","anw":"专利权、商标权、非专利技术等"}
,
{"name":"重庆市中小企业促进条例》中对中小企业参加展会、对外合作的支持，可能包括____。（  ）","type":"1","value":"C","id":"704","anw":"提供国际市场拓展资金支持"}
,
{"name":"重庆市中小企业促进条例》规定行政主管部门收到中小企业投诉举报后，应当在_____作出是 否受理决定。（  ）","type":"1","value":"A","id":"705","anw":"3 个工作日"}
,
{"name":"据《重庆市中小企业促进条例》，中小企业对行政机关侵犯其合法权益的行为不服，可以 _____。（  ）","type":"1","value":"B","id":"706","anw":"向中小企业行政主管部门投诉、申请行政复议或提起诉讼"}
,
{"name":"据《重庆市中小企业促进条例》，若行政许可、年检或检查环节中要求中小企业必须聘请中 介机构，则该做法_____。（  ）","type":"1","value":"C","id":"707","anw":"违反《重庆市中小企业促进条例》规定"}
,
{"name":"市场开拓方面，《重庆市中小企业促进条例》明确政府采购应在同等条件下_____。（  ）","type":"1","value":"A","id":"708","anw":"优先购买中小企业产品、优先接受中小企业服务"}
,
{"name":"重庆市中小企业促进条例》中有关技术创新支持的规定中，不包括下列哪项？（  ）","type":"1","value":"D","id":"709","anw":"强制技术共享给所有企业"}
,
{"name":"于监督检查，《重庆市中小企业促进条例》规定中小企业投诉举报后，有权处理的部门应在 _____作出处理决定。（ ）","type":"1","value":"B","id":"710","anw":"15 个工作日"}
,
{"name":"据《重庆市中小企业促进条例》，重庆市财政预算中安排中小企业发展专项资金的目的是","type":"1","value":"C","id":"711","anw":"用于技术创新、服务体系建设、信用担保等扶持项目"}
,
{"name":"重庆市区县政府在编制该区国民经济和社会发展规划时，没有将中小企业发展纳入规划， 也未制定相关扶持措施。根据《重庆市中小企业促进条例》规定，这种做法_____。（  ）","type":"1","value":"D","id":"712","anw":"违反条例，应承担责任"}
,
{"name":"重庆市知识产权保护和促进条例》对地理标志保护有规定，下列哪项是条例明确支持的____？ （  ）","type":"1","value":"C","id":"713","anw":"建设地理标志产品保护示范区，培育产业"}
,
{"name":"重庆市知识产权保护和促进条例》关于知识产权保护与促进的基本原则中，不包括以下哪项？ （  ）","type":"1","value":"C","id":"714","anw":"优先保护地方利益"}
,
{"name":"根据《重庆市知识产权保护和促进条例》，企业、高校、科研机构可以采取多种方式激励科 技人员在知识产权方面的贡献。下列哪一项不属于条例规定的激励方式？（  ）","type":"1","value":"D","id":"715","anw":"对贡献突出的科技人员给予其子女高考加分"}
,
{"name":"重庆市知识产权保护和促进条例》对知识产权侵权行政保护提出，下列哪项不是条例中特别 强调的机制____？（ ）","type":"1","value":"D","id":"716","anw":"媒体宣传机制"}
,
{"name":"重庆市知识产权保护和促进条例》规定，在知识产权服务领域，市、区县两级要推进公共服 务“三化”，即____。（  ）","type":"1","value":"A","id":"717","anw":"标准化、规范化、便利化"}
,
{"name":"据《重庆市知识产权保护和促进条例》，知识产权管理职责应由下列哪些部门依据职责分工 承担？（  ）","type":"1","value":"D","id":"718","anw":"知识产权部门、市场监督、文化、农业等部门按职能分工承担具体工作"}
,
{"name":"重庆市知识产权保护和促进条例》对新兴领域著作权运用的特别规定____。（  ）","type":"1","value":"B","id":"719","anw":"强调推进网络视听、数字出版等领域著作权运用"}
,
{"name":"《重庆市知识产权保护和促进条例》中，高校、科研机构应明确或设立____机构，以促进 知识产权转化运用。（  ）","type":"1","value":"B","id":"720","anw":"知识产权转化工作"}
,
{"name":"《重庆市知识产权保护和促进条例》中，知识产权部门应会同相关部门统筹建设_____。（ ）","type":"1","value":"A","id":"721","anw":"知识产权数字化应用系统"}
,
{"name":"据《重庆市知识产权保护和促进条例》规定，市、区县政府应将知识产权保护与促进工作 纳入____。（  ）","type":"1","value":"B","id":"722","anw":"国民经济和社会发展规划"}
,
{"name":"据《住房租赁条例》的规定，从事住房转租经营的企业未设立资金监管账户的，应当____。 （  ）","type":"1","value":"A","id":"723","anw":"由住房城乡建设主管部门责令改正并处罚"}
,
{"name":"据《住房租赁条例》的规定，租赁合同连续履行达到规定期限后，承租人____。（ ）","type":"1","value":"C","id":"724","anw":"可按规定享受相应公共服务"}
,
{"name":"据《住房租赁条例》的规定，设区的市级以上地方人民政府应建立的机制是____。（  ）","type":"1","value":"B","id":"725","anw":"租金监测机制"}
,
{"name":"据《住房租赁条例》的规定，网络平台未核验发布者身份且未删除虚假房源信息的，应当 ____。（  ）","type":"1","value":"A","id":"726","anw":"承担法律责任"}
,
{"name":"据《住房租赁条例》的规定，住房租赁经纪机构未经当事人同意，以自己名义签订合同的， 应当____。（  ）","type":"1","value":"B","id":"727","anw":"承担相应法律责任"}
,
{"name":"据《住房租赁条例》的规定，住房租赁企业发布虚假或误导性房源信息的，____。（  ）","type":"1","value":"C","id":"728","anw":"依法承担行政法律责任"}
,
{"name":"据《住房租赁条例》的规定，承租人擅自改动承重墙结构造成损害的，应当____。（  ）","type":"1","value":"A","id":"729","anw":"承担恢复原状或赔偿损失的责任"}
,
{"name":"据《住房租赁条例》的规定，出租人收取押金但未约定返还时间及扣减条件的，____。（ ）","type":"1","value":"B","id":"730","anw":"无正当理由不得扣减押金，租赁关系终止后应当及时返还"}
,
{"name":"据《住房租赁条例》的规定，承租人拒绝出示身份证明材料时，出租人____。（  ）","type":"1","value":"C","id":"731","anw":"有权拒绝出租"}
,
{"name":"据《住房租赁条例》的规定，租赁双方因押金返还发生纠纷协商不成的，可以____。（  ）","type":"1","value":"C","id":"732","anw":"申请调解、仲裁或提起诉讼"}
,
{"name":"据《住房租赁条例》的规定，厨房、卫生间、阳台等非居住空间____。（  ）","type":"1","value":"A","id":"733","anw":"不得单独出租用于居住"}
,
{"name":"据《住房租赁条例》的规定，出租人未按规定备案租赁合同时_____。（  ）","type":"1","value":"D","id":"734","anw":"承租人可以代为备案"}
,
{"name":"据《住房租赁条例》的规定，出租人限制承租人夜间出入的合同条款_____。（  ）","type":"1","value":"B","id":"735","anw":"属无效条款，其余条款仍有效"}
,
{"name":"根据《突发事件应对法》，国家采取措施，加强____，支持引导心理健康服务人员和社会工 作者对受突发事件影响的各类人群开展心理健康教育、心理评估、心理疏导、心理危机干预、心理 行为问题诊治等心理援助工作。（  ）","type":"1","value":"A","id":"736","anw":"心理健康服务体系和人才队伍建设"}
,
{"name":"根据《突发事件应对法》，国家建立健全突发事件预警制度。可以预警的自然灾害、事故灾 难和公共卫生事件的预警级别，按照突发事件发生的紧急程度、发展势态和可能造成的危害程度分 为____级。（  ）","type":"1","value":"C","id":"737","anw":"四"}
,
{"name":"根据《突发事件应对法》，国家建立健全能源应急保障体系，提高（），确保受突发事件影 响地区的能源供应。（  ）","type":"1","value":"D","id":"738","anw":"能源安全保障能力"}
,
{"name":"安全生产法》所指的危险物品包括（  ）。","type":"1","value":"A","id":"739","anw":"易燃易爆物品、危险化学品、放射性物品等能够危及人身安全和财产安全的物品"}
,
{"name":"生产经营单位的工会依法组织职工参加本单位安全生产工作的____，维护职工在安全生产方 面的合法权益。（  ）","type":"1","value":"A","id":"740","anw":"民主管理和民主监督"}
,
{"name":"突发事件应对工作应当坚持 ____，统筹发展与安全。（  ）","type":"1","value":"D","id":"741","anw":"总体国家安全观"}
,
{"name":"市、区县（自治县）人民政府应当建立健全____，统一规划、组织和指导应急救援队伍建设， 组织有关部门制定生产安全事故应急救援预案，储备必要的应急救援物资、装备，组织、协调和督 促本级人民政府有关部门与下级人民政府共同做好生产安全事故应急救援工作。（  ）","type":"1","value":"B","id":"742","anw":"生产安全事故应急救援体系"}
,
{"name":"据《未成年人网络保护条例》规定，网络产品和服务提供者违反条例规定，受到关闭网站、 吊销相关业务许可证或者吊销营业执照处罚的，___年内不得重新申请相关许可，其直接负责的主管 人员和其他直接责任人员___年内不得从事同类网络产品和服务业务。（  ）","type":"1","value":"D","id":"743","anw":"5；5"}
,
{"name":"据《未成年人网络保护条例》规定，网络游戏、网络直播、网络音视频、网络社交等网络 服务提供者应当采取措施，合理限制不同年龄阶段未成年人在使用其服务中的单次消费数额和单日 累计消费数额，不得向未成年人提供_____的付费服务。（  ）","type":"1","value":"B","id":"744","anw":"与其民事行为能力不符"}
,
{"name":"据《未成年人网络保护条例》规定，网络产品和服务提供者应当建立健全_____，不得向未 成年人提供诱导其沉迷的产品和服务。（  ）","type":"1","value":"C","id":"745","anw":"防沉迷制度"}
,
{"name":"据《未成年人网络保护条例》规定，网络服务提供者通过未成年人私密信息发现未成年人 可能遭受侵害的，应当立即采取必要措施保存有关记录，并向_____报告。（  ）","type":"1","value":"D","id":"746","anw":"公安机关"}
,
{"name":"据《未成年人网络保护条例》规定，个人信息处理者对其工作人员应当以____为原则，严 格设定信息访问权限，控制未成年人个人信息知悉范围。（  ）","type":"1","value":"A","id":"747","anw":"最小授权"}
,
{"name":"据《未成年人网络保护条例》规定，任何组织和个人不得（  ）含有宣扬淫秽、色情、暴力、 邪教、迷信、赌博、引诱自残自杀、恐怖主义、分裂主义、极端主义等危害未成年人身心健康内容 的网络信息。（  ） ①制作②复制③发布④传播","type":"1","value":"D","id":"748","anw":"①②③④"}
,
{"name":"未成年人网络保护条例》中规定了对未成年人个人信息的保护，网络服务提供者以下哪种行 为是尽到了法律义务？（  ）","type":"1","value":"D","id":"749","anw":"通过未成年人私密信息发现未成年人可能遭受侵害的，立即采取必要措施保存有关记录，并向公 安机关报告。"}
,
{"name":"据《未成年人网络保护条例》要求，网络游戏、网络直播、网络音视频、网络社交等网络 服务提供者实施以下哪种行为是正确的？（  ）","type":"1","value":"D","id":"750","anw":"设置为灾区献爱心的话题，有未成年人自愿参与的"}
,
{"name":"未成年人网络保护条例》中规定，任何组织和个人不得通过网络以文字、图片、音视频等形 式，对未成年人实施侮辱、诽谤、威胁或者恶意损害形象等____行为。（  ）","type":"1","value":"A","id":"751","anw":"网络欺凌"}
,
{"name":"未成年人网络保护条例》规定，国务院教育部门应当将网络素养教育纳入学校素质教育内容， 并会同国家网信部门制定______。（  ）","type":"1","value":"C","id":"752","anw":"未成年人网络素养测评指标"}
,
{"name":"未成年人网络保护条例》规定，网络相关行业组织应当加强行业自律，制定未成年人网络保 护相关行业规范，____会员履行未成年人网络保护义务，加强对未成年人的网络保护。（  ）","type":"1","value":"A","id":"753","anw":"指导"}
,
{"name":"列选项中，哪个主体不涉及接受未成年人网络保护工作的监督检查？（  ）","type":"1","value":"D","id":"754","anw":"网络服务人员"}
,
{"name":"未成年人网络保护条例》规定，学校、家庭应当教育引导未成年人参加有益身心健康的活动，科学、文明、安全、合理使用网络，____和____未成年人沉迷网络。（  ）","type":"1","value":"A","id":"755","anw":"预防；干预"}
,
{"name":"未成年人网络保护条例》规定，_____负责统筹协调未成年人网络保护工作，并依据职责做好 未成年人网络保护工作。（  ）","type":"1","value":"B","id":"756","anw":"国家网信部门"}
,
{"name":"未成年人网络保护条例》规定，未成年人网络保护工作应当坚持以什么为原则来实现社会共 治？（  ）","type":"1","value":"C","id":"757","anw":"最有利于未成年人原则"}
,
{"name":"于学校国防教育，下列说法错误的是哪一项？（  ）","type":"1","value":"C","id":"758","anw":"地方人民政府民政部门和驻地军事机关应当加强对学生军事训练工作的组织、指导和监督。"}
,
{"name":"于社会国防教育，下列说法错误的是哪一项？（  ）","type":"1","value":"B","id":"759","anw":"居民委员会、村民委员会应当有偿聘请退役军人协助开展国防教育。"}
,
{"name":"反《国防教育法》规定，侵占、挪用、克扣国防教育经费或者企业事业组织、社会组织、 个人资助的国防教育财产的，由有关主管部门责令限期归还；对______依法给予处分。（  ）","type":"1","value":"A","id":"760","anw":"负有责任的领导人员和直接责任人员"}
,
{"name":"了加强国防教育师资队伍建设，国防教育教员应当从热爱国防教育事业、具有扎实的国防 理论、知识和必要的军事技能的人员中选拔，同等条件下优先招录、招聘______。（  ）","type":"1","value":"B","id":"761","anw":"退役军人"}
,
{"name":"级人民政府应当加强对具有国防教育意义的文物的____、登记和保护工作。（  ）","type":"1","value":"A","id":"762","anw":"调查"}
,
{"name":"雄烈士纪念设施、革命旧址和其他具有国防教育功能的博物馆、纪念馆、科技馆、文化馆、 青少年宫等场所，应当为公民接受国防教育提供便利，对有组织的国防教育活动实行______。（  ）","type":"1","value":"C","id":"763","anw":"免费或者优惠"}
,
{"name":"国防教育法》规定，民兵国防教育，应当以______为重点，建立和完善制度，保证受教育的 人员、教育时间和教育内容的落实。（  ）","type":"1","value":"A","id":"764","anw":"基干民兵和担任领导职务的民兵"}
,
{"name":"国防教育法》规定，______可以组织学生开展以国防教育为主题的少年军校活动。（  ）","type":"1","value":"C","id":"765","anw":"小学和初级中学"}
,
{"name":"国防教育法》规定，中国人民解放军、中国人民武装警察部队按照______的有关规定开展国 防教育。（  ）","type":"1","value":"C","id":"766","anw":"中央军事委员会"}
,
{"name":"据《国防教育法》，下列关于国防教育的说法哪一项是错误的？（  ）","type":"1","value":"C","id":"767","anw":"接受国防教育是中华人民共和国公民的一项义务而非权利。"}
,
{"name":"防教育贯彻全民参与、长期坚持、讲求实效的方针，实行______、______、______相结合的 原则，针对不同对象确定相应的教育内容分类组织实施。（  ）","type":"1","value":"B","id":"768","anw":"经常教育与集中教育相结合；普及教育与重点教育相结合；理论教育与行为教育"}
,
{"name":"国防教育法》规定，中央全民国防教育主管部门负责全国国防教育工作的指导、监督和 ______。（  ）","type":"1","value":"A","id":"769","anw":"统筹协调  B. 具体实施  C. 经费保障  D. 总体指挥"}
,
{"name":"据《国防教育法》第二条，我国在全体公民中开展的国防教育以什么为目的？（  ）","type":"1","value":"D","id":"770","anw":"履行国防义务"}
,
{"name":"环境保护法》规定，对超过国家重点污染物排放总量控制指标或者未完成国家确定的环境质 量目标的地区，省级以上人民政府环境保护主管部门应当_____其新增重点污染物排放总量的建设项目环境影响评价文件。（  ）","type":"1","value":"B","id":"771","anw":"暂停审批"}
,
{"name":"环境保护法》规定，有关地方人民政府应当落实生态保护补偿资金，确保其用于生态保护补 偿。政府在指导收益地区和生态保护区人民政府进行生态保护补偿过程中，采取什么样的方式？（","type":"1","value":"A","id":"772","anw":"协商或者按照市场规则"}
,
{"name":"市发生了一起重大环境污染事故，造成了严重的生态破坏和居民健康问题。市政府在事故 发生后采取了紧急措施进行处置。下列哪项是县政府在处理该重大环境污染事故时哪一做法是错误 的？（  ）","type":"1","value":"B","id":"773","anw":"该市政府在事故发生后应立即向公众通报事故情况"}
,
{"name":"家实行环境保护目标责任制和考核评价制度，下列哪项描述是正确的？（  ）","type":"1","value":"C","id":"774","anw":"环境保护目标完成情况应纳入对本级人民政府负有环境保护监督管理职责的部门及其负责人和下 级人民政府及其负责人的考核内容"}
,
{"name":"环境保护法》规定，地方各级人民政府应当采取措施，组织对生活废弃物的分类处置和_____。 （  ）","type":"1","value":"C","id":"775","anw":"回收利用"}
,
{"name":"级以上人民政府环境保护主管部门及其委托的环境监察机构和其他负有环境保护监督管理 职责的部门，有权对排放污染物的企业事业单位和其他生产经营者进行____。（  ）","type":"1","value":"B","id":"776","anw":"现场检查"}
,
{"name":"环境保护法》规定，国家建立跨行政区域的重点区域、流域环境污染和生态破坏联合防治协 调机制。以下哪项是这一机制的核心特点？（  ）","type":"1","value":"C","id":"777","anw":"实行统一的规划、标准、监测和防治措施"}
,
{"name":"环境保护法》规定，____以上人民政府应当组织有关部门或者委托专业机构，对环境状况进 行调查、评价，建立环境资源承载能力监测预警机制。（  ）","type":"1","value":"D","id":"778","anw":"省级"}
,
{"name":"环境保护法》规定，国务院环境保护主管部门制定监测规范，会同有关部门组织监测网络， 统一规划国家环境质量监测站（点）的设置，建立______，加强对环境监测的管理。（  ）","type":"1","value":"C","id":"779","anw":"监测数据共享机制"}
,
{"name":"于国家污染物排放标准的说法，下列说法错误的是哪一项？（  ）","type":"1","value":"D","id":"780","anw":"国务院卫生部门根据国家环境质量标准和国家经济、技术条件，制定国家污染物排放标准。"}
,
{"name":"、自治区、直辖市人民政府对国家环境质量标准中未作规定的项目，____制定地方环境质 量标准。（  ）","type":"1","value":"A","id":"781","anw":"可以"}
,
{"name":"级以上地方人民政府环境保护主管部门会同有关部门，根据______的要求，编制本行政区域 的环境保护规划，报同级人民政府批准并公布实施。（  ）","type":"1","value":"B","id":"782","anw":"国家环境保护规划"}
,
{"name":"年的环境日是哪天？（  ）","type":"1","value":"A","id":"783","anw":"6 月 5 日"}
,
{"name":"环境保护法》规定，国务院环境保护主管部门，对全国环境保护工作实施统一监督管理； ____以上地方人民政府环境保护主管部门，对本行政区域环境保护工作实施统一监督管理。（  ）","type":"1","value":"B","id":"784","anw":"县级"}
,
{"name":"列哪项不是《环境保护法》所规定的保护环境需遵守的原则？（  ）","type":"1","value":"D","id":"785","anw":"企业参与"}
,
{"name":"电商公司为了提升流量，在搜索推广中设置竞争对手“甲品牌”的注册商标为关键词，使 消费者误以为其店铺与甲品牌有关。该行为属于____。（  ）","type":"1","value":"C","id":"786","anw":"混淆行为"}
,
{"name":"公司获得一项新型机械的专利授权，乙公司在明知的情况下仍然大量制造、销售该机械。 根据法律规定，乙公司行为的法律后果是____。（  ）","type":"1","value":"B","id":"787","anw":"应承担停止侵权、赔偿损失等民事责任"}
,
{"name":"出版社擅自将网络作者已公开发布的小说结集出版销售，未征得作者同意。根据法律规定， 作者可以主张____。（ ）","type":"1","value":"C","id":"788","anw":"发表权和复制权被侵犯"}
,
{"name":"公司委托甲设计公司为其创作企业 LOGO，双方签订了设计合同，但未对著作权归属作出 约定。根据《民法典》和《著作权法》的规定，该 LOGO 的著作权应当归属（  ）。","type":"1","value":"A","id":"789","anw":"甲设计公司"}
,
{"name":"公司委托甲设计公司为其创作企业 LOGO，双方签订了设计合同，但未对著作权归属作出 约定。根据《民法典》和《著作权法》的规定，该 LOGO 的著作权应当归属（  ）。","type":"1","value":"A","id":"790","anw":"甲设计公司"}
,
{"name":"数据公司未经许可，通过技术接口抓取竞争平台的用户评价数据和交易记录，用于自身产 品推荐算法。根据新法，这一行为属于____。（  ）","type":"1","value":"B","id":"791","anw":"利用数据和算法实施不正当竞争行为"}
,
{"name":"设计师在受雇期间完成一项技术改进，单位为乙公司。若双方无特别约定，则该改进成果 的专利权归属应为____。（  ）","type":"1","value":"B","id":"792","anw":"乙公司所有"}
,
{"name":"企业注册了“雪原”商标，并长期用于乳制品。另一企业后注册了“雪源”商标，用于同 类产品，造成市场混淆。该行为属于____。（ ）","type":"1","value":"C","id":"793","anw":"侵犯注册商标专用权"}
,
{"name":"民法典》规定，知识产权是民事主体依法享有的____。（  ）","type":"1","value":"A","id":"794","anw":"对特定智力成果依法享有的专有权利"}
,
{"name":"频网站未经许可，将某电视台播出的热门电视剧节目实时转播到网络平台，并供用户在线 观看。该电视台发现后提出异议，要求网站立即停止转播并赔偿损失。根据《著作权法》第四十七 条的规定，下列说法正确的是____。（  ）","type":"1","value":"B","id":"795","anw":"网站行为侵权，因为未经许可通过信息网络向公众传播广播电视节目"}
,
{"name":"到 96110 来电，以下做法正确的是？（  ）","type":"1","value":"B","id":"796","anw":"这是全国电信诈骗劝阻专线，听听警方提醒"}
,
{"name":"某通过电商平台购买了物品。下单成功后收到一条陌生短信，短信称其未购买成功，需要 扫码填写银行账户、密码、验证码进行退款。以下错误的是？（  ）","type":"1","value":"A","id":"797","anw":"扫码填写信息，快速退款"}
,
{"name":"张在某非官方游戏网站上看上一套游戏装备，价格比官网便宜一大半，小张以下选择哪个 正确？（  ）","type":"1","value":"B","id":"798","anw":"这个网站不可靠，很有可能是诈骗"}
,
{"name":"某接到电话，对方自称其是公安民警，说他的银行账号与一宗洗黑钱案件有关，需要冻结 其银行账号，现在要求蒋某配合调查，需要其将银行卡的钱打入国家的指定账号保管，同时不能告 诉家人朋友。蒋某怎么做才正确？（  ）","type":"1","value":"C","id":"799","anw":"打 110 报警，寻求警察帮助"}
,
{"name":"到自称是银行工作人员的电话称帮你提升信用卡额度，下列做法中正确的是（  ）","type":"1","value":"C","id":"800","anw":"挂断电话，自行拨打银行官方电话询问"}
,
{"name":"们常说的“杀猪盘”指的是（  ）","type":"1","value":"D","id":"801","anw":"交友投资类诈骗"}
,
{"name":"王收到一个自称是某领导的微信加好友信息,加上后对方要其打钱给他应急,小王该怎么办? （  ）","type":"1","value":"C","id":"802","anw":"电话联系领导本人，核实真假后再决定"}
,
{"name":"某在网站找工作时，看到一个兼职信息,说是给某网站刷信誉可以赚钱,韩某怎么做才正确？ （  ）","type":"1","value":"C","id":"803","anw":"刷单、刷信誉是诈骗，不能信"}
,
{"name":"上是否能够申请贷款？（  ）","type":"1","value":"C","id":"804","anw":"可以，但要通过正规公司、银行办理"}
,
{"name":"于出租、出借、出售个人银行卡、电话卡的行为，以下哪种想法是正确的？（  ）","type":"1","value":"B","id":"805","anw":"出售的卡可能被不法分子用于违法犯罪。"}
,
{"name":"据《中华人民共和国反有组织犯罪法》规定，对因组织、领导黑社会性质组织被判处刑罚 的人员，设区的市级以上公安机关（ ）决定其自刑罚执行完毕之日起，按照国家有关规定向公安 机关报告个人财产及日常活动。报告期限不超过_____年。（  ）","type":"1","value":"B","id":"806","anw":"可以；5"}
,
{"name":"据《中华人民共和国反有组织犯罪法》规定，因举报、控告和制止有组织犯罪活动，在有 组织犯罪案件中作证，本人或者其近亲属的人身安全面临危险的，公安机关、人民检察院、人民法 院应当按照有关规定，采取保护措施。其中变更被保护人员身份的，由_____批准和组织实施。（  ）","type":"1","value":"D","id":"807","anw":"国务院公安部门"}
,
{"name":"有组织犯罪的罪犯，_____可以依照《中华人民共和国刑法》有关从业禁止的规定，禁止其 从事相关职业，并通报相关行业主管部门。（  ）","type":"1","value":"B","id":"808","anw":"人民法院"}
,
{"name":"安机关核查黑社会性质组织犯罪线索，可以依法对有关涉案财产采取紧急止付或者临时冻 结、临时扣押的紧急措施，期限不得超过_____小时。期限届满或者适用紧急措施的情形消失的，应 当立即解除紧急措施。（  ）","type":"1","value":"D","id":"809","anw":"四十八"}
,
{"name":"中华人民共和国反有组织犯罪法》于_____开始施行。（  ）","type":"1","value":"A","id":"810","anw":"2022 年 5 月 1 日"}
,
{"name":"法拘禁他人使用暴力致人死亡的，以论处。（  ）","type":"1","value":"D","id":"811","anw":"以故意杀人罪论处"}
,
{"name":"据《中华人民共和国反有组织犯罪法》第八条、第五十一条，_____发现有组织犯罪活动、 国家工作人员参与有组织犯罪行为，有权向监察机关、人民检察院、公安机关等部门报案、控告、 举报。（  ）","type":"1","value":"A","id":"812","anw":"任何单位和个人"}
,
{"name":"列_____罪不是九类涉恶案件中的常见罪名。（  ）","type":"1","value":"B","id":"813","anw":"诈骗"}
,
{"name":"查明确实与案件无关的财物，应当在_____以内解除查封、扣押、冻结， 予以退还。（  ）","type":"1","value":"C","id":"814","anw":"三日内"}
,
{"name":"社会性质组织犯罪案件的犯罪嫌疑人、被告人逃匿，在通缉 后不能到案，或者犯罪嫌 疑人、被告人死亡，依照《中华人民共和国刑法》规定应当追缴其违法所得及其他涉案财产的，依 照《中华人民共和国刑事诉讼法》有关犯罪嫌疑人、被告人逃匿、死亡案件违法所得的没收程序的 规定办理。（  ）","type":"1","value":"B","id":"815","anw":"一年"}
,
{"name":"关科研院校、医疗机构以及其他企业事业单位应当将生物安全法律法规和生物安全知识纳 入教育培训内容，加强学生、从业人员_____的培养。（  ）","type":"1","value":"D","id":"816","anw":"生物安全意识和伦理意识"}
,
{"name":"家对公共通信和信息服务、能源、交通、水利、金融、公共服务、电子政务等重要行业和 领域，以及其他一旦遭到破坏、丧失功能或者数据泄露，可能严重危害国家安全、国计民生、公共利益的关键信息基础设施，在网络安全等级保护制度的基础上，实行_____。（  ）","type":"1","value":"B","id":"817","anw":"重点保护"}
,
{"name":"家安全机关因反间谍工作需要，根据国家有关规定，可以提请海关、边防等检查机关对有 关人员和资料、器材_____。有关检查机关应当予以协助。（  ）","type":"1","value":"A","id":"818","anw":"免检"}
,
{"name":"国家情报工作机构职权描述正确的是（  ）。","type":"1","value":"C","id":"819","anw":"根据需要，依法使用必要的方式、手段和渠道，在境内外开展情报工作"}
,
{"name":"交水稻技术是我国 1979－1985 年间的 1089 项发明奖中唯一的特等奖，处于世界领先地 位。但是由于此后在各种公开的报刊杂志上发表了 50 余篇有关这项成果的论文，导致该项技术成 果泄密，同时，使我国也失去了申请专利的条件。造成该项技术失密、泄密的原因是（  ）。","type":"1","value":"B","id":"820","anw":"违反保密制度，在不合适的场所随意公开内部秘密"}
,
{"name":"家安全危机事件发生后，履行国家安全危机管控职责的有关机关，应当按照规定准确、及 时报告，并依法将有关国家安全危机事件发生、发展、管控处置及善后情况_____。（  ）","type":"1","value":"B","id":"821","anw":"统一向社会发布"}
,
{"name":"家生物安全工作协调机制设立_____，为国家生物安全战略研究、政策制定及实施提供决策 咨询。（  ）","type":"1","value":"D","id":"822","anw":"专家委员会"}
,
{"name":"网络安全法》规定，网络运营者应当制定____，及时处置系统漏洞、计算机病毒、网络攻击、 网络侵入等安全风险。（  ）","type":"1","value":"A","id":"823","anw":"网络安全事件应急预案"}
,
{"name":"民和组织支持、协助国家安全工作的行为受法律保护。因支持、协助国家安全工作，本人 或者其近亲属的人身安全面临危险的，可以向_____请求予以保护。（ ）","type":"1","value":"C","id":"824","anw":"公安机关、国家安全机关"}
,
{"name":"家决定进入紧急状态、战争状态或者实施国防动员后，履行国家安全危机管控职责的有关 机关依照法律规定或者_____规定，有权采取限制公民和组织权利、增加公民和组织义务的特别措施。 （  ）","type":"1","value":"D","id":"825","anw":"全国人民代表大会常务委员会"}
,
{"name":"据《中华人民共和国核安全法》规定，核设施_____单位对核安全负全面责任。为核设施营 运单位提供设备、工程以及服务等的单位，应当负相应责任。（  ）","type":"1","value":"A","id":"826","anw":"营运"}
,
{"name":"据《中华人民共和国生物安全法》规定，生物安全是国家安全的重要组成部分。维护生物 安全应当贯彻_____，统筹发展和安全，坚持以人为本、风险预防、分类管理、协同配合的原则。（  ）","type":"1","value":"B","id":"827","anw":"总体国家安全观"}
,
{"name":"列哪项不属于《国家安全法》明确规定的情报信息在报送时的要求？（  ）","type":"1","value":"D","id":"828","anw":"全面"}
,
{"name":"央政治局审议《国家安全战略（2021--2025）》时指出，要加强国家安全意识教育，自觉 推进_____深度融合。（ ）","type":"1","value":"C","id":"829","anw":"发展和安全"}
,
{"name":"书记指出，我们面临的重大风险，既包括国内的经济、政治,意识形态、社会风险以及_____ 的风险，也包括国际经济、政治、军事风险等。（  ）","type":"1","value":"B","id":"830","anw":"来自自然界"}
,
{"name":"据《中华人民共和国反恐怖主义法》规定，网信、电信、公安、国家安全等主管部门发现 某单位网站信息中含有恐怖主义、极端主义内容的信息，应当按照职责分工，及时对该单位采取一 定措施，进行处理。以下措施不符合法律规定的是哪一项？（  ）","type":"1","value":"C","id":"831","anw":"没收该单位所有互联网服务器，停止互联网接入服务"}
,
{"name":"国家安全法》规定，机关、团体和其他组织应当对本单位的人员进行_____教育。（ ）","type":"1","value":"B","id":"832","anw":"维护国家安全教育"}
,
{"name":"护国家主权、统一和领土完整是_____的共同义务。（  ）","type":"1","value":"D","id":"833","anw":"包括港澳同胞和台湾同胞在内的全中国人民"}
,
{"name":"关、单位应当____ 审核所确定的国家秘密。（  ）","type":"1","value":"C","id":"834","anw":"每年"}
,
{"name":"家秘密的知悉范围以外的人员，因工作需要知悉国家秘密的，应当经过____ 批准。（  ）","type":"1","value":"B","id":"835","anw":"机关、单位主要责任人或者其指定的人员"}
,
{"name":"家秘密的保密期限，除另有规定外，绝密级不超过三十年，机密级不超过____ 年，秘密级 不超过十年。（  ）","type":"1","value":"C","id":"836","anw":"二十"}
,
{"name":"关、单位执行上级确定的国家秘密事项或者办理其他机关、单位确定的国家秘密事项，需 要____ 的，应当根据所执行、办理的国家秘密事项的密级确定。（  ）","type":"1","value":"B","id":"837","anw":"派生定密"}
,
{"name":"关、单位确定、变更和解除本机关、本单位的国家秘密，应当由____ 提出具体意见，经定 密责任人审核批准。（  ）","type":"1","value":"C","id":"838","anw":"具体承办人"}
,
{"name":"关、单位____ 为定密责任人，负责本机关、本单位的国家秘密确定、变更和解除工作。（ ）","type":"1","value":"C","id":"839","anw":"主要负责人及其指定的人员"}
,
{"name":"家秘密及其密级的具体范围（以下简称保密事项范围），由____ 规定。（  ）","type":"1","value":"B","id":"840","anw":"国家保密行政管理部门单独或者会同有关中央国家机关"}
,
{"name":"家秘密的密级分为（）三级。（  ）","type":"1","value":"C","id":"841","anw":"绝密、机密、秘密"}
,
{"name":"在保守、保护国家秘密工作中做出突出贡献的组织和个人，按照国家有关规定给予____ 。","type":"1","value":"C","id":"842","anw":"表彰和奖励"}
,
{"name":"级以上____ 应当将保密工作纳入本级国民经济和社会发展规划，所需经费列入本级预算。 （  ）","type":"1","value":"B","id":"843","anw":"人民政府"}
,
{"name":"家鼓励和支持保密科学技术研究和应用，提升自主创新能力，依法保护____ 的知识产权。 （  ）","type":"1","value":"A","id":"844","anw":"保密领域"}
,
{"name":"家采取多种形式加强保密宣传教育，将保密教育纳入国民教育体系和____，鼓励大众传播 媒介面向社会进行保密宣传教育，普及保密知识，宣传保密法治，增强全社会的保密意识。（  ）","type":"1","value":"A","id":"845","anw":"公务员教育培训体系"}
,
{"name":"关、单位应当实行保密工作责任制，依法设置保密工作机构或者指定____ ，健全保密管理 制度，完善保密防护措施，开展保密宣传教育，加强保密监督检查。（  ）","type":"1","value":"A","id":"846","anw":"专人负责保密工作"}
,
{"name":"何危害国家秘密安全的行为，都必须受到____ 追究。（  ）","type":"1","value":"B","id":"847","anw":"法律"}
,
{"name":"切____ 、各政党和各人民团体、企业事业组织和其他社会组织以及公民都有保密的义务。 （  ）","type":"1","value":"B","id":"848","anw":"国家机关和武装力量"}
,
{"name":"___ 规定公开的事项，应当依法公开。（  ）","type":"1","value":"A","id":"849","anw":"法律、行政法规"}
,
{"name":"密工作坚持总体国家安全观，遵循____，积极防范、突出重点，技管并重、创新发展的原 则，既确保国家秘密安全，又便利信息资源合理利用（  ）","type":"1","value":"A","id":"850","anw":"党管保密、依法管理"}
,
{"name":"家秘密是关系国家安全和____，依照法定程序确定，在一定时间内只限一定范围的人员知 悉的事项。（  ）","type":"1","value":"B","id":"851","anw":"利益"}
,
{"name":"了保守____，维护国家安全和利益，保障改革开放和社会主义现代化建设事业的顺利进行， 根据宪法，制定本法。（  ）","type":"1","value":"A","id":"852","anw":"国家秘密"}
,
{"name":"中华人民共和国保守国家秘密法》是由中华人民共和国第十四届全国人民代表大会常务委员 会第八次会议于____修订通过。（  ）","type":"1","value":"C","id":"853","anw":"2024 年 2 月 27 日"}
,
{"name":"食品安全法》规定，食品生产经营者应建立从原料采购到产品销售的可追溯制度。这一制度 的直接目的在于____。（  ）","type":"1","value":"B","id":"854","anw":"便于发现和追查问题食品来源"}
,
{"name":"超市销售超过保质期的熟肉制品。根据《食品安全法》，该行为的法律后果是____。（  ）","type":"1","value":"D","id":"855","anw":"处货值金额十倍以上二十倍以下罚款"}
,
{"name":"据 2025 年修正案，修正的《食品安全法》自_____起施行。（  ）","type":"1","value":"C","id":"856","anw":"2025 年 12 月 1 日"}
,
{"name":"食品安全法》中，货值金额不足一万元的违法食品经营行为，处罚标准是____。（ ）","type":"1","value":"B","id":"857","anw":"五万元以上十万元以下罚款"}
,
{"name":"食品安全法》中，运输企业伪造重点液态食品运输记录、清洗凭证，并拒不改正的，可处 ____。（  ）","type":"1","value":"C","id":"858","anw":"一万元以上十万元以下罚款"}
,
{"name":"食品安全法》要求，食品安全监督管理实行“最严格的监管制度”，下列哪一做法最能体现 这一要求？（  ）","type":"1","value":"C","id":"859","anw":"建立食品安全追溯与退出制度"}
,
{"name":"市突发食源性疾病事件，政府成立联合调查组。根据食品安全法，事故调查应遵循___。（ ）","type":"1","value":"D","id":"860","anw":"统一领导、分级负责、属地管理原则"}
,
{"name":"品生产经营者在召回不符合安全标准的食品后，应如何处理召回食品？（  ）","type":"1","value":"A","id":"861","anw":"采取无害化处理、销毁或防止再次流入市场"}
,
{"name":"食品安全法》2025 年修正后，关于“婴幼儿配方液态乳”的管理，下列说法正确的是____。 （  ）","type":"1","value":"B","id":"862","anw":"纳入注册管理，与配方乳粉相同"}
,
{"name":"企业生产的预包装食品在保质期内因储存不当变质，造成消费者食物中毒。该企业应承担 的责任是____。（  ）","type":"1","value":"C","id":"863","anw":"承担赔偿及行政乃至刑事责任"}
,
{"name":"列哪一情形不属于《食品安全法》第十八条规定的应当进行食品安全风险评估的情形？（  ）","type":"1","value":"C","id":"864","anw":"食品企业申请生产许可的"}
,
{"name":"运输公司未取得“重点液态食品准运证”而擅自运输散装食用油，市场监管部门依法查处。 根据《食品安全法》修正后的规定，该公司应____。（  ）","type":"1","value":"D","id":"865","anw":"责令停止业务、没收违法所得并处罚款"}
,
{"name":"生产经营者发现其生产经营的食品不符合食品安全标准的，应当____。（  ）","type":"1","value":"A","id":"866","anw":"立即停止经营，召回食品并报告监管部门"}
,
{"name":"家对重点液态食品的道路散装运输实行许可制度。下列哪项不符合许可要求？（  ）","type":"1","value":"B","id":"867","anw":"发货方仅需备案，无需查验"}
,
{"name":"公司在未取得生产许可的情况下擅自生产乳制品，并在网络平台销售。根据食品安全法， 应由____依法查处。（ ）","type":"1","value":"C","id":"868","anw":"县级以上市场监督管理部门"}
,
{"name":"品经营者采购食品时应当查验供货者的许可证和食品合格证明文件，并建立查验记录制度。 这一制度的主要目的是____。（  ）","type":"1","value":"D","id":"869","anw":"保证食品来源可追溯"}
,
{"name":"食品安全法》确规定，国家食品安全工作实行“全程控制”，下列哪一选项最能体现这一原 则？（  ）","type":"1","value":"A","id":"870","anw":"对食品从农田到餐桌的全过程实施监管"}
,
{"name":"食品企业在产品外包装上标注“具有调节血糖功能”，但该食品并未经过保健食品注册或 备案。根据食品安全法的规定，该企业行为属于____。（ ）","type":"1","value":"C","id":"871","anw":"违反食品安全法，发布虚假食品广告"}
,
{"name":"据《突发公共卫生事件应对法》，在突发公共卫生事件导致停工、停业期间，用人单位应当 （  ）。","type":"1","value":"C","id":"872","anw":"按规定支付劳动者工资、发放生活费"}
,
{"name":"突发公共卫生事件医疗救治紧急需要，医师可以按照国家统一制定的________，在一定范围 和期限内采用药品说明书中未明确的用法进行救治。（  ）","type":"1","value":"C","id":"873","anw":"诊疗方案"}
,
{"name":"疗卫生机构发现发生或者可能发生突发公共卫生事件时，应当于________内通过网络直报系 统进行报告。（  ）","type":"1","value":"B","id":"874","anw":"两小时"}
,
{"name":"病预防控制机构发现发生突发公共卫生事件时，应当在向同级卫生健康主管部门报告的同 时，提出________的建议。（  ）","type":"1","value":"A","id":"875","anw":"启动应急响应  B. 启动物资调拨  C. 启动隔离措施  D. 启动信息发布"}
,
{"name":"突发公共卫生事件应对法》规定，突发公共卫生事件应急医疗救治网络的组成包括__。（  ）","type":"1","value":"B","id":"876","anw":"定点救治医院、其他医院、基层医疗卫生机构、院前急救机构、临时性救治场所和血站"}
,
{"name":"级以上地方人民政府制定本行政区域突发公共卫生事件应急预案后，应当按照国家有关规 定____。（  ）","type":"1","value":"B","id":"877","anw":"报送备案"}
,
{"name":"突发公共卫生事件应对中，收集、使用个人信息的，应当遵循________原则，并采取必要措 施确保个人信息安全。（  ）","type":"1","value":"C","id":"878","anw":"合法、正当、必要和诚信"}
,
{"name":"家建立应对突发公共卫生事件的________机制，组织动员单位和个人依法有序参与突发公共 卫生事件应对工作。(  )","type":"1","value":"C","id":"879","anw":"社会动员"}
,
{"name":"发公共卫生事件应对工作实行_____负责制。（  ）","type":"1","value":"C","id":"880","anw":"分级负责、属地管理"}
,
{"name":"据《突发公共卫生事件应对法》，突发公共卫生事件的应对坚持的原则是____。（ ）","type":"1","value":"B","id":"881","anw":"依法应对、科学应对"}
,
{"name":"据《突发公共卫生事件应对法》，突发公共卫生事件是指____。（  ）","type":"1","value":"C","id":"882","anw":"突然发生、造成公众生命安全和健康严重损害的事件"}
,
{"name":"某被公司解除劳动合同后申请劳动仲裁，对仲裁裁决不服。根据《劳动法》，张某可以____。 （  ）","type":"1","value":"C","id":"883","anw":"自收到裁决书之日起 15 日内向人民法院起诉"}
,
{"name":"某被用人单位无故拖欠工资两个月，遂向劳动保障监察机构举报。根据《劳动法》，劳动行 政部门应当____。（  ）","type":"1","value":"B","id":"884","anw":"责令限期支付工资"}
,
{"name":"某在工作中因设备故障受伤，经认定为工伤。根据《劳动法》，王某应当享有的权利是_____。 （  ）","type":"1","value":"C","id":"885","anw":"获得工伤保险待遇"}
,
{"name":"劳动法》规定，女职工在孕期、产期、哺乳期内，用人单位____。（  ）","type":"1","value":"A","id":"886","anw":"不得解除劳动合同"}
,
{"name":"劳动法》规定，劳动者在下列情形之一的，用人单位不得解除劳动合同的是____。（  ）","type":"1","value":"D","id":"887","anw":"患病或负伤，在规定的医疗期内"}
,
{"name":"劳动法》规定，用人单位安排劳动者延长工作时间，每月不得超过____。（  ）","type":"1","value":"C","id":"888","anw":"36 小时"}
,
{"name":"劳动法》规定，劳动者在试用期的工资不得低于本单位相同岗位最低档工资或者劳动合同约 定工资的____。（  ）","type":"1","value":"B","id":"889","anw":"80%"}
,
{"name":"生产特点不能实行标准工时制度的，用人单位应当____。（ ）","type":"1","value":"C","id":"890","anw":"报劳动行政部门批准实行其他工时制度"}
,
{"name":"劳动法》规定，劳动者每日工作时间不超过____。（  ）","type":"1","value":"B","id":"891","anw":"8 小时"}
,
{"name":"动合同中约定的劳动报酬，不得低于____。（  ）","type":"1","value":"D","id":"892","anw":"当地最低工资标准"}
,
{"name":"业长期让职工在粉尘严重的环境下工作，未采取防护措施，导致多名职工患病。根据《劳 动法》，企业应承担的责任是____。（  ）","type":"1","value":"B","id":"893","anw":"赔偿损失并承担安全生产责任"}
,
{"name":"据《劳动法》，用人单位自用工之日起，应当与劳动者_____。（  ）","type":"1","value":"A","id":"894","anw":"建立劳动关系并签订劳动合同"}
,
{"name":"劳动法》规定，劳动法调整的对象是____。（  ）","type":"1","value":"C","id":"895","anw":"劳动者与用人单位之间的劳动关系"}
,
{"name":"某购买家电时，经营者隐瞒了存在安全隐患，导致使用中受伤。陈某的维权依据是民法典 中的_____。（  ）","type":"1","value":"B","id":"896","anw":"产品责任制度"}
,
{"name":"某在阳台晾晒衣物，水滴落到楼下李某阳台，李某多次交涉未果后起诉。此案应适用民法 典中的____。（  ）","type":"1","value":"A","id":"897","anw":"邻里关系调整制度"}
,
{"name":"民法典》规定，诉讼时效期间一般为____。（  ）","type":"1","value":"D","id":"898","anw":"三年"}
,
{"name":"某委托律师王某代为签订房屋买卖合同。王某未经赵某同意，私自变更价格。根据民法典， 王某的行为属于_____。（  ）","type":"1","value":"D","id":"899","anw":"超越代理权的行为"}
,
{"name":"住权在民法典中属于_____。（  ）","type":"1","value":"C","id":"900","anw":"用益物权"}
,
{"name":"某借给李某 10 万元，约定一年后偿还。李某到期未还被起诉。法院判决李某还款后，张某 拒绝收款。根据民法典，李某可以_____。（ ）","type":"1","value":"B","id":"901","anw":"将款项提存于有关部门"}
,
{"name":"民法典》规定，善意取得制度的成立前提是_____。（  ）","type":"1","value":"B","id":"902","anw":"受让人不知道也不应当知道出让人无处分权"}
,
{"name":"列哪一项不属于民事权利的基本类型？（  ）","type":"1","value":"C","id":"903","anw":"政治权利"}
,
{"name":"某因交通事故昏迷两年后死亡，其配偶王某要求确认昏迷期间的工资应计入遗产。根据民 法典，李某的民事权利能力_____。（  ）","type":"1","value":"C","id":"904","anw":"自死亡时终止"}
,
{"name":"民法典》规定，监护人应当履行监护职责，需要维护被监护人的权益中，错误的是___。（ ）","type":"1","value":"A","id":"905","anw":"一切权益"}
,
{"name":"民法典》规定，八周岁以上的未成年人属于_____。（  ）","type":"1","value":"B","id":"906","anw":"限制民事行为能力人"}
,
{"name":"民法典》规定，自然人的民事权利能力自____开始。（  ）","type":"1","value":"A","id":"907","anw":"出生时"}
,
{"name":"民法典》规定，民事主体从事民事活动，应当遵循____。（ ）","type":"1","value":"B","id":"908","anw":"自愿、公平、诚信原则"}
,
{"name":"民法典》规定，民法调整的对象是____。（  ）","type":"1","value":"C","id":"909","anw":"平等主体之间的人身关系和财产关系"}
,
{"name":"中华人民共和国宪法》规定，全国人大代表受原选举单位和选民____。（  ）","type":"1","value":"B","id":"910","anw":"监督"}
,
{"name":"中华人民共和国宪法》第十三条规定，公民的合法的私有财产____。（  ）","type":"1","value":"B","id":"911","anw":"不受侵犯，国家依法保护"}
,
{"name":"中华人民共和国宪法》规定，中华人民共和国的根本政治制度是____。（  ）","type":"1","value":"A","id":"912","anw":"人民代表大会制度"}
,
{"name":"据《中华人民共和国宪法》规定，国务院是____。（  ）","type":"1","value":"A","id":"913","anw":"国家最高行政机关"}
,
{"name":"据《中华人民共和国宪法》规定，全国人民代表大会常务委员会的委员长连续任职不得超 过____。（  ）","type":"1","value":"B","id":"914","anw":"两届"}
,
{"name":"中华人民共和国宪法》规定，国家坚持以人民为中心的发展思想，这一表述与宪法中哪一原 则密切相关？（  ）","type":"1","value":"C","id":"915","anw":"人民主权原则"}
,
{"name":"中华人民共和国宪法》规定，中华人民共和国的武装力量由________领导。（ ）","type":"1","value":"C","id":"916","anw":"中华人民共和国中央军事委员会"}
,
{"name":"中华人民共和国宪法》规定，国家尊重和保障人权，这一条款最早是（  ）写入宪法的。","type":"1","value":"D","id":"917","anw":"2004 年"}
,
{"name":"中华人民共和国宪法》规定，中华人民共和国公民有维护国家统一和全国各民族团结的（  ）。","type":"1","value":"C","id":"918","anw":"义务"}
,
{"name":"据宪法规定，国家监察委员会是（  ）。","type":"1","value":"D","id":"919","anw":"监察机关"}
,
{"name":"据《中华人民共和国宪法》规定，中华人民共和国的一切权力属于（  ）。","type":"1","value":"C","id":"920","anw":"人民"}
,
{"name":"018 年宪法修正案将“国家工作人员就职时应当依照法律规定公开进行宪法宣誓”写入宪法， 其根本目的在于（  ）。","type":"1","value":"B","id":"921","anw":"提高宪法实施的权威与公信力"}
,
{"name":"据《中华人民共和国宪法》规定，我国的最高国家权力机关是_____。（  ）","type":"1","value":"B","id":"922","anw":"全国人民代表大会"}
,
{"name":"018 年宪法修正案在国家机构方面作出的重要修改之一是____。（  ）","type":"1","value":"B","id":"923","anw":"设立国家监察委员会"}
,
{"name":"据《中华人民共和国宪法》规定，中国共产党领导是中国特色社会主义最本质的特征，这 一表述首次被写入宪法是在_____。（  ）","type":"1","value":"D","id":"924","anw":"2018 年宪法修正案"}
,
{"name":"据《中华人民共和国宪法》，我国的国家性质是____。（  ）","type":"1","value":"B","id":"925","anw":"工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家"}
,
{"name":"员受到开除党籍处分，_____内不得重新入党，也不得推荐担任与其原任职务相当或者高于 其原任职务的党外职务。（  ）","type":"1","value":"D","id":"926","anw":"五年"}
,
{"name":"党察看期限最长不得超过_____。（ ）","type":"1","value":"B","id":"927","anw":"两年"}
,
{"name":"员受留党察看处分期间，没有_____。（  ）","type":"1","value":"A","id":"928","anw":"表决权、选举权和被选举权"}
,
{"name":"于违犯党纪的党组织，上级党组织应当责令其作出书面检查或者给予通报批评。对于严重违犯党纪、本身又不能纠正的党组织，上一级党的委员会在查明核实后，根据情节严重的程度，可 以予以：（  ） ①重组 ②改组  ③解散  ④遣散","type":"1","value":"D","id":"929","anw":"②③"}
,
{"name":"法院副院长李某（中共党员）为当地一公司在该院的民事案件向主审法官说情打招呼，按 照新修订《中国共产党纪律处分条例》相关规定，李某的行为违反了_____。（  ）","type":"1","value":"A","id":"930","anw":"工作纪律"}
,
{"name":"共党员、某镇民政所所长马某某，在发放救灾物资时，给其弟弟多发五袋大米和三桶油。 请问马某某的行为属于违反群众纪律中的哪种情形？（  ）","type":"1","value":"C","id":"931","anw":"优亲厚友"}
,
{"name":"县委原书记谭某为打造所谓县城建设新亮点，脱离实际，不顾财力，在县政府建议暂缓、 部分县委班子成员反对的情况下，强行决定修建历史文化墙项目，将县城主干道上使用不久的路灯换成单价较高的“橘灯”，总耗资上亿元。按照新修订《中国共产党纪律处分条例》相关规定，谭 某的行为违反了_____。（  ）","type":"1","value":"C","id":"932","anw":"政治纪律"}
,
{"name":"和国家机关违反有关规定经商办企业的，对______给予警告或者严重警告处分；情节严重的， 给予撤销党内职务处分。（  ）","type":"1","value":"D","id":"933","anw":"直接责任者和领导责任者"}
,
{"name":"纪处分决定作出后，应当在____向受处分党员所在党的基层组织中的全体党员及其本人宣 布。（  ）","type":"1","value":"A","id":"934","anw":"一个月内"}
,
{"name":"据案件的特殊情况，由____决定或者经____决定并呈报中央纪委批准，对违纪党员也可以在 本条例规定的处分幅度以外减轻处分。（  ）","type":"1","value":"C","id":"935","anw":"中央纪委；省（部）级纪委（不含副省级市纪委）"}
,
{"name":"组织领导机构集体作出____的决定或者实施其他____的行为，对具有共同故意的成员，按 ____处理；对____的成员，按照各自在集体违纪中所起的作用和应负的责任分别给予处分。（  ）","type":"1","value":"B","id":"936","anw":"违犯党纪；违犯党纪；共同违纪；过失违纪"}
,
{"name":"理违犯党纪的党组织和党员，应当实行_____相结合，做到宽严相济。（  ）","type":"1","value":"B","id":"937","anw":"惩戒与教育"}
,
{"name":"党员受到警告处分的，_____内不得在党内提升职务。（  ）","type":"1","value":"A","id":"938","anw":"1 年"}
,
{"name":"到改组处理的党组织领导机构成员，除应受到_____及以上处分的外，均自然免职。（  ）","type":"1","value":"B","id":"939","anw":"撤销党内职务"}
,
{"name":"违纪后下落不明的党员超过_____的，党组织应当按照党章规定对其予以除名。（  ）","type":"1","value":"A","id":"940","anw":"六个月"}
,
{"name":"了维护党的章程和其他党内法规，严肃党的纪律，纯洁党的组织，保障党员民主权利，教 育党员遵纪守法，维护党的团结统一，保证党的路线、方针、政策、决议和国家法律法规的贯彻执 行，根据_____制定《中国共产党纪律处分条例》。（  ）","type":"1","value":"A","id":"941","anw":"《中国共产党章程》"}
,
{"name":"据《中国共产党纪律处分条例》第十七条，不属于可以从轻或者减轻处分的是_____。（  ）","type":"1","value":"D","id":"942","anw":"被动挽回损失、消除不良影响或者有效阻止危害结果发生"}
,
{"name":"员受到警告处分___内、受到严重警告处分___内，不得在党内提拔职务或者进一步使用，也 不得向党外组织推荐担任高于其原任职务的党外职务或者进一步使用。（  ）","type":"1","value":"A","id":"943","anw":"一年，一年半"}
,
{"name":"行党纪处分决定的机关或者受处分党员所在单位，应当在____内将处分决定的执行情况向 作出或者批准处分决定的机关报告。（  ）","type":"1","value":"D","id":"944","anw":"六个月"}
,
{"name":"中国共产党纪律处分条例》规定，党员通过信息网络、报刊、讲座、书籍等方式，公开发表 坚持资产阶级自由化立场、反对四项基本原则，反对党的改革开放决策的文章、演说、宣言、声明 等的，给予____处分。（  ）","type":"1","value":"D","id":"945","anw":"开除党籍"}
,
{"name":"议强调，要在结构优化、动能转换和品质提升过程中，坚持文化传承和赓续城市文脉。具 体体现在哪些方面？（  ）","type":"1","value":"B","id":"946","anw":"保护历史文化遗产，弘扬城市精神和文化自信"}
,
{"name":"议提出，要牢牢守住城市安全底线，提升城市本质安全和韧性水平，具体应做到以下哪一 项？（  ）","type":"1","value":"A","id":"947","anw":"建立完善的城市安全风险全量闭环智控体系，提升风险预防和应急处置能力"}
,
{"name":"议明确，到 2035 年，现代化人民城市基本建成，________基本实现。（  ）","type":"1","value":"C","id":"948","anw":"超大城市治理体系和治理能力现代化"}
,
{"name":"据会议精神，推动城市治理现代化应充分依托哪些技术手段？（  ）","type":"1","value":"B","id":"949","anw":"人工智能、大数据等数智化技术和基础设施"}
,
{"name":"会明确，要坚持以习近平新时代中国特色社会主义思想为指导，深入贯彻党的二十大和二 十届二中、三中全会以及________精神，全面落实习近平总书记关于城市工作的重要论述。（  ）","type":"1","value":"B","id":"950","anw":"中央城市工作会议"}
,
{"name":"会要求，努力打造更多________的标志性成果，以实干实绩实效确保党中央决策部署落地见 效。（  ）","type":"1","value":"C","id":"951","anw":"西部领先、全国进位和重庆辨识度"}
,
{"name":"议强调，建设现代化人民城市必须推动国家治理体系和治理能力现代化。在此过程中，最关键的保障是什么？（  ）","type":"1","value":"B","id":"952","anw":"党建统领，坚持党的全面领导和发挥党的建设的引领作用"}
,
{"name":"议提出构建“创新、宜居、美丽、韧性、文明、智慧”六城建设体系，其中“韧性”城市 建设的核心内涵是什么？（  ）","type":"1","value":"B","id":"953","anw":"城市具备抵御自然灾害、突发事件的能力，实现安全韧性保障"}
,
{"name":"会强调，要迭代完善________体系、工作体系、政策体系和评价体系，提升城市治理能力和 发展水平。（  ）","type":"1","value":"A","id":"954","anw":"目标"}
,
{"name":"会强调，要扎实推动习近平总书记重要指示要求和党中央关于城市工作的重大决策部署落 地见效，建立健全________的闭环机制，确保“总书记有号令、党中央有部署，重庆见行动”。（ ） A. 督查问责机制","type":"1","value":"B","id":"955","anw":"一体贯彻全面落实"}
,
{"name":"议提出党建统领城市治理，构建“141”基层智治体系。这里的“141”主要包括哪几个内 容？（  ）","type":"1","value":"A","id":"956","anw":"1 基层治理指挥中心，4 大功能板块，1 基层网格"}
,
{"name":"议明确指出，到 2027 年，重庆将塑造绿色低碳整体大美的山水都市新风貌。实现这一目 标的关键措施包括？（  ）","type":"1","value":"B","id":"957","anw":"深化全域城市环境治理攻坚，推进绿色低碳生产生活方式 面积"}
,
{"name":"议强调，要着力推动城市更新和数智赋能双轮驱动，提升城市发展服务和治理质效。以下 哪项最能体现城市更新的核心内涵？（  ）","type":"1","value":"B","id":"958","anw":"以提升存量资源利用效率、改善城市功能和环境质量为重点"}
,
{"name":"优化城市空间布局方面，中国共产党重庆市第六届委员会第七次全体会议提出构建“一核 引领、多点支撑、协调发展”的城镇体系，其中“一核”指的主要是什么？（  ）","type":"1","value":"B","id":"959","anw":"城市中心城区作为引领高质量发展的核心"}
,
{"name":"国共产党重庆市第六届委员会第七次全体会议提出，到 2030 年，重庆要成为人工智能时 代具有普遍意义的治理范例，推动治理体系和能力现代化。对此，下列说法正确的是？（  ）","type":"1","value":"B","id":"960","anw":"重庆将引领西部地区现代化核心增长极和动力源"}
,
{"name":"国共产党重庆市第六届委员会第七次全体会议特别强调，要推动超大城市发展服务治理质 效持续提升，提出“双轮驱动”战略，其中之一是数智赋能，另一个是？（  ）","type":"1","value":"B","id":"961","anw":"大综合一体化城市综合治理体制机制创新"}
,
{"name":"国共产党重庆市第六届委员会第七次全体会议提出，要坚持以人民为中心的发展思想，推 进现代化人民城市建设，明确了“六个新”目标体系。以下哪一项不是会议强调的“六个新”目标 之一？（  ）","type":"1","value":"C","id":"962","anw":"以工业化为核心的大规模城市扩张新趋势"}
,
{"name":"国共产党重庆市第六届委员会第七次全体会议在深入学习贯彻习近平总书记关于城市工作 的重要论述基础上，明确指出我国城镇化正经历阶段性变化，当前阶段的主要特征是什么？（  ）","type":"1","value":"B","id":"963","anw":"由快速增长阶段转向稳定发展阶段，重点从增量扩张转为存量提质和效率提升"}
,
{"name":"的二十届三中全会指出，高水平社会主义市场经济体制是中国式现代化的重要保障。必须 更好发挥市场机制作用，创造更加公平、更有活力的市场环境，实现资源配置效率最优化和效益最 大化，既“放得活”又“管得住”。关于高水平社会主义市场经济体制，下列选项中哪一说法是错 误的？（  ）","type":"1","value":"D","id":"964","anw":"限制民营企业牵头承担国家重大技术攻关任务，提高向民营企业进一步开放国家重大科研基础设 施的准入门槛。"}
,
{"name":"的二十届三中全会指出，高质量发展是全面建设社会主义现代化国家的首要任务。必须以 新发展理念引领改革，立足新发展阶段，深化供给侧结构性改革，完善推动高质量发展激励约束机 制，塑造发展新动能新优势。关于完善推动高质量发展，下列说法哪一选项是错误的？（  ）","type":"1","value":"D","id":"965","anw":"减少制造业投入比重，逐步转向完善发展服务业体制机制。"}
,
{"name":"会要求健全全面从严治党体系，以下哪项是全会提出的具体措施？（  ）","type":"1","value":"D","id":"966","anw":"深入推进党风廉政建设和反腐败斗争"}
,
{"name":"于党的创新理论武装，以下哪项是党的二十届三中全会中强调的提高全党能力的措施？（  ）","type":"1","value":"B","id":"967","anw":"抓好党的创新理论武装"}
,
{"name":"应对外部风险挑战方面，党的二十届三中全会提出了以下哪项策略？（  ）","type":"1","value":"C","id":"968","anw":"主动塑造有利外部环境，引领全球治理"}
,
{"name":"的二十届三中全会强调，坚定不移实现全年经济社会发展目标，要按照党中央关于经济工 作的决策部署，落实好宏观政策，积极扩大国内需求，必须以怎样的方式发展新质生产力？（  ）","type":"1","value":"D","id":"969","anw":"因地制宜"}
,
{"name":"的二十届三中全会指出，中国坚定奉行独立自主的和平外交政策，推动构建人类命运共同 体，践行全人类共同价值，这体现了中国式现代化走的是哪条道路？（  ）","type":"1","value":"B","id":"970","anw":"和平发展道路"}
,
{"name":"于“两个确立”“四个意识”“两个维护”和“四个自信”，下列说法哪一项是正确的？ （  ）","type":"1","value":"B","id":"971","anw":"“四个意识”包括政治意识、大局意识、核心意识和看齐意识"}
,
{"name":"于深化国防和军队改革，以下哪项措施是党的二十届三中全会提出的？（  ）","type":"1","value":"B","id":"972","anw":"深化联合作战体系改革"}
,
{"name":"据党的二十届三中全会的内容，下列哪一选项是中国式现代化行稳致远的重要基础。（  ）","type":"1","value":"C","id":"973","anw":"国家安全"}
,
{"name":"下哪项不是党的二十届三中全会强调的全面深化改革的宝贵经验原则？（  ）","type":"1","value":"C","id":"974","anw":"坚持效率优先"}
,
{"name":"的二十届三中全会强调，进一步全面深化改革要贯彻的原则不包括以下哪一项？（  ）","type":"1","value":"B","id":"975","anw":"坚持以经济建设为主线"}
,
{"name":"的二十届三中全会提出，到中华人民共和国成立八十周年时，需要完成的目标是什么？（","type":"1","value":"B","id":"976","anw":"完成本决定提出的改革任务"}
,
{"name":"的二十届三中全会强调了在全面深化改革中要聚焦的七个方面，下列哪一选项不是党的二 十届三中全会强调的聚焦方面？（  ）","type":"1","value":"C","id":"977","anw":"提高国有企业利润"}
,
{"name":"的二十届三中全会提出的到 2035 年的目标中，不包括以下哪项？（  ）","type":"1","value":"D","id":"978","anw":"全面实现国家治理体系和治理能力现代化"}
,
{"name":"的二十届三中全会指出，进一步全面深化改革的总目标是什么？（  ）","type":"1","value":"C","id":"979","anw":"完善和发展中国特色社会主义制度，推进国家治理体系和治理能力现代化"}
,
{"name":"的二十届三中全会强调，进一步全面深化改革，统筹国内国际两个大局，统筹推进“五位 一体”总体布局，协调推进“四个全面”战略布局，要以什么为出发点和落脚点？（  ）","type":"1","value":"A","id":"980","anw":"促进社会公平正义、增进人民福祉"}
,
{"name":"的二十届三中全会强调，进一步全面深化改革，进一步解放和发展社会生产力.激发和增强 社会活力，要以什么为牵引？（  ）","type":"1","value":"D","id":"981","anw":"经济体制改革"}
,
{"name":"的二十届三中全会高度评价新时代以来全面深化改革的成功实践和伟大成就，研究了进一 步全面深化改革.推进中国式现代化问题，认为当前和今后一个时期是以（ ）全面推进强国建设民 族复兴伟业的关键时期。","type":"1","value":"C","id":"982","anw":"中国式现代化"}
,
{"name":"对严峻复杂的国际环境和艰巨繁重的国内改革发展稳定任务，中央政治局认真落实党的二 十大和二十届一中、二中全会精神，完整准确全面贯彻新发展理念，坚持（  ）工作总基调。","type":"1","value":"A","id":"983","anw":"稳中求进"}
,
{"name":"的二十届三中全会强调，面对纷繁复杂的国际国内形势，面对新一轮科技革命和产业变革， 面对人民群众新期待，必须自觉把（  ）摆在更加突出位置。","type":"1","value":"B","id":"984","anw":"改革"}
,
{"name":"的二十届三中全会审议通过的《中共中央关于进一步全面深化改革 推进中国式现代化的决 定》中，强调了哪个精神在党的制度建设改革落实中的重要性？（  ）","type":"1","value":"A","id":"985","anw":"钉钉子精神"}
,
{"name":"近平法治思想中提到，要“推动扫黑除恶常态化，坚决打击黑恶势力及其‘保护伞’”这 反映了法治建设中哪方面的重要目标？（  ）","type":"1","value":"B","id":"986","anw":"维护社会和谐稳定，保障人民安全"}
,
{"name":"近平法治思想中指出，全面依法治国要“统筹推进国内法治和涉外法治”，维护国家主权、 安全和发展利益。结合国际环境，哪项是实现这一目标的重要手段？（  ）","type":"1","value":"B","id":"987","anw":"运用立法、执法、司法手段，有效应对国际挑战和风险"}
,
{"name":"近平法治思想提出，要“积极推进________等重要领域立法”，不断完善中国特色社会主义 法律体系。（  ）","type":"1","value":"B","id":"988","anw":"国家安全、科技创新、公共卫生、生物安全、生态文明"}
,
{"name":"近平法治思想指出，全面依法治国的根本目的是_____。（ ）","type":"1","value":"B","id":"989","anw":"保障人民权益，维护社会公平正义，实现国家长治久安"}
,
{"name":"近平总书记指出，要“坚持建设德才兼备的高素质法治工作队伍”，保障全面依法治国。 结合这一要求，以下哪项举措最符合习近平法治思想？（  ）","type":"1","value":"A","id":"990","anw":"法治工作队伍应忠于党、国家、人民和法律"}
,
{"name":"近平法治思想中提出，要“坚持建设中国特色社会主义法治体系”。结合新时代发展需要，","type":"1","value":"C","id":"991","anw":"优先发展国际法律适用，放缓国内法体系发展"}
,
{"name":"近平法治思想强调“坚持依宪治国、依宪执政”，要求全社会特别是各级领导干部自觉维 护宪法权威。下列哪一做法最符合这一要求？（  ）","type":"1","value":"B","id":"992","anw":"坚持把宪法作为治国理政的根本遵循，维护宪法的权威和实施"}
,
{"name":"近平法治思想认为，公平正义是司法的灵魂和生命。结合司法改革的实际意义，下列哪一 举措最能体现这一精神？（  ）","type":"1","value":"B","id":"993","anw":"深化司法责任制综合配套改革，加强制约监督"}
,
{"name":"近平总书记强调，要“把体现人民利益、反映人民愿望、维护人民权益、增进人民福祉落 实到科学立法、严格执法、公正司法和全民守法的各领域全过程”。结合这一指导思想，下面哪一 做法最符合习近平法治思想的要求？（  ）","type":"1","value":"A","id":"994","anw":"立法过程中广泛征求人民群众意见，确保法律体现民意"}
,
{"name":"近平法治思想中的“十一个坚持”包含“坚持依法治国、依法执政、依法行政共同推进”。 结合行政权力的法治化，下列哪项措施最符合这一要求？（  ）","type":"1","value":"B","id":"995","anw":"用法治给行政权力定规矩、划界限，规范行政决策程序"}
,
{"name":"面依法治国的根本遵循和行动指南是（  ）","type":"1","value":"C","id":"996","anw":"习近平法治思想"}
,
{"name":"近平总书记在中央全面依法治国工作会议上提出“十一个坚持”，其中明确指出，“坚持 在法治轨道上推进国家治理体系和治理能力现代化”。结合国家治理体系的内涵，以下哪项最能体 现这一坚持的要求？（  ）","type":"1","value":"A","id":"997","anw":"推进建设高水平法治人才队伍 缓"}
,
{"name":"习近平法治思想中，人民群众是依法治国的主体和力量源泉。结合这一观点，下列哪项最 准确地体现了法律权威的来源？（  ）","type":"1","value":"C","id":"998","anw":"来自人民的内心拥护和真诚信仰"}
,
{"name":"习近平总书记指出，要“以满足人民群众对________等方面日益增长的需求为着力点，更好 保障人民权益、维护社会公平正义。” 文中空缺处应填入：（  ）","type":"1","value":"B","id":"999","anw":"民主、法治、公平、正义、安全、环境"}
,
{"name":"习近平总书记指出，新时代坚持和发展中国特色社会主义的根本立场是“以人民为中心”。 结合新时代我国社会主要矛盾转变的背景，习近平法治思想强调全面依法治国必须坚持的最根本的 是什么？（  ）","type":"1","value":"B","id":"1000","anw":"坚持以人民为中心的发展思想  &坚持依法行政，优化营商环境"}
,
{"name":"根据《中华人民共和国法治宣传教育法》，下列违反法治宣传教育规定法律责任的说法，正 确的是哪一项？（  ）","type":"1","value":"C","id":"1001","anw":"违反经费管理规定的，可责令限期改正；造成严重后果的，依法对责任人员给予处分"}
,
{"name":"根据《中华人民共和国法治宣传教育法》第五十八条规定，司法行政部门应当定期向下 列哪一主体报告法治宣传教育工作情况？（  ）","type":"1","value":"B","id":"1002","anw":"本级人民代表大会常务委员会"}
,
{"name":"根据《中华人民共和国法治宣传教育法》第五十二条规定，司法行政部门应当建立________， 并向社会公布。（  ）","type":"1","value":"B","id":"1003","anw":"法治文化场所名录"}
,
{"name":"关于未成年人的网络法治宣传教育，网络服务提供者应？（  ）","type":"1","value":"B","id":"1004","anw":"依法开展未成年人网络法治宣传教育，并履行未成年人网络保护义务"}
,
{"name":"司法行政部门在法治宣传教育中不负责_____？（  ）","type":"1","value":"C","id":"1005","anw":"制定相关经济政策"}
,
{"name":"在开展法治宣传教育过程中，应当避免下列哪种做法？（  ）","type":"1","value":"B","id":"1006","anw":"流于形式、脱离实际或者误导公众的宣传"}
,
{"name":"县级以上人民政府司法行政部门未依法履行法治宣传教育工作职责的，由谁依法处理？（ ）","type":"1","value":"B","id":"1007","anw":"本级人民政府或者上级司法行政部门"}
,
{"name":"法治宣传教育的经费应_______？（ ）","type":"1","value":"B","id":"1008","anw":"由国家机关、群团组织、事业单位合理安排，并纳入预算"}
,
{"name":"在网络环境中的法治宣传教育，应重点加强哪个方面？（","type":"1","value":"B","id":"1009","anw":"对网络服务提供者和用户的法治宣传教育"}
,
{"name":"以下哪个部门不属于必须组织开展法治宣传教育的？（  ）","type":"1","value":"D","id":"1010","anw":"私人公司"}
,
{"name":"领导干部应知应会的法律法规应包括？（  ）","type":"1","value":"B","id":"1011","anw":"与履行职责密切相关的法律法规清单"}
,
{"name":"以下关于青少年法治教育的说法正确的是？（  ）","type":"1","value":"C","id":"1012","anw":"应根据青少年身心特点开展法治教育"}
,
{"name":"根据《中华人民共和国法治宣传教育法》第九条规定，国家机关应当按照______落实普法责 任制。（  ）","type":"1","value":"C","id":"1013","anw":"谁执法谁普法"}
,
{"name":"哪一项符合社会法治宣传教育的活动要求和内容？（  ）","type":"1","value":"B","id":"1014","anw":"结合重大节日开展群众性法治宣传教育活动"}
,
{"name":"根据《中华人民共和国法治宣传教育法》第三十三条规定，国家工作人员应当如何进行宪法教育？（  ）","type":"1","value":"A","id":"1015","anw":"定期开展宪法学习，并在就职时依法进行宪法宣誓"}
,
{"name":"全国法治宣传教育的主管部门是？（  ）","type":"1","value":"A","id":"1016","anw":"国务院司法部"}
,
{"name":"以下哪项不属于法治宣传教育的主要内容？（  ）","type":"1","value":"C","id":"1017","anw":"社会诚信体系建设理论"}
,
{"name":"法治宣传教育应遵守的基本原则不包括以下哪项？（  ）","type":"1","value":"B","id":"1018","anw":"以市场利益为中心"}
,
{"name":"法治宣传教育坚持的指导思想不包括以下哪项？（ ）","type":"1","value":"C","id":"1019","anw":"西方法治价值体系"}
,
{"name":"《中华人民共和国法治宣传教育法》于哪一日起施行？（ ）","type":"1","value":"B","id":"1020","anw":"2025 年 11 月 01 日"}
 
]
    var changText = ''
    var anwdo =''
    var canvas = ''
    var  opt = ''
    var hastable = 0
    var next = null
    var badtable =[]
    var tablenum =0
    var sTime =null
    var stateText = 0
    //var Theopt = null
 
    let button = document.createElement("button");
    button.innerText = "总做题(从头）";
    button.style.background = "#4CAF50";
    button.style.color = "#fff";
    button.style.border = "none";
    button.style.padding = "10px 20px";
    button.style.cursor = "pointer";
    button.style.position = "fixed"; // 固定定位，漂浮在屏幕上
    button.style.left = "30px"; // 左侧距离30px
    button.style.top = "50%"; // 顶部距离50%（垂直居中）
    let button2 = document.createElement("button");
    button2.innerText = "单独题目（模糊搜索）";
    button2.style.background = "#EDA";
    button2.style.color = "#000";
    button2.style.border = "none";
    button2.style.padding = "10px 20px";
    button2.style.cursor = "pointer";
    button2.style.position = "fixed"; // 固定定位，漂浮在屏幕上
    button2.style.left = "30px"; // 左侧距离30px
    button2.style.top = "55%"; // 顶部距离50%（垂直居中）
 
    let button3 = document.createElement("button");
    button3.innerText = "视频倍速，（测试中，请反馈）";
    button3.style.background = "#EDC";
    button3.style.color = "#000";
    button3.style.border = "none";
    button3.style.padding = "10px 20px";
    button3.style.cursor = "pointer";
    button3.style.position = "fixed"; // 固定定位，漂浮在屏幕上
    button3.style.left = "30px"; // 左侧距离30px
    button3.style.top = "60%"; // 顶部距离50%（垂直居中）
 
    // 提示框内联样式（完全通过JS设置）
  const tooltip = document.createElement("div");
 
    // 提示框内联样式（完全通过JS设置）
    tooltip.style.position = "absolute";
    tooltip.style.background = "rgba(0, 0, 0, 0.8)";
    tooltip.style.color = "#fff";
    tooltip.style.padding = "6px 12px";
    tooltip.style.borderRadius = "4px";
    tooltip.style.fontSize = "14px";
    tooltip.style.whiteSpace = "pre"; // 支持换行（\n生效）
    tooltip.style.transition = "all 0.3s ease";
    tooltip.style.zIndex = "10000"; // 比按钮层级高
    tooltip.style.position = "fixed"; // 固定定位，漂浮在屏幕上
    tooltip.style.left = "30px"; // 左侧距离30px
    tooltip.style.pointerEvents = "none"; // 不影响鼠标交互
    tooltip.style.top = "45%"; // 顶部距离50%（垂直居中）
    tooltip.style.boxShadow = "0 2px 8px rgba(0,0,0,0.2)";
 
    // 提示框文本（状态信息）
    tooltip.innerText = '状态：点击“总做题”'
 
    // 添加到页面
    document.body.appendChild(tooltip);
 
    function removeInvisibleChars(str) {//过滤
        let   newStr =str.replace(/\s+/g, "");
        newStr = newStr.replace(/_+/g, "");
        newStr = newStr.replace("(", "");
        newStr = newStr.replace("（", "");
        newStr = newStr.replace("）", "");
        newStr = newStr.replace(")", "");
        newStr = newStr.replace(".", "");
        newStr = newStr.replace(",", "");
        newStr = newStr.replace("，", "");
        newStr = newStr.replace(";", "；");
        newStr = newStr.replace("?", "");
        newStr = newStr.replace("？", "");
        newStr = newStr.replace(">", "");
        newStr = newStr.replace("〈", "");
        newStr = newStr.replace("“", "");
        newStr = newStr.replace("”", "");
        newStr = newStr.replace("\"", "");
        newStr = newStr.replace("、", "");
        newStr = newStr.replace("\\", "");
        newStr = newStr.replace("`", "");
        newStr = newStr.replace(":", "");
        newStr = newStr.replace("-", "一");
 
 
 
        return newStr.trim()
    }
    // 插入到页面中
    document.body.appendChild(button);
    document.body.appendChild(button2);
    document.body.appendChild(button3);
    // 添加点击事件
    //////////////////////////////////////////////////////////////////////////////////----------------------------
    function calculateEditDistance(a, b) {
        const lenA = a.length;
        const lenB = b.length;
 
        // 创建二维数组存储子问题结果（优化空间：可用一维数组，此处为清晰用二维）
        const dp = Array.from({ length: lenA + 1 }, () => Array(lenB + 1).fill(0));
 
        // 初始化：一个字符串为空时，编辑距离等于另一个字符串的长度
        for (let i = 0; i <= lenA; i++) dp[i][0] = i;
        for (let j = 0; j <= lenB; j++) dp[0][j] = j;
 
        // 填充dp数组
        for (let i = 1; i <= lenA; i++) {
            for (let j = 1; j <= lenB; j++) {
                // 字符相同则无需操作，继承上一个子问题的结果
                if (a[i - 1] === b[j - 1]) {
                    dp[i][j] = dp[i - 1][j - 1];
                } else {
                    // 字符不同：取“插入、删除、替换”三种操作的最小值 + 1
                    dp[i][j] = Math.min(
                        dp[i - 1][j] + 1,    // 删除a的当前字符
                        dp[i][j - 1] + 1,    // 插入字符到a
                        dp[i - 1][j - 1] + 1 // 替换a的当前字符
                    );
                }
            }
        }
 
        return dp[lenA][lenB];
    }
 
    /**
 * 计算两个字符串的相似度（百分比）
 * @param {string} a - 第一个字符串
 * @param {string} b - 第二个字符串
 * @returns {number} 相似度（0-100，保留2位小数）
 */
    function calculateSimilarity(a, b) {
        // 处理空字符串场景
        if (a === b) return 100.00;
        if (a.length === 0 || b.length === 0) return 0.00;
 
        const editDistance = calculateEditDistance(a, b);
        const maxLen = Math.max(a.length, b.length);
        const similarity = (1 - editDistance / maxLen) * 100;
 
        return Number(similarity.toFixed(2)); // 保留2位小数
    }
 
    /**
 * 检查两个字符串相似度是否≥90%
 * @param {string} a - 第一个字符串
 * @param {string} b - 第二个字符串
 * @returns {boolean} 是否达标
 */
    function isSimilarEnough(a, b ,c) {
        const similarity = calculateSimilarity(a, b);
        //console.log(`两个字符串的相似度：${similarity}%`);
        return similarity >= c;
    }
 
    ////////////////////////////////////////////////////////////////////////////----------------------------------
    button.onclick = function () {
        tooltip.innerText = '状态：正在准备就绪...'
        tablenum=0
        stateText = 1
        sTime = setInterval(() => {
            tooltip.innerText = '状态：正在开始做题';
            tablenum +=1
 
 
        hasda=0
        hastable =0
        canvas  = document.getElementsByTagName('canvas');  //获取页面中的canvas文字图片节点
        opt =  document.getElementsByClassName('m-a-label') //选项节点
        next =  document.getElementsByClassName('btn-rounded') //选项节点
        //Theopt =  document.getElementsByClassName('item-round') //选项节点
        Tesseract.recognize(
            canvas[0],
            'chi_sim'
        ).then((result) => {
            const text = result.data.text.trim() || '未识别到文字';
            changText = removeInvisibleChars(text).slice(2,);
            for(let i=0;i<1020;i++){//json答案循环
                if(  isSimilarEnough(changText,removeInvisibleChars(Thejson[i].name),85)){
                    hastable =1
                    for (let j=1;j<canvas.length;j++){
 
                        /////////////////////////////////////////////
                        Tesseract.recognize(
                            canvas[j],
                            'chi_sim'
                        ).then((results) => {
                            const text2 = results.data.text.trim() || '未识别到文字';
                            changText = removeInvisibleChars(text2);
                            if(Thejson[i].type <=1){
                                if( isSimilarEnough(changText, removeInvisibleChars(Thejson[i].anw),90)){
                                    opt[j-1].children[0].click()
 
                                }
                            }
                            else{
                                anwdo = Thejson[i].anw.split("&")
 
                                for(let v=0;v<anwdo.length;v++){
                                    if(isSimilarEnough(changText ,removeInvisibleChars(anwdo[v]),90)){
 
                                        opt[j-1].children[0].click()
                                        break;
                                    }
                                }
                            }
                        }).catch((err) => {
                            console.error('详细错误：', err);
                        }).finally(() => {
                            console.error('开始识别 Canvas 文字');
                        });
                        //////////////////////////////////////////////////
 
                    }
                    hasda+=1
                    if(hasda >=Thejson[i].type){
                        break;
                    }
                }
 
            }
            if(!hasda){
                if(!hastable){
                       tooltip.innerText = '状态：未识别到此题目';
                       badtable.push(tablenum)
                    //alert(text.replace(/\s+/g, ""))
                }
                //else
                //alert("没有找到")
 
            }
        }).catch((err) => {
            console.error('详细错误：', err);
        }).finally(() => {
            console.error('开始识别 Canvas 文字');
        });
        setTimeout(function(){
            next[2].click()
        },5000);
            if(tablenum>=100) {
                clearInterval(sTime);
                tooltip.innerText = '状态：完成';
            }
 
        }, 11000);
    };
    button2.onclick = function () {
        clearInterval(sTime);
                    tooltip.innerText = '状态：正在开始做题';
            tablenum +=1
 
 
        hasda=0
        hastable =0
        canvas  = document.getElementsByTagName('canvas');  //获取页面中的canvas文字图片节点
        opt =  document.getElementsByClassName('m-a-label') //选项节点
        next =  document.getElementsByClassName('btn-rounded') //选项节点
        Tesseract.recognize(
            canvas[0],
            'chi_sim'
        ).then((result) => {
            const text = result.data.text.trim() || '未识别到文字';
            changText = removeInvisibleChars(text).slice(2,);
            for(let i=0;i<1020;i++){//json答案循环
                if(  isSimilarEnough(changText,removeInvisibleChars(Thejson[i].name),65)){
                    hastable =1
                    for (let j=1;j<canvas.length;j++){
 
                        /////////////////////////////////////////////
                        Tesseract.recognize(
                            canvas[j],
                            'chi_sim'
                        ).then((results) => {
                            const text2 = results.data.text.trim() || '未识别到文字';
                            changText = removeInvisibleChars(text2);
                            if(Thejson[i].type <=1){
                                if( isSimilarEnough(changText, removeInvisibleChars(Thejson[i].anw),90)){
                                    tooltip.innerText = '状态：识别成功';
                                    opt[j-1].children[0].click()
                                    hasda+=1
 
                                }
                            }
                            else{
                                anwdo = Thejson[i].anw.split("&")
 
                                for(let v=0;v<anwdo.length;v++){
                                    if(isSimilarEnough(changText ,removeInvisibleChars(anwdo[v]),90)){
                                        opt[j-1].children[0].click()
                                        hasda+=1
                                    }
                                }
                            }
                        }).catch((err) => {
                            console.error('详细错误：', err);
                        }).finally(() => {
                            console.error('开始识别 Canvas 文字');
                        });
                        //////////////////////////////////////////////////
 
                    }
 
                    if(hasda >=Thejson[i].type){
                        break;
                    }
                }
 
            }
            if(!hasda){
                if(!hastable){
                    tooltip.innerText = '状态：未识别此题目，请自行搜索';
                    badtable.push(tablenum)
 
                }
                else
                tooltip.innerText = '状态：未找到答案，请自行搜索';
 
            }
        }).catch((err) => {
            console.error('详细错误：', err);
        }).finally(() => {
            console.error('开始识别 Canvas 文字');
        });
 
    }
    //寻找答案
button3.onclick = function () {
        tooltip.innerText = '状态：正在进行倍速播放'
        var aaa = document.getElementById("myVideo_html5_api")
        if(aaa){
           aaa.play()
           aaa.playbackRate = 10
            setTimeout(function(){
                aaa.playbackRate = 1
            },516000);
        }
        else{
           document.getElementsByClassName("video-container")[0].children[0].children[0].play()
           document.getElementsByClassName("video-container")[0].children[0].children[0].playbackRate = 10
            setTimeout(function(){
                document.getElementsByClassName("video-container")[0].children[0].children[0].playbackRate = 1
            },516000);
        }

    }
 
})();