// ==UserScript==
// @name         博物馆传送门
// @namespace    https://www.gamemale.com/space-uid-679233.html
// @homepage     https://www.gamemale.com/thread-144398-1-1.html
// @supportURL   https://www.gamemale.com/thread-144398-1-1.html
// @version      2025.12.28
// @description  Click to jump!
// @author       thh866
// @match        https://www.gamemale.com/wodexunzhang-showxunzhang.html*
// @match        https://www.gamemale.com/plugin.php?id=wodexunzhang%3Ashowxunzhang&fid=*
// @match        https://www.gamemale.com/plugin.php?id=wodexunzhang%3Ashowxunzhang&action=*
// @match        https://www.gamemale.com/thread-*
// @match        https://www.gamemale.com/forum.php?mod=viewthread&tid*
// @grant        none
// @license      GPL
// @icon         https://www.gamemale.com/template/mwt2/extend/img/favicon.ico
// @downloadURL https://update.greasyfork.org/scripts/525857/%E5%8D%9A%E7%89%A9%E9%A6%86%E4%BC%A0%E9%80%81%E9%97%A8.user.js
// @updateURL https://update.greasyfork.org/scripts/525857/%E5%8D%9A%E7%89%A9%E9%A6%86%E4%BC%A0%E9%80%81%E9%97%A8.meta.js
// ==/UserScript==

(function() {
    'use strict';

    // 勋章商城、荣誉勋章、奖励勋章、二手市场和我的勋章页面的勋章图片的点击跳转开关
    const xunzhangSwitch = 1;

    // 帖子详情页用户头像下展示的勋章图片的点击跳转开关
    const threadSwitch = 1;

    // 二手市场页面的勋章记录的文字的点击跳转开关
    const recordSwitch = 1;

    // 勋章名称到帖子的映射表
    const name2url = {
        '詹姆斯·维加':'12025', '詹姆斯‧维加':'12025', '詹姆斯·维加（James Vega）':'12025',
        '奧倫':'12027', '奧倫（Auron）':'12027', '奥伦':'12027', '奥伦（Auron）':'12027',
        '希德‧海温特':'12028', '希德‧海温特（Cid Highwind）':'12028',
        '吉姆‧雷诺':'12030', '吉姆‧雷诺（Jim Raynor）':'12030',
        '法卡斯':'12032', '法卡斯（Farkas）':'12032',
        '维吉尔':'12033', '维吉尔（Vergil）':'12033',
        '皮尔斯‧尼凡斯':'12034', '皮尔斯‧尼凡斯（Piers Nivans）':'12034',
        '文森特·瓦伦丁':'12035', '文森特‧瓦伦丁':'12035', '文森特·瓦伦丁（Vincent Valentine）':'12035',
        '巴尔弗雷亚':'12036', '巴尔弗雷亚（Balthier）':'12036',
        '但丁':'12037', '但丁（Dante）':'12037',
        '盖里':'12040', '盖里（Gary）':'12040',
        '杰夫‧莫罗':'12041', '杰夫‧莫罗（Jeff Moreau）':'12041',
        '威尔卡斯':'12042', '威尔卡斯（Vilkas）':'12042',
        '克里斯·雷德菲尔德':'12043', '克里斯‧雷德菲尔德':'12043', '克里斯·雷德菲尔德（Chris Redfield）':'12043',
        '裸体克里斯':'12044', '一丝不挂克里斯':'12044', '一丝不挂克里斯（Naked Chris）':'12044',
        '凯登‧阿兰科':'12045', '凯登‧阿兰科（Kaidan Alenko）':'12045',
        '肥皂':'12046', '肥皂（John“Soap”MacTavish）':'12046',
        '奥利弗‧奎恩':'12047', '奥利弗‧奎恩（Oliver Queen）':'12047',
        '收到情书':'12048', '送情书':'12048',
        '丢肥皂':'12049', '捡到了肥皂':'12049',
        '千杯不醉':'12050',
        '灵光补脑剂':'12051',
        '贞洁内裤':'12052',
        '炼金之心':'12053',
        '黑暗交易':'12054',
        '水泡术':'12055',
        '召唤古代战士':'12056',
        '祈祷术':'12057',
        '嗜血斩首斧':'12058',
        '符文披风':'12059',
        '净化手杖':'12060', '圣光法杖':'12060',
        '十字叶章':'12061',
        '刺杀者匕首':'12062',
        '药剂背袋':'12063',
        '知识大典':'12064',
        '怪笑的面具':'12065', '诡笑的面具':'12065', '奸笑的面具':'12065', '恐怖的面具':'12065', '微笑的面具':'12065', '邪恶的面具':'12065',
        '被踩烂的小草':'12066', '抖不停小草':'12066', '抖来抖去小草':'12066', '微抖小草':'12066', '种植小草':'12066',
        '聚魔花盆':'12067',
        '金钱马车':'12068',
        '牧羊人':'12069',
        '森林羊男':'12070',
        '被祝福の新旅程':'12071', '被祝福的新旅程':'12071',
        '另一个身份':'12072',
        '神之匠工':'12073',
        'Chris Redfield in Uroboros':'12074',
        '站员薪俸':'12075', '保卫领土':'12075', '站员: 保卫领土':'12075',
        '实习版主薪俸':'12076', '神的重量':'12076', '见习版主: 神的重量':'12076',
        '版主薪俸':'12077', '一国之主':'12077', '版主: 一国之主':'12077',
        '梅格':'12085', '梅格（Meg）':'12085',
        '里昂·S·甘乃迪':'12086', '里昂‧S‧甘乃迪':'12086', '里昂·S·甘乃迪（Leon·S·Kennedy）':'12086',
        '重磅手环':'12087',
        '亚力斯塔尔':'12088', '亚力斯塔尔（Alistair）':'12088',
        '罗伯‧史塔克':'12090', '罗伯‧史塔克（Robb Stark）':'12090',
        '亚当‧简森':'12091', '亚当‧简森（Adam Jensen）':'12091',
        '猫化弩哥':'12092', '猫化弩哥（Daryl Dixon）':'12092',
        '高端噬魂者':'12093', '魂之佳肴':'12093', '狼狈噬魂者':'12093', '吞食魂魄':'12093',
        '超级名贵无用宝剑':'12094',
        '念念往日士官盔':'12095',
        '老旧之椅':'12096', '灵魂之椅':'12096', '流失之椅':'12096',
        '漂洋小船':'12097',
        '菠菜人的尸体':'12098', '发现菠菜人':'12098', '元气菠菜人':'12098', '种植菠菜':'12098',
        '洞窟魔蛋':'12099', '吸血魔蝠':'12099',
        '夜灯':'12100',
        '诺曼底号':'12101',
        '堕落之舞':'12102',
        '黄色就是俏皮':'12103',
        '骑兽之子':'12104',
        '质量效应三部曲':'12105',
        '五花八门版块':'12106',
        '辐射：新维加斯':'12107',
        'TRPG版块':'12108', 'TRPG版塊':'12108',
        '上古卷轴V：天际':'12109',
        '一只可爱的小猫':'12111',
        '猫眼':'12112',
        '謎の男':'12113', '站长の守护':'12113',
        '布莱恩·欧康纳':'12121', '布莱恩‧欧康纳':'12121', '布莱恩·欧康纳（Brian O`Conner）':'12121',
        '迪恩‧温彻斯特':'12122', '迪恩‧温彻斯特（Dean Winchester）':'12122',
        '山姆‧温彻斯特':'12123', '山姆‧温彻斯特（Sam Winchester）':'12123',
        '魔术师奥斯卡':'12124', '魔术师奥斯卡（Magician Oscar）':'12124',
        '卡斯迪奥':'12125', '卡斯迪奥（Castiel）':'12125',
        '虎克船长':'12126', '虎克船长（Captain Hook）':'12126',
        '卢西亚诺‧科斯塔':'12127', '卢西亚诺‧科斯塔（Luciano Costa）':'12127',
        '史蒂夫‧金克斯':'12128', '史蒂夫‧金克斯（Steve Jinks）':'12128',
        '遗忘之水':'12129',
        '咆哮诅咒':'12130',
        '充满魔力的种子':'12131', '闪耀种子':'12131', '夜魔果实':'12131', '夜魔护符':'12131', '夜魔藤':'12131',
        '柏木炭':'12132', '柏树枝':'12132', '木柴堆':'12132', '木精灵短弓':'12132',
        '暗红矿土':'12133', '炼化龙血石':'12133', '龙血水晶':'12133', '龙血指环':'12133',
        '阿呆':'12134', '鼻涕精灵':'12134', '不灭的蓝宝石':'12134', '奇怪的刮刮卡':'12134', '神秘的邀请函':'12134', '天然有鸡':'12134', '指路幽灵':'12134',
        '吃饱金币的Doge':'12135', '吃掉金币的Doge':'12135', '迷のDoge':'12135', '喜欢金币的Doge':'12135',
        '龙腾世纪：审判':'12137',
        '堕落飨宴':'12139',
        'TRPG纪念章':'12140',
        '德拉克神圣灵魂瓶':'12141', '德拉克圣瓶':'12141', // '迷之瓶':'12141',
        // '德拉克魔瓶':'68501',
        '戴蒙‧萨尔瓦托':'12143', '戴蒙‧萨尔瓦托（Damon Salvatore）':'12143',
        '库伦 (起源)':'12144', '库伦(起源)':'12144', '库伦(起源)（Cullen (Origins)）':'12144',
        '安德森‧戴维斯':'12145', '安德森‧戴维斯（Anderson Davis）':'12145',
        '圣英灵秘银甲':'12146', '圣英灵凯尔':'12146',
        '禽兽扒手':'12147',
        '奥兹大陆':'12148',
        '海上明月':'12149',
        '葛莱分多':'12150', '赫夫帕夫':'12150', '霍格沃茨五日游':'12150', '雷文克劳':'12150', '麻瓜':'12150', '史莱哲林':'12150',
        '铁杆影迷':'12151',
        '泡沫浮髅(Squirt)':'12152',
        '铁牛':'12153', '铁牛（Iron Bull）':'12153',
        '康纳‧沃什':'12154', '康纳‧沃什（Connor Walsh）':'12154',
        '尼克·贝特曼':'12155', '尼克‧贝特曼':'12155', '尼克·贝特曼（Nick Bateman）':'12155',
        '离去的尤利西斯':'12156', '尤利西斯':'12156', '尤利西斯（Ulises）':'12156',
        '布衣':'12157', '布衣+1 良好的':'12157', '布衣+10 史诗的':'12157', '布衣+11 史诗的':'12157', '布衣+12 传奇的':'12157', '布衣+13 歷战的':'12157', '布衣+13 歴战的':'12157', '布衣+2 上等的':'12157', '布衣+3 精致的':'12157', '布衣+4 精致的':'12157', '布衣+5 精致的':'12157', '布衣+6 精致的':'12157', '布衣+7 无暇的':'12157', '布衣+8 无暇的':'12157', '布衣+9 无暇的':'12157',
        '锻造卷轴':'12163',
        '巴特·贝克':'12245', '巴特‧贝克':'12245', '巴特·贝克（Bart Baker）':'12245',
        '被释放的灵魂':'12246', '诡异的灵魂石':'12246', '奇怪的紫水晶':'12246',
        '预知水晶球':'12248',
        '艾尔尤因':'12348', '名剑艾尔尤因':'12348', '灵剑艾尔尤因':'12348', '圣剑艾尔尤因':'12348',
        '杰森·斯坦森':'12349', '杰森‧斯坦森':'12349', '杰森·斯坦森（Jason Statham）':'12349',
        '神圣十字章':'12350',
        '哈尔·乔丹':'12351', '哈尔‧乔丹':'12351', '哈尔·乔丹（Hal Jordan）':'12351',
        '新月护符':'12352',
        '发芽的种子':'12353', '可爱的三叶草':'12353', '破土而出的嫩芽':'12353', '神奇四叶草':'12353',
        '艾德尔':'12376', '艾德尔（Edér Teylecg）':'12376',
        '盖拉斯‧瓦卡瑞安':'12377', '盖拉斯‧瓦卡瑞安（Garrus Vakarian）':'12377',
        '史莱姆牧场':'12378', '史莱姆养殖证书/史莱姆牧场':'12378', '史莱姆养殖证书':'12378',
        '丛林的鸟飞走了':'12379', '丛林露出来的鸟':'12379', '非常茂盛的丛林':'12379', '这是一片丛林':'12379',
        '种植菊花':'12380', '菊花发芽了':'12380', '菊花等着开花':'12380', '啊！菊花开了！':'12380', '把菊花卖了':'12380',
        '秘密森林':'12547',
        '戴尔·芭芭拉':'12645', '戴尔‧芭芭拉':'12645', '戴尔·芭芭拉（Dale "Barbie" Barbara）':'12645',
        '婴儿泪之瓶':'12646',
        '雪王的心脏':'12647',
        '萨赫的蛋糕':'12653',
        '勇者与龙之书':'12655', '落雪勇者与龙的传说-封面':'12655', '落雪勇者与龙的传说-第一页':'12655', '落雪勇者与龙的传说-第二页':'12655', '落雪勇者与龙的传说-第三页':'12655', '落雪勇者与龙的传说-第四页':'12655', '落雪勇者与龙的传说-第五页':'12655', '落雪勇者与龙的传说-第六页':'12655', '落雪勇者与龙的传说-第七页':'12655','落雪勇者与龙的传说-第八页':'12655', '落雪勇者与龙的传说-书尾':'12655', '破损的旧书':'12655', '雪勇者与龙的传说-书尾':'12655',
        'Frank （LBF）':'12658', 'Frank (LBF)':'12658',
        'BIG BOSS':'12659',
        '詹米·多南':'12670', '詹米·多南（Jamie Dornan）':'12670',
        '库伦（审判）':'12700', '库伦(审判)':'12700', '库伦 (审判)':'12700',
        '神秘商店贵宾卡':'12701',
        '史莱姆蛋':'12931',
        '心之水晶':'13183',
        '阿尔萨斯·米奈希尔':'13286', '阿尔萨斯‧米奈希尔':'13286', '阿尔萨斯·米奈希尔（Arthas Menethil）':'13286',
        '低阶战斗牧师':'13287', '高阶神圣祭司':'13287', '渐逝忠诚之魂':'13287', '维克多·天火':'13287', '维克多‧天火':'13287', '优雅的圣职者':'13287', '云游中的助祭':'13287',
        '天涯.此时':'13562','天涯‧此时':'13562',
        '快破掉的蛋':'13563', '偷情的月兔男':'13563', '小月兔':'13563', '月亮的蛋':'13563', '月兔男':'13563',
        '骑士遗盔':'13572',
        '背弃之证':'14029', '传承之证':'14029',
        '新年小猴':'15171',
        '变形软泥':'15284', '冥界之眼':'15284', '魔眼护符':'15284', '冥界魔眼':'15284',
        '克里斯·埃文斯':'15285', '克里斯·埃文斯（Chris Evans）':'15285',
        '安德鲁·库珀':'15286', '安德鲁·库珀（Andrew Cooper）':'15286',
        '罗宾·西克':'15580', '罗宾·西克（Robin Thicke）':'15580',
        '章鱼小丸子':'15581',
        '华灯初上':'15660',
        '岛田半藏':'17946', '岛田半藏（Shimada Hanzo）':'17946',
        '归途':'68056', '浪潮之歌':'68056', '奇怪的鱼':'68056', '奇异的光线':'68056', '驱逐':'68056', '人鱼男子':'68056', '人鱼之泪':'68056', '泄密':'68056', '许愿':'68056', '罪恶':'68056', '安静的海边':'68056',
        '生化危机：复仇':'68057',
        '亚瑟·摩根':'68058', '亚瑟‧摩根':'68058', '亚瑟·摩根（Arthur Morgan）':'68058',
        '亚瑟·库瑞':'68059', '亚瑟‧库瑞':'68059', '亚瑟·库瑞（海王）':'68059', '亚瑟·库瑞（Arthur Curry）':'68059',
        '变骚喷雾':'68060',
        '网中的皮卡丘':'68061',
        '红龙蛋':'68272', '驯化红龙幼崽':'68272', '红龙幼崽':'68272',
        '黑龙蛋':'68273', '驯化黑龙幼崽':'68273', '黑龙幼崽':'68273',
        '腐化龙蛋':'68274', '驯化腐化龙幼崽':'68274', '腐化龙幼崽':'68274',
        '龙之魂火':'68448',
        '粗糙的骨锤':'68449', '红龙精华':'68449', '华丽的骨锤':'68449', '烤龙肉':'68449', '龙骨残余':'68449',
        '红龙宝珠碎片':'68451', '珊瑚色捕梦网':'68451', '红龙秘宝':'68451',
        '倒吊人(The Hanged Man , XII)':'68452',
        '战车(The Chariot , VII)':'68453',
        '泰凯斯·芬得利':'68497', '泰凯斯·芬得利（Tychus Findlay）':'68497',
        '【夏日限定】夏日的泰凯斯':'68498', '夏日的泰凯斯':'68498',
        '野兽之子':'68499',
        '康纳':'68500', '康纳/Connor':'68500', '康纳（Conner）':'68500',
        '德拉克魔瓶':'68501', '迷之瓶':'68501',
        '石肤术':'68502',
        '恋人(The Lovers，VI)':'68594', '恋人':'68594',
        '魔术师（The Magician，I）':'68733',
        '恋恋小烹锅':'69034',
        '黑曜石赤螯蝎':'69215', '漆黑的蝎卵':'69215',
        '蛮族战士':'69216',
        '山猫图腾':'69217',
        '猎鹰图腾':'69218',
        '眼镜蛇图腾':'69219',
        '布莱克沃尔':'69251', '黑墙':'69251', '守望者雷涅尔':'69251', '汤姆雷涅尔':'69251', '黑墙（Blackwall）':'69251', '汤姆 雷涅尔':'69251',
        '守望者徽章':'69252', '高阶守望者徽章':'69252', '守望者指挥官徽章':'69252', '满是血迹的徽章':'69252',
        '没有梦想的咸鱼':'69254',
        '内森·德雷克':'69255', '内森·德雷克（Nathan Drake）':'69255',
        '丹尼尔·纽曼':'69256', '丹尼爾·紐曼':'69256', '丹尼尔·纽曼（Daniel Newman）':'69256',
        '石鬼面':'69257',
        '秋水长天':'69302', '落霞孤鹜':'69302',
        '贝优妮塔':'69503',
        'GM村金蛋':'69504', '生金蛋的鹅':'69504', '兴奋的鹅':'69504', '休息的鹅':'69504', '【年中限定】GM村金蛋':'69504',
        '模拟人生4':'69505', '模擬人生4':'69505',
        '晃晃悠悠小矿车':'69660', '空矿车-日':'69660', '日-黑曜石':'69660', '日-琥珀':'69660', '日-精金':'69660', '日-蓝宝石 ':'69660', '日-煤':'69660', '日-山铜':'69660', '日-石头':'69660', '日-铁':'69660', '日-亚历山大石':'69660', '夜-电气石':'69660', '夜-金':'69660', '夜-铁':'69660', '夜-亚历山大石':'69660', '夜-月光石':'69660',
        '英普瑞斯':'69799',
        '杰西·麦克雷':'69800',
        '卡德加':'69801', '卡德加（Khadgar）':'69801',
        '麦迪文':'69802', '麦迪文（Medivh）':'69802',
        '达拉然':'69803',
        '德拉克魂匣':'69804',
        '圣甲虫秘典':'69805',
        '安杜因·乌瑞恩':'70367', '安杜因·乌瑞恩(Anduin Wrynn)':'70367',
        '羅素·托維':'70368',
        '冒险专用绳索':'70370',
        '红石':'70372', '可疑的红石':'70372', '伪造的红石':'70372',
        '结晶火鹰幼崽':'70373', '结晶卵':'70373',
        '暮光独角兽幼崽':'70375', '暮色卵':'70375', '发光的暮色卵':'70375',
        '狂暴的书籍':'70715', '莱托文本残页':'70715', '躁动的书籍':'70715',
        '赫尔墨斯·看守者之杖':'70996', '闪耀的赫尔墨斯之杖':'70996', '失控的赫尔墨斯之杖':'70996',
        '阿列克西欧斯(Alexios)':'70997', '阿列克西欧斯（Alexios）':'70997',
        '冰冷的遗骸':'70998', '蓝礼·拜拉席恩':'70998', '蓝礼·重生鹿三':'70998', '亲和的列王':'70998', '英俊的王弟':'70998',
        '青鸾':'71001', '青鸾蛋':'71001',
        '电磁巨鳄':'71002', '电磁卵':'71002', '风暴磁场之鳄':'71002', '凶猛的鳄鱼':'71002', '一只普通的鳄鱼':'71002',
        '荒野大镖客:救赎 II':'71004', '荒野大镖客：救赎 II':'71004',
        '鬼火竹筒':'71005', '神秘的竹筒':'71005', '幽灵竹筒':'71005',
        '阿帕茶':'71006', '强者の茶':'71006', '神秘的红茶':'71006',
        '种植土豆':'71007', '挖了个坑':'71007', '土豆发芽了':'71007', '土豆开花了':'71007', '收获土豆':'71007', '静谧的洞窟':'71007',
        '巴啦啦小魔仙棒':'71008', '充能的魔仙棒':'71008', '闪耀的魔仙棒':'71008', '失效的魔仙棒':'71008',
        '白猪猪储蓄罐':'71514', '爆炸的储蓄罐':'71514', '白猪猪储蓄罐㊖':'71514',
        '粉猪猪储蓄罐':'71515', '碎裂的储蓄罐':'71515', '粉猪猪储蓄罐㊖':'71515',
        '撑破的储蓄罐':'71516', '金猪猪储蓄罐':'71516', '金猪猪储蓄罐㊖':'71516',
        '德拉克的遗物':'71578', '虹之女神像':'71578', '破旧的石像':'71578', '遗物搜寻':'71578', '展开地图':'71578',
        '不败之花':'71579',
        '雾都血医':'71885',
        '春之歌':'71886', '冬之歌':'71886', '秋之歌':'71886', '四季之歌':'71886', '夏之歌':'71886',
        '喷涌的粪桶':'71887', '用过的粪桶':'71887',
        '箭术卷轴':'71889',
        '心心念念小雪人':'71890', '【圣诞限定】心心念念小雪人':'71890',
        '十字军护盾':'72051',
        '龙血之斧':'72052',
        '魔法石碑':'72053',
        '远古石碑':'72054',
        '莱因哈特·威尔海姆':'72137',
        '吃了一半的面包':'72138', '吃完的面包':'72138', '冒险用面包':'72138', '香喷喷的面包':'72138',
        '海螺号角':'72139',
        '迷之天鹅':'72140', '天鹅鬼琴':'72140',
        '初衷的力量':'72200', '临危受命':'72200', '尼克斯·乌尔里克':'72200', '曙光下的灰烬':'72200', '铁汉柔情':'72200', '王者之剑':'72200',
        '乔纳森·里德':'72201',
        '蔷薇骑士之刃':'72202',
        '狩猎用小刀':'72203',
        '阿拉喵？神灯':'72204', '沙漠神灯':'72204',
        '老旧的怀表':'72225', '发光的怀表':'72225', '无尽的怀表':'72225',
        '冒险用指南针':'72226',
        '珊瑚泡泡鱼':'72227', '珊瑚色礁石蛋':'72227',
        '草原孤狼':'72228', '月影蛋':'72228', '月影狼':'72228',
        '藤田優馬':'72920',
        '莫瑞甘':'72921', '荒野女巫':'72921', '被狩猎的女巫':'72921', '轻蔑的女术士':'72921', '秘法顾问':'72921', '谜踪女巫':'72921',
        '钢铁勇士弯刀':'72922',
        '海盗弯钩':'72923',
        '生锈的海盗刀枪':'72924', '洗刷的了海盗刀枪':'72924', '意气风发的海盗刀枪':'72924',
        '草原之象':'72925', '马戏团灰蛋':'72925', '马戏团狂欢象':'72925',
        '迈克尔迈尔斯':'73626',
        'Doc':'73627',
        '火柴 - Gamemale':'73628', '火柴 - 果体美男子':'73628', '火柴 - 美食大全':'73628', '暖心小火柴':'73628',
        '暴风雨中的漂流瓶':'73629', '繁忙船道上的漂流瓶':'73629', '孤岛旁的漂流瓶':'73629', '极地穿越的漂流瓶':'73629', '秘密森林的漂流瓶':'73629', '密林仙境中的漂流瓶':'73629', '秋日麦田的漂流瓶':'73629', '沙滩上的漂流瓶':'73629', '神秘的漂流瓶':'73629', '神秘古城的漂流瓶':'73629', '驶出水渠的漂流瓶':'73629', '信仰之心':'73629',
        '森林鹿':'73630', '一只小鹿':'73630', '郁苍卵':'73630',
        '熔岩蛋':'73631', '熔岩鹰':'73631',
        '杰克·莫里森':'74196', '杰克·莫里森/士兵 76':'74196', '士兵 76':'74196',
        '索林·橡木盾':'74198', '索林·此生挚爱':'74198', '索林·孤山之王':'74198', '索林·临终一役':'74198',
        '陷阱杀手':'74199',
        '日荒戒指':'74201',
        '月陨戒指':'74202',
        '灵鹫蛋':'74203', '圣光灵鹫':'74203', '心领神会':'74203', '御风之灵':'74203',
        '滴血认亲':'74204', '猩红魔鹫':'74204', '血鹫蛋':'74204', '血色威仪':'74204',
        '月上柳梢':'74206',
        '吉姆·霍普':'75042', '接近阴谋':'75042', '警长':'75042', '老父亲':'75042', '谜':'75042', '十一':'75042',
        '沃特·沙利文':'75043',
        '塞巴斯蒂安·斯坦':'75044',
        '魯杰羅·弗雷迪':'75045',
        '星芒戒指':'75046',
         '冒险用绷带':'75047', '日渐染血的绷带':'75047', '逐渐用完的绷带':'75047', '绷带内裤？':'75047',
        '宝箱内的球':'75048', '空荡荡的精灵球':'75048', '迷拟Q':'75048', '皮卡丘':'75048', '和你一起飞行的皮卡丘':'75048',
        '软泥怪':'75049', '软泥怪蛋':'75049',
        '寶可夢 Pokémon':'75057',
        '血石':'75131',
        '恶魔阿蕾莎':'75750', '莎伦':'75750', '消失的阿蕾莎':'75750',
        '疾风剑豪':'75751', '亚索':'75751',
        '【新手友好】昆進':'75752', '昆進':'75752',
        '萨菲罗斯':'75753',
        'SCP-s-1889':'75754','SCP-s-1889-第二页':'75754', 'SCP-s-1889-第六页':'75754', 'SCP-s-1889-第七页':'75754', 'SCP-s-1889-第三页':'75754', 'SCP-s-1889-第四页':'75754', 'SCP-s-1889-第五页':'75754', 'SCP-s-1889-第一页':'75754',
        'GHOST':'75755',
        '最终幻想XIV':'75756',
        '掌中雪球瓶':'75757',
        '猫猫幽灵':'76082',
        '万圣南瓜':'76083',
        '丹·安博尔':'76095',
        '汤姆·赫兰德':'76096',
        '超人':'76097',
        '阿尔伯特·威斯克':'76556',
        '鬼王酒吞童子':'76557',
        'Scott Ryder':'76558',
        'GM论坛初心者毕业证书':'76559', 'GM论坛初心者勋章':'76559', 'GM论坛进阶勋章':'76559', 'GM论坛荣誉勋章':'76559', 'GM论坛勋章':'76559', 'GM論壇初心者勛章':'76559', 'GM論壇勛章':'76559', 'GM論壇進階勛章':'76559', 'GM論壇榮譽勛章':'76559', 'GM論壇初心者畢業證書':'76559',
        '社畜专用闹钟':'76560',
        '暗纹鲨':'76561', '螺旋纹卵':'76561',
        '邦尼尼':'76562', '万圣彩蛋':'76562',
        '风雪之家':'76563',
        '赛博朋克2077':'76564',
        '气球带来的礼物':'76565', '闪亮拐杖糖':'76565', '神秘的礼物':'76565', '圣诞袜':'76565',
        '汉克/Hank':'77158', 'Hank - 推倒':'77158', 'Hank - 抉择':'77158', 'Hank - 重逢':'77158',
        '三角头':'77159', '守护者三角头':'77159', '刽子手三角头':'77159', '寂静岭三角头':'77159',
        '幻象':'77160',
        '琉璃玉坠':'77161',
        '蠢蠢欲动的宝箱':'77162', '冒险用宝箱':'77162', '奇怪的宝箱':'77162',
        '不曾寄出的信件':'77163', '羽毛笔':'77163',
        '星光彩虹小粉驼':'77164', '幽光彩蛋':'77164',
        '沙漠鸵鸟':'77165', '沙漠羽蛋':'77165',
        '恶魔城':'77166',
        '老旧的书籍':'78151', '伊波恩之书':'78151', '凝视夜空':'78151',
        '金刚狼':'78152', '罗根':'78152', '暮狼归来':'78152', '逆转未来':'78152',
        '克苏鲁':'78153', '诡秘的雕像':'78153', '翻卷的海潮':'78153', '遥远的呼唤':'78153', '无尽的深渊':'78153', '旧日支配者—克苏鲁':'78153',
        '士官长':'78154', '约翰-117':'78154',
        '繁星花':'78711', '枯黄的种苗':'78711', '微光苗':'78711',
        '托尼·史塔克':'79451', '钢铁侠':'79451',
        '加勒特·霍克':'79453',
        '艾吉奥':'79454',
        'Chris Mazdzer':'79456',
        '武士之魂':'79457', '可疑的武士刀':'79457', '削铁如泥的武士刀':'79457', '乘风破浪的武士刀':'79457',
        '超级无敌名贵金卡':'79458',
        '林中松鼠':'79459', '林中之蛋':'79459',
        '云上之光':'79525', '湖面云光':'79525',
        '魔法灵药':'80303',
        '波板糖':'80304', '幼儿波板糖':'80304', '彩虹許願星':'80304',
        '索尔·奥丁森':'81117',
        '绯红女巫':'81119',
        '泰比里厄斯':'81120',
        '大古':'81121',
        'GM村蛋糕':'81123',
        '缘定仙桥':'81124',
        '小小行星':'82408',
        '炙热的格拉迪欧拉斯':'82409',
        '格拉迪欧拉斯':'82410', '王者之盾':'82410',
        '卡洛斯·奥利维拉':'82411',
        '巴基 (猎鹰与冬兵)':'82412', '巴基':'82412', '冬兵':'82412', '碎旗者':'82412',
        '英雄联盟':'82413',
        'Joker':'83981',
        'V (DMC5)':'83983',
        'Dante':'83984',
        'Vergil':'83985',
        '力量腕带':'83986',
        '物理学圣剑':'83987',
        '男巫之歌':'83988', '很久很久以前':'83988', 'xx之歌':'83988', '××之歌':'83988',
        '闪耀圣诞球':'84015',
        '压箱底的泡面':'84534',
        '岛田源氏':'85513',
        '阿拉贡':'85514', '阿拉贡·护戒使者':'85514', '阿拉贡·疾风之足':'85514', '阿拉贡·亡魂之约':'85514', '阿拉贡·星辰之鹰':'85514', '阿拉贡·王者归来':'85514',
        '瑟兰迪尔':'85516',
        '异形':'85517', '“Space jockey”':'85517', '“普罗米修斯”':'85517',
        '威克多尔·克鲁姆':'85519',
        '赫敏·格兰杰':'85520',
        '男用贞操带':'85521',
        'One Ring':'85522', '巴拉多要塞':'85522', '厄运山谷':'85522', '烽火':'85522', '黑暗消融':'85522', '黑门':'85522', '卡兰德拉斯':'85522', '米纳斯提力斯':'85522', '千军万马':'85522', '瑞文戴尔':'85522', '夏尔':'85522',
        '成年独角兽':'85523', '五彩斑斓的蛋':'85523', '幼年独角兽':'85523',
        '大恶魔':'85524', '小恶魔':'85524', '血红色的蛋':'85524',
        '男色风暴':'85525', '男色时代':'85525', '男色诱惑':'85525',
        '孔明灯':'87022',
        '生命树叶':'88872', '菀叶狸猫':'88872',
        '不起眼的空瓶':'88874',
        '大脚板':'88875', '小天狼星·布莱克':'88875', '至情至性':'88875',
        '甘道夫':'88876', '甘道夫·护戒使者':'88876', '甘道夫·涅槃重生':'88876', '甘道夫·曙光军师':'88876', '甘道夫·先圣仁心':'88876', '灰袍甘道夫':'88876',
        '莱戈拉斯':'88877',
        '神灯':'88878',
        '黑豹':'88879',
        '时间变异管理局':'88880', '时间尽头的虚空':'88880', '遗留之人的城堡':'88880', '缘起星空':'88880',
        '普隆普特·阿金塔姆':'91413',
        '诺克提斯·路西斯·伽拉姆':'91414',
        '阿不思·邓布利多':'91415', '魔法不朽·传奇不熄':'91415',
        '孤注一掷':'91416', '混血王子':'91416', '青梅竹马':'91416', '西弗勒斯·斯内普':'91416', '至死不渝':'91416',
        '奥利维尼斯辉石头罩':'91418','卡勒罗斯辉石头罩':'91418', '双贤辉石头罩':'91418', '贤者头盔':'91418',
        '恩惠护符':'91419', '黄金护符':'91419', '黄金树的恩惠':'91419',
        '秘密空瓶':'91420', '诺克史黛拉之月':'91420', '星星泪滴':'91420',
        '霍格沃兹魔法学校':'91424', '霍格沃兹特快列车':'91424', '梦中的列车':'91424', '霍格沃茨特快列车':'91424',
        '海边的蛋':'91425', '夏日柯基':'91425',
        '海边的邻居':'91427', '远亲不如近邻？':'91427',
        '1984':'91428', '疯人院':'91428', '畸形秀':'91428', '洛亚洛克':'91428', '旅馆':'91428', '美恐：启程':'91428', '美恐：新的开始':'91428', '女巫集会':'91428', '启示录':'91428', '邪教':'91428',
        '玄生万物':'91429',
        '莱托·厄崔迪':'91431',
        '海的记忆':'92246',
        '独眼章鱼':'92248', '海与天之蛋':'92248',
        '豹王':'94945', '为承父志':'94945', '化敌为友':'94945', '双重身份':'94945', '再会恩师':'94945',
        '不灭狂雷':'94946', '不灭狂雷-沃利贝尔':'94946', '霹天雳地':'94946', '苏醒巨熊':'94946',
        '初入黑道-桐生一马':'94947', '传说的黑道-桐生一马':'94947', '堂岛之龙-桐生一马':'94947', '桐生一马':'94947',
        '大黄蜂':'94948', '大黄蜂（ChevroletCamaro）':'94948',
        '擎天柱（Peterbilt389）':'94949',
        '博伊卡':'94950', '重回格斗场':'94950', '回旋踢才是男人的浪漫':'94950', 'The Brave Boyka':'94950', '自由':'94950',
        '飞天小糖果':'94952', '闪光糖果盒':'94952',
        '茉香啤酒':'94953',
        '雷霆晶球':'94956',
        '思绪骤聚':'94957', '真理世界':'94957',
        '超级幸运无敌辉石':'95016', '卡利亚权杖':'95016', '这是怎么辉石呢':'95016',
        '香喷喷的烤鸡':'95018', '小菜鸟':'95018', '小凤凰':'95018', '新手蛋':'95018',
        '深渊遗物':'95019', '星辰龙':'95019', '星尘龙':'95019',
        '街头霸王':'95020',
        '奇思妙想':'97633',
        '旅行骰子！':'99612',
        '埃及':'101343', '马克':'101343', '马克·史贝特':'101343', '信任':'101343', '月光化身':'101343', '月光骑士':'101343',
        '史蒂文·格兰特':'101345', '史蒂文':'101345', '幻觉':'101345', '光化身':'101345', '骑士先生':'101345', // '月光骑士':'101345',
        '果体76':'101775',
        '竹村五郎':'103957', '内在':'103957', '忠诚':'103957', '前身':'103957',
        '暗影烈焰':'103958', '苍穹禁城':'103958', '光之战士':'103958', '红莲狂潮':'103958', '晓月终焉':'103958', '重生之境':'103958',
        'Drover':'103959',
        '流行巨星GM':'103960', '乔治·迈克尔':'103960', '威猛主唱GM':'103960', '性感男神GM':'103960', '蛰伏中的GM':'103960',
        '吃饱的小阿尔':'103961', '饥饿的小阿尔':'103961', '小阿尔的蛋':'103961', '幸福的小阿尔':'103961',
        '红心玉':'104061',
        '『还乡歌』':'108197', '『落樱缤纷』':'108197', '『樱花树灵』':'108197',
        '『日心说』':'108200', '『星象监测』':'108200',
        '『任天堂Switch』红蓝√':'108201', '『崭新的红蓝游戏机』':'108201', '『随时随地开启！』':'108201',
        '『任天堂Switch』灰黑√':'108202', '『崭新的灰黑游戏机』':'108202', // '『随时随地开启！』':'108202',
        '『私有海域』':'108899',
        '『钜鲸』':'108901',
        '『召唤好运的角笛』':'108903',
        '『圣洁化身』':'108905',
        '『矩阵谜钥Ⓖ』':'108908',
        '『确认购置新居?』':'108911', '『新居手册Ⓖ』':'108911', '『交钥匙了!』':'108911',
        '『户口本: Lv2~6』':'108918', '『居住证: Lv2~6』':'108918', '『正在入住GM村』':'108918',
        '『户口本: Lv7+』':'108920', '『居住证: Lv7+』':'108920', '『住在GM村』':'108920',
        '牌中小丑':'109760', '牌中小丑 · 呼之欲出':'109760', '牌中小丑·呼之欲出':'109760',
        '诡案谜集·黑夜之星':'111098', '黑夜之星':'111098',
        '诡案谜集·追击者':'111099', '追击者':'111099',
        '艾利克斯':'111280',
        '勒维恩·戴维斯':'111282', '麻烦':'111282', '失败':'111282', '意外':'111282', '远行':'111282', '辗转':'111282', '芝加哥':'111282', '醉乡民谣':'111282',
        '丹·雷诺斯':'111283',
        '蒂法·洛克哈特':'111292',
        '山村贞子':'111293',
        '破旧打火机':'111294', '我的冶金打火机':'111294',
        '静置的双向圣杯':'111295', '双向圣杯：待焕活':'111295', '双向圣杯：焕然意志':'111295', '双向圣杯：血液循环仪式I':'111295', '双向圣杯：血液循环仪式II':'111295', '双向圣杯：咒术循环仪式I':'111295', '双项圣杯':'111295', '双向圣杯：咒术循环仪式II':'111295',
        '传送镜':'111680', '镜中小鸟':'111680', '神奇传送镜':'111680',
        '『叫价牌』':'111775', '『瓶中信』':'111775',
        '『弗霖的琴』':'112426', '『 弗霖的琴』':'112426',
        '『伊黎丝的祝福』':'112510', '『伊黎丝的赞词』':'112510', '『伊黎丝的赞美词』':'112510',
        '【周年限定】克里斯(8)':'112540', '人到中年':'112540', '上作剧情':'112540', '永远的克叔':'112540', '再次回归':'112540',
        '不屈之枪·阿特瑞斯':'112547',
        'Futūrum（未来）':'112555', '弗图AI':'112555', '弗图博士':'112555', '乐园防御程式':'112555',
        '恐惧气味':'112639', '雷夜啸声':'112639', '死神':'112639', '死亡':'112639', '死亡化身':'112639', '业火死斗':'112639', '業火死鬥':'112639', '雷夜嘯聲':'112639', '恐懼氣味':'112639',
        '九尾妖狐·阿狸':'112640',
        '丹妮莉丝·坦格利安':'112642',
        '希尔瓦娜斯·风行者':'112645',
        '炽天使之拥':'112646', '大天使之杖':'112646', '女神之泪':'112646',
        '遍江云霞':'112663', '壶中冰心':'112663', '千里潋滟':'112663', '散佚的文集':'112663',
        '狱炎蛋':'112666', '狱炎魔犬':'112666',
        '风物长宜':'113518',
        '小小舞台':'115919',
        '『灰域来音』':'116029',
        '『开裂囊状物』':'117000', '『迷翳结晶：聚合颗粒』':'117000', '『迷翳结晶：囊状物』':'117000', '『迷翳结晶：收集颗粒』':'117000', '『迷翳之中』':'117000', '『眼榴』':'117000',
        '『迷翳森林回忆录』':'117679',
        '探险三杰士':'117680',
        '『星河碎片』':'118047',
        '桑克瑞德·沃特斯':'118371',
        '白野威':'118372', '不知名的石像':'118372', '复苏的天照':'118372', '净化污秽的天照':'118372', '失去力量的白狼':'118372', '天照大神':'118372',
        '刀锋女王':'118374', '刀锋女王 - 诞生':'118374', '刀锋女王 - 复仇':'118374', '刀锋女王 - 归宿':'118374', '刀锋女王 - 晋升':'118374', '刀锋女王 - 重生':'118374',
        '海德林':'118375', '你的答案':'118375', '生死答问':'118375', '维涅斯':'118375', '我已倾听，我已感受，我已思考':'118375',
        '萨勒芬妮':'118376', '星籁歌姬':'118376',
        '令人不安的契约书':'118378', '沼泽黏附者':'118378',
        '灵藤蛋':'118380', '迷你蔓生灵树':'118380',
        '白巧克力蛋':'118475', '猪庇特':'118475',
        '猛虎贴贴':'118478', '情难自抑':'118478', '永浴爱河':'118478',
        '绿茵宝钻':'119472',
        '肉垫手套':'119473',
        '百相千面':'120387', '百相千面-晦':'120387', '百相千面-殇':'120387', '百相千面-戏':'120387',
        '阿齐斯':'120388', '保加利亚妖王':'120388', '纯爷们阿齐斯':'120388', '温暖的小屋':'120388', '真正的阿齐斯':'120388',
        '白骨露于野':'120390', '感召':'120390', '涅槃':'120390', '叛逆者':'120390', '缘起':'120390', '纣王·子受':'120390',
        '阿尔瓦罗·索莱尔':'120391', '喝奶茶的罗罗':'120391', '认真练琴的罗罗':'120391', '认真练琴的罗罗]':'120391', '走出失恋阴影的罗罗':'120391', '自在旅行的罗罗':'120391', '开心到旋转的罗罗':'120391',
        '莫甘娜':'120393',
        '凯尔':'120395',
        '回忆之物':'120396', '露娜弗蕾亚·诺克斯·芙尔雷':'120396', '未来的黎明':'120396', '约定守护':'120396', '众神祭祀':'120396',
        '干涸的圣杯':'120397', '和谐圣杯':'120397', '邪恶圣杯':'120397',
        '被尘封的诅咒之书':'120398', '被尘封之书':'120398', '沉睡之神，拉莱耶之主—克苏鲁':'120398', '海德拉':'120398', '黄衣之主—哈斯塔':'120398', '黄衣之主召唤仪式':'120398', '解封的死灵之书':'120398', '旧日之印':'120398', '蠕动的混沌—奈亚拉托提普':'120398', '森之黑山羊母神—纱布尼古拉斯':'120398', '死灵之书':'120398', '万物归一者—犹格·索托斯':'120398',
        '可爱的小伯':'120400', '睡着的小伯':'120400', '我的天使':'120400', '享受美食的小伯':'120400', '兴奋的小伯':'120400', '棕色条纹蛋':'120400',
        '沉睡的格罗姆':'120401', '苏醒的格罗姆':'120401', '长花的蛋':'120401',
        '龙鳞护盾':'121125', '龙眼指环':'121125', '龙爪王冠':'121125', '龙之秘宝':'121125', '炎龙火舌':'121125',
        '图腾饼干':'123613',
        '重建熊屋':'123614',
        '虎头怪':'126105', '妙手空空':'126105', '神力无穷':'126105', '十年一梦':'126105', '鹰击':'126105', '追忆':'126105',
        '克劳斯·迈克尔森':'126107', 'Klaus':'126107', 'Niklaus Mikaelson':'126107', 'The Great Evil':'126107', 'The original vampire':'126107', 'The hybrid':'126107', 'As a father':'126107', 'The king':'126107',
        '凯特尼斯·伊夫狄恩':'126109', '禁果':'126109', '破壁':'126109',
        '爱丽丝·盖恩斯巴勒':'126111', '你没事吧？':'126111', '请收下这朵花':'126111', '辣手姐妹花':'126111', '跨过这道墙':'126111', '原来他一直在我身边':'126111',
        '喋血日记本':'126113', '杀意人偶':'126113', '无法消解的怨恨':'126113', '邪骸转生':'126113',
        '烈焰天使弓':'126115', '天使之赐':'126115', '真·天使之赐':'126115',
        '【二阶】最终棱镜':'126116', '【一阶】棱镜':'126116', '棱镜':'126116',
        '哀嚎恶灵':'126119', '厄运骸骨':'126119', '黑暗水晶':'126119', '骷髅勇士':'126119', '天灾骑士':'126119',
        '不朽之恋':'126120', '创生之柱':'126120', '璀璨之焰':'126120', '诞星之所':'126120', '光子之海':'126120', '荒原':'126120', '枯荣明灭':'126120', '猎户座的明珠':'126120', '王座的毗邻':'126120', '无光余烬':'126120', '无垠':'126120',
        '可怖的眼球':'126121', '可疑的触手':'126121', '可疑的肉蛋':'126121', '可疑的眼睛':'126121', '克苏鲁的眼球':'126121',
        '最终幻想XVI':'126122',
        '『金色车票』':'126634', '『梦旅存根』':'126634', '梦旅存根':'126634',
        '六出冰花':'126968',
        '特供热巧':'126969', '极地特快车厢特供 · 热巧 450ml':'126969', 'HOT CHOC！':'126969', '车厢特供 · 热巧 450ml':'126969',
        '『列车长』':'127026', '『极地特快列车长』':'127026', '『即将抵达终点站』':'127026', '『终点站：极地』':'127026',
        '岛屿探险家':'128473',
        '征服之王':'128474',
        '尼克·王尔德':'129113', '初遇朱迪':'129113', '重归于好':'129113', '实现梦想':'129113',
        '朱迪·霍普斯':'129115', '初入动物城':'129115', '卸下警徽':'129115', '官复原职':'129115',
        '“米凯拉的锋刃”玛莲妮亚':'129118', '圣树底部的半神':'129118', '米凯拉的锋刃':'129118', '猩红恐惧':'129118', '破碎战争':'129118', '“腐败女神”玛莲妮亚':'129118',
        '改造后的火枪':'129119', '黄金之旅':'129119', '极·龙の意':'129119', '射手的火枪':'129119', '银色飞鹰':'129119',
        '冰海钓竿':'129120', '步行鮟鱇':'129120', '克苏鲁的仆从':'129120', '虚空之海的鲸':'129120',
        '崩朽龙卵':'129122', '崩朽青铜龙幼崽':'129122', '崩朽之青铜龙王':'129122',
        '波纹蓝蛋':'129123', '幽光蓝龙':'129123', '注入能量的波纹蓝蛋':'129123',
        '雄躯的昇格':'129126',
        '极客的晚宴':'129127',
        '里昂（RE4）':'129158', '致命危机':'129158', '特工里昂的奇幻漂流':'129158', '衣衫褴褛':'129158', '终归一人':'129158',
        '苇名弦一郎':'129159', '巴流·苇名弦一郎':'129159', '飞渡轻舟':'129159', '巴流·雷之矢':'129159', '不死斩【开门】':'129159',
        '克莱夫・罗兹菲尔德':'129161',
        '约书亚・罗兹菲尔德':'129162',
        '『不败之花』':'129610',
        '龙鳞石':'129790',
        '『先知灵药:真视』':'132585', '『先知灵药』':'132585', ' 『先知灵药：真视』':'132585', ' 『先知灵药』':'132585',
        '幽浮起司堡':'133898', '幽浮起司煲':'133898',
        '一只陶瓮':'133899', '瓮中能言蛙':'133899',
        '『流星赶月：宙刃』':'134127', '『流星赶月』':'134127',
        '阿怪':'134663',
        '生活拍立得':'135530', '照相机':'135530',
        '巴比伦辞典':'135738', '巴比伦辞典㊥':'135738',
        '金翼使':'136035', '金翼使(30d)':'136035', '金翼使㊊':'136035',
        '丹雀衔五穗，人间始丰登':'137106', '烈日载雨、风禾尽起':'137106', '瑞雪兆丰年，生灵万物新':'137106', '五谷丰年':'137106', '寻觅':'137106',
        '吉尔·沃瑞克':'137107',
        '大罪人希德':'137108', '雷之显化者':'137108', '希德法斯·特拉蒙':'137108', '召唤兽拉姆':'137108',
        '狄翁·勒萨若':'137110', '狄翁・勒萨若':'137110', '皇子与侍从':'137110', '弑父者':'137110', '百万火光':'137110', '十垓火光':'137110', // '巴哈姆特':'137110',
        'Act of Ultimate Trust':'137117', 'Awakening Earth':'137117', 'Birth of Sky':'137117', 'Emerging Force':'137117', 'Life of Ice':'137117', 'Life of Water':'137117', 'Life of Wind':'137117', 'Master of Six Lives':'137117', '神秘挑战书':'137117', '尾崎八项':'137117',
        '敖蜃星':'137113', '格林星':'137113', '太空列车':'137113', '太空列车票':'137113', '甜点星':'137113',
        '坏掉的月亮提灯':'137134', '月亮提灯':'137134',
        'GM吸血伯爵':'137135', '可爱黑猫':'137135', '可爱毛团':'137135', '吸血猫蛋':'137135',
        '穿过的白袜':'137137', '崭新的白袜':'137137', '装了衣物的纸盒':'137137',
        '变身器':'137697', '月棱镜':'137697',
        '近地夜航':'138136',
        '『分析天平』':'139404',
        '巨力橡果(30d)':'139406', '巨力橡果':'139406', '巨力橡果㊊':'139406',
        '古老金币':'141060', '璀璨金币':'141060',
        '不洁圣子':'141062',
        '『钟楼日暮』':'141820', '『钟楼盐水棒冰』':'141820',
        '小小安全帽':'142917',
        '金牌矿工':'142919',
        '『泥潭颂唱者』':'143409',
        '莱昂纳多·迪卡普里奥':'144099', '了不起的盖茨比':'144099', '盗梦空间':'144099', 'Forever Titanic':'144099',
        '叶卡捷琳娜':'144101', '叶卡捷琳娜大帝':'144101',
        '肃弓':'144103', '最初的轻语':'144103', '轻语':'144103', '最后的轻语':'144103',
        '半生黄金种':'144104', '托莉娜的睡莲':'144104', '托莉娜的微笑':'144104', '米凯拉的花':'144104', '神人的编制发':'144104',
        'Zootopia':'144106', '启程':'144106', '全景':'144106', '沙漠':'144106', '冰原':'144106', '雨林':'144106',
        '御医神兔':'144664',
        '脉律辐石':'144944',
        '劫掠核芯':'144945',
        '幸运女神的微笑':'146144',
        '『逆境中的幸运女神』':'146145',
        '『南瓜拿铁』':'146962',
        '梅克军徽':'147987', '贵族与野兽':'147987', '占卜与日月':'147987', '羽人与蜕变':'147987', '小丑与格雷与星光璀璨':'147987',
        '奎兰':'150222', '无瑕的回忆':'150222',
        '水银日报社特约调查员':'150223', '朴素的誓言':'150223',
        '古烈':'150911',
        '奇异博士':'150913', '史蒂芬·斯特兰奇':'150913', '午夜悲剧':'150913', '时间牢笼':'150913', '至尊法师':'150913',
        '托比·马奎尔':'150914', '抉择':'150914', '改变':'150914', '蜘蛛侠':'150914',
        '阿丽塔':'150915', '重生':'150915', '天人永隔':'150915', '剑指撒冷':'150915',
        '圣诞有铃':'150917', '圣诞寻铃':'150917',
        '羽毛胸针':'150919', '苏格兰圆脸胖鸡':'150919', '苏格兰圆脸胖鸡[Pro Max]':'150919',
        '都市：天际线2':'150921',
        '银色溜冰鞋':'152367',
        '『冰雕马拉橇』':'152369',
        '【新春限定】果体 隆':'153403',
        '汉尼拔':'153404', '晚宴':'153404', '掌中命运':'153404', '未散的宴席':'153404',
        '梅琳娜Melina':'153407', '约定立下':'153407', '明月知心':'153407', '亭亭如盖':'153407', '使命终成':'153407', '宵眼定死':'153407', '黄粱一梦':'153407',
        '贝儿(Belle)':'153409', 'Belle':'153409', 'Come across':'153409', 'Crush':'153409', 'Beauty and the Beast':'153409',
        '普通羊毛球':'153411', '整理好的线团':'153411', '织好的布料':'153411', '暖心小斗篷':'153411',
        '神秘天球':'153413', '乐园之初':'153413', '繁盛之景':'153413', '人世之始':'153413', '堕落之实':'153413', '原罪之初':'153413', '审判终至':'153413', '历练人间':'153413', '堕入地狱':'153413', '百鬼夜行':'153413',
        '婚姻登记册':'153415', '爱情是一只小鸟':'153415', '寻求恋爱是我的自由':'153415', '孤独是一种常态':'153415', '我有一个暗恋对象':'153415', '这天我们之间是粉色的':'153415', '狂热恋爱中':'153415', '520认证':'153415', '组成家庭':'153415',
        '健忘礼物盒':'153416', '打开一个礼物盒':'153416', '打开又一个礼物盒':'153416', '打开又亿个礼物盒':'153416', '变色的礼物盒':'153416', '智力鉴定书':'153416',
        '脏兮兮的蛋':'153419', '爱你的小蟑螂':'153419', '螂的诱惑':'153419', '神秘Bug！':'153419', '战螂':'153419', '一只来自远方的螂':'153419', 'Jo太螂':'153419',
        '小狮欢舞':'155113',
        '『搓粉团珠』':'155117',
        '永亘环':'155195',
        '神奇宝贝大师球':'157540',
        '神奇宝贝图鉴':'157542',
        '『道具超市』':'157750',
        '猫咪点唱机㊊':'157787', '猫咪点唱机':'157787',
        '肉乖乖':'159166', '眠眠茧':'159166', '璀璨闪蝶':'159166', '哀恸魔蝶':'159166',
        '灵魂残絮聚合法':'159167', '脏器再生手术':'159167', '实验体出逃事故':'159167', '自定义男从Homunculus':'159167',
        'John Reese':'160193',
        '穿靴子的猫':'160194', '万众瞩目':'160194', '遭遇死神':'160194', '醉生梦死':'160194', '迷途羔羊':'160194', '许愿之星':'160194', '传奇':'160194',
        '狗狗':'160195', 'dog':'160195', 'perrito':'160195',
        '阿加莎·哈克尼斯':'160196', '女巫起源':'160196', '深陷混沌':'160196', '女巫之路传说':'160196',
        '圣水瓶':'160197', '受赐福的圣水瓶':'160197', '破碎的圣水瓶':'160197', '重铸的圣水瓶':'160197', '新神的赐福':'160197',
        '弯钩与连枷':'160198', '木乃伊巨人':'160198', '巴斯泰托信徒':'160198', '索贝克信徒':'160198', '阿努比斯信徒':'160198',
        '黑神话:悟空':'160199',
        '猫头鹰守卫':'160795', '守卫: 不可选中':'160795', '守卫: 轮班侦察':'160795', '守卫: 坚守眼位':'160795',
        '『凯旋诺书』':'160797',
        '『林中过夜』':'160798',
        '『绿茵甘露』':'159704', '位于左侧的随从已派遣远征':'159704',
        '胡子贴纸':'161623',
        '香蕉特饮':'111748', '迷之香蕉特饮':'111748', ' 迷之香蕉特饮':'111748',
        '特殊-纯真护剑':'112214', '纯真护剑':'112214', '纯真护剑㊕':'112214', '纯真护剑 · 这把剑守护每个孩子无论他有没有被神选中':'112214',
        '『活动代币』':'120137', '『叫价牌』':'120137', '『活动代币兑金币』':'120137',
        '(人)血球蛋白':'121881', '小型流动血瓶':'121881', '失去生机的血瓶':'121881', '中型储蓄血瓶':'121881', '失去生机的血瓶':'121881', '大型贮藏血瓶':'121881', '失活的血瓶':'121881',
        '『酒馆蛋煲』':'122417',
        '格雷的扑克牌':'130782', '格雷的扑克牌':'130782',
        '『厢庭望远』':'161935',
        '十周年扭蛋 - 绿':'113501', '十周年扭蛋 - 蓝':'113501', '十周年扭蛋 - 橙':'113501', '十周年扭蛋 - 紫':'113501', '十周年扭蛋 - 红':'113501',
        '巴哈姆特':'162881', '愤怒的巴哈姆特':'162881', '失败的封印仪式':'162881', '百万核爆':'162881', '巴哈姆特大迷宫':'162881', '龙神巴哈姆特':'162881', '至尊巴哈姆特':'162881',
        '约翰·康斯坦丁':'162882',
        '牛局长博戈':'162885', '勃然大怒的牛局长':'162885', '不为人知的小秘密':'162885',
        '亨利.卡维尔':'162886', '亨利·卡维尔':'162886', '仇恋':'162886', '都铎王朝':'162886', '惊天战神':'162886', '明日之子':'162886', '秘密特工':'162886', 'bvs':'162886', '猎魔人':'162886', '死侍':'162886', '人间之神':'162886',
        '红夫人':'162888', '玛丽':'162888', '希望的残像':'162888', '破镜':'162888', '荣光的残像':'162888',
        '莉莉娅·考尔德（Lilia Calderu）':'162889', 'QUEEN of CUPS.【圣杯皇后】':'162889', 'THREE of PENTACLES.【钱币三】':'162889', 'KNIGHT of WANDS.【权杖骑士】':'162889', 'THE HIGH PRIESTESS.【女祭司】':'162889', 'THREE of SWORDS.【宝剑三】':'162889', 'THE TOWER (REVERSED).【高塔·逆位】':'162889', 'DEATH.【死神】':'162889', 'THE TOWER (UP RIGHT).【高塔·正位】':'162889', '我的路从时间蜿蜒而出':'162889',
        '尼特公仔':'162891', '會動的尼特公仔':'162891', '健壯的尼特公仔':'162891', '威猛尼特':'162891',
        '黑暗之魂系列':'162893',
        '女巫之路':'162894',
        '『狄文卡德的残羽』':'163415',
        '鎏彩万幢':'164432',
        '呆猫':'167219',
        '传说中的黑龙':'167220',
        '检定场':'168856',
        '命运的轮廓':'168858',
        '灯载情绵':'169887',
        '“半狼”布莱泽':'171601', '合作':'171601', '相约于群星':'171601', '发狂':'171601', 'You Can Pet Blaidd':'171601',
        '炽焰咆哮虎':'171602', '火斑喵':'171602', '炽焰咆哮虎的训练':'171602', '咆哮虎的冠军之路':'171602',
        '基努·里维斯':'171603', '生死时速':'171603', '极速追杀':'171603', 'The One':'171603', '黑客帝国':'171603', '地狱神探':'171603',
        '琴.葛蕾':'171605', '牺牲':'171605', '清醒与痛苦':'171605',
        'Honey B Lovely':'171606', 'Honey Bee':'171606', '蜜蜂魔物':'171606', '蜂蜂小甜心':'171606',
        '黑暗封印':'171607', '梅贾的窃魂卷':'171607', '饱食之戒':'171607', '躁动之戒':'171607', '秘法之书':'171607', '光之少女の魔法书':'171607',
        '枯木法杖':'171608', '蓄能法杖':'171608', '元灵化法杖':'171608', '水晶化法杖':'171608', '结晶化法杖':'171608',
        '千年积木':'171609', '寄宿法老王灵魂的容器':'171609',
        '辉夜姬的五难题':'171610', '佛御石之钵':'171610', '蓬莱的玉枝':'171610', '火鼠的皮衣':'171610', '龙头的宝玉':'171610', '燕的子安贝':'171610', '竹取物语':'171610',
        '末影珍珠':'171611', '原初の珍珠':'171611', '更多的珍珠':'171611', '隔墙有眼':'171611', 'The End':'171611',
        '双生蛋':'171614', '双生':'171614', '三羽蚀鸮':'171614', '三羽蚀鸮 ':'171614', '六翼神鸮':'171614',
        '桂花米糕':'172871',
        '弗雷迪玩偶':'174173',
        '发条八音盒':'174174',
        '荧光水母':'175316',
        '河豚寿司':'175317',
        '傲之追猎者·雷恩加尔':'176541', '磨炼！':'176541', '愤怒':'176541', '猎个痛快！':'176541',
        '本・比格':'176542', '隨機過程隨機過':'176542', '熊性本善':'176542', '帅气的本・比格':'176542',
        '高桥剑痴':'176543', '失明':'176543', '先祖之魂':'176543', '隐秘的讯息':'176543',
        '大侦探皮卡丘':'176544', '淘气的皮卡丘':'176544', '闯祸的皮卡丘':'176544', '传说级训练家':'176544', // '皮卡丘':'176544', // 重复了不能加
        '被冰封的头盔':'176545', '冰冷的电气头盔':'176545', '永冻土':'176545',
        '基础维修工具':'176546', '中级维修工具':'176546', '高级维修工具':'176546', '高级维修工具[附魂]':'176546', 'GM高级技工':'176546',
        '无限魔典':'176547', '无限魔典 ':'176547', '失窃':'176547', '余烬':'176547', '逆流':'176547', '原初魔典':'176547', '秘林魔典':'176547', '凛霜魔典':'176547', '炎狱魔典':'176547', '沼蚀魔典':'176547', '幽冥魔典':'176547', '净灵魔典':'176547', '魂灵魔典':'176547', '奥术魔典':'176547', '祛色':'176547',
        '图书馆金蛋':'176548', '可鲁':'176548', '可鲁贝洛斯':'176548',
        '艾尔登法环':'176549',
    };

    // 判断是否是帖子页面的正则
    const reg = /^https:\/\/www.gamemale.com\/thread/;
    const reg2 = /^https:\/\/www.gamemale.com\/forum.php/;

    // 勋章商城、荣誉勋章、奖励勋章、二手市场和我的勋章页面修改href
    // <a href="javascript:void(0);"> => <a href="..." target="_blank">
    function modifyHref(){
        if (1 == xunzhangSwitch){
            // debugger;
            let allDivs = document.getElementsByClassName('myimg');
            console.log(allDivs.length);
            for (let i = 0; i < allDivs.length; i++) {
                let aTag = allDivs[i].querySelector('a');
                let href = aTag.getAttribute('href');
                if (href && href.includes('javascript:void')) {
                    let alt = aTag.querySelector('img').getAttribute('alt');
                    if (alt.endsWith('.')){ // 适配真人男从名称加点的修改
                        alt = alt.substr(0, alt.length - 1);
                    }
                    console.log(alt);
                    if (alt && name2url[alt])
                    {
                        aTag.setAttribute('href', href.replace('javascript:void(0);', 'thread-'+name2url[alt]+'-1-1.html'));
                        aTag.setAttribute('target', '_blank');
                    }
                }
            }
        }
        return 0;
    }

    // 帖子详情页为<img>增加Listener
    function addHref(){
        if (1 == threadSwitch){
            // debugger;
            let pTags = document.getElementsByClassName('md_ctrl wodexunzhang_img');
            for (let i = 0; i < pTags.length; i++) {
                let imgs = pTags[i].getElementsByTagName('img');
                console.log("[L" + (i + 1) + " : " + imgs.length + "]");
                for (let j = 0; j <imgs.length; j++){
                    let alt = imgs[j].getAttribute('alt');
                    if (alt){
                        if (alt.includes('『随时随地开启！』')){
                            let tip = imgs[j].getAttribute('tip');
                            alt = (tip && tip.includes('知识')) ? '『任天堂Switch』红蓝√' : '『任天堂Switch』灰黑√'; // 旅程
                        }
                        else if(alt.includes('月光骑士')){
                            let tip = imgs[j].getAttribute('tip');
                            alt = (tip && tip.includes('回帖 血液')) ? '马克·史贝特' : '史蒂文·格兰特'; // 回帖 金币
                        }
                        else if(alt.includes('巴哈姆特')){ // 与[狄翁·勒萨若 等级Max]重名处理
                            let tip = imgs[j].getAttribute('tip');
                            alt = (tip && tip.includes('回帖 金币')) ? '狄翁·勒萨若' : '巴哈姆特';
                        }
                        else if(alt.startsWith('皮卡丘')){
                            let tip = imgs[j].getAttribute('tip');
                            alt = (tip && tip.includes('回帖 血液')) ? '宝箱内的球' : '大侦探皮卡丘';
                        }
                        if (alt.endsWith('.')){ // 适配真人男从名称加点的修改
                            alt = alt.substr(0, alt.length - 1);
                        }
                        if (name2url[alt]){
                            imgs[j].addEventListener("click", function() {
                                window.open('thread-'+name2url[alt]+'-1-1.html', '_blank');
                            });
                            console.log(alt);
                        }
                        else{
                            console.log(alt+' not found!');
                        }
                    }
                }
                let aTag = pTags[i].getElementsByTagName('a')[0];
                let href = aTag.getAttribute('href');
                if (href && href.includes('wodexunzhang-showxunzhang.html')){
                    aTag.setAttribute('href', href.replace('wodexunzhang-showxunzhang.html', 'javascript:void(0);'));
                }
            }
        }
        return 0;
    }

    // 勋章记录为<b>增加<a href...></a>
    function modifyTagB(){
        if (1 == recordSwitch){
            // debugger;
            let ul = document.getElementsByClassName('mn mymn');
            let li = ul[0].getElementsByTagName('li');
            for (let i = 0; i < li.length; i++) {
                let bTags = li[i].getElementsByTagName('b');
                for (let j = 0; j <bTags.length; j++){
                    if (bTags[j]){
                        let bTextContent = bTags[j].textContent;
                        if (bTextContent.endsWith('.')){ // 适配真人男从名称加点的修改
                            bTextContent = bTextContent.substr(0, bTextContent.length - 1);
                        }
                        if (name2url[bTextContent]){
                            let aElement = document.createElement('a');
                            aElement.href = 'thread-'+name2url[bTextContent]+'-1-1.html';
                            aElement.textContent = bTextContent;
                            aElement.target = '_blank';
                            bTags[j].textContent = '';
                            bTags[j].appendChild(aElement);
                            break;
                        }
                    }
                }
            }
        }
        return 0;
    }

    // 页面加载完再执行
    window.onload=function(){
        if (reg.test(window.location.href) || reg2.test(window.location.href)){
            addHref();
        }
        else{
            modifyHref();
            modifyTagB();
        }
    }
})();