// ==UserScript==
// @name     SCRIPT | КФ | P.Hellsing
// @namespace    http://tampermonkey.net/
// @version      1.01
// @description  SCRIPT для Кураторов форума
// @author       Hellsing
// @match    https://forum.blackrussia.online/threads/*
// @icon     https://sun9-3.userapi.com/impg/GZy29ANLWXVTMSVKo3QHE10eGbWldcLUa2S7eA/tSGyZ25sYU8.jpg?size=2560x2560&quality=95&sign=06e2ed62b4c0f981ab3a6f90be84892c&type=album
// @grant    none
// @license    MIT
// @downloadURL https://update.greasyfork.org/scripts/527967/SCRIPT%20%7C%20%D0%9A%D0%A4%20%7C%20PHellsing.user.js
// @updateURL https://update.greasyfork.org/scripts/527967/SCRIPT%20%7C%20%D0%9A%D0%A4%20%7C%20PHellsing.meta.js
// ==/UserScript==

(function () {
    'use strict';
const UNACCEPT_PREFIX = 4; // префикс отказано
const ACCEPT_PREFIX = 8; // префикс одобрено
const PIN_PREFIX = 2; //  префикс закрепить
const SPECADM_PREFIX = 11; // специальному администратору
const MAINADM_PREFIX = 12; // главному адамнистратору
const CLOSE_PREFIX = 7;
const TEXY_PREFIX = 13;
const REALIZOVANO_PREFIX = 5;
const VAJNO_PREFIX = 1;
const OJIDANIE_PREFIX = 14;
const OTKAZBIO_PREFIX = 4;
const ODOBRENOBIO_PREFIX = 8;
const NARASSMOTRENIIBIO_PREFIX = 2;
const PREFIKS = 0;
const KACHESTVO = 15;
const RASSMOTRENO_PREFIX = 9;
const OTKAZRP_PREFIX = 4;
const ODOBRENORP_PREFIX = 8;
const NARASSMOTRENIIRP_PREFIX = 2;
const OTKAZORG_PREFIX = 4;
const ODOBRENOORG_PREFIX = 8;
const NARASSMOTRENIIORG_PREFIX = 2;
const buttons = [
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️Раздел жалоб на игроков⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},

{
    title: '⌛️На рассмотрение⌛️',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Взято на рассмотрение.[/CENTER]<br>"+
    '[CENTER]Ожидайте.[/CENTER][/FONT]',
    prefix: PIN_PREFIX,
    status: true,
},
{
    title: '💻Передача Теху💻',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[FONT=GEORGIA][CENTER]Ваша жалоба передана [COLOR=BLUE]Техническому специалисту.[/COLOR][/CENTER]<br>'+
    '[CENTER][COLOR=WHITE]Ожидайте ответа.[/COLOR][/CENTER][/FONT]',
    prefix: TEXY_PREFIX,
    status: true,
},
{
    title: '🔱Передача ГКФ🔱',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша жалоба передана [COLOR=BLUE]Главному Куратору Форума.[/URL][/COLOR][/CENTER]<br>'+
    '[CENTER][COLOR=WHITE]Ожидайте.[/COLOR][/CENTER][/FONT]',
    prefix: PIN_PREFIX,
    status: true,
},
{
    title: '✅Получит соответствующее наказание✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Игрок получит соответствующее наказание.[/CENTER]<br>"+
    '[CENTER]Одобрено, закрыто.[/CENTER][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '❌В тех. раздел❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Ваша тема не имеет никакого отношения к данному разделу, обратитесь в [URL=https://forum.blackrussia.online/forums/%D0%A2%D0%B5%D1%85%D0%BD%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9-%D1%80%D0%B0%D0%B7%D0%B4%D0%B5%D0%BB-volgograd.1758/][COLOR=BLUE]технический раздел.[/COLOR][/URL][/CENTER]<br>"+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️Отказ жалоб на игроков⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},
{
    title: '❌Заголовок❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Заголовок жалобы указан не по форме, в связи с этим рассмотрению не подлежит.<br>Внимательно ознакомьтесь с [URL=forum.blackrussia.online/threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1-%D0%BD%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%BE%D0%B2.3429394/][COLOR=BLUE]правилами составления жалоб на игроков.[/URL][/COLOR][/CENTER]<br>"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Жб не по форме❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Жалоба составлена не по форме, в связи с этим рассмотрению не подлежит. <br>Внимательно ознакомьтесь с [URL=forum.blackrussia.online/threads/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%B6%D0%B0%D0%BB%D0%BE%D0%B1-%D0%BD%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA%D0%BE%D0%B2.3429394/][COLOR=BLUE]правилами составления жалоб на игроков.[/URL][/COLOR][/CENTER]<br>"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нет в логах❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]В процессе проверки системы логирования, нарушений от данного игрока выявлено не было.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нет тайма❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]На Ваших доказательствах отсутствует /time, в связи с этим рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Не видно тайм❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]На Ваших доказательствах не удаётся полностью разглядеть дату и время после ввода команды /time, в связи с этим рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нет таймкодов❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Если видео-доказательство длится более 3 минут, требуется указать тайм-коды, в связи с этим, рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нет условий сделки❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]На Ваших доказательствах отсутствуют условия сделки, в связи с этим рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Неправильные условия сделки❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]На Ваших доказательствах условия сделки являются некорректными, в связи с этим рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Дубликат темы❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Данная тема является дубликатом, при повторном дублировании данной темы Ваш форумный аккаунт может быть заблокирован.[/CENTER]<br>"+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌3+ Дня❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]С момента нарушения прошло более 72-ух часов, в связи с этим рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Док-ва с соц.сетей не принимаются❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Доказательства с соц.сетей, не принимаются.<br>Загрузите их на медиа-хостинг [URL='https://yapx.ru/'][COLOR=BLUE]yapx.ru[/COLOR][/URL], [URL='https://imgur.com/'][COLOR=BLUE]imgur.com[/COLOR][/URL], [URL='https://www.youtube.com/'][COLOR=BLUE]youtube.com[/COLOR][/URL],[URL='https://imgbb.com'][COLOR=BLUE]ImgBB.com[/COLOR][/URL][/CENTER]<br>"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Жб от 3-го лица❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]В связи с тем, что Вы являетесь третьим лицом, рассмотрению не подлежит.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Ответ был дан ранее❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Ответ был дан в предыдущей теме, при повторном дублировании данной темы Ваш форумный аккаунт может быть заблокирован.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нет нарушений❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]В процессе рассмотрения жалобы, нарушений от игрока не было выявлено.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Недостаточно док-в❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Доказательств, приложенные в теме, недостаточно, дабы опровергнуть нарушение от игрока.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нерабочие док-ва❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Ссылка на доказательства неработоспособна, перепроверьте правильность и работоспособность ссылки, и напишите жалобу повторно, прикрепив ссылку на доказательства.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Док-ва отредактированы❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Доказательства подвергнуты редактированию, в связи с этим жалоба рассмотрению не подлежит.[/CENTER]<br>"+
    "[CENTER]Создайте новую жалобу, прикрепив доказательства в первоначальном виде.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Фрапс обрывается❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Видео-доказательства, прикреплённые в жалобе обрываются, в связи с этим рассмотрению не подлежит.[/CENTER]<br>"+
    "[CENTER]Создайте новую жалобу, прикрепив доказательства в первоначальном виде, на видео--хостинге [URL='https://www.youtube.com/'][COLOR=BLUE]youtube.com[/COLOR][/URL].[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нужен фрапс❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Доказательств, приложенные в теме, недостаточно, дабы опровергнуть нарушение от игрока, требуется видео-доказательства.[/CENTER]"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Нету док-в❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]В жалобе отсутствуют доказательства на нарушение от игрока, в связи с этим рассмотрению не подлежит.[/CENTER]<br>"+
    "[CENTER]Создайте новую жалобу, прикрепив доказательства на нарушение игрока.[/CENTER]<br>"+
    '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Долг через трейд❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Передача игровой валюты в долг была произведена с помощью трейда, согласно пункту [URL=https://forum.blackrussia.online/threads/%D0%9E%D0%B1%D1%89%D0%B8%D0%B5-%D0%BF%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D1%81%D0%B5%D1%80%D0%B2%D0%B5%D1%80%D0%BE%D0%B2.312571/#:~:text=2.57.%20%D0%97%D0%B0%D0%BF%D1%80%D0%B5%D1%89%D0%B0%D0%B5%D1%82%D1%81%D1%8F,%D0%B1%D1%83%D0%B4%D1%83%D1%82%20%D1%81%D1%87%D0%B8%D1%82%D0%B0%D1%82%D1%8C%D1%81%D1%8F%20%D0%B4%D0%BE%D0%BA%D0%B0%D0%B7%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D1%82%D0%B2%D0%B0%D0%BC%D0%B8.][COLOR=BLUE]общих правил серверов 2.57;[/COLOR][/URL] игрок наказывается только в том случае, если игровая валюта была переведена на банковский счёт, в связи с этим жалоба рассмотрению не подлежит.[/CENTER]"+
     '[COLOR=WHITE][CENTER]Отказано, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️Правила игровых чатов⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},
{
    title: '✅CAPSLOCK✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.02. [/color]Запрещено использование верхнего регистра (CapsLock) при написании любого текста в любом чате [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Оск в НРП чаты✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.03. [/color]Любые формы оскорблений, издевательств, расизма, дискриминации, религиозной враждебности, сексизма в OOC чате запрещены [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Упом. оск. родни✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.04. [/color]Запрещено оскорбление или косвенное упоминание родных вне зависимости от чата (IC или OOC) [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 7 - 15 дней[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅FLOOD✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.05. [/color]Запрещен флуд — 3 и более повторяющихся сообщений от одного и того же игрока [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Злоуп. символами✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.06. [/color]Запрещено злоупотребление знаков препинания и прочих символов [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Слив глоб. чатов✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.08. [/color]Запрещены любые формы «слива» посредством использования глобальных чатов [COLOR=rgb(255, 0, 0)]| PermBan[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Выдача себя за адм✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.10. [/color]Запрещена выдача себя за администратора, если таковым не являетесь [COLOR=rgb(255, 0, 0)]| Ban 7 - 15[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Ввод в заблуждение командами✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.11. [/color]Запрещено введение игроков проекта в заблуждение путем злоупотребления командами [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Нарушение в REP✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.12. [/color]Запрещено подавать репорт, написанный транслитом, с сообщением не по теме (Offtop), с включённым Caps Lock, с использованием нецензурной брани, и повторять обращение (если ответ уже был дан ранее) [COLOR=rgb(255, 0, 0)]| Report Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Музыка в VOICE✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.14. [/color]Запрещено включать музыку в Voice Chat [COLOR=rgb(255, 0, 0)]| Mute 60 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Шум в VOICE✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.16. [/color]Запрещено создавать посторонние шумы или звуки [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Политика/Религия✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.18. [/color]Запрещено политическое и религиозное пропагандирование, а также провокация игроков к конфликтам, коллективному флуду или беспорядкам в любом из чатов [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 10 дней[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Софт для голоса✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.19. [/color]Запрещено использование любого софта для изменения голоса [COLOR=rgb(255, 0, 0)]| Mute 60 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Транслит✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.20. [/color]Запрещено использование транслита в любом из чатов [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Реклама промо✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.21. [/color]Запрещается реклама промокодов в игре, а также их упоминание в любом виде во всех чатах. [COLOR=rgb(255, 0, 0)]| Ban 30 дней[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Объявления на территории ГОСС✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.22. [/color]Запрещено публиковать любые объявления в помещениях государственных организаций вне зависимости от чата (IC или OOC) [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Мат в VIP✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]3.23. [/color]Запрещено использование нецензурных слов, в том числе завуалированных и литературных в VIP чате [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/COLOR][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️Правила RolePlay процесса⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},
{
    title: '✅nRP поведение✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.01. [/color]Запрещено поведение, нарушающее нормы процессов Role Play режима игры [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅ОРП✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.02. [/color]Запрещено целенаправленно уходить от Role Play процесса всеразличными способами [COLOR=rgb(255, 0, 0)]| Jail 30 минут / Warn[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅nRP вождение✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.03. [/color]Запрещен NonRP Drive — вождение любого транспортного средства в невозможных для него условиях, а также вождение в неправдоподобной манере [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Помеха RP процессу+дально/инко✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.04. [/color]Запрещены любые действия способные привести к помехам в игровом процессе, а также выполнению работ, если они этого не предусматривают и если эти действия выходят за рамки игрового процесса данной работы. [COLOR=rgb(255, 0, 0)]| Ban 10 дней / Обнуление аккаунта (при повторном нарушении)[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅nRP обман/попытка✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.05. [/color]Запрещены любые OOC обманы и их попытки, а также любые IC обманы с нарушением Role Play правил и логики [COLOR=rgb(255, 0, 0)]| PermBan[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅AFK без паузы✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.07. [/color]Запрещено нахождение в AFK без включенного ESC, создавая помеху другим игрокам [COLOR=rgb(255, 0, 0)]| Kick[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Слив склада✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.09. [/color]Запрещено сливать склад фракции / семьи путем взятия большого количества ресурсов или превышая допустимый лимит, установленный лидером [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Обман в /do✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.10. [/color]Запрещено в любой форме обманывать в /do, даже если это в дальнейшем негативно скажется на Вашем игровом персонаже [COLOR=rgb(255, 0, 0)]| Jail 30 минут / Warn[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Орг. транспорт в личных целях✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.11. [/color]Запрещено использование рабочего или фракционного транспорта в личных целях [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Затягивание RP✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.12. [/color]Запрещено целенаправленное затягивание Role Play процесса [COLOR=rgb(255, 0, 0)]| Jail 30 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅DB✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.13. [/color]Запрещен DB (DriveBy) — намеренное убийство / нанесение урона без веской IC причины на любом виде транспорта [COLOR=rgb(255, 0, 0)]| Jail 60 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅TK✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.15. [/color]Запрещен TK (Team Kill) — убийство члена своей или союзной фракции, организации без наличия какой-либо IC причины [COLOR=rgb(255, 0, 0)]| Jail 60 минут / Warn (за два и более убийства)[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅SK✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.16. [/color]Запрещен SK (Spawn Kill) — убийство или нанесение урона на титульной территории любой фракции / организации, на месте появления игрока, а также на выходе из закрытых интерьеров и около них [COLOR=rgb(255, 0, 0)]| Jail 60 минут / Warn (за два и более убийства)[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅MG✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.18. [/color]Запрещен MG (MetaGaming) — использование ООС информации, которую Ваш персонаж никак не мог получить в IC процессе [COLOR=rgb(255, 0, 0)]| Mute 30 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅DM✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4]2.19. Запрещен DM (DeathMatch) — убийство или нанесение урона без веской IC причины [COLOR=rgb(255, 0, 0)]| Jail 60 минут[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅TDM✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.20. [/color]Запрещен Mass DM (Mass DeathMatch) — убийство или нанесение урона без веской IC причины трем игрокам и более [COLOR=rgb(255, 0, 0)]| Warn / Ban 3 - 7 дней[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Стороннее ПО✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.22. [/color]Запрещено хранить / использовать / распространять стороннее программное обеспечение или любые другие средства, позволяющие получить преимущество над другими игроками [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Сокрытие багов✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.23. [/color]Запрещено скрывать от администрации баги системы, а также распространять их игрокам | [COLOR=rgb(255, 0, 0)]Ban 15 - 30 дней / PermBan[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Сокрытие нарушителей от адм✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.24. [/color]Запрещено скрывать от администрации нарушителей или злоумышленников [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan + ЧС проекта[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Вред репутации проекта✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.25. [/color]Запрещены попытки или действия, которые могут навредить репутации проекта [COLOR=rgb(255, 0, 0)]| PermBan + ЧС проекта[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Слив админ-инфы✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.27. [/color]Запрещено распространение информации и материалов, непосредственно связанных с деятельностью администрации проекта, которые могут повлиять на работу и систему администрации [COLOR=rgb(255, 0, 0)]| PermBan + ЧС проекта[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Реклама каналов✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.31. [/color]Запрещено рекламировать на серверах любые проекты, серверы, сайты, сторонние Discord-серверы, YouTube каналы и тому подобное [COLOR=rgb(255, 0, 0)]| Ban 7 дней / PermBan[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Обман адм✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.32. [/color]Запрещено введение в заблуждение, обман администрации на всех ресурсах проекта [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 дней[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Исп. уязвимость правил✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.33. [/color]Запрещено пользоваться уязвимостью правил [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Розжиг межнац. конфликта✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.35. [/color]На игровых серверах запрещено устраивать IC и OOC конфликты на почве разногласия о национальности и / или религии совершенно в любом формате [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 7 дней[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅OOC угрозы✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
     "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.37. [/color]Запрещены OOC-угрозы, в том числе и завуалированные, а также угрозы наказанием со стороны администрации [COLOR=rgb(255, 0, 0)]| Mute 120 минут / Ban 7 - 15 дней[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Распростр. личной инфы✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.38. [/color]Запрещено распространять личную информацию игроков и их родственников [COLOR=rgb(255, 0, 0)]| Ban 15 - 30 дней / PermBan + ЧС проекта[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Злоуп. нарушениями✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.39. [/color]Злоупотребление нарушениями правил сервера [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 дней.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Критика проекта✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.40. [/color]Запрещены совершенно любые деструктивные действия по отношению к проекту: неконструктивная критика, призывы покинуть проект, попытки нарушить развитие проекта или любые другие действия, способные привести к помехам в игровом процессе [COLOR=rgb(255, 0, 0)]| Mute 300 минут / Ban 30 дней (Ban выдается по согласованию с главным администратором).[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅nRP сон✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.44. [/color]На серверах проекта запрещен Role Play сон (нахождение в AFK без ESC) [COLOR=rgb(255, 0, 0)]| Kick.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅ЕПП✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.46. [/color]Запрещено ездить по полям на любом транспорте [COLOR=rgb(255, 0, 0)]| Jail 30 минут.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅ЕПП дально/инко✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.47. [/color]Запрещено ездить по полям на грузовом транспорте, инкассаторских машинах (работа дальнобойщика, инкассатора) [COLOR=rgb(255, 0, 0)]| Jail 60 минут.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Арест в интерьере✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.50. [/color]Запрещены задержания, аресты, а также любые действия со стороны игроков, состоящих во фракциях в интерьере аукциона, казино, а также во время системных мероприятий [COLOR=rgb(255, 0, 0)]| Ban 7 - 15 дней + увольнение из организации.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅nRP аксессуар✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.52. [/color]Запрещено располагать аксессуары на теле персонажа, нарушая нормы морали и этики, увеличивать аксессуары до слишком большого размера. [COLOR=rgb(255, 0, 0)]| При первом нарушении - обнуление аксессуаров, при повторном нарушении - обнуление аксессуаров + JAIL 30 минут.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Оск. адм✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.54. [/color]Запрещено неуважительное обращение, оскорбление, неадекватное поведение, угрозы в любом их проявлении по отношению к администрации [COLOR=rgb(255, 0, 0)]| Mute 180 минут.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '✅Багоюз анимаций✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Нарушитель будет наказан по пункту правил:[QUOTE][SIZE=4][color=red]2.55. [/color]Запрещается багоюз связанный с анимацией в любых проявлениях. [COLOR=rgb(255, 0, 0)]| Jail 60 / 120 минут.[/QUOTE][/CENTER]"+
    '[COLOR=WHITE][CENTER]Одобрено, закрыто.[/CENTER][/COLOR][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️RP Биографии⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},
{
    title: '✅Одобрено✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay биография одобрена.[/CENTER]<br>'+
    '[CENTER]Одобрено, закрыто.[/CENTER][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Отказано❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay биография отказана.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Заголовок❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Заголовок Вашей RolePlay биографии составлен не по форме, в связи с этим рассмотрению не подлежит.<br>Внимательно ознакомьтесь с [URL=https://forum.blackrussia.online/threads/volgograd-%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%A0%D0%9F-%D0%B1%D0%B8%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D0%B9.8278259/][COLOR=BLUE]правилами подачи RolePlay биографий[/COLOR][/URL][/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Не по форме❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay биография составлена не по форме, в связи с этим рассмотрению не подлежит.<br>Внимательно ознакомьтесь с [URL=https://forum.blackrussia.online/threads/volgograd-%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-%D0%A0%D0%9F-%D0%B1%D0%B8%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D0%B9.8278259/][COLOR=BLUE]правилами подачи RolePlay биографий[/COLOR][/URL][/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Мало инфы❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]В Вашей RolePlay биографии недостаточно информации, в связи с этим отказано.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Дата рождения не сходится❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Дата рождения не сходится с возрастом, либо написана не полностью.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Копипаст❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay биография скопирована или слишком схожа с одной из уже существующих.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Первое лицо❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay биография написана от первого лица.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌ПГ❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]В Вашей RolePlay биографии, персонажу присвоены нереальные способности.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Ошибки❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]В Вашей RolePlay биографии присутствуют грамматические/орфографические ошибки.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Не относится к разделу❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    "[CENTER]Ваша тема не имеет никакого отношения к данному разделу.[/CENTER]<br>"+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Неадекватная биография❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]В Вашей RolePlay биографии присутствует нецензурная брань/оскорбления.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️RP Ситуации⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},
{
    title: '✅Одобрено✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay ситуация одобрена.[/CENTER]<br>'+
    '[CENTER]Одобрено, закрыто.[/CENTER][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Не по форме❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay ситуация составлена не по форме, в связи с этим рассмотрению не подлежит.<br>Внимательно ознакомьтесь с [URL=https://forum.blackrussia.online/threads/volgograd-%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%B0-%D0%BF%D0%BE%D0%B4%D0%B0%D1%87%D0%B8-roleplay-%D1%81%D0%B8%D1%82%D1%83%D0%B0%D1%86%D0%B8%D0%B9.8278271/][COLOR=BLUE]правилами подачи RolePlay ситуаций.[/COLOR][/URL][/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Отказано❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay ситуация отказана.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
                                                  title: 'ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ⚠️RP Организации⚠️ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠ ᅠᅠ ᅠ',
},
{
    title: '✅Одобрено✅',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay организация одобрена.[/CENTER]<br>'+
    '[CENTER]Одобрено, закрыто.[/CENTER][/FONT]',
    prefix: ACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Не по форме❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay организация составлена не по форме, в связи с этим рассмотрению не подлежит.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
{
    title: '❌Отказано❌',
    content:
    '[SIZE=4][FONT=GEORGIA][CENTER]Доброго времени суток.[/CENTER]<br>'+
    '[CENTER]Ваша RolePlay организация отказана.[/CENTER]<br>'+
    '[CENTER]Отказано, закрыто.[/CENTER][/FONT]',
    prefix: UNACCEPT_PREFIX,
    status: false,
},
];
    $(document).ready(() => {
    // Загрузка скрипта для обработки шаблонов
    $('body').append('<script src="https://cdn.jsdelivr.net/npm/handlebars@latest/dist/handlebars.js"></script>');
    // Добавление кнопок при загрузке страницы
    addButton('⌛️На рассмотрение⌛️', 'pin');
    addButton('❌Отказано❌', 'unaccept');
    addButton('✅Одобрено✅', 'accepted');
    addButton('💻Теху💻', 'Texy');
    addButton('🔱Главному Администратору🔱', 'mainadm');
    addButton('❌Отказано❌', 'Zakrito');
    addButton('✅Рассмотрено✅', 'Rassmotreno');
    addButton('💤Ожидание💤', 'Ojidanie');
    addButton('❌Без префикса❌', 'Prefiks');
    addButton('🌐Ответы🌐', 'selectAnswer');
    // Поиск информации о теме
    const threadData = getThreadData();
    $('button#unaccept').click(() => editThreadData(UNACCEPT_PREFIX, false));
    $('button#pin').click(() => editThreadData(PIN_PREFIX, true));
    $('button#accepted').click(() => editThreadData(ACCEPT_PREFIX, false));
    $('button#specadm').click(() => editThreadData(SPECADM_PREFIX, true));
    $('button#mainadm').click(() => editThreadData(MAINADM_PREFIX, true));
    $('button#Texy').click(() => editThreadData(TEXY_PREFIX, false));
    $('button#Zakrito').click(() => editThreadData(CLOSE_PREFIX, false));
    $('button#watched').click(() => editThreadData(WATCHED_PREFIX, false));
    $('button#decided').click(() => editThreadData(DECIDED_PREFIX, false));
    $('button#Resheno').click(() => editThreadData(RESHENO_PREFIX, false));
    $('button#Zakrito').click(() => editThreadData(CLOSE_PREFIX, false));
    $('button#Realizovano').click(() => editThreadData(REALIZOVANO_PREFIX, false));
    $('button#Vajno').click(() => editThreadData(VAJNO_PREFIX, false));
    $('button#Rassmotreno').click(() => editThreadData(RASSMOTRENO_PREFIX, false));
    $('button#Ojidanie').click(() => editThreadData(OJIDANIE_PREFIX, false));
    $('button#Prefiks').click(() => editThreadData(PREFIKS, false));
    $('button#Kachestvo').click(() => editThreadData(KACHESTVO, false));
    $(`button#selectAnswer`).click(() => {
    XF.alert(buttonsMarkup(buttons), null, 'Выберите ответ:');
    buttons.forEach((btn, id) => {
    if (id > 0) {
    $(`button#answers-${id}`).click(() => pasteContent(id, threadData, true));
    }
    else {
    $(`button#answers-${id}`).click(() => pasteContent(id, threadData, false));
    }
    });
    });
    });
    function addButton(name, id) {
    $('.button--icon--reply').before(
    `<button type="button" class="button rippleButton" id="${id}" style="margin: 3px;">${name}</button>`,
    );
    }
    function buttonsMarkup(buttons) {
    return `<div class="select_answer">${buttons
    .map(
    (btn, i) =>
    `<button id="answers-${i}" class="button--primary button ` +
    `rippleButton" style="margin:5px"><span class="button-text">${btn.title}</span></button>`,
    )
    .join('')}</div>`;
    }
    function pasteContent(id, data = {}, send = false) {
    const template = Handlebars.compile(buttons[id].content);
    if ($('.fr-element.fr-view p').text() === '') $('.fr-element.fr-view p').empty();
    $('span.fr-placeholder').empty();
    $('div.fr-element.fr-view p').append(template(data));
    $('a.overlay-titleCloser').trigger('click');
    if (send == true) {
    editThreadData(buttons[id].prefix, buttons[id].status);
    $('.button--icon.button--icon--reply.rippleButton').trigger('click');
    }
    }
    function getThreadData() {
    const authorID = $('a.username')[0].attributes['data-user-id'].nodeValue;
    const authorName = $('a.username').html();
    const hours = new Date().getHours();
    return {
    user: {
    id: authorID,
    name: authorName,
    mention: `[USER=${authorID}]${authorName}[/USER]`,
    },
    greeting: () =>
    4 < hours && hours <= 11 ?
    'Доброе утро' :
    11 < hours && hours <= 15 ?
    'Добрый день' :
    15 < hours && hours <= 21 ?
    'Добрый вечер' :
    'Доброй ночи',
    };
    }
    function editThreadData(prefix, pin = false) {
    // Получаем заголовок темы, так как он необходим при запросе
    const threadTitle = $('.p-title-value')[0].lastChild.textContent;

    if (pin == false) {
    fetch(`${document.URL}edit`, {
    method: 'POST',
    body: getFormData({
    prefix_id: prefix,
    title: threadTitle,
    _xfToken: XF.config.csrf,
    _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
    _xfWithData: 1,
    _xfResponseType: 'json',
    }),
    }).then(() => location.reload());
    }
    if (pin == true) {
    fetch(`${document.URL}edit`, {
    method: 'POST',
    body: getFormData({
    prefix_id: prefix,
    title: threadTitle,
    sticky: 1,
    _xfToken: XF.config.csrf,
    _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
    _xfWithData: 1,
    _xfResponseType: 'json',
    }),
    }).then(() => location.reload());
    }
    }
    function getFormData(data) {
    const formData = new FormData();
    Object.entries(data).forEach(i => formData.append(i[0], i[1]));
    return formData;
    }
    })();