// ==UserScript==
// @name        ARZ Helper by harley
// @namespace   https://forum.arizona-rp.com/
// @match       https://forum.arizona-rp.com/*
// @grant       none
// @version     xz version
// @author      by harley vk.com/work.alekseevich
// @description vk.com/work.alekseevich
// @license MIT
// @downloadURL https://update.greasyfork.org/scripts/530006/ARZ%20Helper%20by%20harley.user.js
// @updateURL https://update.greasyfork.org/scripts/530006/ARZ%20Helper%20by%20harley.meta.js
// ==/UserScript==

var gosButtonname = "ЖБ на гос";
var buttonname = "ЖБ на несост";
var newButtonName = "ЖБ на адм";
var settingsButtonName = "Настройки";
var version = "xz version";
const RASMOTR_PREFIX = 15; // на рассмотрении
const DORABOTKA_PREFIX = 15; // на рассмотрении
const ACCEPT_PREFIX = 17; // рассмотрено
const DOWN_PREFIX = 18; // отказано
const RULES_LIST = [
  "Запрещено использовать любые скрипты, моды или иные конструкции, дающие преимущество над другими игроками: Бан от 1 до 2000 дней",
  "Запрещено распространять любые скрипты, моды или иные конструкции, дающие преимущество над другими игроками: Бан от 1 до 2000 дней",
  "Запрещено находиться в игре на 2 аккаунтах с 1 устройства: Устное предупреждение / Бан от 1 до 15 дней",
  "Запрещено уходить от наказания (Офф, смена ника и т.п.): Варн / Бан от 1 до 15 дней",
  "Запрещено выдавать себя за администратора: Мут от 30 до 300 минут / Бан от 1 до 5 дней",
  "Запрещено создавать помеху игрокам или администрации: Устное предупреждение / Спавн / Кик / Деморган от 5 до 60 минут",
  "Запрещено использовать недоработки мода или игры: Деморган 10 минут - Бан 2000 дней (на усмотрение главной администрации в зависимости от тяжести нарушения)",
  "Запрещено описание персонажа в т.ч. афк, визитка, нарушающее РП режим, а также неадекватное, бредовое, содержащее рекламу бизнесов  продажи (покупки) имущества: Очистка описания, неоднократно - Бан от 1 до 3 дней",
  "Запрещено воспроизводить запрещенные материалы в кинотеатрах: Бан от 1 до 30 дней.",
  "Запрещено крутить внеигровые рулетки: Бан от 7 до 30 дней",
  "Запрещено неадекватное расположение аксессуаров персонажа, вследствие изменения их местоположения: Устное предупреждение / Очистка всех аксессуаров / Бан от 1 до 5 дней",
  "Запрещено взаимодействовать с игроками, находящимися в чёрном списке сервера/проекта: Бан от 30 до 2000 дней Обнуление аккаунта (по решению ГА)",
  "Запрещен деанон игроков на сервере и ресурсах проекта: Пресечение нарушения / Бан от 30 до 2000 дней / Обнуление аккаунта (по решению ГА)",
  "Запрещены угрозы расправой в реальной жизни на сервере и ресурсах проекта: Бан от 15 до 2000 дней",
  "Запрещено передавать свой игровой аккаунт, а также заходить на чужие (в т.ч. взлом): Бан на 2000 дней",
  "Запрещен обход систем мода с целью получения личной выгоды: Бан от 1 до 2000 дней",
  "Запрещена любая накрутка игровых ценностей (рефералы, рулетки, голоса, деньги и т.д): Бан от 30 до 2000 дней",
  "Запрещено вредительство в любом виде: Бан от 15 до 2000 дней",
  "Запрещено иметь более 3-х активных аккаунтов на одном сервере: Бан от 15 до 2000 дней / Обнуление аккаунтов",
  "Запрещено использование /demoute, /dismiss, /gwarn и подобных команд без объективных причин и наличия доказательств: Варн / Бан от 5 до 30 дней",
  "Никнейм игрока должен иметь формат Имя_Фамилия. Запрещено использовать никнейм с отсутствием смысловой нагрузки (Спам символами/числами, а так же ники, не имеющие логической связи с именем).",
  "Создавая аккаунт с non-RP ником Вы должны осознавать, что получить повышение в организациях Вам не представится возможности, в большинстве случаев Вас вообще откажутся принять.",
  "При вступлении в определенную организацию вас могут попросить сменить ник, т.к. Ваш существующий может не соответствовать требованиям данной организации.",
  "Запрещено использовать в нике оскорбительные слова, маты: Просьба сменить никнейм, в случае отказа - Бан",
  "Запрещено искажать в оскорбительной форме ники игроков и администраторов: Просьба сменить никнейм, в случае отказа - Бан",
  "Запрещено использование фейк ников администрации, ютуберов, игроков высокого уровня данного сервера: Просьба сменить никнейм, в случае отказа - Бан",
  "Администрация не несет ответственности за утерянное имущество аккаунта в случае скачивания вами запрещенного софта, а также модов, тематических программ, взлома и так далее.",
  "Администрация не имеет права запрашивать такую информацию, как пароль от аккаунта.",
  "Администрация вне зависимости от уровня должна отвечать на репорт при наличии очереди.",
  "Администратору нельзя нарушать любые правила проекта, включая правила чатов (имеются исключения).",
  "Администратор обязан соблюдать требования от главной администрации, которые могут дополнять данные правила",
  "Администратор может быть назначен путем обзвона (собеседования) или через полный срок на посту лидера (не менее 25 дней при идеальной работе илии не менее 15 дней при полном взятии гетто/бизнесов).",
  "Администратор может быть восстановлен на пост в течении 150 дней после ухода, но не раньше, чем через 30. В течении 90 дней восстановление возможно с -1 админ-уровнем, затем только на 1 админ-уровень. После истечение срока требуется заново отстоять пост лидера или пройти специальный обзвон (собеседование).",
  "Главная администрация самостоятельно определяет состав админов: имеет право снять администратора, отказать в назначении/восстановлении без объяснения причины или выставить дополнительные требования.",
  "Администратор может быть заблокирован при снятии с поста или занесен в ЧС. Возможные причины для блокировки обычно озвучиваются при постановлении, но наиболее частые: нарушение испытательного срока или правил проекта.",
  "Администратор обязан уважительно относиться к игрокам в игре и за ее пределами.",
  "Администратор является нонРП персонажем в игровом мире, не может препятствовать или мешать RP-процессу.",
  "Администрация не может принимать участие в слетах имущества.",
  "Администрации нельзя иметь любое имущество за пределами админ-зоны, кроме транспорта",
  "Администратор не может экономически взаимодействовать с обычными игроками, кроме специально отведенных для этого систем",
  "Администрация может получать подарки со стороны игроков в одностороннем виде - не оказывая никаких услуг в ответ, но только если главный администратор это разрешает.",
  "Администрации разрешено использовать только стандартное описание персонажа, включая АФК-описание",
  "Администрации запрещено играть с твинков на своем сервере",
  "Администрации запрещено ставить провокационные реакции на сообщения других игроков на форуме",
  "Администратору запрещено превышать норму АФК, установленную главной администрацией. Также запрещено систематическое нахождение в АФК, уход в АФК при большой очереди в репорт.",
  "Администрации запрещено проходить праздничные квесты в первые дни обновления, а также в прайм-тайм.",
  "Администрации запрещено выпрашивать любые поощрения у игроков",
  "Администратор вправе отказать игроку в предоставлении каких-либо услуг/одолжений, нарушающих RP режим игры (выдача ХП, машин, денег и т.п.).",
  "Администрация любого уровня имеет право записывать и выкладывать админ-контент. Перед публикацией видеоролика следует получить одобрение от главной администрации",
  "Администратор оставляет за собой право выбирать наказание, ориентируясь на тяжесть содеянного (в пределах нормы).",
  "Администратор имеет право наказать игрока в течение 5-ти дней, после совершенного игроком нарушения [В случае подачи жалобы].",
  "Игрок, который зафиксировал нарушение со стороны администрации или желающий обжаловать любое наказание, имеет право подать жалобу на форум в раздел «Жалобы на администрацию» с соблюдением соответствующих правил подачи.",
  "Администрация обязана хранить доказательства на нарушения игрока в течении возможного срока подачи жалобы.",
  "Запрещен ДМ (от англ. Deathmatch) - нанесение урона игрокам без причины: Деморган 60-120 минут",
  "Запрещен ДБ (от англ. DriveBy) - нанесение урона машиной / из машины: Деморган 60-120 минут",
  "Запрещен СК (от англ. Spawn Kill) - нанесение урона на респауне: Деморган 60-120 минут",
  "Запрещен ТК (от англ. Team Kill) - нанесение урона союзникам / членам своей фракции: Деморган 60-120 минут",
  "Запрещен ПГ (от англ. Power Gaming) - изображение из себя супергероя, например нападение с кулаками на вооруженного человека: Деморган 60-120 минут",
  "Запрещен массовый (неоднократный - от 3 пострадавших) ДМ/ДБ/СК/ТК: Бан 3-7 дней + запрет использования оружия/транспорта на 3-10 дней",
  "Запрещено нонРП поведение (от англ. Not Role Play) - поведение, которое нарушает реализм и логику игрового мира: без фракции: 10-120 дмг, фракция: 10-600 дмг / варн",
  "Запрещен ОФФ / АФК / Отказ от РП ситуации: Деморган 60-120 минут",
  "Запрещен ОФФ / АФК / Инта / Уход в ЗЗ / Аксессуары от смерти: Деморган 60-120 минут",
  "Запрещен ОФФ / АФК / Инта / Уход в ЗЗ / Аксессуары от ареста: Варн",
  "Запрещен сбив любых системных анимаций: Деморган 30-120 минут",
  "Запрещен сбив анимации выстрела любым способом: Деморган 60-120 минут / Варн",
  "Запрещено использование средств пополнения здоровья/бронежилета в бою: Деморган 60-120 минут / Варн",
  "Запрещены серьезные нарушения в ТСР (ДМ, ПГ, сбивы и т.п): Варн / Увеличение срока",
  "Запрещен МГ (от англ. Meta Gaming) - использование знаний, которые персонаж не может знать: Мут 10-30 минут",
  "Запрещен капс - написание слов заглавными буквами: Мут 10-30 минут",
  "Запрещен флуд - отправка 3 и более одинаковых строк за 10 секунд: Мут 20-120 минут",
  "Запрещено злоупотребление матом в нонРП чатах: Мут 30-120 минут",
  "Запрещено злоупотребление символами (спам): Мут 10-120 минут",
  "Запрещен розжиг - разжигание вражды, ненависти или конфликта: Мут 120-300 минут / Бан 1-5 дней",
  "Запрещена реклама пабликов, серверов, промокодов и т. д.: Мут 60-300 минут",
  "Запрещена реклама сторонних платформ с продажей игровой валюты, аккаунтов и имущества: Бан 2000 дней",
  "Запрещено затрагивание родных: Упоминание - Мут 300 минут / Бан 1-30 дней",
  "Запрещено оскорбление родных: Бан 10-30 дней",
  "Запрещено пожелание смерти родным: Бан 10-30 дней",
  "Запрещен оффтоп в /report: Мут репорта 10-30 минут",
  "Запрещено оскорбление сервера/проекта: Мут 60-300 минут / Бан 1-3 дня",
  "Запрещено оскорбление игроков/администрации: Мут 30-300 минут",
  "Запрещено неадекватное поведение, неуважительное отношение к игрокам/администрации: Мут 20-120 минут",
  "Запрещен призыв к нарушению правил: Мут 60-300 минут / Бан по тяжести нарушения",
  "В канале департамента (/d) запрещены торги, реклама, неадекватное поведение: Мут 60-120 минут",
  "В VIP-чате (/vr) запрещено указывать имя пользователя в соцсетях: Мут 60-120 минут",
  "В VIP-чате (/vr) запрещена реклама в обход системы: Мут 60-120 минут",
  "Запрещено размещать билборды, нарушающие правила чата: Деморган 60-120 минут / Бан 1-5 дней",
  "Запрещено намеренно редактировать объявления в СМИ с нарушениями: Мут 60-120 минут / Варн",
  "Запрещено нарушать правила эфиров в СМИ: Мут 60-120 минут / Варн",
  "Запрещено употребление нацистских лозунгов, символики и проявления ненависти: Мут 300 минут / Бан 15-30 дней",
  "Запрещено распространение информации, доступной только подписчикам Boosty: Устное предупреждение / Мут 60-300 минут / Бан 1-7 дней",
  "Разрешено передавать ООС информацию в голосовой (Voice) чат, если рядом с Вами нет игроков, чью RP атмосферу/ситуацию Вы можете испортить",
  "Разрешена отыгровка действий (модуляция текста через /me) посредством голосового (Voice) чата",
  "Нецензурная отыгровка действий Вашего персонажа также запрещена",
  "Запрещено не отключать голосовой чат во время Вашего молчания: Устное замечание / Мут 10-30 минут",
  "Запрещено издавать любые громкие или мешающие звуки, любые помехи микрофона (шорох, треск и т. д.): Мут 30-60 минут",
  "Запрещено включение любой музыки в общественных местах [Исключение: Использование музыкальных инструментов]: Мут 30-120 минут",
  "Запрещено включение каких-либо записанных голосов/звуков (например, записанные отрывки фраз блогеров): Мут 30-60 минут",
  "Запрещено кричать без какой-либо причины: Мут 30-120 минут",
  "Запрещено неадекватное вмешательство в RP процесс других игроков: Мут 30-120 минут",
  "Запрещено использование любого софта для изменения голоса (робот, демоны, звуки животных и т. д.): Мут 30-120 минут",
  "Запрещена продажа/покупка/обсуждение продажи игровой валюты, услуг, аккаунта или иных игровых ценностей за реальную валюту или какой-либо эквивалент: Бан до 2000 дней",
  "Запрещен обмен имуществом / виртами на разных серверах в обход существующей системы перелетов: Бан на 2000 дней",
  "Запрещена передача/получение любых игровых ценностей перед получением блокировки (если на вас была подана жалоба, по которой вас могут заблокировать): Бан от 30 до 2000 дней",
  "Запрещен РП и НонРП развод (попытка развода) — это любая деятельность, направленная на получение выгоды за счет невнимательности или сильной доверчивости игрока (обман): Бан от 30 до 2000 дней",
  "Запрещено дарить / давать в долг / переносить через Vice City игровые ценности, общей стоимостью свыше 10 миллиардов без предварительного согласования с главным администратором: Изъятие вирт / Бан от 1 до 2000 дней",
  "Запрещено проводить фейк конкурсы и розыгрыши (розыгрыши должны быть заранее согласованы с главной администрацией сервера, а итоги проводиться в виде онлайн-трансляции с последующим хранением записи стрима): Бан от 30 до 2000 дней",
  "Запрещен обход официального доната (например: человек донатит другу, а друг передает в виртах вам, либо любой другой обмен AZ на вирты, кроме /donate): Бан от 1 до 2000 дней",
  "Запрещен обход игровых систем и комиссий (например: обход системы дачи взятки, обход продажи рангов в частных фракциях, обход системной продажи бизнеса): Бан от 1 до 2000 дней",
  "Запрещено оплачивать налоги на имущество игроков, заблокированных на 2000 дней по истечению срока подачи жалобы: Бан от 1 до 30 дней",
  "Запрещено иметь бизнесы на твинке: Изъятие бизнесов / Бан 2000 дней",
  "Запрещено назначать заместителей на нефтевышках за любые игровые ценности: Изъятие бизнеса / Бан от 5 до 2000 дней",
  "Запрещено нарушение функционирования бизнеса сроком более 7 дней (например: закрытие фермы; временное открытие бизнеса не продлевает срок): Изъятие бизнеса / Бан от 5 до 2000 дней",
  "Запрещено иметь больше одной частной фракции в одной структуре (гос/нелегалы) без одобрения от ГА: Изъятие фракции / Удаление семьи / Бан владельцу на 2000 дней",
  "Запрещена передача любых игровых ценностей игрокам, которые могут принимать участие в махинациях (в том числе спонсирование игроков для нечестного участия в слетах имущества)",
  "Не рекомендуется совершать игровые сделки через мусорки, багажники, шкафы и т. п. во избежание ошибочных наказаний, так как подобные сделки вызывают дополнительные подозрения у администрации",
  "Если Вы получили любые игровые ценности от неизвестного Вам игрока (который теоретически может оказаться махинатором, багоюзером и т. д.), следует сообщить старшей администрации для проверки данного игрока",
  "За любое нарушение правил, которое оказало влияние на исход слета имущества, Вам могут отказать верификацию",
  "Необходимо записывать опровержения: ловли домов, ловли бизнесов, ловли транспорта (кроме ситуаций, когда транспорт выставлен на продажу в автосалоне более минуты), ловли сгоревших лотерейных билетов",
  "Опровержение должно отражать весь процесс ловли вне зависимости от сезона, соответственно должно отражать: /time, как вы добрались от риэлторского агентства до дома, как вы вводили капчу и т. д.",
  "Опровержение должно иметь хорошее качество (720p или выше). Все элементы должны быть читаемы",
  "Любой монтаж/изменение/редактирование видео запрещены, администрация в праве отказать в рассмотрении",
  "По желанию записываются звуки клавиатуры и любой пробив, которые могут оказать ключевое значение в спорной ситуации",
  "Опровержение должно храниться не менее 5 дней",
  "Опровержение должно быть предоставлено в течение 24-х часов после запроса администрацией (могут быть исключения): Бан от 5 до 2000 дней",
  "Запрещено создавать помеху другим игрокам любым образом (предлагать обмены и т. д.): Деморган 60-300 минут / Бан от 1 до 3 дней",
  "Запрещено наносить урон, в т. ч. транспортом: Деморган 300 минут",
  "Запрещено убийство игроков: Бан от 3 до 7 дней",
  "Запрещено соучастие с нарушителем (например: с рванщиком): Наказание, аналогичное нарушителю",
  "Запрещено использование недоработок, дающих существенное преимущество (например: шифт на ловле транспорта): Бан от 3 до 30 дней",
  "Запрещено использование программ/скриптов/ботов/сайтов, предоставляющих информацию о последнем заходе игрока в игру, его активности, истории наказаний — приравнивается к чекеру ловли: Бан от 30 до 2000 дней",
  "За неоднократное нарушение правил данного раздела владельцу имущества может быть установлен системный запрет на установку маппинга",
  "Запрещено нонРП, неадекватное, бредовое название дома/бизнеса: Устное предупреждение / Деморган 60-120 минут / Удаление названия администрацией",
  "Запрещена реклама бизнесов/семьи/промокодов, продажа имущества и т. д. в названии дома/бизнеса: Удаление названия / Устное предупреждение / При неоднократном нарушении — Деморган 60-120 минут",
  "Запрещено использование маппинга в местах, для которых он не предназначен: Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга)",
  "Запрещено намеренно создавать помеху маппингом в проходе другим игрокам: Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга)",
  "Запрещено ставить маппинг на дорогах, подъездах к дому: Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга)",
  "Запрещено использование маппинга в целях взобраться куда-либо: Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга)",
  "Запрещено размещение более одного массивного маппинга (елки, здания и т. д.): Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга)",
  "Запрещено любое неестественное, некрасивое размещение маппинга (например: елка/грядки на крыше или асфальте, сейф в воздухе и т. д.): Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга)",
  "Запрещено размещение любых объектов в популярных местах (ЦР, ЦБ, АБ, АШ, вокзалы, фракции и т. д.): Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга / запрет на установку)",
  "Запрещено размещение необычных объектов в местах с большой проходимостью игроков (например, огромное сердце или воздушный шар): Устное предупреждение об изменении маппинга (в случае отказа — удаление маппинга / запрет на установку)",
  "Запрещен неестественный вид тюнинга: Устное предупреждение об изменении тюнинга (в случае отказа — удаление тюнинга)",
  "Запрещено использование тюнинга с целью навредить игрокам: Деморган 120-300 минут + запрет использования транспорта на 3-7 дней",
  "Правила данного раздела относятся исключительно к официальным ресурсам проекта. Ими являются: форум проекта, официальные группы в ВК и ТГ, дискорд сервера, конференции ВК, относящиеся к серверу и так далее.",
  "Наказание игрокам по данному разделу не будут выданы, если: с момента отправки сообщений прошло более 30 дней; игроки нарушали вне официальных ресурсов, например в личных сообщениях.",
  "Запрещено неадекватное поведение: Устное предупреждение / Бан от 1 до 30 дней",
  "Запрещено оскорбление администрации и проекта: Устное предупреждение / Бан от 1 до 30 дней",
  "Запрещено упоминание/оскорбление родных: Бан от 1 до 30 дней",
  "Запрещено предлагать (намекать) кому-либо купить/продать любые игровые ценности, либо заниматься иными вредительскими действиями (рванка, DDoS, установка ракботов и т. п.): Бан на 2000 дней",
];
function showNotification(message, color) {
  const notification = $(`<div style="
    position: fixed;
    bottom: 10px;
    right: 10px;
    background-color: ${color};
    color: white;
    padding: 10px 20px;
    border-radius: 5px;
    z-index: 9999;
    font-family: Arial, sans-serif;
    font-size: 14px;
  ">${message}</div>`);

  $("body").append(notification);
  setTimeout(() => {
    notification.fadeOut(500, () => notification.remove());
  }, 5000);
}

if (window.location.pathname === "/") {
  const username = $(".p-navgroup-link").text().trim().split("\n")[0];
  showNotification(
    `Приветствую вас, ${username}.<br>Помощник администрации для<br>сервера Sun-City готов к работе.<br>Версия: ${version}`,
    "green"
  );
}
if (window.location.pathname === "/forums/3298/") {
  const username = $(".p-navgroup-link").text().trim().split("\n")[0];
  const shortUsername = shortenUsername(username);
  const searchButton = document.createElement("button");
  const searchButton2 = document.createElement("button");

  searchButton.className = "button";
  searchButton.textContent = "Поиск жалоб (1)";
  searchButton2.className = "button";
  searchButton2.textContent = "Поиск жалоб (2)";

  const buttonGroup = document.querySelector(".buttonGroup");
  if (buttonGroup) {
    buttonGroup.appendChild(searchButton);
    buttonGroup.appendChild(searchButton2);
  }

  searchButton.addEventListener("click", function () {
    localStorage.setItem("showComplaintNotification", "true");
    window.location.href = `https://forum.arizona-rp.com/search/2/?q=${username}&t=post&c[child_nodes]=1&c[nodes][0]=3298&o=date&g=1`;
  });

  searchButton2.addEventListener("click", function () {
    localStorage.setItem("showComplaintNotification", "true");
    window.location.href = `https://forum.arizona-rp.com/search/2/?q=${shortUsername}&t=post&c[child_nodes]=1&c[nodes][0]=3298&o=date&g=1`;
  });
}

if (
  window.location.pathname === "/search/" &&
  localStorage.getItem("showComplaintNotification") === "true"
) {
  showNotification(
    "<span style='color: black;'>Внимание! Поиск жалоб может быть неточным!<br>Рекомендую дополнительно сделать ручной просмотр.</span>",
    "yellow"
  );
  localStorage.removeItem("showComplaintNotification");
}
function shortenUsername(username) {
  const [firstName, lastName] = username.split("_");
  if (!firstName || !lastName) return username;
  return `${firstName[0]}.${lastName}`;
}
/////////////////////////////////////////////////////////////////////
function createbuttons() {
  buttonsh_add("Отказано");
  buttonsh_add("Рассмотрено");
  buttonsh_add("Рассмотрено (пару игроков)");
  buttonsh_add("На рассмотрении");
  buttonsh_add("На исправление");
  buttonsh_add("Тех. раздел");
}

function createNewButtonList() {
  buttonsh_add("Ручной ввод");
  buttonsh_add("Пример кнопки");
}
function creategosButtonList() {
  buttonsh_add("Отказано ");
  buttonsh_add("Рассмотрено ");
  buttonsh_add("Рассмотрено (пару игроков) ");
  buttonsh_add("На рассмотрении ");
  buttonsh_add("На исправление ");
  buttonsh_add("Тех. раздел ");
}
///////////////////////////////////////////////////////////////////////////////////////////////////
window.button_id = 0;
$(".button--icon--reply").after(
  '<input type="button" class="button shabs" value="' +
    buttonname +
    '" id="shabs" style="margin-left: 3px;">'
);
$(".button--icon--reply").after(
  '<input type="button" class="button shabs" value="' +
    newButtonName +
    '" id="newShabs" style="margin-left: 3px;">'
);
$(".button--icon--reply").after(
  '<input type="button" class="button shabs" value="' +
    gosButtonname +
    '" id="gosShabs" style="margin-left: 3px;">'
);
$(".button--icon--reply").after(
  '<input type="button" class="button shabs" value="' +
    settingsButtonName +
    '" id="settingsButton" style="margin-left: 3px;">'
);
$(document).ready(function () {
  $("#shabs").click(function () {
    $("div.overlay-container").remove();
    XF.alert(`<div id="shabscontent"></div>`, buttonname);
    createbuttons();
  });
  $("#newShabs").click(function () {
    $("div.overlay-container").remove();
    XF.alert(`<div id="newShabsContent"></div>`, newButtonName);
    createNewButtonList();
  });
  $("#gosShabs").click(function () {
    $("div.overlay-container").remove();
    XF.alert(`<div id="gosShabsContent"></div>`, gosButtonname);
    creategosButtonList();
  });
  $("#settingsButton").click(function () {
    $("div.overlay-container").remove();
    XF.alert(`<div id="settingsContent"></div>`, settingsButtonName);
    createSettingsMenu();
  });
});
function getFormData(params) {
  const formData = new FormData();
  for (const key in params) {
    formData.append(key, params[key]);
  }
  return formData;
}
function applyPrefixAndCloseThread(prefix) {
  const threadTitle = $(".p-title-value")[0]?.lastChild?.textContent;

  if (!threadTitle) {
    showNotification(
      "Ошибка: не удалось получить заголовок темы.<br>Попробуйте обновить страницу.",
      "red"
    );
    return;
  }

  if (prefix === RASMOTR_PREFIX) {
    discussionOpen = 0;
    sticky = 1;
  } else if (prefix === ACCEPT_PREFIX || prefix === DOWN_PREFIX) {
    discussionOpen = 0;
    sticky = 0;
  } else if (prefix === DORABOTKA_PREFIX) {
    discussionOpen = 1;
    sticky = 1;
  }
  fetch(`${document.URL}edit`, {
    method: "POST",
    body: getFormData({
      prefix_id: prefix,
      title: threadTitle,
      discussion_open: discussionOpen,
      sticky: sticky,
      _xfToken: XF.config.csrf,
      _xfRequestUri: document.URL.split(XF.config.url.fullBase)[1],
      _xfWithData: 1,
      _xfResponseType: "json",
    }),
  })
  .then((response) => {
    if (!response.ok) {
      showNotification(
        "Ошибка: сервер вернул некорректный ответ.<br>Возможно, у вас недостаточно прав.",
        "red"
      );
    }
    return response.json();
  })
  .then((data) => {
    if (data.errors || !data.success) {
      showNotification(
        "Префикс и статус темы был изменен в соответствии<br>с нажатой вами кнопкой.",
        "green"
      );
    }
  })

}
function createSettingsMenu() {
  const initialText = `
    <div style="font-family: Arial;">
      <p>Скрипт "ARZ Helper by harley".</p>
      <p>Версия скрипта: <span style="color: #90EE90;">${version}</span></p>
      <p>Разработчик скрипта: <a href="https://vk.com/work.alekseevich" target="_blank" style="color: #AFEEEE;">by harley</a></p>
      <p>Помощник в разработке: <a href="https://vk.com/work.alekseevich" target="_blank" style="color: #AFEEEE;">by harley</a></p>
      <p>Скрытие кнопок (галочка - кнопка активна):</p>
      <label><input type="checkbox" id="toggleGos"> ЖБ гос</label><br>
      <label><input type="checkbox" id="toggleNesost"> ЖБ несост</label><br>
      <label><input type="checkbox" id="toggleAdm"> ЖБ адм</label><br><br>
      <button id="saveSettings" class="button">Сохранить</button>
    </div>
  `;

  $("#settingsContent").html(initialText);

  $("#toggleGos").prop("checked", localStorage.getItem("showGos") !== "false");
  $("#toggleNesost").prop("checked", localStorage.getItem("showNesost") !== "false");
  $("#toggleAdm").prop("checked", localStorage.getItem("showAdm") !== "false");

  $("#saveSettings").click(function () {
    const showGos = $("#toggleGos").is(":checked");
    const showNesost = $("#toggleNesost").is(":checked");
    const showAdm = $("#toggleAdm").is(":checked");

    localStorage.setItem("showGos", showGos);
    localStorage.setItem("showNesost", showNesost);
    localStorage.setItem("showAdm", showAdm);

    toggleButtonVisibility();
    showNotification("Настройки сохранены!", "green");
    $("#exposeMask").click();
  });
}
function toggleButtonVisibility() {
  if (localStorage.getItem("showGos") === "false") {
    $("#gosShabs").hide();
  } else {
    $("#gosShabs").show();
  }

  if (localStorage.getItem("showNesost") === "false") {
    $("#shabs").hide();
  } else {
    $("#shabs").show();
  }

  if (localStorage.getItem("showAdm") === "false") {
    $("#newShabs").hide();
  } else {
    $("#newShabs").show();
  }
}
$(document).ready(function () {
  toggleButtonVisibility();
});
function buttonsh_add(title) {
  const targetContent = $("#shabscontent, #newShabsContent, #gosShabsContent");
  targetContent.append(
    '<input type="button" class="button js-overlayClose" value="' +
      title +
      '" id="shabs_' +
      window.button_id +
      '" style="margin-top: 3px;margin-left: -5px;">'
  );

  $(document).on("click", "#shabs_" + window.button_id, function () {
    let content = "";

    switch (title) {
      case "Читы":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено использовать любые скрипты, моды или иные конструкции, дающие преимущество над другими игроками: Бан от 1 до 2000 дней[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Багоюз":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено использовать недоработки мода или игры: Деморган 10 минут - Бан 2000 дней (на усмотрение главной администрации в зависимости от тяжести нарушения)[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "НРП развод":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Слив игрока/адм":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Ввод в заблуждение":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Деанон":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен деанон игроков на сервере и ресурсах проекта: Пресечение нарушения / Бан от 30 до 2000 дней / Обнуление аккаунта (по решению ГА)[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Взаимодействие с ЧСником":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Упом род":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Упоминание родных: Мут 300 минут / Бан от 1 до 30 дней[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Оск род":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Оскорбление родных в т.ч. завуалированное: Бан от 10 до 30 дней:[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Оск адм":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено оскорбление сервера/проекта: Мут 60-300 минут / Бан 1-3 дня[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Оффтоп":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен оффтоп в /report: Мут репорта 10-30 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Оск/мат":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено оскорбление игроков/администрации: Мут 30-300 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "МегаГейминг":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен МГ (от англ. Meta Gaming) - использование игроком знаний (в РП чаты), которые его персонаж не может знать: Мут 10-30 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Транслит":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Капс":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен капс - написание слов заглавными буквами (даже одно): Мут 10-30 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Обман адм":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Флуд":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен флуд - отправка 3 и более одинаковых строк в 10 секунд: Мут 20-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Злоуп. символ":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено злоупотребления символами (Спам): Мут 10-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Неадекват":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено неадекватное поведение, неуважительное отношение к игрокам/администрации: Мут 20-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "DeathMatch":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Урон в ЗЗ":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен ДМ (от англ. Deathmatch) - нанесение урона игрокам без причины: Деморган 60-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "DriveBy":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "RevengeKill":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "PowerGaming":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен ПГ (от англ. Power Gaming) - изображение из себя супергероя, например нападение с кулаками на вооруженного человека: Деморган 60-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "SpawnKill":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "TeamKill":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен ТК (от англ. Team Kill) - нанесение урона союзникам / членам своей фракции: Деморган 60-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Уход арест/РП/смерть":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен ОФФ / АФК / Инта / Уход в ЗЗ / Аксессуары от ареста: Варн[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "АФК арест/РП/смерть":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Оружие в ЗЗ":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "NonRP":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено нонРП поведение (от англ. Not Role Play) - поведение, которое нарушает реализм и логику игрового мира:[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "+C в стену":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен сбив любых системных анимаций: Деморган 30-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "+С в игрока":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен сбив анимации выстрела любым способом: Деморган 60-120 минут / Варн[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Хилл в бою":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещено использование средств пополнения здоровья/бронежилета в бою: Деморган 60-120 минут / Варн[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "ДБ ковш":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен ДБ (от англ. DriveBy) - нанесение урона машиной / из машины: Деморган 60-120 минут[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "ДМ в ТСР":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Помеха":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Добив стадии":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Масс ДМ":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]Запрещен массовый (неоднократный - от 3 пострадавших) ДМ/ДБ/СК/ТК: Бан 3-7 дней + запрет использования оружия/транспорта на 3-10 дней[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Масс ДМ ЗЗ":
        content = `<div>
          <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
          <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitEvidence" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitEvidence", function () {
          let evidence = $("#inputEvidence").val();

          if (!evidence) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]<br><br>Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]выбери сам[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Отказано":
        content = `<div>
          <label>Причина отказа жалобы:</label><br>
          <input type="text" id="inputReason" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitReason" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitReason", function () {
          let reason = $("#inputReason").val();

          if (!reason) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлена причина отказа", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба [COLOR=rgb(184, 49, 47)]отказана[/COLOR] в рассмотрении.<br>${reason}<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(DOWN_PREFIX);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Рассмотрено":
        content = `<div>
          <label>Никнейм игрока, который получит наказание:</label><br>
          <input type="text" id="inputNickname" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Наказание, которое получит игрок (например: JAIL на 120 минут):</label><br>
          <input type="text" id="inputNakaz" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Пункт правил, по которому выдается наказание (список):</label><br>
          <input type="text" id="searchRules" placeholder="Введите ключевые слова для поиска среди списка правил..." style="width: 100%; margin-bottom: 10px;"><br>
          <select id="rulesDropdown" style="width: 100%; margin-bottom: 10px;">
           <option value="">Выбор пункта правил из списка</option>
         </select>
         <label>Пункт правил, по которому выдается наказание (ручной ввод):</label><br>
         <input type="text" id="inputRules" placeholder="Ручной ввод пункта правил..." style="width: 100%; margin-bottom: 10px;"><br>
         <button id="submitManualInput" class="button js-overlayClose">Добавить</button>
       </div>`;

       XF.alert(content, title);

       RULES_LIST.forEach(rule => {
         $("#rulesDropdown").append(new Option(rule, rule));
       });

       $(document).on("input", "#searchRules", function () {
         const searchValue = $(this).val().toLowerCase();
         $("#rulesDropdown").empty().append(new Option("Выбор пункта правил из списка", ""));

         RULES_LIST.filter(rule => rule.toLowerCase().includes(searchValue)).forEach(filteredRule => {
           $("#rulesDropdown").append(new Option(filteredRule, filteredRule));
         });
       });

       $(document).on("change", "#rulesDropdown", function () {
         if ($(this).val()) {
           $("#inputRules").val("").prop("disabled", true);
         } else {
        $("#inputRules").prop("disabled", false);
         }
       });

       $(document).on("input", "#inputRules", function () {
         if ($(this).val()) {
           $("#rulesDropdown").val("").prop("disabled", true);
         } else {
           $("#rulesDropdown").prop("disabled", false);
         }
       });

       $(document).on("click", "#submitManualInput", function () {
         let nickname = $("#inputNickname").val();
         let nakaz = $("#inputNakaz").val();
         let rules = $("#rulesDropdown").val() || $("#inputRules").val();

         if (!nickname) {
           showNotification("При создании ответа произошла ошибка:<br>Не добавлен никнейм игрока", "red");
           return;
         }
         if (!nakaz) {
           showNotification("При создании ответа произошла ошибка:<br>Не добавлено наказание", "red");
           return;
         }
         if (!rules) {
           showNotification("При создании ответа произошла ошибка:<br>Не добавлен пункт правил", "red");
           return;
         }

         let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба [COLOR=rgb(97, 189, 109)]рассмотрена,[/COLOR] выношу вердикт:<br>Игрок ${nickname} получит ${nakaz} в соответствии с правилом ниже:<br>[QUOTE]${rules}[/QUOTE]<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

         $(".fr-element").html(finalText);
         applyPrefixAndCloseThread(ACCEPT_PREFIX);
         $("#exposeMask").click();
       });
       break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "На рассмотрении":
          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Вашей жалобе присвоен статус "[COLOR=rgb(247, 218, 100)]На рассмотрении[/COLOR]".<br>К сожалению, ваша жалоба требует большего времени на вынесение вердикта.<br>Пожалуйста, ожидайте ответа в этой теме.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(RASMOTR_PREFIX);
          $("#exposeMask").click();
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "На исправление":
        content = `<div>
          <label>Что необходимо исправить в жалобе?:</label><br>
          <input type="text" id="inputReason" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitReason" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitReason", function () {
          let reason = $("#inputReason").val();

          if (!reason) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлена информация", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба может быть [COLOR=rgb(184, 49, 47)]отказана[/COLOR] в рассмотрении.<br>${reason}<br>С правилами оформления жалобы можете ознакомиться – [URL='https://forum.arizona-rp.com/threads/4164869//']Правила подачи жалоб.[/URL]<br>На исправление жалобы вам дается 24 часа. В противном ваша жалоба будет [COLOR=rgb(184, 49, 47)]отказана.[/COLOR]<br>Ожидаю ответа от вас в этой теме после исправления вышеуказанной проблемы.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(DORABOTKA_PREFIX);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Отказано ":
        content = `<div>
          <label>Причина отказа жалобы:</label><br>
          <input type="text" id="inputReason" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitReason" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitReason", function () {
          let reason = $("#inputReason").val();

          if (!reason) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлена причина отказа", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба [COLOR=rgb(184, 49, 47)]отказана[/COLOR] в рассмотрении.<br>${reason}<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(DOWN_PREFIX);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Рассмотрено ":
        content = `<div>
          <label>Никнейм игрока, который получит наказание:</label><br>
          <input type="text" id="inputNickname" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Наказание, которое получит игрок (например: JAIL на 120 минут):</label><br>
          <input type="text" id="inputNakaz" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Пункт правил, по которому выдается наказание (список):</label><br>
          <input type="text" id="searchRules" placeholder="Введите ключевые слова для поиска среди списка правил..." style="width: 100%; margin-bottom: 10px;"><br>
          <select id="rulesDropdown" style="width: 100%; margin-bottom: 10px;">
           <option value="">Выбор пункта правил из списка</option>
         </select>
         <label>Пункт правил, по которому выдается наказание (ручной ввод):</label><br>
         <input type="text" id="inputRules" placeholder="Ручной ввод пункта правил..." style="width: 100%; margin-bottom: 10px;"><br>
         <button id="submitManualInput" class="button js-overlayClose">Добавить</button>
       </div>`;

       XF.alert(content, title);

       RULES_LIST.forEach(rule => {
         $("#rulesDropdown").append(new Option(rule, rule));
       });

       $(document).on("input", "#searchRules", function () {
         const searchValue = $(this).val().toLowerCase();
         $("#rulesDropdown").empty().append(new Option("Выбор пункта правил из списка", ""));

         RULES_LIST.filter(rule => rule.toLowerCase().includes(searchValue)).forEach(filteredRule => {
           $("#rulesDropdown").append(new Option(filteredRule, filteredRule));
         });
       });

       $(document).on("change", "#rulesDropdown", function () {
         if ($(this).val()) {
           $("#inputRules").val("").prop("disabled", true);
         } else {
        $("#inputRules").prop("disabled", false);
         }
       });

       $(document).on("input", "#inputRules", function () {
         if ($(this).val()) {
           $("#rulesDropdown").val("").prop("disabled", true);
         } else {
           $("#rulesDropdown").prop("disabled", false);
         }
       });

       $(document).on("click", "#submitManualInput", function () {
         let nickname = $("#inputNickname").val();
         let nakaz = $("#inputNakaz").val();
         let rules = $("#rulesDropdown").val() || $("#inputRules").val();

         if (!nickname) {
           showNotification("При создании ответа произошла ошибка:<br>Не добавлен никнейм игрока", "red");
           return;
         }
         if (!nakaz) {
           showNotification("При создании ответа произошла ошибка:<br>Не добавлено наказание", "red");
           return;
         }
         if (!rules) {
           showNotification("При создании ответа произошла ошибка:<br>Не добавлен пункт правил", "red");
           return;
         }

         let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба [COLOR=rgb(97, 189, 109)]рассмотрена,[/COLOR] выношу вердикт:<br>Игрок ${nickname} получит ${nakaz} в соответствии с правилом ниже:<br>[QUOTE]${rules}[/QUOTE]<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

         $(".fr-element").html(finalText);
         applyPrefixAndCloseThread(ACCEPT_PREFIX);
         $("#exposeMask").click();
       });
       break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Рассмотрено (пару игроков)":
        content = `<div>
          <label>Никнеймы игроков, которые получат наказание (пишите через запятую):</label><br>
          <input type="text" id="inputNickname" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Наказание, которое получат игроки (например: JAIL на 120 минут):</label><br>
          <input type="text" id="inputNakaz" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Пункт правил, по которому выдается наказание (список):</label><br>
          <input type="text" id="searchRules" placeholder="Введите ключевые слова для поиска среди списка правил..." style="width: 100%; margin-bottom: 10px;"><br>
          <select id="rulesDropdown" style="width: 100%; margin-bottom: 10px;">
           <option value="">Выбор пункта правил из списка</option>
         </select>
         <label>Пункт правил, по которому выдается наказание (ручной ввод):</label><br>
         <input type="text" id="inputRules" placeholder="Ручной ввод пункта правил..." style="width: 100%; margin-bottom: 10px;"><br>
         <button id="submitManualInput" class="button js-overlayClose">Добавить</button>
       </div>`;

       XF.alert(content, title);

       RULES_LIST.forEach(rule => {
         $("#rulesDropdown").append(new Option(rule, rule));
       });

       $(document).on("input", "#searchRules", function () {
         const searchValue = $(this).val().toLowerCase();
         $("#rulesDropdown").empty().append(new Option("Выбор пункта правил из списка", ""));

         RULES_LIST.filter(rule => rule.toLowerCase().includes(searchValue)).forEach(filteredRule => {
           $("#rulesDropdown").append(new Option(filteredRule, filteredRule));
         });
       });

       $(document).on("change", "#rulesDropdown", function () {
         if ($(this).val()) {
           $("#inputRules").val("").prop("disabled", true);
         } else {
        $("#inputRules").prop("disabled", false);
         }
       });

       $(document).on("input", "#inputRules", function () {
         if ($(this).val()) {
           $("#rulesDropdown").val("").prop("disabled", true);
         } else {
           $("#rulesDropdown").prop("disabled", false);
         }
       });

        $(document).on("click", "#submitManualInput", function () {
          let nickname = $("#inputNickname").val();
          let nakaz = $("#inputNakaz").val();
          let rules = $("#rulesDropdown").val() || $("#inputRules").val();

          if (!nickname) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлены никнеймы игроков", "red");
            return;
          }
          if (!nakaz) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено наказание", "red");
            return;
          }
          if (!rules) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлен пункт правил", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба [COLOR=rgb(97, 189, 109)]рассмотрена,[/COLOR] выношу вердикт:<br>Игроки ${nickname} получат ${nakaz} в соответствии с правилом ниже:<br>[QUOTE]${rules}[/QUOTE]<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(ACCEPT_PREFIX);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Рассмотрено (пару игроков) ":
        content = `<div>
          <label>Никнеймы игроков, которые получат наказание (пишите через запятую):</label><br>
          <input type="text" id="inputNickname" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Наказание, которое получат игроки (например: JAIL на 120 минут):</label><br>
          <input type="text" id="inputNakaz" style="width: 100%; margin-bottom: 10px;"><br>
          <label>Пункт правил, по которому выдается наказание (список):</label><br>
          <input type="text" id="searchRules" placeholder="Введите ключевые слова для поиска среди списка правил..." style="width: 100%; margin-bottom: 10px;"><br>
          <select id="rulesDropdown" style="width: 100%; margin-bottom: 10px;">
           <option value="">Выбор пункта правил из списка</option>
         </select>
         <label>Пункт правил, по которому выдается наказание (ручной ввод):</label><br>
         <input type="text" id="inputRules" placeholder="Ручной ввод пункта правил..." style="width: 100%; margin-bottom: 10px;"><br>
         <button id="submitManualInput" class="button js-overlayClose">Добавить</button>
       </div>`;

       XF.alert(content, title);

       RULES_LIST.forEach(rule => {
         $("#rulesDropdown").append(new Option(rule, rule));
       });

       $(document).on("input", "#searchRules", function () {
         const searchValue = $(this).val().toLowerCase();
         $("#rulesDropdown").empty().append(new Option("Выбор пункта правил из списка", ""));

         RULES_LIST.filter(rule => rule.toLowerCase().includes(searchValue)).forEach(filteredRule => {
           $("#rulesDropdown").append(new Option(filteredRule, filteredRule));
         });
       });

       $(document).on("change", "#rulesDropdown", function () {
         if ($(this).val()) {
           $("#inputRules").val("").prop("disabled", true);
         } else {
        $("#inputRules").prop("disabled", false);
         }
       });

       $(document).on("input", "#inputRules", function () {
         if ($(this).val()) {
           $("#rulesDropdown").val("").prop("disabled", true);
         } else {
           $("#rulesDropdown").prop("disabled", false);
         }
       });

        $(document).on("click", "#submitManualInput", function () {
          let nickname = $("#inputNickname").val();
          let nakaz = $("#inputNakaz").val();
          let rules = $("#rulesDropdown").val() || $("#inputRules").val();

          if (!nickname) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлены никнеймы игроков", "red");
            return;
          }
          if (!nakaz) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлено наказание", "red");
            return;
          }
          if (!rules) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлен пункт правил", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба [COLOR=rgb(97, 189, 109)]рассмотрена,[/COLOR] выношу вердикт:<br>Игроки ${nickname} получат ${nakaz} в соответствии с правилом ниже:<br>[QUOTE]${rules}[/QUOTE]<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(ACCEPT_PREFIX);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "На рассмотрении ":
          let finalTextt = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Вашей жалобе присвоен статус "[COLOR=rgb(247, 218, 100)]На рассмотрении[/COLOR]".<br>К сожалению, ваша жалоба требует большего времени на вынесение вердикта.<br>Пожалуйста, ожидайте ответа в этой теме.[/FONT][/CENTER]`;

          $(".fr-element").html(finalTextt);
          applyPrefixAndCloseThread(RASMOTR_PREFIX);
          $("#exposeMask").click();
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "На исправление ":
        content = `<div>
          <label>Что необходимо исправить в жалобе?:</label><br>
          <input type="text" id="inputReason" style="width: 100%; margin-bottom: 10px;"><br>
          <button id="submitReason" class="button js-overlayClose">Добавить</button>
        </div>`;

        XF.alert(content, title);

        $(document).on("click", "#submitReason", function () {
          let reason = $("#inputReason").val();

          if (!reason) {
            showNotification("При создании ответа произошла ошибка:<br>Не добавлена информация", "red");
            return;
          }

          let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Ваша жалоба может быть [COLOR=rgb(184, 49, 47)]отказана[/COLOR] в рассмотрении.<br>${reason}<br>С правилами оформления жалобы можете ознакомиться – [URL='https://forum.arizona-rp.com/threads/4164879/']Правила подачи жалоб.[/URL]<br>На исправление жалобы вам дается 24 часа. В противном ваша жалоба будет [COLOR=rgb(184, 49, 47)]отказана.[/COLOR]<br>Ожидаю ответа от вас в этой теме после исправления вышеуказанной проблемы.[/FONT][/CENTER]`;

          $(".fr-element").html(finalText);
          applyPrefixAndCloseThread(DORABOTKA_PREFIX);
          $("#exposeMask").click();
        });
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Тех. раздел":
          let texnesost = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Проблемы подобного рода рассматриваются в техническом разделе.<br>Обратиться в технический раздел сервера можно кликнув по надписи - [URL='https://forum.arizona-rp.com/forums/2043/'][COLOR=rgb(247, 218, 100)]Технический раздел[/COLOR][/URL]<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

          $(".fr-element").html(texnesost);
          applyPrefixAndCloseThread(DOWN_PREFIX);
          $("#exposeMask").click();
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Тех. раздел ":
          let texgos = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок.<br>Проблемы подобного рода рассматриваются в техническом разделе.<br>Обратиться в технический раздел сервера можно кликнув по надписи - [URL='https://forum.arizona-rp.com/forums/2043/'][COLOR=rgb(247, 218, 100)]Технический раздел[/COLOR][/URL]<br>Администрация сервера желает Вам приятной игры и хорошего времяпровождения.<br>Тема [COLOR=rgb(184, 49, 47)]закрыта.[/COLOR][/FONT][/CENTER]`;

          $(".fr-element").html(texgos);
          applyPrefixAndCloseThread(DOWN_PREFIX);
          $("#exposeMask").click();
        break;
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      case "Ручной ввод":
      content = `<div>
        <label>Доказательства нарушения (прикрепляем ссылку, строго полный url):</label><br>
        <input type="text" id="inputEvidence" style="width: 100%; margin-bottom: 10px;"><br>
        <label>Пункт правил, по которому выдано наказание (список):</label><br>
        <input type="text" id="searchRules" placeholder="Введите ключевые слова для поиска среди списка правил..." style="width: 100%; margin-bottom: 10px;"><br>
        <select id="rulesDropdown" style="width: 100%; margin-bottom: 10px;">
          <option value="">Выбор пункта правил из списка</option>
        </select>
        <label>Пункт правил, по которому выдано наказание (ручной ввод):</label><br>
        <input type="text" id="inputRules" placeholder="Ручной ввод пункта правил..." style="width: 100%; margin-bottom: 10px;"><br>
        <button id="submitManualInput" class="button js-overlayClose">Добавить</button>
      </div>`;

      XF.alert(content, title);

      RULES_LIST.forEach(rule => {
        $("#rulesDropdown").append(new Option(rule, rule));
      });

      $(document).on("input", "#searchRules", function () {
        const searchValue = $(this).val().toLowerCase();
        $("#rulesDropdown").empty().append(new Option("Выбор пункта правил из списка", ""));

        RULES_LIST.filter(rule => rule.toLowerCase().includes(searchValue)).forEach(filteredRule => {
          $("#rulesDropdown").append(new Option(filteredRule, filteredRule));
        });
      });

      $(document).on("change", "#rulesDropdown", function () {
        if ($(this).val()) {
          $("#inputRules").val("").prop("disabled", true);
        } else {
          $("#inputRules").prop("disabled", false);
        }
      });

      $(document).on("input", "#inputRules", function () {
        if ($(this).val()) {
          $("#rulesDropdown").val("").prop("disabled", true);
        } else {
          $("#rulesDropdown").prop("disabled", false);
        }
      });

      $(document).on("click", "#submitManualInput", function () {
        let reason = $("#rulesDropdown").val() || $("#inputRules").val();
        let evidence = $("#inputEvidence").val();

        if (!reason) {
          showNotification("При создании ответа произошла ошибка:<br>Не добавлен пункт правил, который нарушил игрок", "red");
          return;
        }

        if (!evidence) {
          showNotification("При создании ответа произошла ошибка:<br>Не добавлено доказательство нарушения", "red");
          return;
        }

        let finalText = `[CENTER][FONT=Arial]Доброго времени суток, уважаемый игрок!<br>Вы были наказаны мною за нарушение [URL='https://forum.arizona-rp.com/forums/3770/']правил проекта:[/URL]</FONT><br>[/CENTER] [QUOTE] [CENTER]${reason}[/CENTER] [/QUOTE]<br><br>[CENTER][FONT=Arial]Доказательства вашего нарушения: [URL='${evidence}']*тык*[/URL]<br>Ожидайте ответа от старшей администрации.[/FONT][/CENTER]`;

        $(".fr-element").html(finalText);
        $("#exposeMask").click();
      });
      break;

      default:
        showNotification("Ошибка вывода ответа №1.<br>Обратитесь к разработчику скрипта.", "red");
    }
  });

  window.button_id++;
}