// ==UserScript==
// @name         Шаблоны отписей
// @namespace    http://tampermonkey.net/
// @version      2.10
// @description  Удобные шаблоны для отчётов в блог
// @author       OGRTSV / Смекалочка (259349)
// @match        http*://*.catwar.net/*
// @match        http*://*.catwar.su/*
// @icon         https://www.google.com/s2/favicons?sz=64&domain=catwar.net
// @grant        none
// @license     MIT
// @downloadURL https://update.greasyfork.org/scripts/532200/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD%D1%8B%20%D0%BE%D1%82%D0%BF%D0%B8%D1%81%D0%B5%D0%B9.user.js
// @updateURL https://update.greasyfork.org/scripts/532200/%D0%A8%D0%B0%D0%B1%D0%BB%D0%BE%D0%BD%D1%8B%20%D0%BE%D1%82%D0%BF%D0%B8%D1%81%D0%B5%D0%B9.meta.js
// ==/UserScript==

(function () {
  'use strict';

  let commentForm = document.querySelector("#send_comment_form");
  let comment = document.querySelector("#comment");
  let buttonBox = document.createElement("div");
  buttonBox.style.margin = "10px 0px 5px 0px";
  commentForm.prepend(buttonBox);

  var today = new Date();
  var dd = String(today.getDate()).padStart(2, '0');
  var mm = String(today.getMonth() + 1).padStart(2, '0'); //January is 0!
  var yy = today.getFullYear().toString().substr(-2);;
  today = dd + '.' + mm + '.' + yy;

  let buttonText;
  let itemList;

  if (document.URL.includes("blog36670")) { //если камнеступы

    buttonText = {
      "Сбор гнёзд": `[b]Дата:[/b] ` + today +
        `
[b]Локация:[/b] название
[b]Обнаружено:[/b] содержимое гнезда`,
      "Осмотр расщелин": `[b]Период:[/b] ` + today +
        `
[b]Находки:[/b] (сумма) предмет хN, предмет хN`,
      "Транспортировка и чистка": `[b]Дата:[/b] ` + today +
        `
[b]Убрано:[/b] (сумма) предмет хN, предмет хN
[b]История:[/b] [скриншот истории]`,
      "Доступ разведчика": `Я, [${my.id}], ознакомился с Правилами и Памятками и хочу получить доступ Разведчика [скриншот 4+ЛУ].`,
      "Доступ вершинника": `Я, [${my.id}], достиг возраста 6 лун и хочу получить доступ Вершинника [скриншот 8+ЛУ].`,
      "ШК: Принятие под опеку": `Я, [${my.id}], прошу  [ID] взять меня под опеку.
Я, [${my.id}], готов взять [ID] под свою опеку.`,
      "ШК: Выпуск": `Я, [${my.id}], прошёл обучение и хочу получить доступ Разведчика [скриншот 4ЛУ], [скриншот Аттестата]*, [скриншот ПЛ].`,
      "ШК: Прекращение опеки": `Я, [${my.id}], прошу убрать меня из-под опеки [ID] по обоюдному согласию.
Я, [${my.id}], желаю прекратить опеку над [ID] по обоюдному согласию.`,
      "Прокачивание ЛУ": `[${my.id}] - [скриншот N ЛУ].`,
      "Прокачивание УЗ": `[${my.id}] - [скриншот N УЗ].`,
      "Благотворительный фонд": `[b]Дата:[/b] ` + today +
        `
[b]Сдано:[/b] перья, костюмы [скриншот]`,
      "Перенос": `[b]Дата:[/b] ` + today +
        `
[b]Перенесённые:[/b] [url=скриншот][catID][/url], [url=скриншот][catID][/url].`
    };
    itemList = [
      "Сбор гнёзд",
      "Осмотр расщелин",
      "Транспортировка и чистка",
      "Доступ разведчика",
      "Доступ вершинника",
      "ШК: Принятие под опеку",
      "ШК: Выпуск",
      "ШК: Прекращение опеки",
      "Прокачивание ЛУ",
      "Прокачивание УЗ",
      "Благотворительный фонд",
      "Перенос"
    ]

  }
  else if (document.URL.includes("blog30681")) { //если главный блог
    buttonText = {
      "Посвящение в УХП": `― на собрании / в ЛС с речью / в ЛС без речи;
― ${my.id}, одобренное имя;
― ученик(ца) хранителей покоя;
― наставник`,
      "Посвящение в УДБ": `― на собрании / в ЛС с речью / в ЛС без речи;
― ${my.id}, одобренное имя;
― ученик(ца) добытчиков;
― наставник`,
      "Посвящение в ХП": `― на собрании / в ЛС с речью / в ЛС без речи;
― ${my.id}, одобренное имя;
― хранитель(ница) покоя`,
      "Посвящение в ДБ": `― на собрании / в ЛС с речью / в ЛС без речи;
― ${my.id}, одобренное имя;
― добытчик(ца)`,
      "ИНОПЛЕМЕННОЙ НАРУШИТЕЛЬ": `[b]Мною был замечен нарушитель из племени [название племени/одиночки/изгнанники].[/b]
[b]ID нарушителя:[/b]
[b]Скриншот нарушителя:[/b] [url=скрин]скриншот[/url]`
    };

    itemList = [
      "Посвящение в УХП",
      "Посвящение в УДБ",
      "Посвящение в ХП",
      "Посвящение в ДБ",
      "ИНОПЛЕМЕННОЙ НАРУШИТЕЛЬ"

    ]
  }
  else if (document.URL.includes("blog648421")) { //если заступ
    buttonText = {
      "Дневной дозор": `[b]Дневной дозор[/b] (кол-во дозоров)
[b]Дата и время:[/b] чч:мм - чч:мм, ${today}
[b]Участник:[/b] [cat${my.id}] / ${my.id}`,
      "Ночной дозор": `[b]Ночной дозор[/b] (кол-во дозоров)
[b]Дата и время:[/b] чч:мм - чч:мм, ${today}
[b]Участник:[/b] [cat${my.id}] / ${my.id}`,
      "Обнюхивание": `[b]Обнюхивание[/b]
[b]Дата и время:[/b] чч:мм, ${today}
[b]Локация:[/b] название локации
[b]Участник:[/b] [cat${my.id}] / ${my.id}
[b]Скриншот с запахами:[/b] [url=ссылка на скриншот]скриншот[/url]
[b]Чужие запахи:[/b] не имеются`,
      "Палочник": `[b]Палочник[/b]
[b]Дата и время окончания:[/b] 12:мм, ${today}
[b]Собирающий[/b]: [cat${my.id}]
[b]Участники:[/b] [catID], [catID]`,
      "Бдение": `[b]Бдение[/b]
[b]Дата и время:[/b] чч:мм - чч:мм; ${today}
[b]Новопосвящённый:[/b] [cat${my.id}] / ${my.id}`,
      "Охрана трав": `[b]Охрана трав[/b]
[b]Дата и время:[/b] 16:мм, ${today}
[b]Локация:[/b] название локации
[b]Участник:[/b] [cat${my.id}] / ${my.id}`,
      "Охрана мха": `[b]Охрана мха[/b]
[b]Дата и время:[/b] 17:мм, ${today}
[b]Локация:[/b] название локации
[b]Участник:[/b] [cat${my.id}] / ${my.id}`,
      "Сбор крепких веток": `Я, [cat${my.id}] / ${my.id}, собрал крепкие ветки с локаций: [названия локаций через запятую] в чч:мм ${today}`,
      "Нарушитель": `Я, [cat${my.id}] / ${my.id}, обнаружил [должность нарушителя, фракция] / ID нарушителя на локации [название локации] + [url=ссылка на скриншот]скриншот-доказательство[/url]`
    };

    itemList = [
      "Дневной дозор",
      "Ночной дозор",
      "Обнюхивание",
      "Палочник",
      "Бдение",
      "Охрана трав",
      "Охрана мха",
      "Сбор крепких веток",
      "Нарушитель"

    ]

  }
  else if (document.URL.includes("blog31391")) { //если додо

    buttonText = {
      "Охота": `[b]00:00, ${today}
Ходили на охоту:[/b] [cat${my.id}] (n + n), [catID] (n + n)`,

      "Чистка": `[b]${today}
Чистил бота:[/b] [cat${my.id}]
[b]Количество смешанной падали:[/b] n штук`,

      "Тамашество (создание)": `Я, (ваше имя) [code][link${my.id}][/code], хочу стать тамаши (имя тамаши) [code][linkID][/code], потому что он мне близок и душе, и сердцу. [[url=...]скриншот ответа[/url]]`,
      "Тамашество (разрыв)": `Я, (ваше имя) [code][link${my.id}][/code], разрываю тамашество с (имя тамаши) [code][linkID][/code]. [[url=...]скриншот ответа[/url]]`,
      "Соревнование (одиночное)": `[b]00:00, ${today}[/b]
[b]Сопроводящий:[/b] [catID] (3 балла)
[b]Вид соревнования:[/b] одиночное соревнование.
[b]Участники:[/b] [catID], [catID] (2 балла); [catID], [catID] (1 балл); [catID] (относил)`,
      "Соревнование (командное)": `[b]00:00, ${today}[/b]
[b]Сопроводящий:[/b] [catID] (3 балла)
[b]Вид соревнования:[/b] командное соревнование.
[b]Участники:[/b]
Команда 1: [catID], [catID] (2 балла);
Команда 2: [catID], [catID] (1 балл);
[catID] (относил).`,
      "Состязание": `[b]00:00, 00.04.25[/b]
[b]Вид соревнования:[/b] состязание резвых лап.
[b]Организаторы:[/b] [catID], [catID]
[b]Участники:[/b]
Команда 1: [catID], [catID] (3 балла);
Команда 2: [catID], [catID] (2 балла)`
    };
    itemList = [
      "Охота",
      "Чистка",
      "Тамашество (создание)",
      "Тамашество (разрыв)",
      "Соревнование (одиночное)",
      "Соревнование (командное)",
      "Состязание"
    ]

  }
  else if (document.URL.includes("blog30778")) { //если хп

    buttonText = {
      "Патруль": `[b]1. Дата и время проведения патруля:[/b] чч:00; ${today}
[b]2. Собирающий:[/b] [cat${my.id}]
[b]3. Ходили:[/b] [catID], [catID]`,
      "Добавить в УХП": `Прошу добавить [l[i]i[/i]nk${my.id}] в ученики хранителей покоя`,
      "Добавить в ХП": `Прошу добавить [l[i]i[/i]nk${my.id}] в хранители покоя`,
      "Добавить в Ведущие": `Прошу добавить [l[i]i[/i]nk${my.id}] в ведущие`,
      "Добавить в Наставники": `Прошу добавить меня в список наставников [l[i]i[/i]nk${my.id}] + [url=скриншот]скриншот сданной ПН[/url]`,
      "Добавить ученика (наставнику)": `Прошу добавить ко мне, [l[i]i[/i]nk${my.id}], в ученики [l[i]i[/i]nkID].`,
      "Добавить наставника (ученику)": `Прошу добавить меня, [l[i]i[/i]nk${my.id}], в ученики к [l[i]i[/i]nkID].`,
      "Отметить неактивного ученика": `Прошу отметить моего, [l[i]i[/i]nk${my.id}], ученика, [l[i]i[/i]nkID], неактивным по причине: "причина".`,
      "Сдал ПП": `Прошу отметить меня, [l[i]i[/i]nk${my.id}], ученика хранителей покоя, как способного собирать патрули + [url=скриншот]скриншот сданного ПП.[/url]`,
      "Тамашество (создание)": `Я, [cat${my.id}] [code][link${my.id}][/code], хочу стать тамаши (имя тамаши) [code][linkID][/code], потому что он мне близок и душе, и сердцу. [[url=...]скриншот ответа[/url]]`,
      "Тамашество (разрыв)": `Я, [cat${my.id}] [code][link${my.id}][/code], разрываю тамашество с (имя тамаши) [code][linkID][/code]. [[url=...]скриншот ответа[/url]]`
    };
    itemList = [
      "Патруль",
      "Добавить в УХП",
      "Добавить в ХП",
      "Добавить в Ведущие",
      "Добавить в Наставники",
      "Добавить ученика (наставнику)",
      "Добавить наставника (ученику)",
      "Отметить неактивного ученика",
      "Сдал ПП",
      "Тамашество (создание)",
      "Тамашество (разрыв)"
    ]

  }
  else if (document.URL.includes("blog48904")) { //если чистка
    buttonText = {
      "Чистка": `[cat${my.id}] | ${my.id}
n баллов
[header=${my.id}+палатки][ палатки ][/header]
[block=${my.id}+палатки]история из палаток[/block]

[header=${my.id}+лагерь][ лагерь ][/header]
[block=${my.id}+лагерь]история из лагеря[/block]

[header=${my.id}+внелаг][ внелаг ][/header]
[block=${my.id}+внелаг]история из внелага[/block]`

    };

    itemList = [
      "Чистка"

    ]

  }
  else if (document.URL.includes("blog1114316")) { //если груши
    buttonText = {
      "Двойное грушевание": `[b]Дата:[/b] ${today}
[b]БГ:[/b] [cat${my.id}] / ${my.id} (БУ)
[b]МГ (до / после 6 лун):[/b] имя / ID (БУ)
[b]Сколько всего накачали в сумме:[/b] n БУ
[ [url=скрин]скрины сообщений[/url] ]`,
      "Одиночное грушевание": `[b]Дата:[/b] ${today}
[b]Груша (до / после 6 лун):[/b] [cat${my.id}] / ${my.id} (БУ)
[b]Сколько всего накачали в сумме:[/b] n БУ
[ [url=скрин]скрины сообщений[/url] ]`

    };

    itemList = [
      "Двойное грушевание",
      "Одиночное грушевание"

    ]
  }
  else if (document.URL.includes("blog56871")) { //если ИП
    buttonText = {
      "Стать Лунным Зайчонком": `Я, [code][link${my.id}][/code], хочу стать Лунным Зайчонком.`,
      "Тренировка": `[b]Тренировка[/b]
[b]Участники[/b]: [cat${my.id}] (БУ), [catID] (БУ).`,
      "Плавание": `[b]Плавание[/b]
[b]Участник[/b]: [cat${my.id}] (ПУ)`,
      "Лазание": `[b]Лазание[/b]
[b]Участник[/b]: [cat${my.id}] (ЛУ).`,
      "Зоркость": `[b]Зоркость[/b]
[b]Участник[/b]: [cat${my.id}] (УЗ).`,
      "Тренировка с бабочкой": `[b]Тренировка[/b]
[b]Участник[/b]: [cat${my.id}] (БУ).
[b]Активатор[/b]: [catID].`,
      "Двойное грушевание": `[b]Тренировка[/b]
[b]Грушующий[/b]: [cat${my.id}] (баллы_ДГ).
[b]Подтверждение отвечающего за ДГ[/b]: [[url=скрин]ссылка[/url]].`,
      "Охота": `[b]Охота[/b]
[b]Дата и время проведения охоты[/b]: 00:00; ${today}
[b]Участники[/b]: [cat${my.id}] (обычные|красивые|редкие + светлячки)`,
      "Дневной дозор": `[b]Дозор[/b]
[b]Дата и время проведения дневного дозора[/b]: 00:00; ${today}
[b]Участники[/b]: [cat${my.id}], [catID], [catID].`,
      "Ночной дозор": `[b]Дозор[/b]
[b]Дата и время проведения ночного дозора[/b]: 00:00; ${today}
[b]Участники[/b]: [cat${my.id}], [catID], [catID].`,
      "Патруль": `[b]Патруль[/b]
[b]Дата и время проведения патруля[/b]: 00:00; ${today}
[b]Участники[/b]: [cat${my.id}] (номер задания), [catID] (номер задания), [catID].
[header=подтверждение]Выполненные поручения[/header][block=подтверждение]
[url=скрин]ссылка[/url] + [url=скрин]ссылка[/url] (если 2 подтверждения одного и того же задания)
[url=скрин]ссылка[/url][/block]`,
      "Мероприятия": `[b]Мероприятие[/b]: собрание, Ночь Спящего Зайца, т.д.
[b]Дата[/b]: ${today}
[b]Ходили[/b]: [cat${my.id}], [catID], [catID], [catID], [catID].
[b]Новости:[/b] посвятили Рогатенькую в Зайцы и проводили Китовенького.`,
      "Еженедельные задания": `[b]Категория[/b]: творческих / смышлёных / энергичных
[b]Задание[/b]: первое / второе / третье / продублированный текст задания
[b]Выполнение[/b]: ответ на загадку / [url=скрин]ссылка на изображение[/url]`,
      "Тренировка (для взросляков)": `[b]Тренировка взросляка[/b]
[b]Участники[/b]: [cat${my.id}] (БУ), [catID] (БУ).
[b]Подтверждение[/b]: [url=ссылка]до[/url] и [url=ссылка]после[/url].`,
      "ДГ (для взросляков)": `[b]Тренировка взросляка[/b]
[b]Грушующий[/b]: [cat${my.id}] (баллы_ДГ).
[b]Подтверждение отвечающего за ДГ[/b]: [url=ссылка]скриншот[/url].`,
      "Ныряние (для взросляков)": `[b]Ныряние взросляка[/b]
[b]Участник[/b]: [cat${my.id}] (кол-во ныряний).
[b]Подтверждение[/b]: [url=ссылка]скриншот[/url]`,
      "Плавание (для взросляков)": `[b]Плавание взросляка[/b]
[b]Участник[/b]: [cat${my.id}] (кол-во действий/единиц ПУ).
[b]Подтверждение[/b]: [url=ссылка]скриншот[/url].`,
      "Лазание (для взросляков)": `[b]Лазание взросляка[/b]
[b]Участник[/b]: [cat${my.id}] (единицы ЛУ).
[b]Подтверждение[/b]: [url=ссылка]до[/url] и [url=ссылка]после[/url].`,
      "Зоркость (для взросляков)": `[b]Зоркость взросляка[/b]
[b]Участник[/b]: [cat${my.id}] (единицы УЗ).
[b]Подтверждение[/b]: [url=ссылка]до[/url] и [url=ссылка]после[/url].`

    };

    itemList = [
      "Стать Лунным Зайчонком",
      "Тренировка",
      "Плавание",
      "Лазание",
      "Зоркость",
      "Тренировка с бабочкой",
      "Двойное грушевание",
      "Охота",
      "Дневной дозор",
      "Ночной дозор",
      "Патруль",
      "Мероприятия",
      "Еженедельные задания",

      "Тренировка (для взросляков)",
      "ДГ (для взросляков)",
      "Ныряние (для взросляков)",
      "Плавание (для взросляков)",
      "Лазание (для взросляков)",
      "Зоркость (для взросляков)"

    ]

  }
  else if (document.URL.includes("blog628277")) { //если подземки
    buttonText = {
      "Паутинник": `[b]Дата паутинника:[/b] ${today}
[b]Участники:[/b] Имя / айди (кол-во паутины), Имя / айди, Имя / айди, `,
      "Доступ к плавательным локациям": `Я, [cat${my.id}] [${my.id}], хочу запросить доступ к плавательным локациям + [url=скрин]скриншот с 5 пу[/url].`,
      "Доступ к дальним водам": `Я, [cat${my.id}] [${my.id}], хочу запросить доступ к дальним водам + [url=скрин]скриншот с 6 пу[/url].`

    };

    itemList = [
      "Паутинник",
      "Доступ к плавательным локациям",
      "Доступ к дальним водам"

    ]

  }
  else if (document.URL.includes("blog49798")) { //если пг
    buttonText = {
      "Подводная охота": `[b]Подводная охота | ${today}[/b]
[b]Охотник:[/b] [cat${my.id}] / ${my.id}
[b]Находка:[/b] кораллы/водоросли/крепкая ветка/другое`,

      "Помощь с доп. нырком": `[b]Помощь с нырком | ${today}, чч:мм[/b]
[b]Относящий:[/b] [cat${my.id}] / ${my.id}
[b]Ныряющий:[/b] [catID] / айди`,

      "Заплыв (оповещение)": `[font=Chiron GoRound TC][bgrf=#e9dff1][pad=20][center][table][tr][td][bgrf=#d0bedf][center][color=black][size=15][b]ЗАПЛЫВ НА ДНО[/b][/size]

[b]Тип заплыва:[/b] четверной ([i]по возможности[/i])/тройной
[b]Время проведения:[/b] nn:nn, xx:xx
[b]Проводящий:[/b] [link${my.id}]

[b]Требования для участия:[/b]
- должность от ученика;
- 5+ пу;
- здоровье не меньше 50%.

[b]Шаблон отписи:[/b]
имя и айди, луны, пу, здоровье и переход, время

[b]Пример отписи:[/b]
Серафим 188547, 100 лун, 8 пу, 90% 50 сек, на nn:nn
[color=#d0bedf] [/color]
Записывайтесь на заплыв в ЛС у проводящего.
Встречаемся на [b]Овечьем лугу[/b]!
Опаздывающих ждём 5 минут.[/color]
[/center][/bgrf][/td][/tr][/table][/center][/pad][/bgrf][/font]`,

      "Заплыв (отчёт)": `[b]Заплыв на дно (тройной/четверной) | ${today}, чч:мм[/b]
[b]Проводящий:[/b] [cat${my.id}] / ${my.id}
[b]Сопровождающие:[/b] [catID] / айди
[b]Участники:[/b] [catID] / айди`,

      "Котячий заплыв": `[b]Котячий заплыв | ${today}, чч:мм[/b]
[b]Сопровождающие:[/b] [cat${my.id}] / ${my.id}
[b]Участники:[/b] [catID] / айди`,

      "Прокачка ПУ": `[b]Прокачка ПУ | ${today}[/b]
[cat${my.id}] / ${my.id} | [url=ссылка на скриншот]скриншот ПУ[/url]`,

      "Чистка": `[b]Чистка | ${today}[/b]
[b]Участник:[/b] [cat${my.id}] / ${my.id}
[b]Количество смешанных падали/мха:[/b] n падали, n мха
[b]История:[/b] [url=ссылка на скриншот]скриншот истории[/url]`,

    };
    itemList = [
      "Подводная охота",
      "Помощь с доп. нырком",
      "Заплыв (оповещение)",
      "Заплыв (отчёт)",
      "Котячий заплыв",
      "Прокачка ПУ",
      "Чистка"
    ]
  }

  function createButton(text) {

    let button = document.createElement("input");
    button.type = "button";
    button.style.margin = "2px 2px";
    button.style.padding = "2px 5px";
    button.value = text;
    button.onclick = () => {
      comment.value += (buttonText[text] + "\n\n");
    };
    buttonBox.append(button);

  }

  function insertButtons(itemList, buttonText) {
    for (let item of itemList) createButton(item);
  }

  insertButtons(itemList, buttonText);

})()