// ==UserScript==
// @name         岐黄天使刷课助手 - 题库数据模块
// @namespace    http://tampermonkey.net/qhtx-modules
// @version      1.3.1 
// @description  存储岐黄天使刷课助手的题库数据。
// @author       AI助手
// ==/UserScript==

(function() {
    'use strict';
    window.qhtxInitialQuestionBank = {
  "questions": [
    {
      "questions": [
        {
          "id": 4647,
          "title": "蜡疗部位每次不超过几个",
          "options": {
            "A": "3",
            "B": "4",
            "C": "5",
            "D": "6",
            "E": ""
          },
          "answer": "A",
          "analysis": "蜡疗部位每次不超过 3 个，操作时间一般为 30~60 分钟。",
          "type": "多选题"
        },
        {
          "id": 4648,
          "title": "蜡疗技术适用于以下些疾病",
          "options": {
            "A": "急慢性疾病",
            "B": "创伤后期治疗",
            "C": "非感染性炎症",
            "D": "以上都是",
            "E": ""
          },
          "answer": "D",
          "analysis": "适用于各种急慢性疾病引起的疼痛症状；创伤后期治疗如软组织挫伤范围较大、 关节扭伤、骨折复位后；非感染性炎症所致的关节功能障碍如关节强直、挛缩等。",
          "type": "多选题"
        },
        {
          "id": 4651,
          "title": "穴位贴敷的作用有",
          "options": {
            "A": "活血化瘀",
            "B": "消肿止痛",
            "C": "行气消痞",
            "D": "以上都是",
            "E": ""
          },
          "answer": "D",
          "analysis": "穴位贴敷技术将药物制成一定剂型敷贴到人体穴位，通过刺激穴位激发经气达到 通经活络、 清热解毒、活血化瘀、消肿止痛、行气消痞、扶正强身作用的一种操作方法。",
          "type": "多选题"
        },
        {
          "id": 4654,
          "title": "穴位贴敷技术适用于以下些疾病引起的疼痛",
          "options": {
            "A": "消化系统疾病",
            "B": "呼吸系统疾病",
            "C": "恶性肿瘤",
            "D": "所有上述疾病",
            "E": ""
          },
          "answer": "D",
          "analysis": "穴位贴敷技术适用于恶性肿瘤各种疮疡及跌打损伤等疾病引起的疼痛消化系统疾 病引起的腹胀、腹泻、便秘，呼吸系统疾病引起的咳喘等症状。",
          "type": "多选题"
        },
        {
          "id": 4661,
          "title": "中药热熨敷技术的中药药液温度为",
          "options": {
            "A": "38~42℃",
            "B": "38~41℃",
            "C": "38~45℃",
            "D": "37~43℃",
            "E": ""
          },
          "answer": "C",
          "analysis": "根据需要局部热敷温度以 38~45℃为宜。",
          "type": "多选题"
        },
        {
          "id": 4663,
          "title": "中药热熨敷的作用",
          "options": {
            "A": "温经通络",
            "B": "行气活血",
            "C": "散寒止痛",
            "D": "祛瘀消肿",
            "E": ""
          },
          "answer": "A#B#C#D",
          "analysis": "中药加热后装入布袋在人体局部或一定穴位上移动利用温热之力使药性通过体表 渗入经络、血脉从而达到温经通络、行气活血、散寒止痛、祛瘀消肿等作用的一种操作方法。",
          "type": "多选题"
        },
        {
          "id": 12458,
          "title": "中药离子导入治疗什么的",
          "options": {
            "A": "风寒湿痹",
            "B": "关节肿痛",
            "C": "头晕眼花",
            "D": "恶心呕吐",
            "E": ""
          },
          "answer": "A#B",
          "analysis": "中药离子导入是中医的一种外治法，能够促进药物向体内的有效运转，可使药物直达病灶，能达到疏通经络、补气活血、扶正祛邪的功效，对于一些风湿痹症引起的腰腿疼，关节肿胀，关节疼，疗效显著。故选AB。",
          "type": "多选题"
        },
        {
          "id": 12459,
          "title": "下列不属于离子导入治疗的是",
          "options": {
            "A": "风寒湿痹",
            "B": " 关节肿痛",
            "C": "腰颈疼痛",
            "D": "恶心呕吐",
            "E": ""
          },
          "answer": "D",
          "analysis": "中药离子导入是中医的一种外治法，能够促进药物向体内的有效运转，可使药物直达病灶，能达到疏通经络、补气活血、扶正祛邪的功效，对于一些风湿痹症引起的腰腿疼，关节肿胀，关节疼，疗效显著。对于腰间盘突出以及颈椎病也有一定的治疗效果，还可改善宫寒的症状。D不属于离子导入治疗的范围，故选D。",
          "type": "多选题"
        },
        {
          "id": 12460,
          "title": "下列哪一项不属于耳穴贴压感受",
          "options": {
            "A": "酸",
            "B": "麻",
            "C": "胀",
            "D": "痒",
            "E": ""
          },
          "answer": "D",
          "analysis": "耳穴贴压后皮肤有痒或疼痛感时为过敏感受，因及时取下避免过敏、发炎。故选按D。",
          "type": "多选题"
        },
        {
          "id": 12461,
          "title": "耳穴贴压注意事项有哪些",
          "options": {
            "A": "局部耳膜炎",
            "B": "高血压",
            "C": "糖尿病",
            "D": "腹泻",
            "E": ""
          },
          "answer": "A",
          "analysis": "1、应注意防水，以免脱落，易出汗时，贴压耳穴不宜过多，时间不宜过长，以防胶布潮湿或皮肤感染；2、如对胶布过敏者，可用粘合纸代替；耳廓皮肤有炎症或冻伤者不宜采用该方法；3、对于过度饥饿、疲劳、精神高度紧张、年老体弱、孕妇等患者，按压宜轻；急性疼痛性病症宜重手法强刺激；习惯性流产慎用该方法，以免流产。故选A。",
          "type": "多选题"
        },
        {
          "id": 12462,
          "title": "隔物灸中的隔姜灸是治疗什么的",
          "options": {
            "A": "高血压",
            "B": "呕吐腹泻",
            "C": "感冒",
            "D": "腹部寒凉萎软无力",
            "E": ""
          },
          "answer": "B#D",
          "analysis": "隔姜灸的治疗作用是用于各种虚寒导致的畏寒怕冷，腹痛腹泻，恶心呕吐，阳痿痛经等症候。故选BD。",
          "type": "多选题"
        },
        {
          "id": 12463,
          "title": "下列不属于隔物灸的注意事项有哪些",
          "options": {
            "A": "孕妇不能灸腹部",
            "B": "不能过饱腹灸",
            "C": "高热期间不能灸",
            "D": "洗澡后不能灸",
            "E": ""
          },
          "answer": "D",
          "analysis": "一，患者在艾灸后一个小时内不能洗澡，吃饭。二，艾灸前患者的情绪不能过于激动，不能过饱过饥。三，喝完酒的患者也不能进行艾灸。四，月经期的女性不建议进行隔姜灸。五，艾灸的时候也要选择质量较好的艾条，以免患者烫伤或者对艾条过敏。故选D。",
          "type": "多选题"
        },
        {
          "id": 12464,
          "title": "在刮痧时一般局部刮痧（）为宜",
          "options": {
            "A": "5分钟",
            "B": "5-10分钟",
            "C": "20-30分钟",
            "D": "60分钟",
            "E": ""
          },
          "answer": "B",
          "analysis": "一般每个部位刮20-局部刮痧一般5-10分钟，故选B。",
          "type": "多选题"
        },
        {
          "id": 12465,
          "title": "刮痧的程度包括（）和出痧的程度",
          "options": {
            "A": "力量强度",
            "B": "角度大小",
            "C": "速度快慢",
            "D": "长度的长短",
            "E": ""
          },
          "answer": "A",
          "analysis": "以出现微红色或紫红色的痧点为度。 刮痧时力度的要求为“重而不板，轻而不浮”。一般以刮痧部位出痧后呈现微红色或紫红色的痧点、斑块为度，但由于每个人体质情况不一样，所以刮痧后出痧的颜色和轻重程度也会有区别，但只要刮痧的部位、手法方法正确，就能起到相应的调理效果，在刮痧是不可一味地强求出痧。故选B。",
          "type": "多选题"
        },
        {
          "id": 12466,
          "title": "经学推拿的好处是什么",
          "options": {
            "A": "减轻疼痛",
            "B": "治疗高血压",
            "C": "治疗糖尿病",
            "D": "温经通络",
            "E": ""
          },
          "answer": "A#D",
          "analysis": "经血推拿的好处是减轻疼痛、调节胃肠功能、温经通络，故选AD。",
          "type": "多选题"
        },
        {
          "id": 12467,
          "title": "推拿注意事项不正确的是",
          "options": {
            "A": "女性经期",
            "B": "操作前剪指甲",
            "C": "操作中要力量适度",
            "D": "患者放松",
            "E": ""
          },
          "answer": "A",
          "analysis": "按摩就具有活血化瘀的作用，可促进血液循环，长时间的进行按摩就会导致人体处于一种被刺激的状态，继而导致月经出现异常。故选A。",
          "type": "多选题"
        },
        {
          "id": 12468,
          "title": "下列不属于麦粒灸的治疗好处是",
          "options": {
            "A": "温经散寒",
            "B": "扶助阳气",
            "C": "治疗高血压",
            "D": "消瘀散结",
            "E": ""
          },
          "answer": "C",
          "analysis": "麦粒灸法总的来说是用温热的效力治疗病人，麦粒灸也是一样起到温经散寒的作用。麦粒灸往往不做化脓灸，只是做清浅的灸法，因此麦粒灸根据选的穴位，对人体激发正气、补益气血的作用更强。没有治疗高血压的效果，故选C。",
          "type": "多选题"
        },
        {
          "id": 12469,
          "title": "麦粒灸禁用不包括",
          "options": {
            "A": "动脉搏动处",
            "B": "脐窝",
            "C": "胸腹部",
            "D": "会阴",
            "E": "颜面部"
          },
          "answer": "C",
          "analysis": "1.颜面部、心前区、体表大血管部位和关节部位不可用化脓麦粒灸；2.妇女妊娠期，腰骶部和小腹部禁用化脓灸；3.动脉搏动处如太渊、经渠、冲阳穴不宜用麦粒灸；4.不便护理的部位如腋窝、脐窝、会阴等处禁用麦粒灸。故选C。",
          "type": "多选题"
        },
        {
          "id": 12470,
          "title": "下列不属于悬灸治疗的是",
          "options": {
            "A": "胃脘痛",
            "B": "月经寒冷",
            "C": "四肢冷痛",
            "D": "心脏病",
            "E": ""
          },
          "answer": "D",
          "analysis": "心脏病是心脏的结构和功能受损引起，作为一类疾病的总称，“心脏病”实际包括众多疾病，在治疗手段上，总体上来说多以药物治疗作为基础治疗方案，必要时行介入或手术治疗。悬灸治疗无法质量心脏病，故选D。",
          "type": "多选题"
        },
        {
          "id": 12471,
          "title": "悬灸的好处是什么",
          "options": {
            "A": "温经通络",
            "B": "治疗高血压",
            "C": "缓解四肢冷痛",
            "D": "治疗糖尿病",
            "E": ""
          },
          "answer": "A#C",
          "analysis": "一.温经散寒，悬灸用于气血因寒而运行不畅，寒湿凝涩的痹症效果甚为显著;二.行气通络，悬灸通过疏通经络、调和气血，可以治疗缓解各种痛症;三.扶阳固脱，人体正常生理活动以阳气为根本，阳病则阴盛，阳气不充，手足逆冷;四.祛寒除湿，悬灸可直接体内脏腑中的寒气排出体外。故选AC。",
          "type": "多选题"
        },
        {
          "id": 12476,
          "title": "冷敷时间一般是",
          "options": {
            "A": "不超过30分钟",
            "B": "约60分钟",
            "C": "30分钟以上",
            "D": "以患者舒适为宜",
            "E": ""
          },
          "answer": "A",
          "analysis": "冷敷是常用的物理治疗方法，主要起降温、镇痛、止血、消炎等作用。在临床上应用冷敷治疗时，根据不同病情以及病人的自身条件来确定冷敷时间，一般每次冷敷时间为20-30分钟，3-4小时一次。故选A。",
          "type": "多选题"
        },
        {
          "id": 12477,
          "title": "冷敷的注意事项正确的是",
          "options": {
            "A": "冰袋无漏水",
            "B": "注意防止冻伤",
            "C": "注意观察冰块融化情况，及时更换",
            "D": "以上均是",
            "E": ""
          },
          "answer": "D",
          "analysis": "冷敷的注意事项有：冷敷之前要及时消毒，冷敷面积不要太大，正确的使用冷敷的方法，冷敷的时间不要太长并注意观察，及时更换冰块。故选D。",
          "type": "多选题"
        },
        {
          "id": 12481,
          "title": "下列属于中药灌肠作用的是",
          "options": {
            "A": "清热解毒",
            "B": "治疗高血压",
            "C": "活血化瘀",
            "D": "治疗糖尿病",
            "E": ""
          },
          "answer": "A#C",
          "analysis": "迅速吸收药物、清热解毒、活血化瘀，起到全身治疗的作用。 中药灌肠主要是通过肠道局部灌充药液以后，通过肠壁的吸收，利于肠壁半透膜的渗透性，迅速吸收药物起到全身的治疗作用。特别对于肠道附近的器官比如盆腔、腹腔以及肠道局部炎症、感染等疾病，有明显的治疗效果。故选AC。",
          "type": "多选题"
        },
        {
          "id": 12482,
          "title": "灌肠中肛管排气一般取哪里",
          "options": {
            "A": "右侧卧位",
            "B": "半坐卧位",
            "C": "左侧卧位",
            "D": "强迫卧位",
            "E": ""
          },
          "answer": "C",
          "analysis": "备齐用物携至患者床边，向说明用意，屏风遮挡，助病人仰卧或左侧卧位。故选C。",
          "type": "多选题"
        },
        {
          "id": 12483,
          "title": "下列那些不属于中药泡洗治疗疾病",
          "options": {
            "A": "外感发热",
            "B": "失眠",
            "C": "皮肤感染",
            "D": "头晕眼花",
            "E": ""
          },
          "answer": "D",
          "analysis": "温热之力及药 物本身的功效，浸洗全身或局部皮肤，达到活血 、消肿、止痛、祛瘀生新等作用的一种操作方，故选D。",
          "type": "多选题"
        },
        {
          "id": 12484,
          "title": "下列中药泡洗的功效错误选项是",
          "options": {
            "A": "活血",
            "B": "消肿",
            "C": "止痛",
            "D": "治疗高血压",
            "E": ""
          },
          "answer": "D",
          "analysis": "中药泡洗技术 中药泡洗技术 中药泡洗技术是借助泡洗时洗液的温热之力及药 物本身的功效，浸洗全身或局部皮肤，达到活血 、消肿、止痛、祛瘀生新等作用的一种操作方法 。 故选D。",
          "type": "多选题"
        },
        {
          "id": 12489,
          "title": "涂药法的作用包括",
          "options": {
            "A": "祛风除湿",
            "B": "解毒消肿",
            "C": "止痒镇痛",
            "D": "以上均是",
            "E": ""
          },
          "answer": "D",
          "analysis": "擦药疗法因所用药物的不同，基作用调和气血，疏经活络或活血祛瘀，行气止痛，或发散表邪、祛风散寒。故选D。",
          "type": "多选题"
        },
        {
          "id": 12490,
          "title": "涂药法注意事项错误的是",
          "options": {
            "A": "涂药次数应依病情、药物而定",
            "B": "霜剂应反复擦抹，使之渗入肌肤",
            "C": "涂药应尽可能厚，以增强药效",
            "D": "毛发长的部位应将毛发剃去再涂药",
            "E": ""
          },
          "answer": "C",
          "analysis": "药膏涂抹的厚度仅需千分之一厘米（约角质层厚度的一半）左右就可以达到满意的吸收度，太厚的药膏会让人产生不适感，潜意识就会有揉搓的冲动，极易造成药物分布到非病灶部位。故选C。",
          "type": "多选题"
        },
        {
          "id": 12491,
          "title": "中药熏蒸法的功效包括",
          "options": {
            "A": "温经散寒",
            "B": "活血化瘀",
            "C": "杀虫止痒",
            "D": "以上均是",
            "E": ""
          },
          "answer": "D",
          "analysis": "通过源源不断的热药蒸汽以对流和传导的方式直接作用于人体，扩张局部和全身的血管，促进体表组织的血液循环，改善皮肤的吸收作用，促进汗腺的大量分泌，加速皮肤的新陈代谢；同时由熏蒸药物中逸出的中药粒子（为分子或离子）作用于体表直接产生杀虫、杀菌、消炎、止痒、治痛与温经散寒、活血化瘀等作用，或经透皮吸收人体通过激发组织细胞受体的生物化学过程发挥药疗作用，进而消除病灶。故选D。",
          "type": "多选题"
        },
        {
          "id": 12492,
          "title": "关于中药熏蒸的注意事项，错误的是",
          "options": {
            "A": "熏蒸后立即擦干皮肤",
            "B": "过度疲劳不宜进行",
            "C": "临睡前进行最佳",
            "D": "药液温度不宜过高",
            "E": ""
          },
          "answer": "C",
          "analysis": "1．施行熏蒸疗法，应时时注意防止烫伤，各种用具易牢固稳妥，热源应当合理，药不应接触皮肤。2．小儿及智能低下，年老体弱者熏蒸时间不易过长需家属陪同。3．熏蒸浴具要注意消毒。4．治疗期间对辛辣，油腻，甘甜等食物摄入应适当控制。5．空腹及饭后半小时不宜做熏蒸。6．做完熏蒸后要喝300-500ml的白开水。临睡前不宜熏蒸，故选C。",
          "type": "多选题"
        },
        {
          "id": 12495,
          "title": "穴位注射操作中应注意什么",
          "options": {
            "A": "年老者选穴宜少",
            "B": "孕妇下腹部注射时，注意不可注入血管",
            "C": "严格无菌操作",
            "D": "防止晕针、弯针等",
            "E": ""
          },
          "answer": "A#B#C#D",
          "analysis": "严格执行无菌操作，防止感染。注意药物性能，对存在过敏反应的药物需要经过皮试，才可以使用。年老者选穴宜少，孕妇下腹部注射时，注意不可注入血管，防止晕针、弯针等一般情况下，药液不宜注入关节腔内，以免引起关节红肿、酸痛。高渗葡萄糖不可注入皮下，一定要注入肌肉深部。故选ABCD。",
          "type": "多选题"
        },
        {
          "id": 12496,
          "title": "关于穴位注射下列说法不正确的是",
          "options": {
            "A": "孕妇禁针",
            "B": "孕妇三阴交禁用",
            "C": "药液不可注入血管、关节腔",
            "D": "严格无菌操作",
            "E": ""
          },
          "answer": "A",
          "analysis": "孕妇不能针灸的部位,主要有腹部、腰骶部等，并不是完全禁止。故选A。",
          "type": "多选题"
        },
        {
          "id": 12497,
          "title": "拔罐法主要用于",
          "options": {
            "A": "风寒湿痹",
            "B": "外感风寒",
            "C": "妇科疾病如痛经、月经不调等",
            "D": "以上均是",
            "E": ""
          },
          "answer": "D",
          "analysis": "这种疗法部分人认为可以除风寒去湿痹、逐寒祛湿、疏通经络、祛除淤滞、行气活血、消肿止痛、拔毒泻热，具有调整人体的阴阳平衡、解除疲劳、增强体质的功能，从而达到扶正祛邪、治愈疾病的目的。故选D。",
          "type": "多选题"
        },
        {
          "id": 12498,
          "title": "可以进行拔罐的是",
          "options": {
            "A": "高热抽搐",
            "B": "脏器衰竭",
            "C": "儿童",
            "D": "孕妇腹部",
            "E": ""
          },
          "answer": "C",
          "analysis": "体质较差的孩子平时在背部拔拔罐可以提高免疫力，健脾和胃。给小孩拔罐时，要掌握好时间，拔了就起不留罐，拔到以皮肤发红为宜。六个月以内的乳婴儿禁止使用拔罐的方法进行治病。同时对于一些高热、皮肤感染性疾病的儿科疾病不宜使用拔罐进行治疗。故选C。",
          "type": "多选题"
        },
        {
          "id": 13255,
          "title": "中药湿热敷技术的中药药液温度为（ ）",
          "options": {
            "A": "35-38℃",
            "B": "36-39℃",
            "C": "38-43℃",
            "D": "40-45℃",
            "E": ""
          },
          "answer": "C",
          "analysis": "一般来说，使用湿热敷的时候温度不能太高，只需要略高于体温即可，以38-43摄氏度为宜，时间控制在20~30分钟左右。故选C。",
          "type": "多选题"
        },
        {
          "id": 13256,
          "title": "湿热敷的时间为（  ）",
          "options": {
            "A": "15-30min",
            "B": "20-30min",
            "C": "10-20min",
            "D": "25-30min",
            "E": ""
          },
          "answer": "B",
          "analysis": "一般来说，使用湿热敷的时候温度不能太高，只需要略高于体温即可，以38-43摄氏度为宜，时间控制在20~30分钟左右。故选B。",
          "type": "多选题"
        },
        {
          "id": 13257,
          "title": "湿热敷时每隔（ ）分钟需要淋药或更换敷料",
          "options": {
            "A": "3",
            "B": "5",
            "C": "8",
            "D": "10",
            "E": ""
          },
          "answer": "B",
          "analysis": "湿热敷的时间为20~30分钟左右，湿热敷时一般每隔5分钟就需要淋药或更换敷料。故选B。",
          "type": "多选题"
        },
        {
          "id": 14458,
          "title": "以下哪位医家提出“大医精诚”的理念？",
          "options": {
            "A": "张仲景",
            "B": "孙思邈",
            "C": "葛洪",
            "D": "华佗 ",
            "E": "巢元方"
          },
          "answer": "B",
          "analysis": "孙思邈所著的《备急千金要方》中专论医德，提出“大医精诚”，故选B",
          "type": "多选题"
        },
        {
          "id": 14459,
          "title": "以下哪部中医典籍开创了辨证施护的先河？",
          "options": {
            "A": "《黄帝内经》       ",
            "B": "《伤寒杂病论》             ",
            "C": "《神农本草经》",
            "D": "《备急千金要方》",
            "E": "《肘后备急方》"
          },
          "answer": "B",
          "analysis": "张仲景所著的《伤寒杂病论》以六经辨伤寒，以脏腑辨杂病，开创了辨证施护的先河，故选B",
          "type": "多选题"
        },
        {
          "id": 14460,
          "title": "屠呦呦教授是从以下哪部书中获得灵感，从青蒿中提取出青蒿素，制成抗疟新药？",
          "options": {
            "A": "《黄帝内经》       ",
            "B": "《伤寒杂病论》             ",
            "C": "《神农本草经》",
            "D": "《备急千金要方》",
            "E": "《肘后备急方》"
          },
          "answer": "E",
          "analysis": "《肘后备急方》中有关于青蒿治疗疟疾的记载，故选E",
          "type": "多选题"
        },
        {
          "id": 14461,
          "title": "最早对自缢者提出的急救护理与现代复苏术相似的是以下哪部医学典籍？",
          "options": {
            "A": "《外台秘要》",
            "B": "《诸病源候论》",
            "C": "《神农本草经》",
            "D": "《伤寒杂病论》 ",
            "E": "《理瀹骈文》"
          },
          "answer": "D",
          "analysis": "张仲景的《伤寒杂病论》最早开展复苏术，救猝死、自缢死，故选D",
          "type": "多选题"
        },
        {
          "id": 14462,
          "title": "最早较全面论述中医护理的专书是哪部？",
          "options": {
            "A": "《侍疾要语》",
            "B": "《修龄要旨》     ",
            "C": "《理瀹骈文》",
            "D": "《外台秘要》",
            "E": "《太平圣惠方》"
          },
          "answer": "A",
          "analysis": "钱襄的《侍疾要语》是现存古代中医文献中最早较全面论述中医护理的专书，故选A",
          "type": "多选题"
        },
        {
          "id": 14473,
          "title": "异常情志变化可以使脏腑气机功能紊乱，从而导致疾病的发生。如《素问·举痛论》云“百病生于气也……”下面哪句正确",
          "options": {
            "A": "喜则气上",
            "B": "悲则气缓 ",
            "C": "怒则气下",
            "D": "思则气结",
            "E": "恐则气消"
          },
          "answer": "D",
          "analysis": "《素问·举痛论》云“百病生于气也，怒则气上，喜则气缓，悲则气消，恐则气下，思则气结，惊则气乱”。对应后，只有D正确。",
          "type": "多选题"
        },
        {
          "id": 14474,
          "title": "《素问·阴阳应象大论》根据五行相克关系提出：“怒伤肝，（     ）胜怒。” ",
          "options": {
            "A": "喜",
            "B": "忧",
            "C": "悲",
            "D": "思",
            "E": "恐"
          },
          "answer": "C",
          "analysis": "《素问·阴阳应象大论》根据五行相克关系提出：“怒伤肝，悲胜怒；喜伤心，恐胜喜；思伤脾，怒胜思；忧伤肺，喜胜忧；恐伤肾，思胜恐。” 即通过悲哀因素来克制愤怒太过的方法。 所以选择C",
          "type": "多选题"
        },
        {
          "id": 14475,
          "title": "下面哪项不是情志护理方法",
          "options": {
            "A": "说理开导",
            "B": "诚挚体贴",
            "C": "顺情从欲",
            "D": "以情胜情",
            "E": "宣泄解郁"
          },
          "answer": "B",
          "analysis": "诚挚体贴是情志护理的原则，不是情志护理方法。情志护理方法还包括释疑解惑法、宣泄解郁法、暗示疗法。",
          "type": "多选题"
        },
        {
          "id": 14476,
          "title": "请完善古文括号中内容，《素问》“恬淡虚无，真气从之，（     ），病安从来”。",
          "options": {
            "A": "顺应四时",
            "B": "起居有常",
            "C": "劳逸适度",
            "D": "精神内守",
            "E": "避免刺激"
          },
          "answer": "D",
          "analysis": "原文是《素问》“恬淡虚无，真气从之，精神内守，病安从来”。所以选择D。",
          "type": "多选题"
        },
        {
          "id": 14477,
          "title": "下面哪一项不是情志护理原则",
          "options": {
            "A": "一视同仁",
            "B": "因人施护",
            "C": "避免刺激",
            "D": "释疑解惑",
            "E": "诚挚体贴"
          },
          "answer": "D",
          "analysis": "只有D是情志护理方法，其余都是情志护理原则。",
          "type": "多选题"
        },
        {
          "id": 14478,
          "title": "秋季饮食护理的原则是",
          "options": {
            "A": "疏肝养肝，忌酸涩",
            "B": "滋补，补肾为主",
            "C": "祛暑生津，养心护心",
            "D": "润肺养肺，宜酸润",
            "E": "秋冬养阳"
          },
          "answer": "D",
          "analysis": "秋季属肺，且气候由热转凉，自然界的阳气由疏泄趋向收敛。故饮食宜酸润，以润肺养肺为主。生活起居调养应为秋冬养阴，故选D。",
          "type": "多选题"
        },
        {
          "id": 14479,
          "title": "五味对五脏具有一定的选择性作用。如，（     ）先入心……。如果长期嗜食某种食物，就会使该脏腑的功能偏盛，久之就破坏脏腑间的协调关系，发生脏腑之间的病理传变。",
          "options": {
            "A": "辛",
            "B": "苦",
            "C": "酸",
            "D": "甘",
            "E": "咸"
          },
          "answer": "B",
          "analysis": "食物的五味可以营养人之五脏，饮食五味得当，均衡进食，可以补益五脏。五味对五脏具有一定的选择性作用。如，酸先入肝，苦先入心，甘先入脾，辛先入肺，咸先入肾。所以选择B。",
          "type": "多选题"
        },
        {
          "id": 14480,
          "title": "适用于瘿瘤，瘰疬的食物是下面哪种性味",
          "options": {
            "A": "辛味",
            "B": "甘味",
            "C": "酸味",
            "D": "苦味",
            "E": "咸味"
          },
          "answer": "E",
          "analysis": "食物也具有五味，其中咸味，具有有软坚、散结、泻下的作用，如海带、紫菜、海蛰等。适应证：热结便秘，瘿瘤，瘰疬等。如海藻软坚，消散瘿瘤。所以选择E。",
          "type": "多选题"
        },
        {
          "id": 14481,
          "title": "下面哪一项不是饮食调养的基本要求",
          "options": {
            "A": "饮食有节",
            "B": "辨证施食",
            "C": "饮食须洁，不进食腐败变质的食物",
            "D": "饮食清淡，少食盐",
            "E": "饮食平衡，不偏嗜"
          },
          "answer": "B",
          "analysis": "只有B是饮食调养的原则，其余是饮食调养的基本要求，饮食调养的基本要求还包括合理烹制，养成良好的饮食习惯。",
          "type": "多选题"
        },
        {
          "id": 14482,
          "title": "下面关于饮食的说法哪个不正确",
          "options": {
            "A": "人参忌萝卜",
            "B": "黄疸泄泻忌油腻",
            "C": "赤小豆配鲤鱼可增强利水作用",
            "D": "一般在服药期间，凡属生冷、油腻、腥臭及不易消化，刺激性食物，均应避免为宜",
            "E": "阳虚者忌温热，宜淡薄滋润类食物。"
          },
          "answer": "E",
          "analysis": "阳虚则寒，所以阳虚者忌寒凉，宜温补类食物。所以E是错误的。",
          "type": "多选题"
        },
        {
          "id": 14483,
          "title": "下面哪项不是病情观察的目的",
          "options": {
            "A": "及时发现危重症和并发症",
            "B": "判断疾病的发展趋向和转归",
            "C": "为疾病的诊断、治疗和护理提供科学的依据",
            "D": "和病人建立良好关系",
            "E": "了解治疗效果和用药反应"
          },
          "answer": "D",
          "analysis": "病情观察是指医护人员通过望、闻、问、切等方法及借助医疗仪器设备等，有目的、有计划地全面收集患者资料，对病情进行辨证分析并做出判断的动态过程。是收集资料做出判断的过程。除了D项，其余四项均为病情观察目的，所以选择D。",
          "type": "多选题"
        },
        {
          "id": 14484,
          "title": "下面哪种说法不准确",
          "options": {
            "A": "健康成人一般情况下，白天小便4～6次，夜间0～2次，一天的尿量在1000～2000ml之间。",
            "B": "健康人大便一般每日一次或每日2次，质软成形，干湿适度，排便通畅。",
            "C": "小便点滴而出为“癃”，小便不通，点滴不出者为“闭”，统称为癃闭。",
            "D": "遗尿多因禀赋不足，肾气未充，或肾气亏虚，不能固约膀胱所致。",
            "E": "大便的便次异常，有便秘和泄泻之分。 "
          },
          "answer": "B",
          "analysis": "健康人大便一般每日一次或隔日一次。所以B选项不正确。其余均正确。",
          "type": "多选题"
        },
        {
          "id": 14485,
          "title": "观察下面哪个内容的变化是望神的重点",
          "options": {
            "A": "面色",
            "B": "舌苔",
            "C": "眼神",
            "D": "食欲",
            "E": "脉象"
          },
          "answer": "C",
          "analysis": "《医原·望病须察神气论》云，“人之神气，栖于两目”。说明两目最易传神，因为，目为五脏六腑精气汇聚之地，目系通于脑，其活动直接接受心神的支配。所以观察眼神的变化是望神的重点。",
          "type": "多选题"
        },
        {
          "id": 14486,
          "title": "下面哪一项不是病情观察的方法",
          "options": {
            "A": "运用四诊的方法观察",
            "B": "及时观察治疗和护理后的效果 ",
            "C": "了解脏腑的虚实变化",
            "D": "根据护理效果及时修订护理措施",
            "E": "运用辨证的方法分析病情"
          },
          "answer": "C",
          "analysis": "只有C是病情观察的原则，剩下的选项都是病情观察的方法。",
          "type": "多选题"
        },
        {
          "id": 14487,
          "title": "关于脉象的说法不正确的是哪一项",
          "options": {
            "A": "外感脉象由浮转沉，表示病邪由表入里",
            "B": "病、脉、证不符的特殊情况下，要舍症从脉",
            "C": "从不同的脉象上可以判断病变的性质",
            "D": "通过诊脉可以判断病位深浅",
            "E": "久病脉见缓和，是胃气渐复、病退向愈之候"
          },
          "answer": "B",
          "analysis": "一般情况下，病、脉、证是相符的。也有不符的特殊情况，因此在临床运用时要注意病、脉、证进行四诊合参，认真分析，才能全面认识疾病的本质，决定脉症之取舍，若症真脉假，则舍脉从症，若脉真症假，则舍症从脉。所以B选项不正确",
          "type": "多选题"
        },
        {
          "id": 14488,
          "title": "下面哪项不是生活起居护理原则",
          "options": {
            "A": "顺应四时，平衡阴阳",
            "B": "环境适宜，慎避外邪",
            "C": "病室安静， 空气清新",
            "D": "起居有常",
            "E": "劳逸适度"
          },
          "answer": "C",
          "analysis": "只有 C是生活起居护理的方法，属于环境护理内容，保持病室安静整洁。其余均为生活起居护理原则。",
          "type": "多选题"
        },
        {
          "id": 14489,
          "title": "关于环境护理的内容哪个不正确",
          "options": {
            "A": "燥证患者病室湿度可略高",
            "B": "阴虚证患者宜安置在向阳温暖的病室内，使患者感到舒适",
            "C": "热证患者病室温度以16-20℃为宜",
            "D": "阳亢患者，神经衰弱者病室光线宜偏暗",
            "E": "风寒湿痹患者，病室光线充足，可增进食欲"
          },
          "answer": "B",
          "analysis": "阴虚证者，多有恶热喜凉之求，可集中在背阴凉爽通风病室内，使患者感到凉爽、舒适、心静，利于养病。",
          "type": "多选题"
        },
        {
          "id": 14490,
          "title": "夏季阳气旺盛，万物生长茂盛。这个季节白昼最长，所以夏季起居方面应遵循",
          "options": {
            "A": "早卧早起",
            "B": "晚卧早起",
            "C": "早卧晚起",
            "D": "晚卧晚起",
            "E": "以上说的都不对"
          },
          "answer": "B",
          "analysis": "夏季阳气旺盛，万物生长茂盛。这个季节白昼最长，黑夜最短，宜“夜卧早起”，顺应夏季阳长之气，夜卧，晚点睡但最好不超过11点，早起则有助于阳气生发之力。由于白天时间过长，还应适当延长午休时间，减轻疲劳感。所以选择B，晚卧早起，也就是夜卧早起。",
          "type": "多选题"
        },
        {
          "id": 14491,
          "title": "有关压疮的内容，哪项说的不正确",
          "options": {
            "A": "压疮重在预防，应每隔3小时翻身1次。",
            "B": "保持卧床患者衣裤、床单的平整、清洁、无皱折、无渣屑，减少对皮肤的刺激。",
            "C": "定时检查受压部位，尤其是骨突处，观察皮肤颜色和血运情况。",
            "D": "对于压疮患者可用气垫床或在骶尾部或足跟部垫气圈或气垫，或软枕，增加人体与床的接触面积，减轻局部组织所受的压力。",
            "E": "气滞血瘀型压疮，局部热敷或红花酒适当按摩局部受压部位。"
          },
          "answer": "A",
          "analysis": "应该2小时翻身一次，并且建立翻身记录卡，保证按时翻身，防止出现压疮。",
          "type": "多选题"
        },
        {
          "id": 14492,
          "title": "请仔细阅读，下面哪句不正确",
          "options": {
            "A": "避免久视伤血",
            "B": "避免久立伤筋",
            "C": "避免神劳，损伤脾运",
            "D": "避免久卧伤气",
            "E": "避免久坐伤肉"
          },
          "answer": "B",
          "analysis": "《素问·宣明五气》指出：“久视伤血，久卧伤气，久坐伤肉，久立伤骨、久行伤筋、是谓五劳七伤。所以B选项不正确，因为久立伤骨。",
          "type": "多选题"
        },
        {
          "id": 14549,
          "title": "中药具有的特点有哪些？",
          "options": {
            "A": "中药最初都是产于中国",
            "B": "中药主要源于天然产物，但天然产物并不一定都是中药",
            "C": "它充分反应了我国的历史文化、自然资源等方面的若干特点",
            "D": "以上都是",
            "E": ""
          },
          "answer": "D",
          "analysis": "中药是和西药相对而言的。它是对我国中医传统药物的总称。它具有以下几个特点:1.从产地来看，绝大多数的中药最初都是出产于中国。2.中药主要源于天然产物，但天然产物并不一定都是中药。中药不仅具有天然产物的自然属性，更关键的是，中药的认识和使用是以中医理论为基础，它具有特定的内涵、独特的理论体系和应用形式勤求博采。",
          "type": "多选题"
        },
        {
          "id": 14550,
          "title": "古代本草书籍所记载中药有多少种？",
          "options": {
            "A": "2000种",
            "B": "3000种",
            "C": "4000种",
            "D": "5000种",
            "E": "6000种"
          },
          "answer": "B",
          "analysis": "古代本草书籍所载中药已逾3000种，经目前整理则达12807种，故选B，",
          "type": "多选题"
        },
        {
          "id": 14551,
          "title": "中药的植物药占百分之？",
          "options": {
            "A": "80%",
            "B": "40%",
            "C": "50%",
            "D": "60%",
            "E": "70%"
          },
          "answer": "A",
          "analysis": "由于中药以植物药居多 (占80%多)，且植物药的使用也最普遍，故有“诸药草类最多，诸药以草为本的说法。五代韩保异说:“药有玉石草木虫兽，而直言本草者，草类药为最多也。”因此，自古相沿将中药称作“本草”。故选A。",
          "type": "多选题"
        },
        {
          "id": 14552,
          "title": "我国现存最早的药学专著是？",
          "options": {
            "A": "《神农本草经》",
            "B": "《黄帝内经》",
            "C": "《本草纲目》",
            "D": "《难经》",
            "E": "《伤寒杂病论》"
          },
          "answer": "A",
          "analysis": "《神农本草经》又称《本草经》或《本经》，托名“神农”所作，实成书于汉代，是中医四大经典著作之一，是现存最早的中药学著作，故选A。",
          "type": "多选题"
        },
        {
          "id": 14553,
          "title": "神农本草经共记载多少种药物？",
          "options": {
            "A": "1000种",
            "B": "500种",
            "C": "365种",
            "D": "366种",
            "E": "265种"
          },
          "answer": "C",
          "analysis": "《神农本草经》记载药物365种，包括草、谷、米、果、木、虫、鱼、家畜、金石等。其中植物药252种，动物药67种，矿物药46种，故选C。",
          "type": "多选题"
        },
        {
          "id": 14554,
          "title": "中医四大经典是？",
          "options": {
            "A": "《脉经》",
            "B": "《伤寒杂病论》",
            "C": "《神农本草经》",
            "D": "《难经》",
            "E": "《黄帝内经》"
          },
          "answer": "B#C#D#E",
          "analysis": "《神农本草经》是我国本草学的奠基之作，与《黄帝内经》《黄帝八十一难经》《伤寒杂病论》一并被奉为“四大经典”，故选BCDE。",
          "type": "多选题"
        },
        {
          "id": 14555,
          "title": "集我国16世纪以前药学大成的本草著作是？",
          "options": {
            "A": "《新修本草》",
            "B": "《本草经集注》",
            "C": "《证类本草》",
            "D": "《本草纲目》",
            "E": "《中华本草》"
          },
          "answer": "D",
          "analysis": "《本草纲目》总结了我国16世纪以前的药物学知识，是我国大型骨干本草的范本，其影响远远超出了本草学范围，故选D。",
          "type": "多选题"
        },
        {
          "id": 14556,
          "title": "最早采用图文对照编写方法的本草著作是？",
          "options": {
            "A": "《本草纲目》",
            "B": "《中华本草》",
            "C": "《本草经集注》",
            "D": "《证类本草》",
            "E": "《新修本草》"
          },
          "answer": "E",
          "analysis": "在《新修本草》的编写过程中，唐政府通令全国各地选送当地道地药材，作为实物标本进行描绘，从而增加了药物图谱，并附以文字说明，这种图文对照的方法，开创了世界药学著作的先例，故选E。",
          "type": "多选题"
        },
        {
          "id": 14557,
          "title": "《本草纲目》为哪朝代的本草代表作？",
          "options": {
            "A": "明朝",
            "B": "元朝",
            "C": "唐朝",
            "D": "宋代",
            "E": "清代"
          },
          "answer": "A",
          "analysis": "《本草纲目》，药学著作，五十二卷，明朝李时珍撰，刊于1590年。全书共190多万字，载有药物1892种，收集医方11096个。",
          "type": "多选题"
        },
        {
          "id": 14558,
          "title": "《本草纲目》共记载了多少种药物？",
          "options": {
            "A": "365种",
            "B": "1892种",
            "C": "1992种",
            "D": "1462种",
            "E": "1782种"
          },
          "answer": "B",
          "analysis": "《本草纲目》载药数目:全书共52卷，载药1892种，新增374种，附药图1109幅，附方11096首。",
          "type": "多选题"
        },
        {
          "id": 14559,
          "title": "《本草纲目拾遗》的朝代为？",
          "options": {
            "A": "明朝",
            "B": "元朝",
            "C": "唐朝",
            "D": "宋代",
            "E": "清代"
          },
          "answer": "E",
          "analysis": "《本草纲目拾遗》简称《纲目拾遗》，清代本中医学者、本草学家赵学敏编著，为清代本草代表作。",
          "type": "多选题"
        },
        {
          "id": 14560,
          "title": "我国最早的中药炮制专著是？",
          "options": {
            "A": "《雷公炮灸论》",
            "B": "《本草拾遗》",
            "C": "《炮灸大法》",
            "D": "《神农本草经》",
            "E": "《新修本草》"
          },
          "answer": "A",
          "analysis": "南朝刘宋时代雷敩所著的《雷公炮炙论》是我国第一部炮制专著，该书系统地介绍了300种中药的炮制方法，其中有些方法仍沿用至今，为中药炮制的发展奠定了基础，故选A。",
          "type": "多选题"
        },
        {
          "id": 14561,
          "title": "我国第一部药典性著作是？",
          "options": {
            "A": "《本草纲目》",
            "B": "《中华本草》",
            "C": "《本草经集注》",
            "D": "《新修本草》",
            "E": "《证类本草》"
          },
          "answer": "D",
          "analysis": "唐显庆四年颁布了经政府批准撰写的《新修本草》，由于它是第一次由国家组织修定和推行的，因此它是我国，也是世界上公开颁布的最早的药典，故选D。",
          "type": "多选题"
        },
        {
          "id": 14562,
          "title": "历史悠久、产地适宜、品种优良、产量宏丰、炮制考究、疗效突出、带有地域特点的药材，传统被称为？",
          "options": {
            "A": "特产药材",
            "B": "名产药材",
            "C": "道地药材",
            "D": "稀有药材",
            "E": "贵重药材"
          },
          "answer": "C",
          "analysis": "所谓道地药材，又称地道药材，是优质纯真药材的专用名词，它是指历史悠久、产地适宜、品种优良、产量宏丰、炮制考究、疗效突出、带有地域特点的药材，故选C。",
          "type": "多选题"
        },
        {
          "id": 14563,
          "title": "不属于四大怀药的是？",
          "options": {
            "A": "地黄",
            "B": "牛膝",
            "C": "山药",
            "D": "龙胆",
            "E": "菊花"
          },
          "answer": "D",
          "analysis": "产于河南的焦作温县、沁阳、武、孟州的怀地黄、怀山药、怀牛膝、怀菊花，为著名的“四大怀药”，龙胆为重要的关药。",
          "type": "多选题"
        },
        {
          "id": 14564,
          "title": "下列属于川药药材的是？",
          "options": {
            "A": "川芎",
            "B": "巴戟天",
            "C": "茯苓",
            "D": "吴茱萸",
            "E": "地黄"
          },
          "answer": "A",
          "analysis": "川药指四川、重庆等地所出产的道地药材，川芎主产于四川(灌县)，巴戟天属广药，茯苓属云药，吴茱萸属贵药，地黄属怀药。",
          "type": "多选题"
        },
        {
          "id": 14565,
          "title": "下列药材不属于浙八味的是？",
          "options": {
            "A": "浙贝母",
            "B": "杭白菊",
            "C": "麦冬",
            "D": "山药",
            "E": "玄参"
          },
          "answer": "D",
          "analysis": "“浙八味”是指白术、白芍、浙贝母、杭白菊、延胡索、玄参、笕麦冬、温郁金这八味中药材，山药属怀药。",
          "type": "多选题"
        },
        {
          "id": 14566,
          "title": "道地药材产于山西的是？",
          "options": {
            "A": "枸杞",
            "B": "当归",
            "C": "阿胶",
            "D": "牛膝",
            "E": "党参"
          },
          "answer": "E",
          "analysis": "在上述备选药物中，枸杞的道地药材产于宁夏；当归的道地药材产于甘肃；阿胶的道地药材产于山东；牛膝的道地药材产于河南；党参的道地药材产于山西，故选E。",
          "type": "多选题"
        },
        {
          "id": 14568,
          "title": "道地药材产于甘肃的是？",
          "options": {
            "A": "枸杞",
            "B": "当归",
            "C": "阿胶",
            "D": "牛膝",
            "E": "党参"
          },
          "answer": "B",
          "analysis": "在上述备选药物中，枸杞的道地药材产于宁夏；当归的道地药材产于甘肃；阿胶的道地药材产于山东；牛膝的道地药材产于河南；党参的道地药材产于山西，故选B。",
          "type": "多选题"
        },
        {
          "id": 14569,
          "title": "道地药材产于东北的是？",
          "options": {
            "A": "黄连、附子",
            "B": "薄荷、苍术",
            "C": "细辛、五味子",
            "D": "阿胶",
            "E": "地黄"
          },
          "answer": "C",
          "analysis": "在上述备选药物中，黄连、附子的道地药材产于四川；薄荷、苍术的道地药材产于江苏；细辛、五味子的道地药材产于东北；阿胶的道地药材产于山东；地黄的道地药材产于河南，故选C。",
          "type": "多选题"
        },
        {
          "id": 14570,
          "title": "确定道地药材的主要因素有？",
          "options": {
            "A": "产地",
            "B": "品种",
            "C": "质量",
            "D": "产量",
            "E": "疗效"
          },
          "answer": "A#B#C#D#E",
          "analysis": "道地药材是指历史悠久、产地适宜、品种优良、产量宏丰、炮制考究、疗效突出、带有地域特点的药材，因此道地药材的确定与产地、品种、质量、产量、疗效都有关系，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 14571,
          "title": "四川的道地药材有？",
          "options": {
            "A": "地黄",
            "B": "黄连",
            "C": "川芎",
            "D": "乌头",
            "E": "茯苓"
          },
          "answer": "B#C#D",
          "analysis": "黄连、川芎、乌头的道地药材产于四川，地黄的道地药材产于河南，茯苓的道地药材产于云南，故选BCD。",
          "type": "多选题"
        },
        {
          "id": 14574,
          "title": "沙苑子的采收应在？",
          "options": {
            "A": "果实成熟时",
            "B": "果实成熟后",
            "C": "果实未成熟时",
            "D": "种子成熟后",
            "E": "种子成熟时"
          },
          "answer": "B",
          "analysis": "以种子入药的，通常在果实成熟后采集，如莲子、白果、沙苑子、菟丝子等。故选B。",
          "type": "多选题"
        },
        {
          "id": 14575,
          "title": "二、八月最宜采集的药材是？",
          "options": {
            "A": "叶类",
            "B": "花类",
            "C": "全草类",
            "D": "果实类",
            "E": "根及根茎"
          },
          "answer": "E",
          "analysis": "根及根茎一般以早春及深秋，即二月、八月采收最佳，因为春初“津润始萌，未充枝叶，势力淳浓”，“至秋枝叶干枯，津润归流于下”。且现代研究也证明，早春及深秋时植物的根茎中有效成分含量较高，此时采集产量和质量都较高，故选E。",
          "type": "多选题"
        },
        {
          "id": 14576,
          "title": "野菊花的采收应在？",
          "options": {
            "A": "含苞欲放时",
            "B": "果实成熟后",
            "C": "二者均是",
            "D": "二者均不是",
            "E": "花蕾盛开时"
          },
          "answer": "A",
          "analysis": "花、花粉:花类药材，一般采收未开放的花蕾或刚开放的花朵，以免气味散失、花瓣散落而影响质量，如野菊花、金银花、月季花等，故选A。",
          "type": "多选题"
        },
        {
          "id": 14577,
          "title": "中药在运输、贮藏过程中，如果管理不当会出现什么现象？",
          "options": {
            "A": "变色",
            "B": "泛油",
            "C": "发霉",
            "D": "风化",
            "E": "虫蛀"
          },
          "answer": "A#B#C#D#E",
          "analysis": "中药在运输、贮藏过程中，如果管理不当，养护不善在外界条件和自身性质相互作用下，就会逐渐发生物理化学变化，出现发霉、虫蛀、变色、变味、泛油、风化等现象，直接影响药物的质量与疗效，这种现象称为中药的变异现象。故选ABCDE",
          "type": "多选题"
        },
        {
          "id": 14578,
          "title": "淫羊藿用羊脂炒后能？",
          "options": {
            "A": "活血止痛",
            "B": "润肺止咳",
            "C": "活血作用增强",
            "D": "补肾助阳",
            "E": "入肝消极"
          },
          "answer": "D",
          "analysis": "增强药物功能，提高临床疗效，如延胡索醋制以后能增强活血止痛功效，麻黄、紫、款冬花蜜制增强润肺止咳作用，大黄酒制后活血作用增强，淫羊藿用羊脂炒后能增强补肾助阳作用。故选D。",
          "type": "多选题"
        },
        {
          "id": 14579,
          "title": "生地黄酒制成熟地黄后的功效有？",
          "options": {
            "A": "补血滋阴、益精填髓",
            "B": "补肝肾、益精血",
            "C": "药性凉润、清化热痰",
            "D": "燥湿化痰、祛风解痉",
            "E": "截疟解毒、润肠通便"
          },
          "answer": "A",
          "analysis": "生地黄功专清热凉血、滋阴生津，而酒制成熟地黄后则成补血滋阴、益精填髓之品。故选A。",
          "type": "多选题"
        },
        {
          "id": 14580,
          "title": "下列哪项不是水制的方法？",
          "options": {
            "A": "漂洗",
            "B": "浸泡",
            "C": "喷洒",
            "D": "炒黄",
            "E": "闷润"
          },
          "answer": "D",
          "analysis": "用水或其他液体辅料处理药材的方法称为水制法。其目的主要是清洁药物、除杂质、软化物、便降低毒性及调整药性等。常见的水制方法有漂洗、闷润浸泡、喷洒、水飞等。故选D。",
          "type": "多选题"
        },
        {
          "id": 14581,
          "title": "朱砂常用于哪种水制方法？",
          "options": {
            "A": "漂洗",
            "B": "浸泡",
            "C": "喷洒",
            "D": "水飞",
            "E": "闷润"
          },
          "answer": "D",
          "analysis": "水飞是借药物在水中的沉降性质分取药材极细粉末的方法，常用于矿物类、贝壳类药物的制粉，如水飞朱砂、炉甘石、滑石、海蛤壳、雄黄等。故选D。",
          "type": "多选题"
        },
        {
          "id": 14582,
          "title": "以下属于水火共制的是？",
          "options": {
            "A": "煮法",
            "B": "煨",
            "C": "灸",
            "D": "炒炭",
            "E": "闷润"
          },
          "answer": "A",
          "analysis": "这类炮制方法是既要用水又要用火，有些药物还必须加入其它辅料进行炮制。包括煮、蒸、炖、耀、淬等方法。故选A。",
          "type": "多选题"
        },
        {
          "id": 14583,
          "title": "淬法适用于哪种药物？",
          "options": {
            "A": "生姜",
            "B": "鳖甲",
            "C": "木香",
            "D": "刺猥皮",
            "E": "阿胶珠"
          },
          "answer": "B",
          "analysis": "淬法是将药物烧红后，迅速投入冷水或液体辅料中，使其酥脆的方法。淬后不仅易于粉碎，且辅料被其吸收，可发挥预期疗效。如醋淬自然铜、鳖甲，黄连煮汁淬炉甘石等。故选B。",
          "type": "多选题"
        },
        {
          "id": 14584,
          "title": "肉豆蔻适用于哪种炮制方法？",
          "options": {
            "A": "煨",
            "B": "灸",
            "C": "炒炭",
            "D": "闷润",
            "E": "煮法"
          },
          "answer": "A",
          "analysis": "煨是将药物用湿面或湿纸包裹，置于热火灰中或用吸油纸与药物隔层分开进行加热的方法。其目的是除去药物中的部分挥发性及刺激性成分，以缓和药性降低副作用，增强疗效。如煨肉豆蔻、煨木香、煨生姜煨葛根等。",
          "type": "多选题"
        },
        {
          "id": 14585,
          "title": "降低巴豆毒性的炮制方法是？",
          "options": {
            "A": "水制",
            "B": "酒炒",
            "C": "去油制霜",
            "D": "水飞",
            "E": ""
          },
          "answer": "C",
          "analysis": "对一些毒副作用较强的药物经过加工炮制后，可以明显降低药物的毒性和副作用，使之广泛用于临床并保证安全用药。如巴豆压油取霜，醋煮甘遂、京大戟，酒炒常山，甘草银花水煮川乌、草乌，姜矶水制半夏、南星，胆巴水制附子等，均能降低其毒副作用。故选C。",
          "type": "多选题"
        },
        {
          "id": 14586,
          "title": "常用的炮制方法有？",
          "options": {
            "A": "修制",
            "B": "水制",
            "C": "火制",
            "D": "水火共制",
            "E": "其他制法"
          },
          "answer": "A#B#C#D#E",
          "analysis": "中药常用的炮制方法有修治、水制、火制、水火共制、其他制法五大类型，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 14587,
          "title": "中药炮制的主要目的是？",
          "options": {
            "A": "增强作用，提高疗效",
            "B": "降低毒副作用",
            "C": "改变性能和功效",
            "D": "便于调剂",
            "E": "便于定向用药"
          },
          "answer": "A#B#C#D#E",
          "analysis": "中药炮制的目的有八个方面：①纯净药材，保证质量，分捡药物，区分等级；②切制饮片，便于调剂制剂；③干燥药材，利于贮藏；④矫味、矫臭，便于服用；⑤降低毒副作用，保证安全用药；⑥增强药物功能，提高临床疗效；⑦改变药物性能，扩大应用范围；⑧引药入经，便于定向用药。故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 14648,
          "title": "相须、相使配伍可产生？",
          "options": {
            "A": "协同作用，增进疗效",
            "B": "拮抗作用，降低疗效",
            "C": "减毒作用",
            "D": "毒副作用",
            "E": "以上都不是"
          },
          "answer": "A",
          "analysis": "相须就是两种功效类似的药物配合应用，可以增强原有药物的功效。相使就是以一种药物为主，另一种药物为辅，两药合用，辅药可以提高主主药的功效。相须、相使可以起到协同作用，能提高药效，是临床常用的配伍方法，故选A。",
          "type": "多选题"
        },
        {
          "id": 14649,
          "title": "黄芪与茯苓配伍，茯苓能增强黄芪补气利水的功效，这种配伍关系属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相杀",
            "E": "相恶"
          },
          "answer": "B",
          "analysis": "黄芪配茯苓治脾虚水肿，黄芪为健脾益气、利尿消肿的主药，茯苓淡渗利湿，可增强黄芪益气利尿的作用，这种配伍关系属于相使，故选B。",
          "type": "多选题"
        },
        {
          "id": 14650,
          "title": "两种药物合用，一种药物能破坏另一种药物的功效，这种配伍关系属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相杀",
            "E": "相恶"
          },
          "answer": "E",
          "analysis": "相恶是指两药合用，一种中药能使另一种中药原有功效降低，甚至丧失。故选E。",
          "type": "多选题"
        },
        {
          "id": 14651,
          "title": "两种药物配伍能产生剧烈的毒性反应或副作用，这种配伍关系属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相反",
            "D": "相杀",
            "E": "相恶"
          },
          "answer": "C",
          "analysis": "相反:就是两种中药同用能产生或增强毒性或副作用。如甘草反甘遂，贝母反乌头等，故选C。",
          "type": "多选题"
        },
        {
          "id": 14652,
          "title": "人参配莱菔子，莱菔子能消弱人参的补气作用，这种配伍关系属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相恶",
            "E": "相杀"
          },
          "answer": "D",
          "analysis": "人参恶莱菔子，是指人参与莱菔子配伍同用，莱菔子能削弱人参的补气作用，这种配伍关系属于相恶，故选D。",
          "type": "多选题"
        },
        {
          "id": 14653,
          "title": "全蝎与蜈蚣配伍属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相反",
            "E": "相恶"
          },
          "answer": "A",
          "analysis": "全蝎、蜈蚣同用能明显增强平肝息风、止痉定搐的作用，这种配伍关系属于相须，故选A。",
          "type": "多选题"
        },
        {
          "id": 14654,
          "title": "枸杞子与菊花配伍属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相反",
            "E": "相恶"
          },
          "answer": "B",
          "analysis": "枸杞子配菊花治目暗昏花，枸杞子为补肾益精、养肝明目的主药，菊花清肝泻火，兼能益阴明目，可以增强枸杞的补虚明目的作用，这种配伍关系属于相使，故选B。",
          "type": "多选题"
        },
        {
          "id": 14655,
          "title": "生姜与半夏配伍属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相杀",
            "E": "相恶"
          },
          "answer": "D",
          "analysis": "生姜与半夏配伍同用，生姜可以抑制半夏的毒副作用，这种配伍关系属于相杀，故选D。",
          "type": "多选题"
        },
        {
          "id": 14656,
          "title": "使用毒副作用较强的药物应考虑的配伍方法是？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相杀",
            "E": "相反"
          },
          "answer": "C#D",
          "analysis": "相畏、相杀可以减轻或消除毒副作用，以确保用药安全，是使用毒副作用较强药物的配伍方法，也可用于有毒中药的炮制及中毒解救，故选CD。",
          "type": "多选题"
        },
        {
          "id": 14657,
          "title": "中药配伍的目的是？",
          "options": {
            "A": "增强疗效",
            "B": "减轻毒性",
            "C": "扩大治疗范围",
            "D": "适应复杂病情",
            "E": "改变药物的味"
          },
          "answer": "A#B#C#D",
          "analysis": "中药配伍应用能适应复杂病情，增强疗效，减轻毒性，扩大治疗范围，但不能改变药物的味，故选ABCD。",
          "type": "多选题"
        },
        {
          "id": 14658,
          "title": "与乌头相反的药物应除（）外",
          "options": {
            "A": "玄参",
            "B": "白及",
            "C": "贝母",
            "D": "瓜蒌",
            "E": "半夏"
          },
          "answer": "A",
          "analysis": "乌头反贝母、瓜蒌、半夏、白及、白蔹，而玄参不与乌头相反，故选A。",
          "type": "多选题"
        },
        {
          "id": 14659,
          "title": "属于十八反的配伍药对是？",
          "options": {
            "A": "甘草与海藻",
            "B": "丁香与郁金",
            "C": "人参与五灵脂",
            "D": "三棱与莪术",
            "E": "川芎与牛膝"
          },
          "answer": "A",
          "analysis": "甘草与海藻配伍属于十八反的内容，而丁香与郁金、人参与五灵脂配伍属于十九畏的内容，而三棱与莪术，川芎与牛膝配伍不属于配伍禁忌，故选A。",
          "type": "多选题"
        },
        {
          "id": 14660,
          "title": "属于十九畏的配伍药对是？",
          "options": {
            "A": "川乌与草乌",
            "B": "桃仁与红花",
            "C": "官桂与赤石脂",
            "D": "乌头与贝母",
            "E": "甘草与甘遂"
          },
          "answer": "C",
          "analysis": "官桂与赤石脂配伍属于十九畏内容，而乌头与贝母、甘草与甘遂配伍属于十八反内容，川乌与草乌，桃仁与红花配伍不属于配伍禁忌，故选C。",
          "type": "多选题"
        },
        {
          "id": 14661,
          "title": "属于十八反的是？",
          "options": {
            "A": "陈皮配半夏",
            "B": "石膏配牛膝",
            "C": "乌头配半夏",
            "D": "生姜配黄芩",
            "E": "丁香配郁金"
          },
          "answer": "C",
          "analysis": "上述几组药物中，乌头配半夏属于十八反的内容，丁香配郁金属于十九畏的内容，而陈皮配半夏属于相须，石膏配牛膝属于相使，生姜配黄芩属于相恶。故选C。",
          "type": "多选题"
        },
        {
          "id": 14662,
          "title": "属于十九畏的是？",
          "options": {
            "A": "陈皮配半夏",
            "B": "石膏配牛膝",
            "C": "乌头配半夏",
            "D": "生姜配黄芩",
            "E": "丁香配郁金"
          },
          "answer": "E",
          "analysis": "上述几组药物中，乌头配半夏属于十八反的内容，丁香配郁金属于十九畏的内容，而陈皮配半夏属于相须，石膏配牛膝属于相使，生姜配黄芩属于相恶。故选E。",
          "type": "多选题"
        },
        {
          "id": 14663,
          "title": "不宜与瓜蒌同用的药是？",
          "options": {
            "A": "乌头",
            "B": "甘草",
            "C": "三棱",
            "D": "芒硝",
            "E": "藜芦"
          },
          "answer": "A",
          "analysis": "十八反中乌头反瓜蒌，即乌头不宜与瓜蒌同用，故选A。",
          "type": "多选题"
        },
        {
          "id": 14664,
          "title": "不宜与牙硝同用的药是？",
          "options": {
            "A": "乌头",
            "B": "甘草",
            "C": "三棱",
            "D": "芒硝",
            "E": "藜芦"
          },
          "answer": "C",
          "analysis": "十九畏中牙硝畏三棱，即牙硝不宜与三棱同用，故选C。",
          "type": "多选题"
        },
        {
          "id": 14665,
          "title": "不宜与砒霜同用的药物是？",
          "options": {
            "A": "海藻",
            "B": "贝母",
            "C": "玄参",
            "D": "水银",
            "E": "朴硝"
          },
          "answer": "D",
          "analysis": "“十九畏”中水银畏砒霜，硫黄畏朴硝，均属于配伍禁忌的内容，故选D。",
          "type": "多选题"
        },
        {
          "id": 14666,
          "title": "不宜与硫黄同用的药物是？",
          "options": {
            "A": "海藻",
            "B": "贝母",
            "C": "玄参",
            "D": "水银",
            "E": "朴硝"
          },
          "answer": "E",
          "analysis": "“十九畏”中水银畏砒霜，硫黄畏朴硝，均属于配伍禁忌的内容，故选E。",
          "type": "多选题"
        },
        {
          "id": 14667,
          "title": "与藜芦相反的药物有？",
          "options": {
            "A": "人参",
            "B": "细辛",
            "C": "玄参",
            "D": "沙参",
            "E": "丹参"
          },
          "answer": "A#B#C#D#E",
          "analysis": "十八反中，藜芦反人参、丹参、玄参、沙参、细辛、芍药，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 14668,
          "title": "黄精甘平用于哪种病症？",
          "options": {
            "A": "表实无汗",
            "B": "肺虚燥咳",
            "C": "脾虚有湿",
            "D": "肺气不宣",
            "E": "咳嗽痰多"
          },
          "answer": "B",
          "analysis": "黄精甘平，功能滋阴补肺、补脾益气，主要用于肺虚燥咳、脾胃虚弱及肾虚精亏的病证，但因其性质滋腻，易助湿邪，因此，凡脾虚有湿、咳嗽痰多以及中寒便浦者则不宜服用黄精。故选B。",
          "type": "多选题"
        },
        {
          "id": 14669,
          "title": "妊娠禁用药应除（）外",
          "options": {
            "A": "牵牛",
            "B": "桃仁",
            "C": "巴豆",
            "D": "莪术",
            "E": "水蛭"
          },
          "answer": "B",
          "analysis": "妊娠禁用药是指毒性较强或药性猛烈的药物，如牵牛、巴豆、莪术、水蛭、雄黄、砒霜等，而通经去瘀、行气破滞及辛热滑利之品如桃仁、红花、牛膝等则属于妊娠慎用药，故选B。",
          "type": "多选题"
        },
        {
          "id": 14670,
          "title": "妊娠慎用药应除（）外",
          "options": {
            "A": "牛膝",
            "B": "白术",
            "C": "大黄",
            "D": "红花",
            "E": "附子"
          },
          "answer": "B",
          "analysis": "牛膝、大黄、红花、附子属于妊娠慎用药，白术具有健脾益气、燥湿利水、止汗安胎之功，不属于妊娠用药禁忌，故选B。",
          "type": "多选题"
        },
        {
          "id": 14671,
          "title": "妊娠用药禁忌的理由有？",
          "options": {
            "A": "对母体不利",
            "B": "对胎儿不利",
            "C": "对产程不利",
            "D": "对小儿不利",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "随着对妊娠禁忌药的认识逐渐深入，对妊娠用药禁忌理由的认识也逐步加深。归纳起来，主要包括:对体不利，2对胎儿不利;对产程不利，对小儿不利。故选E。",
          "type": "多选题"
        },
        {
          "id": 14672,
          "title": "属于妊娠慎用药的是？",
          "options": {
            "A": "桃仁",
            "B": "牛膝",
            "C": "大黄",
            "D": "附子",
            "E": "川乌"
          },
          "answer": "A#B#C#D",
          "analysis": "妊娠慎用药主要包括活血化瘀药、行气药、攻下导滞药、药性辛热的温里药以及性质滑利之品，如桃仁、红花、牛膝、积实、大黄、附子、肉桂、干姜、木通、冬葵子、瞿麦等。故选ABCD。",
          "type": "多选题"
        },
        {
          "id": 14673,
          "title": "属于妊娠禁用药的是？",
          "options": {
            "A": "红花",
            "B": "干姜",
            "C": "巴豆",
            "D": "肉桂",
            "E": "商陆"
          },
          "answer": "C#E",
          "analysis": "妊娠禁用药:是指性强的、作用的以及堕胎作用较强的药，如巴豆、牵牛子、大戟、商陆、麝香、三棱、莪术、水蛭、斑蝥、马钱子、川乌、雄黄、砒石等。故选CE。",
          "type": "多选题"
        },
        {
          "id": 14674,
          "title": "胸痹患者最应忌食的是？",
          "options": {
            "A": "肥肉",
            "B": "脂肪",
            "C": "动物内脏",
            "D": "烟",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "胸痹患者最应忌食肥肉、脂肪、动物内脏及烟、酒等，故选E。",
          "type": "多选题"
        },
        {
          "id": 14675,
          "title": "皮肤病患者最应忌食的是？",
          "options": {
            "A": "鱼、虾、蟹等腥膻发物",
            "B": "肥肉、脂肪、动物内脏",
            "C": "二者均是",
            "D": "二者均不是",
            "E": ""
          },
          "answer": "A",
          "analysis": "皮肤病患者最应忌食鱼、虾、蟹等腥膻发物及辛辣刺激性食品，故选A。",
          "type": "多选题"
        },
        {
          "id": 14676,
          "title": "用药禁忌包括？",
          "options": {
            "A": "配伍禁忌",
            "B": "妊娠禁忌",
            "C": "饮食禁忌",
            "D": "炮制禁忌",
            "E": "证候禁忌"
          },
          "answer": "A#B#C#E",
          "analysis": "中药的用药禁忌主要包括配伍禁忌、证候禁忌、妊娠禁忌和服药时的饮食禁忌四个方面，故选ABCE。",
          "type": "多选题"
        },
        {
          "id": 14677,
          "title": "化石类药常用量为？",
          "options": {
            "A": "15`30g",
            "B": "20`30g",
            "C": "16`30g",
            "D": "17`30g",
            "E": "18`30g"
          },
          "answer": "A",
          "analysis": "除了毒性大的药，泻下、行气、活血作用峻猛的药，精制药及某些贵重药外，一般中药常用内服剂量为5~10g，部分质地重而无毒的矿物、贝壳、甲壳化石类药常用量为15~30g，新鲜的动植物药常用量为30~60g。故选A。",
          "type": "多选题"
        },
        {
          "id": 14678,
          "title": "中药的计量单位有？",
          "options": {
            "A": "重量：斤",
            "B": "数量：片",
            "C": "度量：尺",
            "D": "容量：升",
            "E": "重量：两"
          },
          "answer": "A#B#C#D#E",
          "analysis": "中药的计量单位有:1.重量:市制:斤、两、钱、分、厘;公制:千克、克、毫克;2.数量:如生姜三片、蜈二条、大枣七枚、芦根一支、荷叶一角、葱白两只等.3.度量:如尺、寸;4.容量:如古代用斗、升、合、勺等;现代用升、毫升等。故选ABCDE",
          "type": "多选题"
        },
        {
          "id": 14679,
          "title": "临床上确定中药用量的主要依据是？",
          "options": {
            "A": "服药的季节",
            "B": "所用药物的性质",
            "C": "患者年龄、体质、病情",
            "D": "剂型",
            "E": "配伍"
          },
          "answer": "A#B#C#D#E",
          "analysis": "一般来讲，确定中药的剂量，应考虑到药物性质、剂型、配伍、年龄、体质、病情及季节变化等方面的因素，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 14680,
          "title": "入汤剂需先煎的药物是？",
          "options": {
            "A": "薄荷、白豆蔻",
            "B": "蒲黄、海金沙",
            "C": "人参、阿胶",
            "D": "磁石、牡蛎",
            "E": "以上均不是"
          },
          "answer": "D",
          "analysis": "上述药物中，磁石、牡蛎为有效成分难溶于水的矿物、介壳类药物，应打碎先煎，煮沸20－30分钟后，再下其它药物同煎，以使有效成分充分溶出，故选D。",
          "type": "多选题"
        },
        {
          "id": 14681,
          "title": "入汤剂需后下的药物是？",
          "options": {
            "A": "磁石、牡蛎",
            "B": "蒲黄、海金沙",
            "C": "薄荷、白豆蔻",
            "D": "人参、鹿茸",
            "E": "芒硝、阿胶"
          },
          "answer": "C",
          "analysis": "上述药物中，薄荷、白豆蔻属气味芳香的药物，久煎其有效成分易于挥发而降低药效，须在其它药物煎煮将成时放入，煎沸3-5分钟即可，故选C。",
          "type": "多选题"
        },
        {
          "id": 14682,
          "title": "蒲黄、旋覆花等药入煎剂宜？",
          "options": {
            "A": "包煎",
            "B": "后下",
            "C": "先煎",
            "D": "烊化",
            "E": "冲服"
          },
          "answer": "A",
          "analysis": "蒲黄为花粉入药，质轻，煎煮时易漂浮于药液表面，或成糊状，不便于煎煮及服用；旋覆花为花序入药，带有绒毛，易刺激咽喉引起咳嗽，故两药入煎剂时宜先用纱布袋装好，再与其它药物同煎，故选A。",
          "type": "多选题"
        },
        {
          "id": 14683,
          "title": "宜饭后服用的药是？",
          "options": {
            "A": "峻下逐水药",
            "B": "对胃肠有刺激性的药",
            "C": "驱虫药",
            "D": "安神药",
            "E": "截疟药"
          },
          "answer": "B",
          "analysis": "饭前还是饭后服药主要决定于病变部位和性质，对胃肠有刺激性的药物宜饭后服用，故选B；此外，峻下逐水药宜晨起空腹服药，驱虫药宜饭前服用，安神药宜睡前服用，截疟药应在疟疾发作前两小时服药。",
          "type": "多选题"
        },
        {
          "id": 14684,
          "title": "中药传统的给药途径是？",
          "options": {
            "A": "舌下给药",
            "B": "直肠给药",
            "C": "口服和皮肤给药",
            "D": "粘膜表面给药",
            "E": "吸入给药"
          },
          "answer": "C",
          "analysis": "中药传统的给药途径是口服和皮肤给药，故选C。舌下给药、直肠给药、粘膜表面给药、吸入给药都属于现代给药途径。",
          "type": "多选题"
        },
        {
          "id": 14685,
          "title": "西洋参入汤剂宜？",
          "options": {
            "A": "先煎",
            "B": "后下",
            "C": "包煎",
            "D": "另煎",
            "E": "烊化"
          },
          "answer": "D",
          "analysis": "西洋参属贵重药材，为了更好的煎出有效成分，应单独另煎，即另炖2－3小时，故选D。",
          "type": "多选题"
        },
        {
          "id": 14686,
          "title": "钩藤入汤剂宜？",
          "options": {
            "A": "先煎",
            "B": "后下",
            "C": "包煎",
            "D": "另煎",
            "E": "烊化"
          },
          "answer": "B",
          "analysis": "钩藤久煎易破坏其有效成分，应后下，故选B。",
          "type": "多选题"
        },
        {
          "id": 14687,
          "title": "细小而含粘液质多的种子类药入汤剂宜？",
          "options": {
            "A": "先煎",
            "B": "后下",
            "C": "包煎",
            "D": "另煎",
            "E": "冲服"
          },
          "answer": "C",
          "analysis": "细小而含粘液质多的种子类药，煎煮时容易粘锅，引起焦化或糊化，入汤剂宜布包煎，故选C。",
          "type": "多选题"
        },
        {
          "id": 14688,
          "title": "贝壳类药入汤剂宜？",
          "options": {
            "A": "先煎",
            "B": "后下",
            "C": "包煎",
            "D": "另煎",
            "E": "冲服"
          },
          "answer": "A",
          "analysis": "贝壳类药，质地坚硬，应打碎先煎，煮沸20-30分钟后，再下其他药物同煎，以使有效成分充分析出，故选A。",
          "type": "多选题"
        },
        {
          "id": 14689,
          "title": "宜冲服的药物是？",
          "options": {
            "A": "矿物药",
            "B": "胶类药",
            "C": "芳香药",
            "D": "汁液性药",
            "E": "贵重药"
          },
          "answer": "D#E",
          "analysis": "某些贵重药和汁液性药宜冲服，故选DE，而矿物药宜先煎，胶类药宜烊化，芳香药宜后下。",
          "type": "多选题"
        },
        {
          "id": 15253,
          "title": "中医理论体系是以中国古代哲学中的（   ）为哲学基础",
          "options": {
            "A": "气",
            "B": "阴阳",
            "C": "五行",
            "D": "以上都包括",
            "E": ""
          },
          "answer": "D",
          "analysis": "中医学以中国古代朴素的唯物论和自发的辩证法思想即气一元论、阴阳学说和五行学说为哲学基础，来建构理论体系。",
          "type": "多选题"
        },
        {
          "id": 15254,
          "title": "(   )是极其细微的物质，具有运动功能的客观实体，是构成世界万物的本原，是一个抽象的物质概念，是物质与功能的统一。",
          "options": {
            "A": "气",
            "B": "血",
            "C": "津",
            "D": "液",
            "E": ""
          },
          "answer": "A",
          "analysis": "气是中国古代哲学的最高范畴，中医学中的气是一种极其细微的物质，是构成世界的物质本原。气（精气）充塞于天地之间，是化生自然万物的基本物质，人的形体及精神智慧也是精气的产物。",
          "type": "多选题"
        },
        {
          "id": 15255,
          "title": "“在天化气，在地成形，形气相感而生万物矣。”出自(   )",
          "options": {
            "A": "《素问》",
            "B": "《说文解字》",
            "C": "《道德经》",
            "D": "《灵枢》",
            "E": ""
          },
          "answer": "A",
          "analysis": "《素问·天元纪大论》有载：在天化气，在地成形，形气相感而生万物矣。",
          "type": "多选题"
        },
        {
          "id": 15256,
          "title": "天地万物相互感应的中介是(   )",
          "options": {
            "A": "气",
            "B": "血",
            "C": "精",
            "D": "液",
            "E": ""
          },
          "answer": "A",
          "analysis": "天地万物之间相互作用的中介是气,气的中介作用,主要表现为维系天地万物之联系,并使天、地、生、人之间相参相应。",
          "type": "多选题"
        },
        {
          "id": 15257,
          "title": "《内经》讲“左右者，阴阳之道路也；（   ）者，阴阳之征兆也”",
          "options": {
            "A": "血气",
            "B": "水火",
            "C": "阴阳",
            "D": "男女",
            "E": ""
          },
          "answer": "B",
          "analysis": "天地者，万物之上下也；阴阳者，血气之男女也；左右者，阴阳之道路也；水火者，阴阳之征兆也；阴阳者，万物之能始也。",
          "type": "多选题"
        },
        {
          "id": 15258,
          "title": "阴阳之中复有阴阳，即阴中有阳，阳中有阴。这种特性称为阴阳的（   ） ",
          "options": {
            "A": "相对性",
            "B": "无限可分性",
            "C": "关联性",
            "D": "普遍性",
            "E": ""
          },
          "answer": "A",
          "analysis": "事物阴阳属性并不是一成不变的，主要表现在以下三个方面：（1）阴阳属性可以互相转化；（2）阴阳之中复有阴阳，即阴中有阳，阳中有阴；（3）阴阳属性随比较对象而变。",
          "type": "多选题"
        },
        {
          "id": 15259,
          "title": "阴阳学说中，下午被称为（  ）",
          "options": {
            "A": "阳中之阳 ",
            "B": "阳中之阴 ",
            "C": "阴中之阴",
            "D": "阴中之阳",
            "E": "阴中之至阴"
          },
          "answer": "B",
          "analysis": "在阴阳学说里,昼为阳,夜为阴。上午为阳中之阳,下午为阳中之阴;前半夜为阴中之阴，后半夜属阴中之阳。",
          "type": "多选题"
        },
        {
          "id": 15260,
          "title": "“阴在内，阳之守也；阳在外，阴之使也”，说明了（  ）",
          "options": {
            "A": "阴阳的相互对立  ",
            "B": "阴阳的相互消长  ",
            "C": "阴阳的相互转化  ",
            "D": "阴阳的互根互用",
            "E": "阴阳的相互制约"
          },
          "answer": "D",
          "analysis": "\"阴在内,阳之守也;阳在外,阴之使也\"说明了阴阳具有相互依存、互为根本的关系,每一方以相对的另一方的存在作为自己存在的前提和条件。“守”是守于内，“使”是行于外。这是对阴阳双方依存关系的很好说明。结合人体的生理功能而言，阴指物质，阳指功能，物质居于体内，功能表现于外。在外的阳是内在物质的表现，所以说阳为“阴之使”，在内的阴是产生机能活动的物质基础，所以说阴为“阳之守”",
          "type": "多选题"
        },
        {
          "id": 15261,
          "title": "《素问•生气通天论》所谓：“阴平阳秘，精神乃治”，是指（  ）",
          "options": {
            "A": "阴阳的对立制约关系正常  ",
            "B": "阴阳的依存互根关系正常  ",
            "C": "阴阳的消长平衡关系正常  ",
            "D": "阴阳的相互转化关系正常  ",
            "E": "阴阳的对立、消长关系正常"
          },
          "answer": "C",
          "analysis": "《素问·生气通天论》中记载：“阴平阳秘，精神乃治，阴阳离决，精气乃绝。”\n阴与阳相互对抗、相互制约和相互排斥，以求其统一，取得阴阳之间的相对的动态平衡，称之为“阴平阳秘”。",
          "type": "多选题"
        },
        {
          "id": 15262,
          "title": "阴阳之间的增减、盛衰、进退的变化称为（   ） ",
          "options": {
            "A": "阴阳对立",
            "B": "阴阳交感",
            "C": "阴阳转化",
            "D": "阴阳消长",
            "E": ""
          },
          "answer": "D",
          "analysis": "阴阳消长指阴阳双方不是静止不变的，而是处于不断地消和长的运动变化之中。",
          "type": "多选题"
        },
        {
          "id": 15263,
          "title": "事物矛盾的双方经过斗争以后在一定的条件下，走向自己的反面称为（   ） ",
          "options": {
            "A": "阴阳对立",
            "B": "阴阳交感",
            "C": "阴阳转化",
            "D": "阴阳消长",
            "E": ""
          },
          "answer": "C",
          "analysis": "阴阳转化，指事物的阴阳属性，在一定条件下可以向其相反的方向转化，即属阳的事物可以转化为属阴的事物，属阴的事物可以转化为属阳的事物",
          "type": "多选题"
        },
        {
          "id": 15264,
          "title": "阴损及阳，阳损及阴,是根据（  ）",
          "options": {
            "A": "阴阳互根  ",
            "B": "阴阳对立  ",
            "C": "阴阳消长  ",
            "D": "阴阳转化  ",
            "E": "阴阳制约"
          },
          "answer": "A",
          "analysis": "阴阳互藏互根关系失常就会导致疾病的发生，乃至危及生命。在病理情况下，人体内的阳气和阴液，一方的不足可以引起另一方的亏损，阳损可以耗阴，阴损可以耗阳。即阳虚至一定程度时，由于“无阳则阴无以化”，故可进一步损伤体内的阴液而导致阴虚，称作“阳损及阴”。",
          "type": "多选题"
        },
        {
          "id": 15265,
          "title": "（   ）曰炎上",
          "options": {
            "A": "木",
            "B": "火",
            "C": "土",
            "D": "金",
            "E": ""
          },
          "answer": "B",
          "analysis": "出自《尚书·洪范》，形容五行中火的特性，炎，是焚烧、炎热、光明之义；上，是上升。炎上，是指火具有炎热、上升、光明的特性。引申为凡具有温热、上升、光明等性质或作用的事物和现象，归属于火。",
          "type": "多选题"
        },
        {
          "id": 15266,
          "title": "（   ）爰稼穑",
          "options": {
            "A": "木",
            "B": "火",
            "C": "土",
            "D": "金",
            "E": ""
          },
          "answer": "C",
          "analysis": "出自《尚书·洪范》，形容五行中土的特性。指土具有载物、生化、收成的特性。引申为凡具有生化、承载、受纳性质或作用的事物和现象，归属于土。",
          "type": "多选题"
        },
        {
          "id": 15267,
          "title": "把“脾”归属土，主要采用的是何种归类法（  ）",
          "options": {
            "A": "取象比类法   ",
            "B": "推演络绎法   ",
            "C": "以表知里法   ",
            "D": "试探法   ",
            "E": "反证法"
          },
          "answer": "A",
          "analysis": "取象比类法：“取象”，即是从事物的形象（形态、作用、性质）中找出能反映本质的特有征象；“比类”，即是以五行各自的抽象属性为基准，与某种事物所特有的征象相比较，以确定其五行归属。",
          "type": "多选题"
        },
        {
          "id": 15268,
          "title": "木生火，木是火之（），火是木之（）。",
          "options": {
            "A": "子，母",
            "B": "母，子",
            "C": "阴，阳",
            "D": "阳，阴",
            "E": ""
          },
          "answer": "B",
          "analysis": "五行之间的母子关系，指“生我”者为母，“我生”者为子。木生火，则木为火之母，火为木之子。",
          "type": "多选题"
        },
        {
          "id": 15269,
          "title": "五行之间生中有克，克中有生，生克结合，五行之间这样的关系叫做（   ）",
          "options": {
            "A": "五行制化",
            "B": "五行相乘",
            "C": "五行相辱",
            "D": "五行相生",
            "E": ""
          },
          "answer": "A",
          "analysis": "五行制化指五行之间相互化生，又相互制约，生化中有制约，制约中有生化，二者相辅相成，从而维持其相对平衡和正常的协调关系。",
          "type": "多选题"
        },
        {
          "id": 15270,
          "title": "五行之间相克太过称为（   ）",
          "options": {
            "A": "五行制化",
            "B": "五行相乘",
            "C": "五行相辱",
            "D": "五行相生",
            "E": ""
          },
          "answer": "B",
          "analysis": "五行相乘，指五行中所不胜一行对其所胜一行的过度制约或克制。",
          "type": "多选题"
        },
        {
          "id": 15277,
          "title": "中医学第一部针灸学专著是（）",
          "options": {
            "A": "《内经》",
            "B": "《难经》",
            "C": "《针灸甲乙经》",
            "D": "《黄帝内经》",
            "E": ""
          },
          "answer": "C",
          "analysis": "《针灸甲乙经》是中医学第一部针灸学专著，在经络学说的发展及针灸疗法的应用中，起到承先启后、继往开来的重大作用。",
          "type": "多选题"
        },
        {
          "id": 15278,
          "title": "经络是运行（），联络（），沟通（）的通路。",
          "options": {
            "A": "全身气血 脏腑肢节 上下内外",
            "B": "脏腑肢节 全身气血 上下内外",
            "C": "全身气血 上下内外  脏腑肢节",
            "D": "上下内外  全身气血 脏腑肢节",
            "E": ""
          },
          "answer": "A",
          "analysis": "经络是经脉和络脉的总称，为人体运行气血、联络脏腑、沟通内外、贯穿上下的径路。",
          "type": "多选题"
        },
        {
          "id": 15279,
          "title": "以下关于经络的说法中，错误的是（）",
          "options": {
            "A": "经络系统由十二经脉、奇经八脉和络脉组成",
            "B": "经脉大多循行于深部，且有一定的循行径路",
            "C": "经脉可分为正经和奇经两类",
            "D": "络脉是经脉的分支，多循行于较浅的部位",
            "E": ""
          },
          "answer": "A",
          "analysis": "经络系统由十二经脉、奇经八脉、十二经脉的附属部分和络脉组成。",
          "type": "多选题"
        },
        {
          "id": 15280,
          "title": "根据经脉命名原则，以下名称正确的是（   ）",
          "options": {
            "A": "手太阴脾经",
            "B": "足阳明胃经",
            "C": "手阳明心经",
            "D": "足太阴肝经",
            "E": ""
          },
          "answer": "B",
          "analysis": "经脉命名原则中，脏为阴，六阴经属于脏，并冠以所属脏之名；腑为阳，六阳经属于腑，并冠以所属腑之名。",
          "type": "多选题"
        },
        {
          "id": 15281,
          "title": "内踝上八寸处以下，循行于下肢内侧中线的经脉是：",
          "options": {
            "A": "足少阴肾经",
            "B": "足太阴脾经",
            "C": "足厥阴肝经",
            "D": "足阳明胃经",
            "E": "足少阳胆经"
          },
          "answer": "B",
          "analysis": "下肢内侧面内踝上八寸以下为足厥阴肝经在前,足太阴脾经在中,足少阴肾经在后。",
          "type": "多选题"
        },
        {
          "id": 15282,
          "title": "下列各组经脉中，从胸腔走向手指末端的是：",
          "options": {
            "A": "心、肝、肾经",
            "B": "胆、胃、三焦经",
            "C": "心、肺、心包经",
            "D": "心、胆、小肠经",
            "E": "肺、脾、胆经"
          },
          "answer": "C",
          "analysis": "本题考察经脉分布规律。",
          "type": "多选题"
        },
        {
          "id": 15283,
          "title": "下列各组经脉中，从足趾走向腹腔、胸腔的是：",
          "options": {
            "A": "肝、胆、肾经",
            "B": "肝、脾、胃经",
            "C": "肾、膀胱、胃经",
            "D": "脾、胃、肾经",
            "E": "脾、肝、肾经"
          },
          "answer": "E",
          "analysis": "本题考察经脉分布规律。",
          "type": "多选题"
        },
        {
          "id": 15284,
          "title": "在头面部，分布于面部、额部的经脉是：",
          "options": {
            "A": "阳明经",
            "B": "太阳经",
            "C": "少阳经",
            "D": "厥阴经",
            "E": "少阴经"
          },
          "answer": "A",
          "analysis": "本题考察经脉分布规律。",
          "type": "多选题"
        },
        {
          "id": 15285,
          "title": "“头为诸阳之会”是由于：",
          "options": {
            "A": "头居上部，且有阳经分布",
            "B": "同名的手足三阳经均在头面部交接",
            "C": "有“阳脉之海”之称的督脉上行于脑",
            "D": "与阴经相表里的阳经输送气血于脑",
            "E": "头为五脏六腑精气汇聚之所"
          },
          "answer": "B",
          "analysis": "手三阳经止于头，足三阳经起于头，因此头为“诸阳之会”。",
          "type": "多选题"
        },
        {
          "id": 15287,
          "title": "十二经脉气血流注形式为：",
          "options": {
            "A": "直线贯注",
            "B": "手足贯注",
            "C": "上下贯注",
            "D": "循环贯注",
            "E": "左右贯注"
          },
          "answer": "D",
          "analysis": "十二经脉的气血运行是循脉依次传注，从手太阴肺经开始，逐经依次流注，最后注入足厥阴肝经，再复回到手太阴肺经，首尾相贯，如环无端。",
          "type": "多选题"
        },
        {
          "id": 15288,
          "title": "手三阴经的走行规律是（   ）",
          "options": {
            "A": "从手走头",
            "B": "从胸走手",
            "C": "从头走足",
            "D": "从足至腹胸",
            "E": ""
          },
          "answer": "B",
          "analysis": "十二经脉的走向规律为：手之三阴，从胸走手；手之三阳，从手走头；足之三阳，从头走足；足之三阴，从足走腹胸。",
          "type": "多选题"
        },
        {
          "id": 15289,
          "title": "十二经脉气血流注次序中，手阳明经上接（），下接（）。",
          "options": {
            "A": "手太阴经  足阳明经",
            "B": "足阳明经  手太阴经",
            "C": "手少阴经  足太阳经",
            "D": "足太阳经  手少阴经",
            "E": ""
          },
          "answer": "A",
          "analysis": "本题考察十二经脉气血流注次序。手阳明肺经上接手太阴肺经，下接足阳明胃经。手太阳小肠经上接手少阴心经，下接足太阳膀胱经。",
          "type": "多选题"
        },
        {
          "id": 15290,
          "title": "“一源三歧”的奇经是指",
          "options": {
            "A": "冲脉、任脉、带脉        ",
            "B": "任脉、督脉、带脉",
            "C": "冲脉、任脉、督脉        ",
            "D": "督脉、冲脉、带脉",
            "E": ""
          },
          "answer": "C",
          "analysis": "督、任、冲皆起于胞中，称为“一源而三歧”。",
          "type": "多选题"
        },
        {
          "id": 15291,
          "title": "有“十二经脉之海”之称的经脉是",
          "options": {
            "A": "任脉       ",
            "B": "冲脉      ",
            "C": "督脉        ",
            "D": "带脉",
            "E": ""
          },
          "answer": "B",
          "analysis": "冲脉调节十二经脉气血，又称“十二经脉之海”，渗灌三阴三阳。",
          "type": "多选题"
        },
        {
          "id": 15292,
          "title": "具有调节阳经气血作用的经脉是：",
          "options": {
            "A": "督脉  ",
            "B": "带脉  ",
            "C": "任脉  ",
            "D": "阴维脉  ",
            "E": "阳维脉"
          },
          "answer": "A",
          "analysis": "本题考察奇经八脉的生理功能。督脉调节阳经气血，任脉调节阴经气血，冲脉调节十二经脉气血，带脉约束纵行诸经。",
          "type": "多选题"
        },
        {
          "id": 15293,
          "title": "具有约束纵行诸经作用的经脉是：",
          "options": {
            "A": "督脉  ",
            "B": "带脉  ",
            "C": "任脉  ",
            "D": "阴维脉  ",
            "E": "阳维脉"
          },
          "answer": "B",
          "analysis": "本题考察奇经八脉的生理功能。督脉调节阳经气血，任脉调节阴经气血，冲脉调节十二经脉气血，带脉约束纵行诸经。",
          "type": "多选题"
        },
        {
          "id": 15294,
          "title": "下列有调节肢体运动和眼睑开合作用的经脉是",
          "options": {
            "A": "任脉      ",
            "B": "督脉     ",
            "C": "阴跷、阳跷脉  ",
            "D": "阴维、阳维脉",
            "E": ""
          },
          "answer": "C",
          "analysis": "阴跷、阳跷脉，阴阳气相并，共同濡养眼目，主司眼睑开合。",
          "type": "多选题"
        },
        {
          "id": 15295,
          "title": "经络的沟通联系作用主要表现在（）",
          "options": {
            "A": "脏腑与体表的联系",
            "B": "脏腑与官窍之间的联系",
            "C": "脏腑之间的联系",
            "D": "经脉之间的联系",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "经络的沟通联系作用主要表现在四个方面：（1）脏腑与体表的联系；（2）脏腑与官窍之间的联系；（3）脏腑之间的联系；（4）经脉之间的联系。",
          "type": "多选题"
        },
        {
          "id": 15296,
          "title": "针灸时，局部有酸、麻、胀、寒、热、重等特殊的感觉。这种现象是经络（）作用的体现",
          "options": {
            "A": "感应传导作用",
            "B": "沟通联系作用",
            "C": "运行气血作用",
            "D": "调节作用",
            "E": ""
          },
          "answer": "A",
          "analysis": "感应传导，是指经络系统具有感应及传导各种信息的作用。如对经穴刺激引起的感应及传导，又称为“针感”“经络感传”“经络现象”，表现为局部有酸、麻、胀、寒、热、重等特殊的感觉，有时还会沿一定线路传导。",
          "type": "多选题"
        },
        {
          "id": 15297,
          "title": "倡导分经用药，并创立“引经报使”理论的医家是（）",
          "options": {
            "A": "吴有性",
            "B": "叶桂",
            "C": "张元素",
            "D": "吴瑭",
            "E": ""
          },
          "answer": "C",
          "analysis": "金代医家张元素，又称张洁古，根据经络学说，在中药归经基础上，倡导分经用药，并创立“引经报使”理论。",
          "type": "多选题"
        },
        {
          "id": 15298,
          "title": "中医认识发病原理，主要从以下哪个角度来认识：",
          "options": {
            "A": "正邪相搏",
            "B": "阴阳失调",
            "C": "饮食失调",
            "D": "气血失常",
            "E": "脏腑功能失调"
          },
          "answer": "A",
          "analysis": "中医认为邪正相搏决定发病与否。证候类型、病变性质、病情轻重、进展与转归，都与邪正胜负有关。",
          "type": "多选题"
        },
        {
          "id": 15299,
          "title": "疾病发生的内在因素是：",
          "options": {
            "A": "邪气强盛",
            "B": "正气不足",
            "C": "邪胜正负",
            "D": "正虚邪不胜",
            "E": "正胜邪衰"
          },
          "answer": "B",
          "analysis": "正气是人体正常功能活动的统称，包括人体正常生理功能及所产生的各种维护健康的能力，包括自我调节能力、适应环境能力、抗邪防病能力和康复自愈能力等。正气不足是疾病发生的内在因素。",
          "type": "多选题"
        },
        {
          "id": 15300,
          "title": "疾病发生的重要条件是：",
          "options": {
            "A": "邪气",
            "B": "正气",
            "C": "地域因素",
            "D": "饮食习惯",
            "E": "生活和工作环境"
          },
          "answer": "A",
          "analysis": "邪气，与正气相对，是各种致病因素的总称，简称为“邪”，包括存在于外界或由人体内产生的各种致病因素。邪气是发病的重要条件。",
          "type": "多选题"
        },
        {
          "id": 15301,
          "title": "机体感受病邪，病邪潜伏一段时间之后发病者，属（      ）",
          "options": {
            "A": "徐发",
            "B": "继发",
            "C": "复发",
            "D": "伏而后发",
            "E": "感而即发"
          },
          "answer": "D",
          "analysis": "伏而后发，又称伏邪发病。指机体感受某些病邪后，病邪潜伏于体内某些部位，经过一段时间之后，或在一定的诱因作用下发病。",
          "type": "多选题"
        },
        {
          "id": 15302,
          "title": "原病再度发作或反复发作，称为（      ）",
          "options": {
            "A": "徐发",
            "B": "继发",
            "C": "复发",
            "D": "伏而后发",
            "E": "感而即发"
          },
          "answer": "C",
          "analysis": "原病再度发作或反复发作，就发病形式而言，属于复发。",
          "type": "多选题"
        },
        {
          "id": 15303,
          "title": "外感湿邪致病，其发病多为（      ）",
          "options": {
            "A": "徐发",
            "B": "继发",
            "C": "复发",
            "D": "伏而后发",
            "E": "感而即发"
          },
          "answer": "A",
          "analysis": "徐发与致病邪气的性质，以及体质因素等密切相关。外感湿邪致病，因湿为阴邪，其性粘滞，故湿邪为病，多为发病缓、病程长。",
          "type": "多选题"
        },
        {
          "id": 15304,
          "title": "肝病胁痛、黄疸，若久治不愈，渐成“癥积”者，应属于（      ）",
          "options": {
            "A": "徐发",
            "B": "继发",
            "C": "复发",
            "D": "伏而后发",
            "E": "感而即发"
          },
          "answer": "B",
          "analysis": "在原有疾病的基础上继发新的病变，称为继发。如肝病胁痛、黄疸，久治不愈，日久可继发“癥积”、“臌胀”。",
          "type": "多选题"
        },
        {
          "id": 15305,
          "title": "外感六淫邪气致病，其发病多为（      ）",
          "options": {
            "A": "徐发",
            "B": "继发",
            "C": "复发",
            "D": "伏而后发",
            "E": "感而即发"
          },
          "answer": "E",
          "analysis": "感而即发，又称“卒发”、“顿发”，指机体感邪后立即发病。外感六淫邪气，除湿邪外，大都是感而即发。",
          "type": "多选题"
        },
        {
          "id": 15306,
          "title": "“大实有羸状”是指（      ）",
          "options": {
            "A": "虚中夹实",
            "B": "因虚致实",
            "C": "真实假虚",
            "D": "真虚假实",
            "E": "由实转虚"
          },
          "answer": "C",
          "analysis": "“大实有羸状”，是指邪气深结不散，气血郁积于内，经络阻滞，气血不能通达于外之真实假虚病变。",
          "type": "多选题"
        },
        {
          "id": 15307,
          "title": "脾气虚损，运化无力，导致水湿内停，其病理变化多属（      ）",
          "options": {
            "A": "虚中夹实",
            "B": "实中夹虚",
            "C": "由实转虚",
            "D": "因虚致实",
            "E": "真虚假实"
          },
          "answer": "A",
          "analysis": "脾气亏损，运化无力，导致水湿内停，属虚实错杂之虚中夹实病理。",
          "type": "多选题"
        },
        {
          "id": 15308,
          "title": "从虚实角度看，“阳胜则阴病”属于（      ）",
          "options": {
            "A": "由实转虚",
            "B": "真实假虚",
            "C": "大实有羸状",
            "D": "至虚有盛候",
            "E": "虚实错杂"
          },
          "answer": "E",
          "analysis": "阳胜则阴病，即阳盛的同时即能耗伤阴液，其病机可表现为虚实错杂之实中夹虚。",
          "type": "多选题"
        },
        {
          "id": 15309,
          "title": "阴阳互损是指在阴或阳任何一方虚损的前提下，影响到相对的一方，导致（      ）",
          "options": {
            "A": "阴阳偏衰",
            "B": "阴阳亡失",
            "C": "阴阳两虚",
            "D": "阴损及阳",
            "E": "阳损及阴"
          },
          "answer": "C",
          "analysis": "在阴或阳任何一方虚损的前提下，病变发展影响到相对的另一方，形成阴阳两虚的病机变化。",
          "type": "多选题"
        },
        {
          "id": 15310,
          "title": "真寒假热的机理是（      ）",
          "options": {
            "A": "阴盛则阳病",
            "B": "重阴必阳",
            "C": "阴盛格阳",
            "D": "阳盛各阴",
            "E": "阴证转阳"
          },
          "answer": "C",
          "analysis": "真寒假热，即是阴盛格阳。指阴寒邪气过盛，壅阻于内，排斥阳气于外，阴阳之间不相交通，相互格拒的病变。",
          "type": "多选题"
        },
        {
          "id": 15311,
          "title": "（）指机体阳气虚损，温煦、推动、气化等功能减退，出现虚寒内生的病机变化。",
          "options": {
            "A": "阳偏盛",
            "B": "阴偏盛",
            "C": "阳偏衰",
            "D": "阴偏衰",
            "E": ""
          },
          "answer": "C",
          "analysis": "阳偏衰是指机体阳气虚损，温煦、推动、气化等功能减退出现虚寒内生的病机变化。",
          "type": "多选题"
        },
        {
          "id": 15312,
          "title": "下列除哪一项外，均属气机失调（      ）",
          "options": {
            "A": "气虚",
            "B": "气陷",
            "C": "气滞",
            "D": "气脱",
            "E": "气闭"
          },
          "answer": "A",
          "analysis": "气机失调主要是指气的升降出入运动失调，包括气滞、气逆、气陷、气闭、气脱五个方面。",
          "type": "多选题"
        },
        {
          "id": 15313,
          "title": "脏腑气滞多见（）",
          "options": {
            "A": "肺、脾、肾",
            "B": "肺、肝、脾胃",
            "C": "心、肺、肝",
            "D": "胃、肾、子宫",
            "E": ""
          },
          "answer": "B",
          "analysis": "脏腑气滞多以肺、肝、脾胃为多见。",
          "type": "多选题"
        },
        {
          "id": 15314,
          "title": "汗出不止、目闭口开、全身瘫软是（      ）的表现",
          "options": {
            "A": "气逆",
            "B": "气闭",
            "C": "气脱",
            "D": "气滞",
            "E": "气陷"
          },
          "answer": "C",
          "analysis": "气脱表现为面色苍白、汗出不止、目闭口开、全身瘫软、撒手遗尿、脉微欲绝。",
          "type": "多选题"
        },
        {
          "id": 15315,
          "title": "气血关系失调的病机包括（      ）",
          "options": {
            "A": "气滞血瘀",
            "B": "气血两虚",
            "C": "气不摄血",
            "D": "气随血脱",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "由于气为血之帅，血为气之母，故气血之间病理上相互影响。气血关系失调主要包括气滞血瘀、气血两虚、气不摄血、气随血脱、血随气逆五个方面。",
          "type": "多选题"
        },
        {
          "id": 15316,
          "title": "血液运行失常的病机不包括（      ）",
          "options": {
            "A": "血不足",
            "B": "血瘀",
            "C": "出血",
            "D": "血虚",
            "E": ""
          },
          "answer": "A",
          "analysis": "血液运行失常，主要表现有血瘀、血虚、出血三个方面。",
          "type": "多选题"
        },
        {
          "id": 15317,
          "title": "精与气血关系失常的病机不包括（      ）",
          "options": {
            "A": "精气两虚",
            "B": "精血不足",
            "C": "气滞精瘀",
            "D": "血瘀精阻",
            "E": "以上皆是"
          },
          "answer": "E",
          "analysis": "津液与气血的关系失常，主要表现有精气两虚、精血不足、气滞精瘀 和血瘀精阻。",
          "type": "多选题"
        },
        {
          "id": 15318,
          "title": "与津液输布、排泄障碍有关的内脏是（      ）",
          "options": {
            "A": "脾",
            "B": "肺",
            "C": "肾",
            "D": "膀胱",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "由于脾主运化水液、肺主通调水道、肾主持水液代谢、膀胱贮存和排泄尿液、三焦通行水液，故人体津液输布、排泄障碍的病变与这些脏腑的功能失调密切相关。",
          "type": "多选题"
        },
        {
          "id": 15319,
          "title": "津血关系失常的病机不包括（      ）",
          "options": {
            "A": "津枯血燥",
            "B": "津亏血瘀",
            "C": "血瘀水停",
            "D": "精血两虚",
            "E": ""
          },
          "answer": "D",
          "analysis": "津液与血的关系失常，主要表现有津枯血燥、津亏血瘀、血瘀水停三个方面。",
          "type": "多选题"
        },
        {
          "id": 15320,
          "title": "津气关系失调的病机不包括（      ）",
          "options": {
            "A": "精气亏损",
            "B": "津停气阻",
            "C": "气随津脱",
            "D": "津气两虚",
            "E": "津气两脱"
          },
          "answer": "A",
          "analysis": "津液与血的关系失调，其病理表现包括津停气阻、气随津脱（轻者津气两虚，重者津气两脱）。",
          "type": "多选题"
        },
        {
          "id": 15321,
          "title": "下列不属于“风气内动”病机的有（      ）",
          "options": {
            "A": "肝阳化风",
            "B": "阴虚风动",
            "C": "风邪上扰",
            "D": "血虚生风",
            "E": "热极生风"
          },
          "answer": "C",
          "analysis": "风气内动指脏腑阴阳气血失调，体内阳气亢逆而致风动之征的病机变化，包括阴虚风动，血虚生风，热极生风以及肝阳化风。",
          "type": "多选题"
        },
        {
          "id": 15322,
          "title": "风气内动的病机中，属于虚风的有",
          "options": {
            "A": "肝阳化风",
            "B": "阴虚风动",
            "C": "肝风内动",
            "D": "热极生风",
            "E": ""
          },
          "answer": "B",
          "analysis": "风气内动指脏腑阴阳气血失调，体内阳气亢逆而致风动之征的病机变化，包括阴虚风动，血虚生风，热极生风以及肝阳化风。其中阴虚风动，血虚生风属于虚风。",
          "type": "多选题"
        },
        {
          "id": 15323,
          "title": "邪热炽盛，燔灼津液，劫伤肝阴导致高热痉厥、四肢抽搐、颈项强直等，属于（      ）",
          "options": {
            "A": "肝阳化风",
            "B": "热极生风",
            "C": "阴虚风动",
            "D": "血虚生风",
            "E": "外感风邪"
          },
          "answer": "B",
          "analysis": "热极生风属于实性病变，多见于热性病的极盛阶段。因邪热炽盛，燔灼津液，劫伤肝阴，阳热亢盛而化风，故以高热伴有抽搐、痉厥、颈项强直、角弓反张、目睛上吊为其主要表现。",
          "type": "多选题"
        },
        {
          "id": 15324,
          "title": "年老精血亏少，筋脉失养之肢体麻木，手足拘挛等，属于（      ）",
          "options": {
            "A": "肝阳化风",
            "B": "热极生风",
            "C": "阴虚风动",
            "D": "血虚生风",
            "E": "外感风邪"
          },
          "answer": "D",
          "analysis": "血虚生风属于虚风内动。可见于年老年老肝肾阴亏，筋脉失养或血不荣络的病变过程中，轻者眩晕欲仆，筋惕肉瞤，肢麻震颤，或见口眼喎斜、半身不遂。严重者则卒然仆倒，神志昏迷，或为闭厥，或为脱厥。",
          "type": "多选题"
        },
        {
          "id": 15325,
          "title": "津伤化燥最常见的脏腑不包括（）",
          "options": {
            "A": "肺",
            "B": "胃",
            "C": "大肠",
            "D": "肾",
            "E": "心"
          },
          "answer": "E",
          "analysis": "体内津液耗伤而干燥少津的病机变化，长见于肺、胃、大肠和肾。",
          "type": "多选题"
        },
        {
          "id": 15326,
          "title": "火热内生的病机包括（      ）",
          "options": {
            "A": "阳盛化火",
            "B": "五志化火",
            "C": "阴虚火旺",
            "D": "邪郁化火",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "火热内生（内火）病机包括阳气过盛化火、邪郁化火、五志过极化火、阴虚火旺等。",
          "type": "多选题"
        },
        {
          "id": 15327,
          "title": "病位传变不包括",
          "options": {
            "A": "表里传变",
            "B": "外感热病传变",
            "C": "内伤病传变",
            "D": "寒热转化",
            "E": ""
          },
          "answer": "D",
          "analysis": "寒热转化是病性转化，故选D。",
          "type": "多选题"
        },
        {
          "id": 15328,
          "title": "病性转化主要包括寒热转化和（）。",
          "options": {
            "A": "六经传变",
            "B": "虚实转化",
            "C": "表里转化",
            "D": "脏腑传变",
            "E": ""
          },
          "answer": "B",
          "analysis": "疾病过程中，病机性质转化主要包括由寒转化为热，或由热转化为寒，或由虚转化为实，或由实证转化为虚证。",
          "type": "多选题"
        },
        {
          "id": 15329,
          "title": "影响疾病传变的因素是（）",
          "options": {
            "A": "环境因素",
            "B": "生活因素",
            "C": "体质因素",
            "D": "病邪因素",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "影响疾病传变的因素共有5种，包括环境因素，生活因素，体质因素，病邪因素以及诊治因素。",
          "type": "多选题"
        },
        {
          "id": 15330,
          "title": "广义的精指的是（   ）",
          "options": {
            "A": "气血化生的构成人体和维持人体生命活动的精微物质",
            "B": "肾脏所藏的精，即生殖之精",
            "C": "先天之精",
            "D": "后天之精",
            "E": ""
          },
          "answer": "A",
          "analysis": "广义的精包括精气血津液等一切精微物质。",
          "type": "多选题"
        },
        {
          "id": 15331,
          "title": "由父母遗传的生命物质，称之为 ( )",
          "options": {
            "A": "先天之精",
            "B": "后天之精",
            "C": "肾精",
            "D": "水谷之精",
            "E": "生殖之精"
          },
          "answer": "A",
          "analysis": "先天之精禀受于父母,是构成胚胎的原始物质,与生俱来。",
          "type": "多选题"
        },
        {
          "id": 15332,
          "title": "肾精化为生殖之精以施泄，依靠于 ( )",
          "options": {
            "A": "肾阳推动",
            "B": "肾阴滋润",
            "C": "天癸促发",
            "D": "脾胃运化",
            "E": "肝气疏泄"
          },
          "answer": "C",
          "analysis": "肾精在天癸的促发作用下,可化为生殖之精以施泄。如《素问·上古天真论》说:男子“二八,肾气盛,天癸至,精气溢泻,阴阳和,故能有子。”",
          "type": "多选题"
        },
        {
          "id": 15333,
          "title": "（   ）是构成人体和维持人体生命活动的基本物质",
          "options": {
            "A": "气",
            "B": "血",
            "C": "津",
            "D": "液",
            "E": ""
          },
          "answer": "A",
          "analysis": "气是人体内活力很强、运动不息的极细微物质，是构成和维持人体生命活动的基本物质。",
          "type": "多选题"
        },
        {
          "id": 15334,
          "title": "人体中活力很强的运行不息的精微物质是 ( )",
          "options": {
            "A": "精",
            "B": "气",
            "C": "血",
            "D": "津",
            "E": "液"
          },
          "answer": "B",
          "analysis": "气是人体内活力很强、运动不息的极细微物质，是构成和维持人体生命活动基本物质。",
          "type": "多选题"
        },
        {
          "id": 15335,
          "title": "人体之气的运动称作 ( )",
          "options": {
            "A": "气机",
            "B": "气化",
            "C": "升降出入",
            "D": "气机调畅",
            "E": "阴阳转化"
          },
          "answer": "A",
          "analysis": "气的运动称为气机。气机指人体内气的正常运行机制，包括脏腑经络等的功能活动。人体气机活动的基本形式主要为升降出入，若气机的升降出入失常，则可出现气逆、气郁、气滞、气陷、气闭甚至气机泄脱等病变。",
          "type": "多选题"
        },
        {
          "id": 15336,
          "title": "维持人体相对恒定的体温，属于气的哪项功能 ( )",
          "options": {
            "A": "推动",
            "B": "温煦",
            "C": "凉润",
            "D": "防御",
            "E": "中介"
          },
          "answer": "B",
          "analysis": "气的温煦作用产生热量,保持体温。",
          "type": "多选题"
        },
        {
          "id": 15337,
          "title": "人体生长发育迟缓，责之于气的哪项功能减退 ( )",
          "options": {
            "A": "凉润",
            "B": "中介",
            "C": "推动",
            "D": "防御",
            "E": "固摄"
          },
          "answer": "C",
          "analysis": "气的推动作用激发、兴奋和促进生长发育生殖、脏腑功能活动、血和津液的输布。",
          "type": "多选题"
        },
        {
          "id": 15338,
          "title": "人体内各种生命信息的感应和传递，属于气的哪项功能 ( )",
          "options": {
            "A": "调控",
            "B": "防御",
            "C": "温煦",
            "D": "中介",
            "E": "固摄"
          },
          "answer": "D",
          "analysis": "气的中介作用感应传导信息，维系整体联系。",
          "type": "多选题"
        },
        {
          "id": 15339,
          "title": "先天之气，名为（   ）",
          "options": {
            "A": "元气",
            "B": "宗气",
            "C": "营气",
            "D": "卫气",
            "E": ""
          },
          "answer": "A",
          "analysis": "元气以先天精气为基础，赖后天精气充养，而根源于肾的气，是人体最根本、最重要的气，是生命活动的原动力。",
          "type": "多选题"
        },
        {
          "id": 15340,
          "title": "气行于脉外，则为（   ）",
          "options": {
            "A": "宗气",
            "B": "营气",
            "C": "卫气",
            "D": "元气",
            "E": ""
          },
          "answer": "C",
          "analysis": "卫气由饮食水谷所化生的悍气，行于脉外，具有温煦皮肤、腠理、肌肉，司汗孔开阖与护卫肌表、抗御外邪的功能。",
          "type": "多选题"
        },
        {
          "id": 15341,
          "title": "走息道而行呼吸的气是（   ）",
          "options": {
            "A": "宗气",
            "B": "营气",
            "C": "卫气",
            "D": "元气",
            "E": ""
          },
          "answer": "A",
          "analysis": "宗气由呼吸清气与水谷精气所化生而聚于胸中之气，走息道，行呼吸；贯心脉，行气血；资先天元气。",
          "type": "多选题"
        },
        {
          "id": 15342,
          "title": "指行于脉中的具有化生血液，营养全身作用的气是（   ）",
          "options": {
            "A": "宗气",
            "B": "营气",
            "C": "卫气",
            "D": "元气",
            "E": ""
          },
          "answer": "B",
          "analysis": "营气由饮食水谷所化生的精气，行于脉内，具有化生血液、营养周身的功能",
          "type": "多选题"
        },
        {
          "id": 15343,
          "title": "血液的生成主要依赖于 ( ) 的运化功能。",
          "options": {
            "A": "脾胃",
            "B": "肾肝",
            "C": "心肺",
            "D": "肝胆",
            "E": ""
          },
          "answer": "A",
          "analysis": "血液的化生以水谷之精以及肾精为物质基础,主要依赖于脾胃的运化功能。",
          "type": "多选题"
        },
        {
          "id": 15344,
          "title": "血具有濡养和 ( ) 两方面功能。",
          "options": {
            "A": "化生",
            "B": "化神",
            "C": "固摄",
            "D": "防御",
            "E": ""
          },
          "answer": "B",
          "analysis": "血具有濡养和化神两方面功能",
          "type": "多选题"
        },
        {
          "id": 15345,
          "title": "与血液正常运行密切相关的脏腑不包括 ( )",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "血液正常运行依靠心气和肺气的推动、肝气的疏泄、脾气的统摄，共同协作才得以完成。",
          "type": "多选题"
        },
        {
          "id": 15346,
          "title": "与血液生成作用密切相关的脏腑是（）",
          "options": {
            "A": "脾、心、肺、肾 ",
            "B": "肝、心、肺、肾 ",
            "C": "脾、心、肺、肝 ",
            "D": "脾、心、肝、肾 ",
            "E": "脾、肝、肺、肾 "
          },
          "answer": "A",
          "analysis": "水谷精微和肾精是血液化生的基础。它们在脾胃、心、肺、肾等脏腑的共同作用下，经过气化过程而得以化生为血液。",
          "type": "多选题"
        },
        {
          "id": 15347,
          "title": "在津液的生成中，最为密切相关的脏腑是 ( )",
          "options": {
            "A": "脾、肺",
            "B": "脾、胃",
            "C": "脾、肾",
            "D": "肠、胃",
            "E": "肺、肾"
          },
          "answer": "B",
          "analysis": "胃主受纳腐熟，脾主运化，在津液生成中起决定作用。",
          "type": "多选题"
        },
        {
          "id": 15348,
          "title": "与津液的输布关系密切的脏腑为",
          "options": {
            "A": "A、脾、肺、肾、肝、三焦 ",
            "B": "B、心、肺、肾、肝、三焦 ",
            "C": "C、脾、心、肾、肝、三焦 ",
            "D": "D、脾、肺、肾、小肠、三焦 ",
            "E": "E、大肠、肺、肾、小肠、三焦 "
          },
          "answer": "A",
          "analysis": "津液的输布主要依靠脾气的输布散精、肺气的通调水道、肾气的主水液而蒸腾气化，以及肝气疏泄，促进津液输布。此外，三焦水道的通利则保证津液的输布和畅通。",
          "type": "多选题"
        },
        {
          "id": 15349,
          "title": "布散于体表，渗入血脉之内起滋润作用的是 ( )",
          "options": {
            "A": "气",
            "B": "水",
            "C": "精",
            "D": "津",
            "E": "液"
          },
          "answer": "D",
          "analysis": "津的性状较清稀，以滋润作用为主，布散于体表能滋润皮毛肌肉，输注于孔窍能滋润鼻、目、口、耳等官窍。",
          "type": "多选题"
        },
        {
          "id": 15350,
          "title": "与津液代谢关系最为密切的是哪一组脏腑 ( )",
          "options": {
            "A": "心、肝、肾",
            "B": "心、脾、肾",
            "C": "脾、肝、肾",
            "D": "脾、肺、肾",
            "E": "脾、胃、肾"
          },
          "answer": "D",
          "analysis": "津液的整个代谢过程以脾、肺、肾三脏的综合调节为首要。",
          "type": "多选题"
        },
        {
          "id": 15351,
          "title": "津液的生理功能包括 ( )",
          "options": {
            "A": "滋润濡养",
            "B": "充养血脉",
            "C": "C 二者皆是",
            "D": "二者皆非",
            "E": ""
          },
          "answer": "C",
          "analysis": "津液既有滋润濡养作用，又充养血脉，成为血液组成部分。 ",
          "type": "多选题"
        },
        {
          "id": 15352,
          "title": "津液能够滋养濡润 ( )",
          "options": {
            "A": "官窍",
            "B": "关节",
            "C": "骨髓",
            "D": "皮毛",
            "E": "以上皆是"
          },
          "answer": "E",
          "analysis": "津液有滋润官窍、皮毛、脏腑、骨髓、关节的作用。",
          "type": "多选题"
        },
        {
          "id": 15353,
          "title": "神的作用包括 ( )",
          "options": {
            "A": "调节脏腑生理功能",
            "B": "调节精气血津液的代谢",
            "C": "二者皆是",
            "D": "二者皆非",
            "E": ""
          },
          "answer": "C",
          "analysis": "神主宰调节全身脏腑生理功能和物质代谢。 ",
          "type": "多选题"
        },
        {
          "id": 15354,
          "title": "神的物质基础不包含 ( )",
          "options": {
            "A": "精",
            "B": "气",
            "C": "血",
            "D": "津液",
            "E": "脏腑"
          },
          "answer": "E",
          "analysis": "神的产生以气、血、精、津液为物质基础。",
          "type": "多选题"
        },
        {
          "id": 15355,
          "title": "人体之神的功能包括（）",
          "options": {
            "A": "主宰生命活动",
            "B": "主宰精神活动",
            "C": "调节精气血津液",
            "D": "调节脏腑功能",
            "E": "以上皆是"
          },
          "answer": "E",
          "analysis": "神具有统领、调控精气血津液等物质代谢和各脏腑生理功能的作用，主宰着人体的生理活动和心理活动，因此神是生命活动的主宰，对人体生命十分重要。",
          "type": "多选题"
        },
        {
          "id": 15356,
          "title": "以下哪项不是气与津液的关系（   ）",
          "options": {
            "A": "气能生津",
            "B": "气能行津",
            "C": "气能摄津",
            "D": "气能载津",
            "E": ""
          },
          "answer": "D",
          "analysis": "气与津的关系主要有气能生津、气能行津、气能摄津。津能载气，而气不能载津。",
          "type": "多选题"
        },
        {
          "id": 15357,
          "title": "“夺血者无汗”所说明的生理关系是(  )",
          "options": {
            "A": "气与血",
            "B": "气与津",
            "C": "血与津",
            "D": "精与津",
            "E": ""
          },
          "answer": "C",
          "analysis": "血与律液都来源于水谷精气，由水谷精气所化生。血溢脉外化为津液，津液渗注于脉中，又为血液的重要组成部分。二者相互资生、相互转化，称为“津血同源”，因汗为津液所化，故又称为“血汗同源”，当血与汗的任何一方丢失过多，可致另一方的亏损，故有“夺血者无汗，夺汗者无血”的理论总结。",
          "type": "多选题"
        },
        {
          "id": 15358,
          "title": "治疗血虚病证，配用补气药物的生理基础是(  ) ",
          "options": {
            "A": "气能生血",
            "B": "气能行血",
            "C": "气能摄血",
            "D": "血能载气",
            "E": "津血同源"
          },
          "answer": "A",
          "analysis": "此题考查气与血的关系。气能生血是指血液的生成必须依赖着气的推动作用和气化作用。营气和津液是化生血液的主要物质，其化生血液均需气的推动和气化作用。肾精化生血液也必须依赖气的气化作用。故气虚，则化生血的功能亦弱，甚则可导致血虚，出现气血两虚。临床上治疗血虚时，常常配伍补气药物，这是气能生血的理论应用。",
          "type": "多选题"
        },
        {
          "id": 15359,
          "title": "《金匮要略心典》说：“吐下之余，定无完气”，指剧烈呕吐或腹泻会损伤正气，引起气的不足。结合本章知识点，“吐下之余，定无完气”的生理基础是（）",
          "options": {
            "A": "气能生津",
            "B": "津能化气",
            "C": "气能摄津",
            "D": "津能载气",
            "E": "气能行津"
          },
          "answer": "D",
          "analysis": "津液是气的载体，在剧烈呕吐或腹泻之后会丢失大量的津液，而随着津液的大量丢失，气也会被损伤，所以“吐下之余，定无完气”的生理基础是津能载气。",
          "type": "多选题"
        },
        {
          "id": 15360,
          "title": "体质的构成要素是",
          "options": {
            "A": "形态结构",
            "B": "生理功能",
            "C": "心理特征",
            "D": "中医学的“神”",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "体质，是在先天禀赋和后天获得的基础上所形成的形态结构、生理功能、心理状态方面相对稳定的个体化特性。",
          "type": "多选题"
        },
        {
          "id": 15361,
          "title": "以下对理想体质的描述，错误的是（）。",
          "options": {
            "A": "理想体质是指人体具有的良好质量",
            "B": "理想体质的标志之一是有较强的运动与劳动等身体活动能力",
            "C": "理想体质是一种遗传性的全面发展的",
            "D": "理想体质的标志之一是对自然和社会环境有较强的适应能力",
            "E": ""
          },
          "answer": "C",
          "analysis": "理想体质是人体在充分发挥遗传潜力的基础上，经过后天的积极培育，使机体的形态结构、生理功能、心理状态以及对环境的适应能力等各方面得到全面发展，处于相对良好的状态，即形神统一的状态。体质的形成既有先天因素，也有后天因素，因此C项中理想体质是一种遗传性的说法是错误的。",
          "type": "多选题"
        },
        {
          "id": 15362,
          "title": "决定体质差异的最根本因素是",
          "options": {
            "A": "精气血津液",
            "B": "经络",
            "C": "脏腑",
            "D": "脏腑的形态及功能特点",
            "E": "外部形态"
          },
          "answer": "D",
          "analysis": "脏腑经络的盛衰偏颇决定体质的差异。脏腑的形态和功能特点是构成并决定体质差异的最根本因素。",
          "type": "多选题"
        },
        {
          "id": 15363,
          "title": "（）是体质形成的基础，决定着体质的相对稳定性和特异性",
          "options": {
            "A": "先天因素",
            "B": "性别差异",
            "C": "年龄因素",
            "D": "饮食因素",
            "E": "地理因素"
          },
          "answer": "A",
          "analysis": "先天因素，是体质形成的基础，决定着体质的相对稳定性和特异性，是人体体质强弱的前提条件，起着关键性作用。",
          "type": "多选题"
        },
        {
          "id": 15364,
          "title": "不良的饮食习惯中，嗜食辛辣易出现哪种体质",
          "options": {
            "A": "痰湿体质",
            "B": "阴虚火旺体质",
            "C": "痰瘀体质",
            "D": "气虚体质",
            "E": "阳虚体质"
          },
          "answer": "B",
          "analysis": "过食辛辣易成阴虚火旺体质。",
          "type": "多选题"
        },
        {
          "id": 15365,
          "title": "偏阳质体质特征表述不正确的是",
          "options": {
            "A": "食量较大，大便易干燥",
            "B": "小便易黄赤",
            "C": "平时畏寒喜热，唇舌偏白偏淡",
            "D": "性格外向，喜动好强",
            "E": "易急躁，精力旺盛，反应灵敏"
          },
          "answer": "C",
          "analysis": "偏阳质是具有兴奋、好动、偏热特征的体质类型。",
          "type": "多选题"
        },
        {
          "id": 15366,
          "title": "阴阳平和质体质特征的是",
          "options": {
            "A": "身体强壮，胖瘦适度",
            "B": "脉象缓匀，目光有神",
            "C": "C.性格开朗、随和",
            "D": "D.反应灵活，思维敏捷",
            "E": "E.以上均是"
          },
          "answer": "E",
          "analysis": "阴阳平和质是功能较为协调的体质类型。",
          "type": "多选题"
        },
        {
          "id": 15367,
          "title": "以下关于偏阳质的说法中不正确的是（）",
          "options": {
            "A": "具有兴奋、好动、偏热特征",
            "B": "饮食上宜温补，忌生冷寒凉",
            "C": "施药时宜甘寒、酸寒、咸寒、清润，忌辛热温散、苦寒沉降。",
            "D": "疾病初愈，慎食温热、辛辣之品。",
            "E": ""
          },
          "answer": "B",
          "analysis": "偏阳质饮食上宜凉忌热。",
          "type": "多选题"
        },
        {
          "id": 15368,
          "title": "属于从化的一般规律的是（）",
          "options": {
            "A": "素体阴虚阳亢者，功能活动相对亢奋，受邪后多从热化。",
            "B": "素体阳虚阴盛者，功能活动相对不足，受邪后多从寒化。",
            "C": "素体津亏血耗者，易致邪从燥化。",
            "D": "气虚湿盛者，受邪后多从湿化。",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "从化指病情随体质而变化，从化的一般规律是阴虚阳亢者，受邪后多从热化；阳虚阴盛者，受邪后多从寒化；津亏血耗者，受邪后多从燥化；气虚湿盛者，受邪后多从湿化。",
          "type": "多选题"
        },
        {
          "id": 15369,
          "title": "导致人生病的外因包括六淫和（）。",
          "options": {
            "A": "疠气",
            "B": "传染病",
            "C": "病毒",
            "D": "病理产物",
            "E": "七情"
          },
          "answer": "A",
          "analysis": "外感病因包括六淫和疠气",
          "type": "多选题"
        },
        {
          "id": 15370,
          "title": "内伤病因包括七情、劳逸和（ ）。",
          "options": {
            "A": "饮食",
            "B": "传染病",
            "C": "病毒",
            "D": "细菌",
            "E": ""
          },
          "answer": "A",
          "analysis": "内伤病因包括七情内伤、饮食失宜、劳逸失度",
          "type": "多选题"
        },
        {
          "id": 15371,
          "title": "不属于疠气性质及致病特点的是（   ）",
          "options": {
            "A": "传染性强    ",
            "B": "特异性强   ",
            "C": "症状相似   ",
            "D": "气候反常   ",
            "E": "发病急骤"
          },
          "answer": "D",
          "analysis": "气候反常是疠气的发生和流行因素，而不是疫气的致病特点。",
          "type": "多选题"
        },
        {
          "id": 15372,
          "title": "下列哪项不属于疫病发生流行的原因（   ）",
          "options": {
            "A": "社会因素   ",
            "B": "气候因素   ",
            "C": "隔离因素   ",
            "D": "环境因素   ",
            "E": "体质因素"
          },
          "answer": "E",
          "analysis": "前4项都是疫病发生流行的原因，体质因素不是疫病发生流行的原因。",
          "type": "多选题"
        },
        {
          "id": 15373,
          "title": "惊则易于导致（   ）   ",
          "options": {
            "A": "气上   ",
            "B": "气乱   ",
            "C": "气结   ",
            "D": "气消   ",
            "E": "气下"
          },
          "answer": "B",
          "analysis": "惊则气乱。",
          "type": "多选题"
        },
        {
          "id": 15374,
          "title": "过怒主要影响（   ）",
          "options": {
            "A": "肺的呼吸功能   ",
            "B": "肝的疏泄功能   ",
            "C": "肝的藏血功能   ",
            "D": "肾的纳气功能   ",
            "E": "脾的运化功能"
          },
          "answer": "B",
          "analysis": "怒伤肝，导致肝的疏泄功能失常。",
          "type": "多选题"
        },
        {
          "id": 15375,
          "title": "七情太过，首先伤及（   ）",
          "options": {
            "A": "肝气   ",
            "B": "脾阳   ",
            "C": "肾精   ",
            "D": "心神   ",
            "E": "肺气"
          },
          "answer": "D",
          "analysis": "心主神明。七情致病，皆可损伤心神。",
          "type": "多选题"
        },
        {
          "id": 15376,
          "title": "过度悲哀，则易损伤（   ）",
          "options": {
            "A": "肝气   ",
            "B": "心气   ",
            "C": "肾气   ",
            "D": "脾气   ",
            "E": "肺气"
          },
          "answer": "E",
          "analysis": "悲伤肺，悲则气消，损伤肺气。",
          "type": "多选题"
        },
        {
          "id": 15377,
          "title": "思虑过度，易导致（   ）",
          "options": {
            "A": "肝失疏泄   ",
            "B": "心气紊乱   ",
            "C": "肾气虚弱   ",
            "D": "脾气郁结   ",
            "E": "E 肺失宣肃"
          },
          "answer": "D",
          "analysis": "思伤脾，思则气结，导致脾气郁结。",
          "type": "多选题"
        },
        {
          "id": 15378,
          "title": "过食肥甘厚味，易于（   ）",
          "options": {
            "A": "阻滞气机",
            "B": "损伤胃肠",
            "C": "化热生痰",
            "D": "营养失调",
            "E": "寒湿内生"
          },
          "answer": "C",
          "analysis": "过食肥甘厚味，“肥则令人内热，甘则令人中满”，易于导致化热生痰。",
          "type": "多选题"
        },
        {
          "id": 15379,
          "title": "过饱主要损伤（   ）",
          "options": {
            "A": "心肾   ",
            "B": "肝肾   ",
            "C": "脾胃   ",
            "D": "心脾   ",
            "E": "心肺"
          },
          "answer": "C",
          "analysis": "饮食过饱，主要损伤脾胃。",
          "type": "多选题"
        },
        {
          "id": 15380,
          "title": "味过于咸则易致（   ）",
          "options": {
            "A": "肝盛而乘脾   ",
            "B": "肾盛而乘心   ",
            "C": "脾盛而乘肾   ",
            "D": "心盛而乘肺   ",
            "E": "肺盛而乘肝"
          },
          "answer": "B",
          "analysis": "五味太过，则损伤五脏。味过于咸，导致肾盛而乘心。",
          "type": "多选题"
        },
        {
          "id": 15381,
          "title": "劳力过度主要伤及（   ）\t",
          "options": {
            "A": "精   ",
            "B": "气   ",
            "C": "血   ",
            "D": "津液   ",
            "E": "神"
          },
          "answer": "B",
          "analysis": "劳力过度主要伤气。",
          "type": "多选题"
        },
        {
          "id": 15382,
          "title": "劳神过度主要伤及（   ）",
          "options": {
            "A": "肝脾   ",
            "B": "肺脾   ",
            "C": "脾肾   ",
            "D": "心脾   ",
            "E": "心肾"
          },
          "answer": "D",
          "analysis": "劳神过度，主要损伤心脾，暗耗心血，损伤脾气。",
          "type": "多选题"
        },
        {
          "id": 15383,
          "title": "过劳则易致（   ）",
          "options": {
            "A": "气上   ",
            "B": "气乱   ",
            "C": "气结   ",
            "D": "气耗   ",
            "E": "气下"
          },
          "answer": "D",
          "analysis": "劳力过度主要伤气，如《素问·举痛论》说：“劳则气耗”。",
          "type": "多选题"
        },
        {
          "id": 15384,
          "title": "长期形体少动，先是导致（   ）",
          "options": {
            "A": "气血运行不畅   ",
            "B": "脏腑功能减退   ",
            "C": "脾胃运化呆滞   ",
            "D": "心肺之气不足     ",
            "E": "形体消瘦痿废"
          },
          "answer": "A",
          "analysis": "长期形体少动，始则气血运行不畅，继则脏腑功能减退，脾胃呆滞，心肺气虚等，并可导致其他疾病。",
          "type": "多选题"
        },
        {
          "id": 15388,
          "title": "与痰饮形成关系较小的内脏是（    ）",
          "options": {
            "A": "脾   ",
            "B": "心   ",
            "C": "肺   ",
            "D": "肾   ",
            "E": "膀胱"
          },
          "answer": "B",
          "analysis": "痰饮是机体水液代谢障碍所形成的病理产物，故凡参与水液代谢的脏腑都与痰饮生成有关。其中尤以肺、脾、肾、肝、膀胱对水液代谢关系最为密切。故选B。",
          "type": "多选题"
        },
        {
          "id": 15389,
          "title": "痰与饮的主要区别是（    ）",
          "options": {
            "A": "热者为痰，寒者为饮   ",
            "B": "得阳气煎熬而成者为痰，受阴气凝聚而成者为饮   ",
            "C": "粘稠者为痰，清稀者为饮   ",
            "D": "色黄者为痰，色白者为饮   ",
            "E": "痰量多者为痰，少者为饮"
          },
          "answer": "C",
          "analysis": "痰与饮的区别主要在形质上,一般以稠浊者为痰，清稀者为饮。",
          "type": "多选题"
        },
        {
          "id": 15390,
          "title": "神昏、谵语、发狂是由于（    ）",
          "options": {
            "A": "痰浊上蒙清窍   ",
            "B": "痰火扰心   ",
            "C": "饮逆于上   ",
            "D": "痰浊内扰   ",
            "E": ""
          },
          "answer": "B",
          "analysis": "痰郁化火，痰火扰心，可见神昏、谵语、发狂等症状。",
          "type": "多选题"
        },
        {
          "id": 15391,
          "title": "下列哪一项属于痰饮的致病特点（    ）",
          "options": {
            "A": "致病广泛，变化多端   ",
            "B": "生风动血，易致疮痈   ",
            "C": "善动数变，百病之长   ",
            "D": "耗气伤津，易扰心神   ",
            "E": "气血凝滞，筋脉挛急"
          },
          "answer": "A",
          "analysis": "痰饮致病特点之一是症状复杂，变化多端。其他项分别是燥、风、热（火）、寒邪的致病特点。",
          "type": "多选题"
        },
        {
          "id": 15392,
          "title": "具有随气流行，机体内外无处不至特征的致病因素为（    ） ",
          "options": {
            "A": "痰饮   ",
            "B": "瘀血   ",
            "C": "结石   ",
            "D": "疠气   ",
            "E": "风邪"
          },
          "answer": "A",
          "analysis": "从发病部位而言，饮多见于胸腹四肢，而痰则随气流行，全身各处均可出现，无处不到。",
          "type": "多选题"
        },
        {
          "id": 15393,
          "title": "梅核气为痰气结于（    ）\t",
          "options": {
            "A": "心   ",
            "B": "咽喉   ",
            "C": "肠胃   ",
            "D": "肺   ",
            "E": "皮肤"
          },
          "answer": "B",
          "analysis": "痰气结于咽喉，则发为梅核气。",
          "type": "多选题"
        },
        {
          "id": 15394,
          "title": "瘀血引起的出血特点是（    ）",
          "options": {
            "A": "血色鲜红   ",
            "B": "伴有血块   ",
            "C": "色淡质清稀   ",
            "D": "出血量多   ",
            "E": "出血量少"
          },
          "answer": "B",
          "analysis": " 瘀血引起出血时必然伴有血块。",
          "type": "多选题"
        },
        {
          "id": 15395,
          "title": "下列哪项是瘀血致病的特征（    ）",
          "options": {
            "A": "腹痛，痛随利减       ",
            "B": "形成肿胀，时聚时减   ",
            "C": "胁痛且胀，随情绪波动而增减     ",
            "D": "胸闷咳嗽，不能平卧   ",
            "E": "疼痛如针刺，位置不移。"
          },
          "answer": "E",
          "analysis": "瘀血所致症状之一是疼痛如针刺，位置不移。其它不是瘀血致病的症状。",
          "type": "多选题"
        },
        {
          "id": 15396,
          "title": "下列哪一项不是瘀血的病因（    ）",
          "options": {
            "A": "气虚   ",
            "B": "气滞   ",
            "C": "血寒   ",
            "D": "外伤   ",
            "E": "过劳  "
          },
          "answer": "E",
          "analysis": "气虚、气滞、血寒和外伤都能导致瘀血，过劳一般不会导致瘀血。",
          "type": "多选题"
        },
        {
          "id": 15397,
          "title": "下列哪项不是结石的多发部位（    ）",
          "options": {
            "A": "大肠   ",
            "B": "胃   ",
            "C": "胆   ",
            "D": "膀胱   ",
            "E": "肾"
          },
          "answer": "A",
          "analysis": "胃、胆、膀胱和肾都是结石的多发部位。",
          "type": "多选题"
        },
        {
          "id": 15398,
          "title": "下列哪项不属于结石的致病特点（    ）",
          "options": {
            "A": "多发于六腑   ",
            "B": "阻滞气机，损伤脉络   ",
            "C": "在体内形成症块",
            "D": "病程较长，症状不固定   ",
            "E": "可发生绞痛"
          },
          "answer": "C",
          "analysis": "在体内形成症块的病因是瘀血，而不是结石。",
          "type": "多选题"
        },
        {
          "id": 15399,
          "title": "空腹进食大量未成熟的柿子或黑枣，易形成（    ）",
          "options": {
            "A": "肝结石    ",
            "B": "肾结石    ",
            "C": "胃石    ",
            "D": "膀胱结石    ",
            "E": "胆结石"
          },
          "answer": "C",
          "analysis": "空腹进食大量的柿子或黑枣等，特别是未成熟、或未去皮的新鲜柿子，其中的某些成分与胃酸作用后，凝结形成团块，而为胃石。",
          "type": "多选题"
        },
        {
          "id": 15400,
          "title": "下列哪项不是结石形成的原因（    ）",
          "options": {
            "A": "嗜食辛辣           ",
            "B": "嗜酒过度           ",
            "C": "恣食生冷    ",
            "D": "服药不当           ",
            "E": "生活习惯"
          },
          "answer": "C",
          "analysis": "结石与体内湿热浊邪，蕴结不散密切相关，恣食生冷一般不导致结石。",
          "type": "多选题"
        },
        {
          "id": 15401,
          "title": "下列哪项不属于水湿痰饮、瘀血、结石的共同致病特点（    ）",
          "options": {
            "A": "与气滞有关  ",
            "B": "致病广泛  ",
            "C": "病程较长   ",
            "D": "导致疼痛",
            "E": "为有形之病理产物"
          },
          "answer": "D",
          "analysis": "瘀血和结石能导致疼痛，但水湿痰饮一般很少引起疼痛。",
          "type": "多选题"
        },
        {
          "id": 15402,
          "title": "“六淫”是指（   ）   ",
          "options": {
            "A": "六气   ",
            "B": "六气的太过和不及   ",
            "C": "六种毒气    ",
            "D": "六种外感病邪的统称    ",
            "E": ""
          },
          "answer": "D",
          "analysis": "六淫，即风、寒、暑、湿、燥、火（热）六种外感病邪的统称。",
          "type": "多选题"
        },
        {
          "id": 15403,
          "title": "下列哪项不是六淫致病的特点（   ）",
          "options": {
            "A": "季节性   ",
            "B": "地区性   ",
            "C": "传染性   ",
            "D": "转化性   ",
            "E": "外感性"
          },
          "answer": "C",
          "analysis": "C选项中的传染性是疠气最显著的致病特点。",
          "type": "多选题"
        },
        {
          "id": 15404,
          "title": "常为外感病致病先导的邪气是（   ）",
          "options": {
            "A": "热邪   ",
            "B": "风邪   ",
            "C": "寒邪   ",
            "D": "暑邪   ",
            "E": "燥邪"
          },
          "answer": "B",
          "analysis": "风邪常为外感病致病的先导，寒、湿、燥、热等邪气，多依附于风而侵袭人体。",
          "type": "多选题"
        },
        {
          "id": 15405,
          "title": "六淫中易侵犯人体上部和肌腠的外邪是（   ）",
          "options": {
            "A": "风邪    ",
            "B": "寒邪    ",
            "C": "湿邪    ",
            "D": "燥邪    ",
            "E": "暑邪"
          },
          "answer": "A",
          "analysis": "风性轻扬开泄，易袭阳位，容易侵犯人体上部和肌腠。",
          "type": "多选题"
        },
        {
          "id": 15406,
          "title": "六淫中，易导致疼痛的邪气是（   ）",
          "options": {
            "A": "风邪   ",
            "B": "寒邪   ",
            "C": "暑邪   ",
            "D": "湿邪   ",
            "E": "燥邪"
          },
          "answer": "B",
          "analysis": "寒性凝滞，寒邪侵入人体，阳气受损，经脉气血失于阳气温煦，则凝结阻滞，涩滞不通，不通则痛，故寒邪伤人多见疼痛症状。",
          "type": "多选题"
        },
        {
          "id": 15407,
          "title": "寒性收引可导致（   ）",
          "options": {
            "A": "阻滞气机   ",
            "B": "损伤阳气   ",
            "C": "耗气伤津   ",
            "D": "气机收敛   ",
            "E": "凝滞经脉"
          },
          "answer": "D",
          "analysis": "寒性收引，“寒则气收”，故寒邪侵袭人体，可使气机收敛，腠理闭塞。",
          "type": "多选题"
        },
        {
          "id": 15408,
          "title": "称为“百病之始”的邪气是（   ）",
          "options": {
            "A": "风邪   ",
            "B": "寒邪   ",
            "C": "暑邪   ",
            "D": "湿邪   ",
            "E": "燥邪"
          },
          "answer": "A",
          "analysis": "寒、湿、燥、热等邪气，多是依附于风而侵袭人体致病。风邪常为外邪致病的先导，故又有“风为百病之长”、“风为百病之始”之称。",
          "type": "多选题"
        },
        {
          "id": 15409,
          "title": "六淫中易阻遏气机，损伤阳气的邪气是（   ）",
          "options": {
            "A": "风邪   ",
            "B": "寒邪   ",
            "C": "暑邪   ",
            "D": "湿邪   ",
            "E": "燥邪"
          },
          "answer": "D",
          "analysis": "湿邪侵及人体，由于其粘腻停滞的特性，故湿邪最易阻滞气机，导致气机升降失常的病理变化。湿为阴邪，湿胜即阴胜，阴胜则阳病，故湿邪为害，易伤阳气。",
          "type": "多选题"
        },
        {
          "id": 15410,
          "title": "在六淫中，最易伤肺的邪气是（   ）",
          "options": {
            "A": "风邪   ",
            "B": "寒邪   ",
            "C": "暑邪   ",
            "D": "湿邪   ",
            "E": "燥邪"
          },
          "answer": "E",
          "analysis": "燥为秋令主气，与肺相应。肺为娇脏，喜清肃滋润而恶燥。肺开窍于鼻，燥邪伤人，多从口鼻而入，故燥邪最易伤肺。",
          "type": "多选题"
        },
        {
          "id": 15411,
          "title": "燥邪致病最易损伤人体的（   ）",
          "options": {
            "A": "津液   ",
            "B": "气   ",
            "C": "血   ",
            "D": "精   ",
            "E": "神"
          },
          "answer": "A",
          "analysis": "燥性干涩，侵犯人体，最易损伤人体的津液。",
          "type": "多选题"
        },
        {
          "id": 15412,
          "title": "在六淫中，易扰心神的邪气是（   ）",
          "options": {
            "A": "风邪   ",
            "B": "寒邪   ",
            "C": "火邪   ",
            "D": "湿邪   ",
            "E": "燥邪"
          },
          "answer": "C",
          "analysis": "心在五行中属火，火热之性躁动，与心相应，故火热之邪入于营血，尤易影响心神。",
          "type": "多选题"
        },
        {
          "id": 15413,
          "title": "下列哪项属于风性善行的致病特点（   ）",
          "options": {
            "A": "手足震颤   ",
            "B": "四肢抽搐   ",
            "C": "四肢游走性疼痛   ",
            "D": "角弓反张",
            "E": "四肢麻木"
          },
          "answer": "C",
          "analysis": "“善行”是指风邪具有善动不居、易行而无定处的特征。风邪偏盛所致痹证为“行痹”，其特点是四肢关节游走性疼痛。",
          "type": "多选题"
        },
        {
          "id": 15414,
          "title": "下列哪项属于湿邪的性质（   ）",
          "options": {
            "A": "凝滞   ",
            "B": "粘滞   ",
            "C": "涩滞   ",
            "D": "瘀滞   ",
            "E": "动血"
          },
          "answer": "B",
          "analysis": "湿性粘滞。寒邪凝滞，燥邪涩滞，热（火）邪易动血。凝滞、涩滞、瘀滞等都是干扰答案。",
          "type": "多选题"
        },
        {
          "id": 15415,
          "title": "可致小便浑浊涩滞不畅等症的邪气是（   ）",
          "options": {
            "A": "风邪   ",
            "B": "寒邪   ",
            "C": "暑邪   ",
            "D": "湿邪   ",
            "E": "燥邪"
          },
          "answer": "D",
          "analysis": "湿性重浊粘滞，故湿邪为患，易于出现排泄物和分泌物秽浊不清，粘腻不爽的症状。",
          "type": "多选题"
        },
        {
          "id": 15416,
          "title": "津液与血液之间互相滋生、相互转化称为？",
          "options": {
            "A": "津血同源",
            "B": "精血同源",
            "C": "气血同源",
            "D": "血汗同源",
            "E": "肝肾同源"
          },
          "answer": "A",
          "analysis": "津血同源：皆为液态物质，与气相对而言，皆属于阴，均由水谷精微化生，同具营养和滋润的功能，二者之间可以相互滋生、相互转化。故选A",
          "type": "多选题"
        },
        {
          "id": 15417,
          "title": "以下不属于衰老的发生机制的是（）",
          "options": {
            "A": "阴阳失调",
            "B": "脏腑虚衰",
            "C": "精气虚衰",
            "D": "疾病影响",
            "E": ""
          },
          "answer": "D",
          "analysis": "衰老的发生机制包括阴阳失调，脏腑虚衰，精气虚衰和情绪失调。",
          "type": "多选题"
        },
        {
          "id": 15418,
          "title": "衰老与五脏虚衰有关，其中最重要的两个脏是（）",
          "options": {
            "A": "肾、脾",
            "B": "心、肺",
            "C": "肝、肾",
            "D": "肺、脾",
            "E": ""
          },
          "answer": "A",
          "analysis": "五脏虚衰，以脾、肾为本。",
          "type": "多选题"
        },
        {
          "id": 15419,
          "title": "以下哪项不是养生的基本原则（）",
          "options": {
            "A": "顺应自然",
            "B": "形神共养",
            "C": "保精护肾",
            "D": "调养脾胃",
            "E": "未病先防"
          },
          "answer": "E",
          "analysis": "养生基本原则包括顺应自然、形神共养、保精护肾和调养脾胃四项。",
          "type": "多选题"
        },
        {
          "id": 15420,
          "title": "中医学的预防观念主要有以下哪些（   ）",
          "options": {
            "A": "未病先防",
            "B": "既病防变",
            "C": "愈后防复",
            "D": "未病先治",
            "E": ""
          },
          "answer": "A#B#C",
          "analysis": "中医学的预防观念指的是中医学“治未病”的思想，包括三个主要方面：未病先防、既病防变、愈后防复。",
          "type": "多选题"
        },
        {
          "id": 15421,
          "title": "下列选项中，不属于未病先防的原则和方法有（）",
          "options": {
            "A": "保持良好心情",
            "B": "加强身体锻炼",
            "C": "控制疾病传变",
            "D": "注意生活起居",
            "E": "避免病邪侵害"
          },
          "answer": "C",
          "analysis": "未病先防指在疾病发生之前，采取各种措施，增强人体正气，消除有害因素侵袭，以防止疾病的发生。选项ABDE属于未病先防的原则和方法。控制疾病传变为既病防变的原则和方法。",
          "type": "多选题"
        },
        {
          "id": 15422,
          "title": "以上不属于治则的是（）",
          "options": {
            "A": "正治与反治",
            "B": "活血化瘀",
            "C": "扶正祛邪",
            "D": "调整阴阳",
            "E": "三因制宜"
          },
          "answer": "B",
          "analysis": "活血化瘀不属于治则。",
          "type": "多选题"
        },
        {
          "id": 15423,
          "title": "正治的别名是（）",
          "options": {
            "A": "逆治",
            "B": "从治",
            "C": "顺治",
            "D": "反治",
            "E": ""
          },
          "answer": "A",
          "analysis": "正治采用与证候性质相反的方药治疗的治疗原则，又称“逆治”。",
          "type": "多选题"
        },
        {
          "id": 15424,
          "title": "正治的方法有以下哪些（   ）",
          "options": {
            "A": "寒者热之",
            "B": "热者寒之",
            "C": "虚则泻之",
            "D": "实则泻之",
            "E": "热因热用"
          },
          "answer": "A#B#C#D",
          "analysis": "E选项热因热用为反治的方法。",
          "type": "多选题"
        },
        {
          "id": 15425,
          "title": "寒因寒用适合的病症是（）",
          "options": {
            "A": "真寒假热证",
            "B": "真热假寒证",
            "C": "真虚假实证",
            "D": "真实假虚证",
            "E": ""
          },
          "answer": "B",
          "analysis": "寒因寒用（以寒治寒）指用寒凉方药治疗具有假寒症状的病证。适用于真热假寒证。",
          "type": "多选题"
        },
        {
          "id": 15426,
          "title": "以下不属于标本理论在治疗上的应用的是（）",
          "options": {
            "A": "急则治标",
            "B": "缓则治本",
            "C": "先治标后治本",
            "D": "标本兼治",
            "E": ""
          },
          "answer": "C",
          "analysis": "标本理论在治疗上的应用主要在三个方面：缓则治本，急则治标和标本兼治。",
          "type": "多选题"
        },
        {
          "id": 15427,
          "title": "因人制宜指根据病人的（）等不同特点，来制定适宜的方法和方药原则。",
          "options": {
            "A": "年龄",
            "B": "性别",
            "C": "体质",
            "D": "生活习惯",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "因人制宜指根据病人年龄、性别、体质、生活习惯等不同特点，来制定适宜的方法和方药原则。",
          "type": "多选题"
        },
        {
          "id": 15428,
          "title": "以下“因时制宜”的应用正确的是（）",
          "options": {
            "A": "夏季慎用温热",
            "B": "冬季慎用寒凉",
            "C": "暑邪致病应解暑化湿",
            "D": "冬季宜食热性食物",
            "E": "以上均对"
          },
          "answer": "E",
          "analysis": "因时制宜指根据不同季节气候的特点，来制定适宜的治法和方药原则。即如《素问•六元正纪大论》所说：“用寒远寒，用凉远凉，用温远温，用热远热，食宜同法。”即用寒凉方药及食物时，当避其气候之寒凉；用温热方药及食物时，当避其气候之温热。",
          "type": "多选题"
        },
        {
          "id": 15429,
          "title": "中医学描述肺“虚如蜂巢”所体现的思维方式是()",
          "options": {
            "A": "形象思维",
            "B": "意象思维",
            "C": "应象思维",
            "D": "抽象思维",
            "E": "逻辑思维"
          },
          "answer": "A",
          "analysis": "形象思维是用直观形象和表象解决问题的思维方式。通过对客观事物的直接接触而获得的感性认识，常常是人们在实践中对客观事物的直接、生动的直觉反映。 ",
          "type": "多选题"
        },
        {
          "id": 15430,
          "title": "中医学象思维的特征是（）",
          "options": {
            "A": "形象思维 ",
            "B": "意象思维",
            "C": "应象思维",
            "D": "抽象思维",
            "E": "逻辑思维"
          },
          "answer": "B",
          "analysis": "象思维是认识生命、健康和疾病的一种思维方式。它主要包括三种思维方式,以形象思维为根本,以意象思维为特征,以应象思维为法则。 ",
          "type": "多选题"
        },
        {
          "id": 15431,
          "title": "天人合一的思维方式属于（）",
          "options": {
            "A": "象思维",
            "B": "系统思维",
            "C": "变易思维",
            "D": "逻辑思维",
            "E": "辩证思维"
          },
          "answer": "B",
          "analysis": "天人合一是指天、地、人本原于一气，同构同律，相参相应的思维方式，属于中医的系统思维。",
          "type": "多选题"
        },
        {
          "id": 15432,
          "title": "中医学的变易思维指（）",
          "options": {
            "A": "整体宏观，天人合一",
            "B": "观物取象，立象尽意",
            "C": "恒动变化，动静相召",
            "D": "五脏一体，天人相应",
            "E": ""
          },
          "answer": "C",
          "analysis": "变易思维是指在观察分析和研究处理问题时，注重事物的运动变化规律，中医学用来研究生命和健康过程以及防治疾病等的思维方式，包括恒动变化，动静相召的思维模式。",
          "type": "多选题"
        },
        {
          "id": 15433,
          "title": "下列选项中，不属于中医学动静相召思维特点的是（）",
          "options": {
            "A": "凡阴阳之要，阳密乃固",
            "B": "谨察阴阳所在而调之，以平为期",
            "C": "筋脉和同，骨髓坚固，气血皆从",
            "D": "五脏安定，血脉和利，精神乃居",
            "E": "物之生，从乎化；物之极，由乎变"
          },
          "answer": "E",
          "analysis": "物之生，从乎化；物之极，由乎变体现的是中医学恒动变化的思维特点。",
          "type": "多选题"
        },
        {
          "id": 15434,
          "title": "中国药学史上最早一本经典药学著作是（   ）",
          "options": {
            "A": "《神农本草经》",
            "B": "《中药赋》",
            "C": "《伤寒论》",
            "D": "《内经》",
            "E": ""
          },
          "answer": "A",
          "analysis": "《神农本草经》简称《本草经》或《本经》，是中国现存最早的中药学专著",
          "type": "多选题"
        },
        {
          "id": 15435,
          "title": "中国第一部脉学专著是（   ）",
          "options": {
            "A": "唐·孙思邈《备急千金要方》",
            "B": "隋·巢元方《诸病源候论》",
            "C": "晋·皇甫谧《针灸甲乙经 》",
            "D": "晋.王叔和《脉经》",
            "E": ""
          },
          "answer": "D",
          "analysis": "魏晋隋唐时期是中国医学发展史上承前启后的重要时期。在这一时期诞生了第一部脉学专著：晋·王叔和《脉经》。",
          "type": "多选题"
        },
        {
          "id": 15436,
          "title": "确立中医临床辨证论治理论体系的是（）",
          "options": {
            "A": "《伤寒杂病论》",
            "B": "《黄帝内经》",
            "C": "《难经》",
            "D": "《神农本草经》",
            "E": ""
          },
          "answer": "A",
          "analysis": "《伤寒杂病论》后世分为《伤寒论》与《金匮要略》，是中医学第一部辨证论治的专著。",
          "type": "多选题"
        },
        {
          "id": 15437,
          "title": "关于《伤寒杂病论》，下列说法错误的是（       ）。",
          "options": {
            "A": "是我国第一部临床学专著",
            "B": "开创了辨证论治的先河，理法方药一线贯穿",
            "C": "以六经论伤寒，以脏腑论杂病",
            "D": "作者是张仲景，被后世尊称为“医圣”",
            "E": "该书成书于春秋战国时期"
          },
          "answer": "E",
          "analysis": "《伤寒杂病论》成书于东汉，ABCD项的表述正确。",
          "type": "多选题"
        },
        {
          "id": 15438,
          "title": "提出三因学说的医家是（）",
          "options": {
            "A": "陈无择",
            "B": "刘完素",
            "C": "李杲",
            "D": "朱震亨",
            "E": ""
          },
          "answer": "A",
          "analysis": "宋代医家陈无择在他的专著《三因极一病证方论》中提出了三因学说。",
          "type": "多选题"
        },
        {
          "id": 15439,
          "title": "以下不属于明清时期温病四大家的医家是（）",
          "options": {
            "A": "吴有性",
            "B": "叶桂",
            "C": "张介宾",
            "D": "吴瑭",
            "E": ""
          },
          "answer": "C",
          "analysis": "明清时期的温病四大家分别是明代的吴有性，清代的叶桂，吴瑭和薛雪。",
          "type": "多选题"
        },
        {
          "id": 15440,
          "title": "关于温病四大家，下列说法错误的是（       ）。",
          "options": {
            "A": "吴有性指出戾气多“从口鼻而入”且有传染性、流行性",
            "B": "叶桂提出“温邪上受，首先犯肺，逆传心包”",
            "C": "吴瑭指出“凡病温者，始于上焦”、“上焦病不治则传中焦”、“中焦病不治，即传下焦”",
            "D": "薛雪指出湿热多由阳明、太阴两经表里相传",
            "E": "温病四大家，均为清代著名医家"
          },
          "answer": "E",
          "analysis": "明清时期的温病四大家分别是明代的吴有性，清代的叶桂，吴瑭和薛雪。",
          "type": "多选题"
        },
        {
          "id": 15441,
          "title": "中国近代中西医汇通派的代表专著是（   ）",
          "options": {
            "A": "《医学衷中参西录》",
            "B": "《中药赋》",
            "C": "《伤寒论》",
            "D": "《脉经》",
            "E": ""
          },
          "answer": "A",
          "analysis": "张锡纯主张沟通中西，取长补短，是近代中西医汇通派的代表之一。结合其多年临证经验与汇通中西的体会，著成《医学衷中参西录》。",
          "type": "多选题"
        },
        {
          "id": 15442,
          "title": "中医整体观念包含的内容为（  ）",
          "options": {
            "A": "人体是一个有机的整体  ",
            "B": "自然界是一个统一的整体",
            "C": "脏腑肢体官窍连络成一个整体",
            "D": "人体是一个有机的整体，人与外界环境的统一性",
            "E": "人体是一个有机的整体，自然界是一个统一的整体"
          },
          "answer": "D",
          "analysis": "整体观念，是中医学认识人体自身以及人与环境之间联系性和统一性的学术思想。",
          "type": "多选题"
        },
        {
          "id": 15443,
          "title": "自然环境对人体生理的影响包括（）",
          "options": {
            "A": "季节气候",
            "B": "昼夜时辰",
            "C": "地域环境",
            "D": "以上都是",
            "E": ""
          },
          "answer": "D",
          "analysis": "中医认为四季气候变化，一日之内的昼夜晨昏变化，地域环境对人体生理也会有不同的影响",
          "type": "多选题"
        },
        {
          "id": 15444,
          "title": "人体是一个有机整体，其体现在（  ）",
          "options": {
            "A": "以五脏为中心的整体观  ",
            "B": "人体生理上相互联系  ",
            "C": "人体病理上相互影响  ",
            "D": "局部的病变可从整体进行治疗",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "中医学认为人体是一个有机的整体，构成人体的各个组成部分之间，在结构上是不可分割的，在功能上是相互协调、相互为用的，在病理上则是相互影响的，而且与自然界相互关联。",
          "type": "多选题"
        },
        {
          "id": 15445,
          "title": "以下关于疾病防治中“因地制宜”原则的说法中，错误的是（）",
          "options": {
            "A": "北方多燥寒，人体多腠理致密",
            "B": "南方多湿热，人体多腠理疏松",
            "C": "西北宜用寒凉之药",
            "D": "东南慎用辛热之品",
            "E": ""
          },
          "answer": "C",
          "analysis": "西北地势高，偏于寒凉干燥，应少用寒凉之药。",
          "type": "多选题"
        },
        {
          "id": 15446,
          "title": "中医学主张（）以养生维护健康、形神共调以康复治疗疾病。",
          "options": {
            "A": "形神共养",
            "B": "心神合一",
            "C": "动静互涵",
            "D": "治未病",
            "E": ""
          },
          "answer": "A",
          "analysis": "中医学主张形神共养以养生维护健康、形神共调以康复治疗疾病。 如：顺应自然、锻炼身体、合理膳食、劳逸适度、外避病邪以养其形，形健神旺\n恬惔虚无、怡畅情志以养神，神清形健 ",
          "type": "多选题"
        },
        {
          "id": 15447,
          "title": "以下哪项是“病”的概念()",
          "options": {
            "A": "疾病过程中某一类型的病理概括",
            "B": "疾病的全过程",
            "C": "疾病过程中的体征",
            "D": "疾病某一阶段的病理概括",
            "E": "疾病过程的症状"
          },
          "answer": "B",
          "analysis": "病是疾病的简称，指有特定的致病因素、发病规律和病理演变的一个完整的异常生命过程，常常有较固定的临床症状和体征、诊断要点、与相似疾病的鉴别点等。",
          "type": "多选题"
        },
        {
          "id": 15448,
          "title": "疾病表现出来的各种异常生命现象称之为（   ）",
          "options": {
            "A": "症状",
            "B": "病",
            "C": "症候",
            "D": "证",
            "E": ""
          },
          "answer": "A",
          "analysis": "症状和体征，是机体发病而表现出来的异常表现，包括患者所诉的异常感觉与医生所诊查的各种体征。",
          "type": "多选题"
        },
        {
          "id": 15449,
          "title": "根据中医理论，“证”“症”“病”含义不同，下列表述中，属于“症”的是()",
          "options": {
            "A": "津亏",
            "B": "风疹",
            "C": "恶寒",
            "D": "痹证",
            "E": "结石"
          },
          "answer": "C",
          "analysis": "症，指疾病的外在表现，即症状。疾病，是机体在一定情况下对于外界有害因素作用的一种反应，具有特定的症状和体征，答案中其他选项属于证的范畴。",
          "type": "多选题"
        },
        {
          "id": 15450,
          "title": "我们要通过四诊（望、闻、问、切）合参，经过分析归纳得出个结论，揭示出病因、病位、病性、病机、机体的抗病能力，最后得出个结论，为论治提供依据和前提的过程称为（   ）",
          "options": {
            "A": "辨证",
            "B": "论治",
            "C": "问诊",
            "D": "查体",
            "E": ""
          },
          "answer": "A",
          "analysis": "辨证，是以中医学理论对四诊（望、闻、问、切）所得的资料进行综合分析，明确病变本质并确立为何种证的思维和实践过程。",
          "type": "多选题"
        },
        {
          "id": 15451,
          "title": "藏象学说主要是研究（   ）",
          "options": {
            "A": "脏腑概念",
            "B": "脏腑生理、病理",
            "C": "脏腑生理、病理之间的关系",
            "D": "脏腑生理、病理及其相互关系",
            "E": "脏腑组织器官结构形态"
          },
          "answer": "D",
          "analysis": "藏象学说，是研究人体脏腑生理功能、病理变化规律及相互关系的学说",
          "type": "多选题"
        },
        {
          "id": 15452,
          "title": "藏象学说的主要特点是（   ）",
          "options": {
            "A": "古代哲学思想的渗透",
            "B": "五脏功能系统观",
            "C": "取象比类的认知方法",
            "D": "重道轻器的认识",
            "E": "脏腑互为表里的认识"
          },
          "answer": "B",
          "analysis": "五脏功能系统观和五脏阴阳时空观是藏象学说的两大主要特点",
          "type": "多选题"
        },
        {
          "id": 15453,
          "title": "藏象的基本含义是（   ）",
          "options": {
            "A": "五脏六腑的形象            \t\t",
            "B": "内在组织器官的表象",
            "C": "五脏六腑和奇恒之腑\t",
            "D": "脏腑藏于内，其生理病理表现于外",
            "E": "五脏的形象"
          },
          "answer": "D",
          "analysis": "藏象又名脏象，是指人体内脏运动规律及其表现于外的生理病理征象",
          "type": "多选题"
        },
        {
          "id": 15454,
          "title": "脏腑是人体内脏的总称，分为脏、腑和（   ）三类",
          "options": {
            "A": "奇恒之腑",
            "B": "A. 精",
            "C": "B. 气",
            "D": "C. 血",
            "E": "D. 经络"
          },
          "answer": "A",
          "analysis": "脏腑是人体内脏的总称，分为脏、腑和奇恒之腑三类",
          "type": "多选题"
        },
        {
          "id": 15455,
          "title": "被称为“五脏六腑之大主”的脏腑是（   ）",
          "options": {
            "A": "心  \t",
            "B": "肺    \t",
            "C": "脾\t",
            "D": "肝    \t",
            "E": "肾"
          },
          "answer": "A",
          "analysis": "由于心的主血脉和主藏神功能起着主宰人体整个生命活动的作用，故称心为“君主之官”、“生之本”、“五脏六腑之大主”",
          "type": "多选题"
        },
        {
          "id": 15456,
          "title": "心在五行属（   ）",
          "options": {
            "A": "木 ",
            "B": "火",
            "C": "土",
            "D": "金",
            "E": "水"
          },
          "answer": "B",
          "analysis": "藏象学说中心在五行属火",
          "type": "多选题"
        },
        {
          "id": 15457,
          "title": "判断心主血脉的功能正常与否，可观察的外在征象不包括（   ）",
          "options": {
            "A": "面色    \t",
            "B": "脉搏   \t\t",
            "C": "意识  \t",
            "D": "舌色    \t\t",
            "E": "心胸部感觉"
          },
          "answer": "C",
          "analysis": "判断心主血脉的功能正常与否，可观察的外在征象共有四个，包括心胸部感觉，面色，脉搏，舌色",
          "type": "多选题"
        },
        {
          "id": 15458,
          "title": "以下关于心的称呼，错误的是（   ）",
          "options": {
            "A": "君主之官\t\t\t\t\t",
            "B": "五脏六腑之大主\t",
            "C": "生之本\t\t\t\t\t\t",
            "D": "气之本\t",
            "E": "阳中之阳脏"
          },
          "answer": "D",
          "analysis": "： 由于心的主血脉和主藏神功能起着主宰人体整个生命活动的作用，故称心为“君主之官”、“生之本”、“五脏六腑之大主”。从阴阳属性和生理特性来看，心为阳中之阳，故称阳中之阳脏",
          "type": "多选题"
        },
        {
          "id": 15459,
          "title": "下列关于心主神明的含义中，错误的是（   ）",
          "options": {
            "A": "主宰五脏六腑的生理活动 \t\t",
            "B": "主宰形体官窍的生理活动",
            "C": "主宰人体的精神意识思维活动\t",
            "D": "总司气化功能",
            "E": ""
          },
          "answer": "D",
          "analysis": "心主神明指心具有主宰五脏六腑、形体官窍等生命活动和意识、思维等精神活动的功能。心所主的广义之神指心神调控各脏腑功能，狭义之神指意识、思维、情志等活动",
          "type": "多选题"
        },
        {
          "id": 15460,
          "title": "六腑是胆、胃、小肠、大肠、膀胱、（   ）的合称",
          "options": {
            "A": "三焦",
            "B": "心",
            "C": "肝",
            "D": "肾",
            "E": "肺"
          },
          "answer": "A",
          "analysis": "六腑是胆、胃、小肠、大肠、膀胱、三焦的合称",
          "type": "多选题"
        },
        {
          "id": 15461,
          "title": "六腑的生理特性是（   ）",
          "options": {
            "A": "传化物而不藏，实而不能满  \t",
            "B": "藏精气而不泻，实而不能满",
            "C": "传化物而不藏，满而不能实    \t",
            "D": "藏精气而不泻，满而不能实",
            "E": "虚实交替，泻而不藏"
          },
          "answer": "A",
          "analysis": "《素问·五脏别论》说：“所谓五脏者，藏精气而不泻也，故满而不能实；六腑者，传化物而不藏，故实而不能满也。”",
          "type": "多选题"
        },
        {
          "id": 15462,
          "title": "即属于六腑，有属于奇恒之腑的是（   ）",
          "options": {
            "A": "脑",
            "B": "髓",
            "C": "骨",
            "D": "胆",
            "E": ""
          },
          "answer": "D",
          "analysis": "胆居六腑之首，又为奇恒之腑。",
          "type": "多选题"
        },
        {
          "id": 15463,
          "title": "贮藏和排泄胆汁的生理功能属于（   ）",
          "options": {
            "A": "胆",
            "B": "大肠",
            "C": "小肠",
            "D": "膀胱",
            "E": ""
          },
          "answer": "A",
          "analysis": "胆主贮藏和排泄胆汁",
          "type": "多选题"
        },
        {
          "id": 15464,
          "title": "胆汁的生成和排泄有赖于(   )功能控制和调节",
          "options": {
            "A": "肝主疏泄",
            "B": "肾主藏精",
            "C": "脾主运化",
            "D": "肺主通调水道",
            "E": ""
          },
          "answer": "A",
          "analysis": "胆汁的生成和排泄有赖于肝主疏泄功能控制和调节。肝的疏泄功能障碍会导致胆汁化生和排泄障碍，使得胆汁不能正常地注入小肠，影响饮食水谷的消化",
          "type": "多选题"
        },
        {
          "id": 15465,
          "title": "胃的生理功能是（   ）",
          "options": {
            "A": "受盛化物",
            "B": "传化糟粕",
            "C": "主持诸气",
            "D": "受纳腐熟",
            "E": "通调水道"
          },
          "answer": "D",
          "analysis": "胃的生理功能主要体现在胃主收纳水谷和胃主腐熟水谷两方面",
          "type": "多选题"
        },
        {
          "id": 15466,
          "title": "与胃一样具有喜润恶燥生理特性的脏腑是（   ）",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "肺",
            "D": "脾",
            "E": ""
          },
          "answer": "C",
          "analysis": "肺喜润恶燥，脾喜燥恶湿",
          "type": "多选题"
        },
        {
          "id": 15467,
          "title": "小肠位于腹中，其上端与胃在幽门相接，下端与（   ）在阑门相连",
          "options": {
            "A": "胆",
            "B": "大肠",
            "C": "三焦",
            "D": "膀胱",
            "E": ""
          },
          "answer": "B",
          "analysis": "小肠位于腹中，其上端与胃在幽门相接，下端与大肠在阑门相连",
          "type": "多选题"
        },
        {
          "id": 15468,
          "title": "小肠的功能是（   ）",
          "options": {
            "A": "受盛化物",
            "B": "排泄糟粕",
            "C": "受纳腐熟",
            "D": "运行水液",
            "E": "通调水道"
          },
          "answer": "A",
          "analysis": "小肠主受盛化物，小肠接受由胃腑下移而来的食糜而盛纳之，食糜在小肠内必须停留一定的时间，由脾气与小肠的共同作用对其进一步消化，化为精微和糟粕两部分",
          "type": "多选题"
        },
        {
          "id": 15469,
          "title": "利小便而实大便的理论依据是（   ）",
          "options": {
            "A": "脾主运化",
            "B": "肺主通调水道",
            "C": "小肠主受盛",
            "D": "小肠主化物",
            "E": "小肠主泌别清浊"
          },
          "answer": "E",
          "analysis": "“小肠主泌别清浊”是指小肠对食糜作进一步消化，并将其分为清浊两部分的生理机能。其中清者即水谷精微和津液，由小肠吸收后，经脾气转输至全身，灌溉四旁；浊者即食物残渣和部分津液，在胃和小肠之气的作用下传送大肠，在大肠生理作用下转化为粪便排出体外。若小肠泌别清浊功能失常，清浊不分，就会出现便溏泄泻等症。“利小便而实大便”治疗泄泻的理论依据为小肠主泌别清浊",
          "type": "多选题"
        },
        {
          "id": 15470,
          "title": "大肠者（   ）",
          "options": {
            "A": "仓廪之官，五味出焉",
            "B": "中正之官，决断出焉",
            "C": "传道之官，变化出焉",
            "D": "相辅之官，治节出焉",
            "E": "作强之官，伎巧出焉"
          },
          "answer": "C",
          "analysis": "《素问·灵兰秘典论》有言:“肺者，相傅之官，治节出焉。肝者，将军之官，谋虑出焉。胆者，中正之官，决断出焉。膻中者，臣使之官，喜乐出焉。脾胃者，仓廪之官，五味出焉。大肠者，传道之官，变化出焉。小肠者，受盛之官，化物出焉。肾者，作强之官，伎巧出焉。三焦者，决渎之官，水道出焉。膀胱者，州都之官，津液藏焉，气化则能出矣。凡此十二官者，不得相失也。”",
          "type": "多选题"
        },
        {
          "id": 15471,
          "title": "大肠的主要生理功能是（   ）",
          "options": {
            "A": "受盛",
            "B": "传导糟粕",
            "C": "化物",
            "D": "泌别清浊",
            "E": "通行元气"
          },
          "answer": "B",
          "analysis": "大肠主传导糟粕，接受由小肠下移的食物残渣，吸收水分，形成糟粕，经肛门排泄粪便",
          "type": "多选题"
        },
        {
          "id": 15472,
          "title": "“州都之官”是（   ）",
          "options": {
            "A": "胆",
            "B": "胃",
            "C": "小肠",
            "D": "大肠",
            "E": "膀胱"
          },
          "answer": "E",
          "analysis": "《素问·灵兰秘典论》有云：“膀胱者，州都之官，津液藏焉。”",
          "type": "多选题"
        },
        {
          "id": 15473,
          "title": "膀胱的开合由下列哪项调节（   ）",
          "options": {
            "A": "肝气",
            "B": "胃气",
            "C": "肺气",
            "D": "肾气",
            "E": "三焦"
          },
          "answer": "D",
          "analysis": "肾气失于固摄，膀胱合少开多，可见夜尿多，尿后余沥，尿频，遗尿，小便不禁等症状。肾的气化作用失常，膀胱开少合多，可出现小便不利或癃闭",
          "type": "多选题"
        },
        {
          "id": 15474,
          "title": "具有通行元气和运行水液功能的是（   ）",
          "options": {
            "A": "脾",
            "B": "三焦",
            "C": "膀胱",
            "D": "胃",
            "E": "小肠"
          },
          "answer": "B",
          "analysis": "三焦具有疏通水道、运行津液的作用，以调节津液代谢平衡，而诸气的运行输布，皆以三焦为通道",
          "type": "多选题"
        },
        {
          "id": 15475,
          "title": "脏腑之中，被称为“孤府”的是（   ）",
          "options": {
            "A": "胆",
            "B": "胃",
            "C": "三焦",
            "D": "脾",
            "E": "脑"
          },
          "answer": "C",
          "analysis": "三焦为六腑之一，又名外腑、孤府，它是分布于胸腹腔的一个大腑，惟三焦最大，无与匹配，故有“孤府”之称",
          "type": "多选题"
        },
        {
          "id": 15476,
          "title": "属于上焦生理功能特点的是（   ）",
          "options": {
            "A": "主气的升发",
            "B": "升已而降，若雾露之溉",
            "C": "通行三气",
            "D": "原气之别使",
            "E": "以上都不是"
          },
          "answer": "B",
          "analysis": "上焦宣发卫气，敷布水谷精微、血和津液的作用，如雾露之灌溉",
          "type": "多选题"
        },
        {
          "id": 15477,
          "title": "不属于奇恒之腑的是（   ）",
          "options": {
            "A": "脑",
            "B": "髓",
            "C": "骨",
            "D": "胆",
            "E": "小肠"
          },
          "answer": "E",
          "analysis": "奇恒之腑，是脑、髓、骨、脉、胆、女子胞的总称",
          "type": "多选题"
        },
        {
          "id": 15478,
          "title": "脑藏于颅腔之中，为脑髓汇聚而成，位于头部之内，故又名“髓海” ，又称(   )",
          "options": {
            "A": "元神之府",
            "B": "神明之府",
            "C": "五脏六腑之大主",
            "D": "中精之府",
            "E": ""
          },
          "answer": "A",
          "analysis": "脑藏于颅腔之中，为脑髓汇聚而成，位于头部之内，故又名“髓海” ，又称元神之府",
          "type": "多选题"
        },
        {
          "id": 15479,
          "title": "主持月经的功能属于（   ）",
          "options": {
            "A": "骨",
            "B": "胆",
            "C": "脉",
            "D": "女子胞",
            "E": ""
          },
          "answer": "D",
          "analysis": "主持月经和孕育胎儿是女子胞的生理功能之一",
          "type": "多选题"
        },
        {
          "id": 15480,
          "title": "女子胞与五脏密切相关，尤以（   ）为最",
          "options": {
            "A": "肝、脾、肾",
            "B": "心、肺、肾",
            "C": "脾、肺、肾",
            "D": "心、肺、肝",
            "E": ""
          },
          "answer": "A",
          "analysis": "女子胞的生理功能主要与心、肝、脾、肾的关系最为密切",
          "type": "多选题"
        },
        {
          "id": 15481,
          "title": "肺最基本的生理功能是（   ）",
          "options": {
            "A": "主气   \t",
            "B": "主宣降\t\t",
            "C": "主行水   \t",
            "D": "主治节    \t",
            "E": "主藏魄"
          },
          "answer": "B",
          "analysis": "宣发与肃降运动协调，维持着肺司呼吸、主行水等功能，是肺最基本的生理功能",
          "type": "多选题"
        },
        {
          "id": 15482,
          "title": "肺吸入清气主要靠下列哪项（   ）",
          "options": {
            "A": "宣发   \t",
            "B": "肃降 \t\t\t",
            "C": "疏通    \t\t",
            "D": "调节    \t\t",
            "E": "朝百脉"
          },
          "answer": "B",
          "analysis": "肺主肃降是指肺气具有向内向下清肃通降的作用。主要体现在三个方面：一是吸入自然界之清气，生成宗气并散布脐下，以资元气；二是向下向内布散水谷精微；三是将脏腑代谢所产生的浊液下输膀胱，生成尿液，排出体外",
          "type": "多选题"
        },
        {
          "id": 15483,
          "title": "肺被称为“娇脏”是因为（   ）",
          "options": {
            "A": "肺主司呼吸    \t\t\t\t\t",
            "B": "肺为华盖",
            "C": "肺气通于天，不耐寒热\t\t\t",
            "D": "肺为水之上源    ",
            "E": "肺朝百脉"
          },
          "answer": "C",
          "analysis": "肺为娇脏是指肺体清虚娇嫩，易为邪气侵袭为病的生理特性。由于肺位最高，与外界相通，主司呼吸，为脏腑之华盖，百脉之所朝会。故外感六淫邪气从皮毛或口鼻而入，常易犯肺而为病；其他脏腑病变，亦常累及于肺。肺为清虚之脏，清轻肃静，不容纤芥，不耐邪气之侵。故无论外感、内伤或其他脏腑病变，皆可病及于肺，故肺有“娇脏”之称",
          "type": "多选题"
        },
        {
          "id": 15484,
          "title": "肺气的宣发生理作用不包括（   ）",
          "options": {
            "A": "呼出浊气            \t\t",
            "B": "宣散卫气       ",
            "C": "布散津液于体表\t\t\t\t",
            "D": "将水谷精微上输头面",
            "E": "生成宗气"
          },
          "answer": "E",
          "analysis": "肺气的宣发指肺气升宣与布散的运动形式，主要表现在三个方面：一是呼出体内浊气；二是将脾转输至肺的水谷精微和津液上输头面诸窍，外达皮毛肌腠；三是宣发卫气于皮毛肌腠，以温分肉，充皮肤，肥腠理，司开阖，并将津液化为汗液排出体外",
          "type": "多选题"
        },
        {
          "id": 15485,
          "title": "肺主一身之气主要体现于（   ）",
          "options": {
            "A": "宗气生成和气机调节    \t\t\t\t",
            "B": "宣发津液        ",
            "C": "通调水道\t\t\t\t\t",
            "D": "朝百脉",
            "E": ""
          },
          "answer": "A",
          "analysis": "肺主一身之气体现在于宗气生成和气机调节",
          "type": "多选题"
        },
        {
          "id": 15486,
          "title": "肺的行水功能主要依赖于（   ）",
          "options": {
            "A": "肺主一身之气    \t\t\t\t",
            "B": "肺司呼吸    ",
            "C": "肺输精于皮毛\t\t\t\t\t",
            "D": "肺朝百脉       ",
            "E": "肺主宣发肃降"
          },
          "answer": "E",
          "analysis": "宣发与肃降运动协调，维持着肺司呼吸、主行水等功能",
          "type": "多选题"
        },
        {
          "id": 15487,
          "title": "肺被称为“水之上源”是因为（   ）",
          "options": {
            "A": "肺具有通调水道的功能  \t",
            "B": "肺具有布散津液的功能",
            "C": "肺具有输精于皮毛的功能     \t",
            "D": "肺为脏腑之华盖",
            "E": "饮入于胃，上归于肺"
          },
          "answer": "A",
          "analysis": "肺主行水，为“水之上源”。肺主行水指肺通调水道，通过肺气宣发肃降对体内水液的输布、运行和排泄具有疏通和调节作用",
          "type": "多选题"
        },
        {
          "id": 15488,
          "title": "肺主治节是指（   ）",
          "options": {
            "A": "肺主气的调节作用          \t\t",
            "B": "肺主宣发和肃降的调节作用",
            "C": "对肺生理功能的高度概括   \t\t",
            "D": "肺协助心调节全身血脉作用",
            "E": "肺对津液的调节作用"
          },
          "answer": "C",
          "analysis": "肺主治节指肺对气、血、津液的治理和调节作用，主要体现在四个方面：一是治理调节呼吸运动，使之保持呼吸节律、有条不紊；二是治理调节全身气机，随着肺一呼一吸的运动，调节全身气机的升降出入；三是肺朝百脉，治理调节血液的运行；四是肺主通调水道，治理调节津液的代谢。肺主治节，是对肺的主要生理功能的高度概括",
          "type": "多选题"
        },
        {
          "id": 15489,
          "title": "肺在志为（   ）",
          "options": {
            "A": "喜",
            "B": "怒",
            "C": "忧",
            "D": "思",
            "E": "恐"
          },
          "answer": "C",
          "analysis": "忧、悲由肺精、肺气化生，同属肺志。悲忧过度，则可损伤肺精、肺气，出现呼吸气短等现象。肺气虚衰或肺气宣降失调，也易于产生悲忧的情绪变化",
          "type": "多选题"
        },
        {
          "id": 15490,
          "title": "在肝主疏泄的各种功能表现中，最根本的是（   ）",
          "options": {
            "A": "调畅情志",
            "B": "调节气机",
            "C": "调节血量",
            "D": "疏通水道",
            "E": "促进脾胃运化"
          },
          "answer": "B",
          "analysis": "肝气疏通、畅达全身气机，使脏腑经络之气的运行通畅无阻，升降出入运动协调平衡，从而维持了全身脏腑、经络、形体、官窍等机能活动的有序进行。因而肝主疏泄的中心环节是调节气机",
          "type": "多选题"
        },
        {
          "id": 15491,
          "title": "对肝主疏泄影响最大的情志活动是（   ）",
          "options": {
            "A": "喜",
            "B": "怒",
            "C": "忧",
            "D": "思",
            "E": "恐"
          },
          "answer": "B",
          "analysis": "肝之志在怒，对肝主疏泄影响最大的情志活动是怒，暴怒伤肝",
          "type": "多选题"
        },
        {
          "id": 15492,
          "title": "肝在液为（   ）",
          "options": {
            "A": "泪    \t",
            "B": "汗    \t",
            "C": "涎\t",
            "D": "涕\t",
            "E": "唾"
          },
          "answer": "A",
          "analysis": "肝在液为泪",
          "type": "多选题"
        },
        {
          "id": 15493,
          "title": "肝在体合（   ）",
          "options": {
            "A": "筋\t",
            "B": "脉    \t",
            "C": "肉    \t",
            "D": "皮 \t",
            "E": "骨"
          },
          "answer": "A",
          "analysis": "肝在体合筋，其华在爪",
          "type": "多选题"
        },
        {
          "id": 15494,
          "title": "肝主要生理功能是（   ）",
          "options": {
            "A": "统血\t",
            "B": "藏血    \t",
            "C": "纳气    \t",
            "D": "行水 \t",
            "E": "主血脉"
          },
          "answer": "B",
          "analysis": "肝具有贮藏血液、调节血量和防止出血的功能",
          "type": "多选题"
        },
        {
          "id": 15495,
          "title": "肝开窍于（   ）",
          "options": {
            "A": "口",
            "B": "耳",
            "C": "目",
            "D": "鼻",
            "E": "舌"
          },
          "answer": "C",
          "analysis": "肝开窍于目",
          "type": "多选题"
        },
        {
          "id": 15496,
          "title": "（   ）喜条达而恶抑郁",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肾",
            "E": ""
          },
          "answer": "B",
          "analysis": "肝属木，肝气以疏通、畅达为顺，不宜抑制、郁结。故肝喜条达而恶抑郁",
          "type": "多选题"
        },
        {
          "id": 15497,
          "title": "肾所藏之精是指（   ）",
          "options": {
            "A": "先天之精",
            "B": "后天之精",
            "C": "包括先天之精和后天之精",
            "D": "生殖之精",
            "E": "气血津液"
          },
          "answer": "C",
          "analysis": "肾精即肾藏之精，来源于先天，充养于后天",
          "type": "多选题"
        },
        {
          "id": 15498,
          "title": "天癸的产生取决于（   ）",
          "options": {
            "A": "先天禀赋的强弱",
            "B": "元气的充沛",
            "C": "肾阴肾阳的平衡",
            "D": "肾中精气的充盈",
            "E": "后天之精的充养"
          },
          "answer": "D",
          "analysis": "天癸，是肾精充盈而化生的促进生殖器官成熟，维持生殖功能的精微物质。由中年进入老年，肾中精气渐衰，天癸生成减少、耗竭",
          "type": "多选题"
        },
        {
          "id": 15499,
          "title": "以下选项中不是观察肾精盛衰的标志是（   ）",
          "options": {
            "A": "齿",
            "B": "骨",
            "C": "发",
            "D": "面色",
            "E": ""
          },
          "answer": "D",
          "analysis": "齿、发、骨是观察肾中精气的外候，是判断机体生长发育状况客观标志",
          "type": "多选题"
        },
        {
          "id": 15500,
          "title": "对肾主封藏影响最大的情志活动是（   ）",
          "options": {
            "A": "喜",
            "B": "怒",
            "C": "忧",
            "D": "思",
            "E": "恐"
          },
          "answer": "E",
          "analysis": "肾在志为恐。对肾主封藏影响最大的情志活动是恐，恐伤肾",
          "type": "多选题"
        },
        {
          "id": 15501,
          "title": "肾精不足可出现（）",
          "options": {
            "A": "小儿囟门迟闭",
            "B": "小儿骨软无力",
            "C": "牙齿松动脱落",
            "D": "老年人骨质脆弱",
            "E": "以上均是"
          },
          "answer": "E",
          "analysis": "肾精不足，骨髓生化无源，骨骼失养，则可出现小儿囟门迟闭，骨软无力，齿迟；以及老年人骨质脆弱，易于骨折，牙齿松动、脱落等",
          "type": "多选题"
        },
        {
          "id": 15502,
          "title": "肾气通于（   ）",
          "options": {
            "A": "春",
            "B": "夏",
            "C": "长夏",
            "D": "秋",
            "E": "冬"
          },
          "answer": "E",
          "analysis": "《素问· 六节藏象论》 说: “肾者主蛰……通于冬气。”",
          "type": "多选题"
        },
        {
          "id": 15503,
          "title": "补肾治疗脱发的理论依据是（   ）",
          "options": {
            "A": "发为血之余",
            "B": "肾主纳气",
            "C": "发之生机在肾",
            "D": "滋水涵木",
            "E": ""
          },
          "answer": "C",
          "analysis": "由于肾藏精，精生血，精血旺盛，则毛发粗壮、浓密而润泽故说发的生机根于肾。临床所见的未老先衰，年少而头发枯萎、早脱早白等，多与肾精、肾气不足有关，应考虑从肾论治",
          "type": "多选题"
        },
        {
          "id": 15504,
          "title": "下列官窍中与肾有关的是（   ）",
          "options": {
            "A": "目",
            "B": "鼻",
            "C": "口",
            "D": "耳及二阴",
            "E": ""
          },
          "answer": "D",
          "analysis": "肾在窍为耳及二阴",
          "type": "多选题"
        },
        {
          "id": 15515,
          "title": "脾统血的含义是（   ）",
          "options": {
            "A": "脾有推动血液在经脉中流行的作用",
            "B": "脾有调节经脉中血流量的作用",
            "C": "脾有统摄血液在经脉中运行的作用",
            "D": "脾有贮藏血液的作用",
            "E": "脾有化生血液的作用"
          },
          "answer": "C",
          "analysis": "脾统血指脾气具有统摄、控制血液在脉中正常运行而不逸出脉外的功能",
          "type": "多选题"
        },
        {
          "id": 15516,
          "title": "具有化湿而恶湿特点的脏腑是（    ）",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "C",
          "analysis": "脾主运化，脾气健运，运化水饮功能正常，水精四布，自然无痰饮水湿的停聚",
          "type": "多选题"
        },
        {
          "id": 15517,
          "title": "脾的生理特性是（    ）",
          "options": {
            "A": "喜和降",
            "B": "喜清肃",
            "C": "喜燥恶湿",
            "D": "喜润恶燥",
            "E": "喜条达"
          },
          "answer": "C",
          "analysis": "脾运化水饮，喜燥恶湿",
          "type": "多选题"
        },
        {
          "id": 15518,
          "title": "脾气将饮食物化为水谷精微，为化生精、气、血、津液提供充足的原料，故为（    ）",
          "options": {
            "A": "后天之本",
            "B": "水之上源",
            "C": "气血生化之源",
            "D": "生之本",
            "E": "气之本"
          },
          "answer": "C",
          "analysis": "饮食物是生成精、气、血、津液的主要物质基础，而其消化及其精微的吸收、\n转输、布散都由脾主，脾气将饮食物化为水谷精微，为化生精、气、血、津液\n提供充足的原料，故为“气血生化之源”",
          "type": "多选题"
        },
        {
          "id": 15519,
          "title": "脾在液为（   ）",
          "options": {
            "A": "汗",
            "B": "泪",
            "C": "涎",
            "D": "涕",
            "E": "尿"
          },
          "answer": "C",
          "analysis": "脾在液为涎",
          "type": "多选题"
        },
        {
          "id": 15520,
          "title": "脾在体合（   ）",
          "options": {
            "A": "脉",
            "B": "肉",
            "C": "筋",
            "D": "骨",
            "E": "皮"
          },
          "answer": "B",
          "analysis": "脾在体合肉，主四肢",
          "type": "多选题"
        },
        {
          "id": 15521,
          "title": "脾的主要生理功能是（   ）",
          "options": {
            "A": "运化食物",
            "B": "运化水液",
            "C": "主升清",
            "D": "主统血",
            "E": "以上全是"
          },
          "answer": "E",
          "analysis": "脾的主要生理功能主要体现在两个方面：1.脾主运化，指脾气将饮食水谷转化为水谷精微，并将其吸收、转输到全身脏腑的生理功能；2.脾主统血，指脾气具有统摄、控制血液在脉中正常运行而不逸出脉外的功能",
          "type": "多选题"
        },
        {
          "id": 15522,
          "title": "以下可以体现了机体升降相因作用的是（   ）",
          "options": {
            "A": "肝与脾",
            "B": "脾与胃",
            "C": "肝与肾",
            "D": "心与脾",
            "E": ""
          },
          "answer": "B",
          "analysis": "脾主运化，气机主升、主入；胃主受纳，气机主降、主出，这种升降结合，出入相因，维持脾胃功能的协调",
          "type": "多选题"
        },
        {
          "id": 15523,
          "title": "心与（   ）相表里",
          "options": {
            "A": "胆",
            "B": "大肠",
            "C": "小肠",
            "D": "膀胱",
            "E": ""
          },
          "answer": "C",
          "analysis": "心与小肠相表里",
          "type": "多选题"
        },
        {
          "id": 15524,
          "title": "与大肠相表里的脏是（   ）",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "D",
          "analysis": "肺与大肠相表里",
          "type": "多选题"
        },
        {
          "id": 15525,
          "title": "在脾胃的关系中，最根本的是（   ）",
          "options": {
            "A": "脾燥胃湿，燥湿相济",
            "B": "太阴湿土得阳始运，阳明燥土得阴自安",
            "C": "胃主纳谷，脾主磨谷",
            "D": "脾主升清，胃主降浊",
            "E": "胃为水谷之海，脾为胃行其津液"
          },
          "answer": "D",
          "analysis": "脾主升，胃主降：脾能将水谷精微上输到心肺，胃将腐熟过的水谷下移，共同完成食物消化和吸收",
          "type": "多选题"
        },
        {
          "id": 15526,
          "title": "五脏与奇恒之腑相同的生理特点是（   ）",
          "options": {
            "A": "传化物而不藏  \t",
            "B": "藏精气而不泻",
            "C": "虚实交替，泻而不藏    \t",
            "D": "两神相抟，合而成形",
            "E": ""
          },
          "answer": "B",
          "analysis": "五脏与奇恒之腑相同的生理特点是“藏精气而不泻”",
          "type": "多选题"
        },
        {
          "id": 15527,
          "title": "六腑病变，在病理上相互影响多表现为（   ）",
          "options": {
            "A": "传化不通",
            "B": "母病及子",
            "C": "子病及母",
            "D": "水液代谢失常",
            "E": ""
          },
          "answer": "A",
          "analysis": "六腑传化水谷，需要不断地受纳排空，虚实更替，故“六腑以通为用”、“以降为顺” 。 六腑病变，在病理上相互影响多表现为传化不通",
          "type": "多选题"
        },
        {
          "id": 15528,
          "title": "心和脾的关系集中表现为（   ）",
          "options": {
            "A": "血液的生成",
            "B": "血液的运行",
            "C": "二者均是",
            "D": "二者均非",
            "E": ""
          },
          "answer": "C",
          "analysis": "心与脾的关系,表现在血液生成及血液运行的相互为用、相互协同",
          "type": "多选题"
        },
        {
          "id": 15529,
          "title": "心与肝的关系主要表现在（   ）",
          "options": {
            "A": "行血与藏血",
            "B": "精神情志的调节",
            "C": "二者均是",
            "D": "二者均非",
            "E": ""
          },
          "answer": "C",
          "analysis": "心与肝的关系，主要表现为血液运行和精神情志的调节两方面",
          "type": "多选题"
        },
        {
          "id": 15530,
          "title": "脾和肺的关系主要表现为（   ）",
          "options": {
            "A": "气的生成",
            "B": "水液代谢",
            "C": "二者均是",
            "D": "二者均非",
            "E": ""
          },
          "answer": "C",
          "analysis": "肺与脾的关系，主要体现为气的生成和水液代谢两个方面",
          "type": "多选题"
        },
        {
          "id": 15531,
          "title": "具有水火既济关系的是（   ）",
          "options": {
            "A": "心与肺",
            "B": "心与脾",
            "C": "心与肝",
            "D": "心与肾",
            "E": "肝与肾"
          },
          "answer": "D",
          "analysis": "心与肾的关系主要表现在三个方面：一是水火既济，二是精神互用，三是君相安位",
          "type": "多选题"
        },
        {
          "id": 15532,
          "title": "肝与脾的关系是（   ）",
          "options": {
            "A": "消化功能和血液运行",
            "B": "水液代谢和消化功能",
            "C": "血液运行和水液代谢",
            "D": "情志调节和消化功能",
            "E": ""
          },
          "answer": "A",
          "analysis": "肝与脾的关系，表现为疏泄与运化互用、藏血与统血协调的关系",
          "type": "多选题"
        },
        {
          "id": 15533,
          "title": "乙癸同源描述的是（   ）",
          "options": {
            "A": "脾与肾",
            "B": "肝与肾",
            "C": "心与肝",
            "D": "心与脾",
            "E": ""
          },
          "answer": "B",
          "analysis": "乙癸同源又称肝肾同源，指肝肾之间的关系，以天干配五行，肝属乙木，肾属癸水，故称。又称“肝肾同源”。肝主藏血而肾主藏精，肝主疏泄而肾主封藏，肝为水之子而肾为木之母。故肝肾之间的关系，主要表现在精血同源、藏泄互用以及阴阳互滋互制等方面",
          "type": "多选题"
        },
        {
          "id": 15534,
          "title": "以下为先后天相互滋生的关系是（   ）",
          "options": {
            "A": "肝与肾",
            "B": "心与肝",
            "C": "脾与肾",
            "D": "肺与脾",
            "E": ""
          },
          "answer": "C",
          "analysis": "脾与肾的关系，主要体现在先后天相互滋生和津液代谢过程中的相互协同等方面",
          "type": "多选题"
        },
        {
          "id": 15775,
          "title": "药物的四气是指？",
          "options": {
            "A": "酸苦甘辛",
            "B": "升降浮沉",
            "C": "寒热温凉",
            "D": "温清消补",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "四气，即指药物具有寒、热、温、凉四种不同的药性。是由药物作用于人体所产生的不同反应和不同疗效而总结出来的。故选C。",
          "type": "多选题"
        },
        {
          "id": 15776,
          "title": "寒、热、温、凉属于？",
          "options": {
            "A": "四气",
            "B": "五味",
            "C": "归经",
            "D": "升降浮沉",
            "E": "以上都不是"
          },
          "answer": "A",
          "analysis": "四气，即指药物具有寒、热、温、凉四种不同的药性。故选A。",
          "type": "多选题"
        },
        {
          "id": 15777,
          "title": "甘味药的作用是？",
          "options": {
            "A": "发散、行气、行血",
            "B": "收敛固涩",
            "C": "软坚散结、泻下",
            "D": "补益、和中、缓急",
            "E": "渗湿利水"
          },
          "answer": "D",
          "analysis": "甘味“能补、能和、能缓”，具有补益、和中、调和药性和缓急止痛的作用，故选D。",
          "type": "多选题"
        },
        {
          "id": 15778,
          "title": "辛味药的作用是？",
          "options": {
            "A": "发散、行气、行血",
            "B": "收敛固涩",
            "C": "软坚散结、泻下",
            "D": "补益、和中、缓急",
            "E": "渗湿利水"
          },
          "answer": "A",
          "analysis": "辛味“能散、能行”，具有发散、行气、行血的作用，故选A。",
          "type": "多选题"
        },
        {
          "id": 15780,
          "title": "能泻火存阴的药物多具有？",
          "options": {
            "A": "苦味",
            "B": "咸味",
            "C": "二者均是",
            "D": "二者均不是",
            "E": "辛味"
          },
          "answer": "A",
          "analysis": "苦味药“能泄、能燥、能坚”，具有清泄火热、泄降气逆、通泄大便、燥湿、泻火存阴等作用，故选A。",
          "type": "多选题"
        },
        {
          "id": 15781,
          "title": "能软坚散结的药物多具有？",
          "options": {
            "A": "苦味",
            "B": "咸味",
            "C": "二者均是",
            "D": "二者均不是",
            "E": "辛味"
          },
          "answer": "B",
          "analysis": "咸味药“能下、能软”，具有泻下通便、软坚散结的作用，故选B。",
          "type": "多选题"
        },
        {
          "id": 15782,
          "title": "五味是指药物的？",
          "options": {
            "A": "最基本的滋味",
            "B": "五类基本作用",
            "C": "全部味道",
            "D": "五种不同的滋味",
            "E": "部分味道"
          },
          "answer": "A",
          "analysis": "所谓五味，是指药物有酸、苦、甘、辛、咸不同的药味，因而具有不同的治疗作用。有些还具有淡味或涩味，因而实际上不止五种。但由于酸、苦、甘、辛、咸是最基本的五种药味，所以仍然称为五味。故选A。",
          "type": "多选题"
        },
        {
          "id": 15783,
          "title": "温热药的功效是？",
          "options": {
            "A": "清热解毒",
            "B": "凉血解毒",
            "C": "温里散寒",
            "D": "补火助阳",
            "E": "回阳救逆"
          },
          "answer": "C#D#E",
          "analysis": "一般来讲，温热药具有温里散寒、暖肝散结、补火助阳、温阳利水、温经通络、引火归原、回阳救逆等作用，故选CDE。",
          "type": "多选题"
        },
        {
          "id": 15784,
          "title": "苦味药的作用是？",
          "options": {
            "A": "清泄火热",
            "B": "坚阴",
            "C": "通泄大便",
            "D": "泄降气逆",
            "E": "燥湿"
          },
          "answer": "A#B#C#D#E",
          "analysis": "苦“能泄、能燥、能坚”，具有清泄火热、泄降气逆、通泄大便、燥湿、坚阴等作用，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 15786,
          "title": "五味中属阴的是？",
          "options": {
            "A": "酸",
            "B": "苦",
            "C": "咸",
            "D": "甘",
            "E": "淡"
          },
          "answer": "A#B#C",
          "analysis": "五味与四气一样，也具有阴阳五行的属性。《素问·至真要大论》云:“辛甘发散为阳，酸苦涌泄为阴咸味涌泄为阴，淡味渗泄为阳”，后世将其概括为辛甘淡属阳，酸苦咸涩属阴。故选ABC。",
          "type": "多选题"
        },
        {
          "id": 15789,
          "title": "芳香药的作用是？",
          "options": {
            "A": "行气、行血",
            "B": "辟秽、化湿、开窍",
            "C": "二者均是",
            "D": "二者均不是",
            "E": ""
          },
          "answer": "C",
          "analysis": "芳香药具有辟秽防疫、解表散邪、悦脾开胃、化湿去浊、通窍止痛、行气活血、开窍醒神的作用，故选C。",
          "type": "多选题"
        },
        {
          "id": 15796,
          "title": "五味中属阳的是？",
          "options": {
            "A": "酸",
            "B": "辛",
            "C": "甘",
            "D": "淡",
            "E": "咸"
          },
          "answer": "B#C#D",
          "analysis": "五味与四气一样，也具有阴阳五行的属性。《素问·至真要大论》云:“辛甘发散为阳，酸苦涌泄为阴咸味涌泄为阴，淡味渗泄为阳”，后世将其概括为辛甘淡属阳，故选BCD。",
          "type": "多选题"
        },
        {
          "id": 15799,
          "title": "反映药物作用趋势的是？",
          "options": {
            "A": "四气",
            "B": "五味",
            "C": "归经",
            "D": "毒性",
            "E": "升降浮沉"
          },
          "answer": "E",
          "analysis": "升降浮沉是药物对人体作用的不同趋向性，它与疾病所表现的趋向性是相对而言的，故选E。",
          "type": "多选题"
        },
        {
          "id": 15800,
          "title": "药物的升降沉浮确定的依据是？",
          "options": {
            "A": "药物的效用",
            "B": "药物的性味",
            "C": "药物的数量",
            "D": "药物的质地轻重",
            "E": "药物的气味厚薄"
          },
          "answer": "D",
          "analysis": "影响药物升降浮沉的因素主要与四气五味、药物质地轻重有密切关系，并受到炮制和配伍的影响。故选D。",
          "type": "多选题"
        },
        {
          "id": 15801,
          "title": "下列哪项不具有升浮药性？",
          "options": {
            "A": "解表药",
            "B": "开窍药",
            "C": "温里药",
            "D": "祛风寒湿药",
            "E": "平肝息风药"
          },
          "answer": "E",
          "analysis": "一般升浮药，其性主温热，味属辛、甘、淡，质地多为轻清至虚之品，作用趋向多主上升、向外。故解表药、温里药、祛风寒湿药、行气药活血祛瘀药、开窍药、补益药、涌吐药等多具有升浮药性。故选E。",
          "type": "多选题"
        },
        {
          "id": 15804,
          "title": "沉降药物的作用有？",
          "options": {
            "A": "泻下",
            "B": "清热",
            "C": "重镇安神",
            "D": "收敛",
            "E": "止咳平喘"
          },
          "answer": "A#B#C#D#E",
          "analysis": "一般沉降药的作用有清热泄火、泻下通便、利水渗湿、重镇安神、平肝潜阳、息风止痉、降逆平喘、止呕、止呃、消积导滞、固表止汗、敛肺止咳、涩肠止泄、固崩止带、涩精止遗、收敛止血、收湿敛疮等，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 15806,
          "title": "影响升降浮沉的主要因素是？",
          "options": {
            "A": "四气",
            "B": "五味",
            "C": "药物质地",
            "D": "配伍",
            "E": "炮制"
          },
          "answer": "A#B#C#D#E",
          "analysis": "影响药物升降浮沉的因素主要与四气五味、药物质地有密切关系，并受到炮制和配伍的影响，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 15807,
          "title": "归经是指？",
          "options": {
            "A": "药物具有的升降浮沉的作用趋向",
            "B": "药物具有的寒热温凉四种性质",
            "C": "药物具有的辛甘酸苦咸五种滋味",
            "D": "药物对于机体某部分的选择性作用",
            "E": "药物对于机体有无毒副作用"
          },
          "answer": "D",
          "analysis": "归经是指药物对于机体某部分的选择性作用，即某药对某些脏腑经络有特殊的亲和作用，因而对这些部位的病变起着主要或特殊的治疗作用，药物的归经不同，其治疗作用也不同，故选D。",
          "type": "多选题"
        },
        {
          "id": 15808,
          "title": "确定归经学说的理论基础是？",
          "options": {
            "A": "阴阳学说",
            "B": "脏腑经络理论",
            "C": "药性理论",
            "D": "药味理论",
            "E": "五行学说"
          },
          "answer": "B",
          "analysis": "中药归经理论的形成是在中医基本理论指导下以脏腑经络理论为基础，以药物所治疗的具体病证为依据，经过长期临床实践总结出来的用药理论，故选B。",
          "type": "多选题"
        },
        {
          "id": 15813,
          "title": "朱砂能治疗心悸失眠，具有重镇安神之功，其归经为？",
          "options": {
            "A": "归心经",
            "B": "归肝经",
            "C": "归脾经",
            "D": "归肺经",
            "E": "归肾经"
          },
          "answer": "A",
          "analysis": "归经的确定以脏腑经络理论为基础，以所治具体病症为依据。心主神明，心经病变多见心悸失眠，在此基础上，联系朱砂的功效，因朱砂能治疗心悸失眠，具有重镇安神之功，所以归心经，故选A。",
          "type": "多选题"
        },
        {
          "id": 15814,
          "title": "杏仁能治疗胸闷喘咳，具有止咳平喘之功，其归经为？",
          "options": {
            "A": "归心经",
            "B": "归肝经",
            "C": "归脾经",
            "D": "归肺经",
            "E": "归肾经"
          },
          "answer": "D",
          "analysis": "肺主宣发，肺经病变多见胸闷喘咳，因杏仁能治疗胸闷喘咳，具有止咳平喘之功，所以归肺经，故选D。",
          "type": "多选题"
        },
        {
          "id": 15817,
          "title": "中药的副作用是指？",
          "options": {
            "A": "配伍不当出现的反应",
            "B": "药不对证出现的不良反应",
            "C": "达不到常规用量不能控制病情",
            "D": "超过常规用量时出现的不适反应",
            "E": "在常规剂量时出现的与疗效无关的不适反应"
          },
          "answer": "E",
          "analysis": "中药的副作用是指在常规剂量时出现与治疗需要无关的不适反应，一般比较轻微，对机体危害不大，停药后可自行消失，故选E。",
          "type": "多选题"
        },
        {
          "id": 15818,
          "title": "古代认为“毒性”的含义是？",
          "options": {
            "A": "药物的毒性",
            "B": "药物的偏性",
            "C": "药物的副作用",
            "D": "药物的疗效",
            "E": "药物的总称"
          },
          "answer": "B",
          "analysis": "古代药物毒性的含义较广，古人常常把毒药看做是一切药物的总称，而把药物的毒性看作是药物的偏性，故选B。",
          "type": "多选题"
        },
        {
          "id": 15819,
          "title": "中药的副作用是指",
          "options": {
            "A": "用药后引起机体损害性反应",
            "B": "在常用剂量时出现与治疗无关的不适反应",
            "C": "二者均是",
            "D": "二者均不是",
            "E": ""
          },
          "answer": "B",
          "analysis": "中药的副作用有别于中药的毒性作用，是指在常用剂量时出现与治疗无关的不适反应，比较轻微，对机体危害不大，停药后可自行消失，故选B。",
          "type": "多选题"
        },
        {
          "id": 15820,
          "title": "中药的毒性是指？",
          "options": {
            "A": "用药后引起机体损害性反应",
            "B": "在常用剂量时出现与治疗无关的不适反应",
            "C": "二者均是",
            "D": "二者均不是",
            "E": ""
          },
          "answer": "A",
          "analysis": "中药的毒性一般指药物对机体所产生的不良影响及损害性，故选A。",
          "type": "多选题"
        },
        {
          "id": 15821,
          "title": "中药不良反应的概念是？",
          "options": {
            "A": "人接受正常剂量的药物时出现的任何有伤害的和与用药目的相关的反应",
            "B": "人接受正常剂量的药物时出现的任何有伤害的和与用药目的无关的反应",
            "C": "人接受超剂量的药物时出现的任何有伤害的和与用药目的无关的反应",
            "D": "人接受超剂量的药物时出现的任何有伤害的和与用药目的有关的反应",
            "E": "以上均不是"
          },
          "answer": "B",
          "analysis": "药物不良反应是指正常剂量的药物用于预防诊断、治疗疾病或调节生理机能时出现的任何有害目与用药目的无关的反应。故选B。",
          "type": "多选题"
        },
        {
          "id": 15822,
          "title": "属于毒性药材的是？",
          "options": {
            "A": "生姜",
            "B": "半夏",
            "C": "天南星",
            "D": "瓜蒂",
            "E": "砒霜"
          },
          "answer": "E",
          "analysis": "自中华人民共和国成立以来，出现了大量中药中毒报告，仅单味药引起中毒就达上百种之多，包括础石、砒霜、水银。故选E。",
          "type": "多选题"
        },
        {
          "id": 15823,
          "title": "产生中药毒性的原因有？",
          "options": {
            "A": "品种不同",
            "B": "剂型不恰当",
            "C": "给药途径不同",
            "D": "服药时间过长",
            "E": "个体差异"
          },
          "answer": "A#B#C#D#E",
          "analysis": "此外，药物贮存不当、品种不同、剂型不恰当、给药途径不同、药不对证、服药时间过长、自行服药、乳母用药、个体差异(病人的年龄、体质) 以及管理不规范等也是引起中毒的原因。故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 15824,
          "title": "药物的毒性可分为？",
          "options": {
            "A": "大毒",
            "B": "小毒",
            "C": "常毒",
            "D": "无毒",
            "E": "微毒"
          },
          "answer": "A#B#C#D#E",
          "analysis": "伴随临床用药经验的积累，对毒性研究的深入，中药毒性分级情况各不相同。如《素问·五常政大》把物分为“大毒”“小毒”“常毒”“无毒”四类;;《神农本》分为“有毒”“无毒”两类;《证类本草》《本目》将毒性分为“大毒”“有毒”“小毒”“微毒”四类。",
          "type": "多选题"
        },
        {
          "id": 15825,
          "title": "中药副作用的产生与哪些因素有关？",
          "options": {
            "A": "药物自身特性",
            "B": "炮制",
            "C": "配伍",
            "D": "制剂",
            "E": "其他因素"
          },
          "answer": "A#B#C#D#E",
          "analysis": "中药副作用的产生与药物自身特性、炮制、配伍、制剂等多种因素有关。故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 15826,
          "title": "产生中药毒性的主要原因有？",
          "options": {
            "A": "剂量过大",
            "B": "误服伪品",
            "C": "炮制不当",
            "D": "制剂服法不当",
            "E": "配伍不当"
          },
          "answer": "A#B#C#D#E",
          "analysis": "产生中药毒性的主要原因有五个方面：一是剂量过大，二是误服伪品，三是炮制不当，四是制剂服法不当，五是配伍不当，此外还有药不对证、自行服药、乳母用药及个体差异也是引起中毒的原因，故选ABCDE。",
          "type": "多选题"
        },
        {
          "id": 15933,
          "title": "下列不属于中医诊断基本原理的是",
          "options": {
            "A": "司外揣内 ",
            "B": "见微知著",
            "C": "以常衡变",
            "D": "因发知受",
            "E": "整体审查"
          },
          "answer": "E",
          "analysis": "中医诊断的基本原理为司外揣内、见微知著、以常衡变、因发知受，整体审查为中医诊断基本原则，故选E。",
          "type": "多选题"
        },
        {
          "id": 15934,
          "title": "《灵枢•本脏》说:“视其外应，以知其内脏，则知所病矣。”体现了中医诊断的哪一基本原理",
          "options": {
            "A": "司外揣内 ",
            "B": "见微知著",
            "C": "以常衡变",
            "D": "因发知受",
            "E": "辨证论治"
          },
          "answer": "A",
          "analysis": "《难经•一难》强调“独取寸口，以决五脏六腑死生吉凶之法”，指的是详察寸口脉的三部九候以推断全身疾病的方法，体现了见微知著的基本原理，故选B。",
          "type": "多选题"
        },
        {
          "id": 15935,
          "title": "下列不属于中医诊断基本原则的是",
          "options": {
            "A": "整体审查",
            "B": "四诊和参",
            "C": "辨证论治",
            "D": "病证结合",
            "E": "动静统一"
          },
          "answer": "C",
          "analysis": "中医诊断的基本原则为整体审查、四诊和参、病证结合、动静统一，故选C。",
          "type": "多选题"
        },
        {
          "id": 15936,
          "title": "望、闻、问、切诸法参用，综合考虑所收集的病情资料，体现了中医诊断的哪项基本原则",
          "options": {
            "A": "病证结合",
            "B": "动静统一",
            "C": "整体审查",
            "D": "四诊和参",
            "E": "辨证论治"
          },
          "answer": "D",
          "analysis": "四诊和参是指四诊并重，诸法参用，综合考虑所收集的病情资料，有利于得出准确的诊断，故选D。",
          "type": "多选题"
        },
        {
          "id": 15937,
          "title": "下列不属于中医护理原则的是",
          "options": {
            "A": "同病异护",
            "B": "异病同护",
            "C": "正护反护",
            "D": "一视同仁",
            "E": "辨证施护"
          },
          "answer": "D",
          "analysis": "中医护理的原则是以中医辨证治则指导护理工作的，针对不同病情，应用“扶正祛邪”、“标本缓急”、“同病异护”、“异病同护”、“正护反护”、“因人、因时、因地制宜”及“预防为主”等护理原则来制定相应的护理措施，一视同仁不符合辨证施护的原则，故选D。",
          "type": "多选题"
        },
        {
          "id": 15938,
          "title": "人体生命活动的总称，是对人体生命活动外在表现的高度概括是指",
          "options": {
            "A": "气",
            "B": "血",
            "C": "津液",
            "D": "精",
            "E": "神"
          },
          "answer": "E",
          "analysis": "神是人体生命活动的总称，是对人体生命活动外在表现的高度概括，故选E。",
          "type": "多选题"
        },
        {
          "id": 15939,
          "title": "临床表现为精神不振，嗜睡健忘；目光乏神，双目少动；面色淡白少华；肌肉松弛，倦怠乏力，动作迟缓；气少懒言，食欲减退，称为",
          "options": {
            "A": "得神",
            "B": "少神",
            "C": "失神",
            "D": "假神",
            "E": "神乱"
          },
          "answer": "B",
          "analysis": "少神，又称“神气不足”，临床表现为精神不振，嗜睡健忘；目光乏神，双目少动；面色淡白少华；肌肉松弛，倦怠乏力，动作迟缓；气少懒言，食欲减退。少神多由正气不足，精气轻度损伤，脏腑功能减退所致，多见于轻病或疾病恢复期的患者；素体虚弱者，平时亦多出现少神，故选B。",
          "type": "多选题"
        },
        {
          "id": 15940,
          "title": "下列不属于神乱的是",
          "options": {
            "A": "脏躁",
            "B": "痴呆",
            "C": "脾虚",
            "D": "癫狂",
            "E": "痫病"
          },
          "answer": "C",
          "analysis": "神乱是指神志意识错乱失常，主要表现为焦虑恐惧、淡漠痴呆、狂躁妄动、猝然昏仆等，多见于脏躁、痴呆、癫、狂、痫等患者，故选C。",
          "type": "多选题"
        },
        {
          "id": 15941,
          "title": "临床见面色荣润光泽者，为脏腑精气未衰，一般属于",
          "options": {
            "A": "病重",
            "B": "危候",
            "C": "无病或病轻",
            "D": "血虚",
            "E": "无法判断"
          },
          "answer": "C",
          "analysis": "皮肤的光泽是脏腑精气盛衰的表现，凡面色荣润光泽者，为脏腑精气未衰，属无病或病轻，故选C。",
          "type": "多选题"
        },
        {
          "id": 15942,
          "title": "因季节、气候、昼夜等外界因素变动而发生相应变化的肤色，称为",
          "options": {
            "A": "常色",
            "B": "客色",
            "C": "主色",
            "D": "病色",
            "E": "真脏色"
          },
          "answer": "B",
          "analysis": "因季节、气候、昼夜等外界因素变动而发生相应变化的肤色，称为客色，如春季面色稍青，夏季面色稍赤，长夏面色稍黄，秋季面色稍白，冬季面色稍黑，故选B。",
          "type": "多选题"
        },
        {
          "id": 15943,
          "title": "人体在疾病状态时面部显露的色泽，称为",
          "options": {
            "A": "常色",
            "B": "客色",
            "C": "主色",
            "D": "病色",
            "E": "面色"
          },
          "answer": "D",
          "analysis": "人体在疾病状态时面部显露的色泽，称为病色，故选D。",
          "type": "多选题"
        },
        {
          "id": 15944,
          "title": "病色分为善色与恶色，是根据哪项来判断的",
          "options": {
            "A": "有无光泽",
            "B": "病程时间",
            "C": "发病原因",
            "D": "饮食情况",
            "E": "睡眠情况"
          },
          "answer": "A",
          "analysis": "根据面色有无光泽，病色分为善色与恶色，故选A。",
          "type": "多选题"
        },
        {
          "id": 15945,
          "title": "下列不属于五色主病中青色主病的是",
          "options": {
            "A": "寒证",
            "B": "气滞",
            "C": "血虚",
            "D": "血瘀",
            "E": "疼痛"
          },
          "answer": "C",
          "analysis": "由于寒邪凝滞，或气滞血瘀，或因疼痛剧烈，或因筋脉拘急，或因热盛动风，致脉络阻滞，血行不畅，故见青色，故选C。",
          "type": "多选题"
        },
        {
          "id": 15946,
          "title": "肥人多（）",
          "options": {
            "A": "痰湿",
            "B": "虚火",
            "C": "瘀血",
            "D": "结石",
            "E": "虫积"
          },
          "answer": "A",
          "analysis": "肥胖之人由于形盛气虚，常多痰湿积聚，即所谓“肥人多痰湿”，故选A。",
          "type": "多选题"
        },
        {
          "id": 15947,
          "title": "猝倒神昏，口吐涎沫，四肢抽搐，醒后如常者，多属",
          "options": {
            "A": "惊风",
            "B": "脏躁",
            "C": "癫狂",
            "D": "中风",
            "E": "痫病"
          },
          "answer": "E",
          "analysis": "猝倒神昏，口吐涎沫，四肢抽搐，醒后如常者，多属痫病，故选E。",
          "type": "多选题"
        },
        {
          "id": 15948,
          "title": "白睛发黄，为下列哪项的主要标志",
          "options": {
            "A": "血虚",
            "B": "火盛",
            "C": "黄疸",
            "D": "瘀血",
            "E": "肾虚"
          },
          "answer": "C",
          "analysis": "白睛发黄为黄疸的主要标志，黄疸常伴身面发黄、尿黄等症，多因湿热内壅或寒湿内困，肝胆疏泄失常，胆汁外溢所致，故选C。",
          "type": "多选题"
        },
        {
          "id": 15949,
          "title": "耳轮甲错，多属",
          "options": {
            "A": "久病血瘀",
            "B": "肾气不足",
            "C": "肾气充足",
            "D": "肝胆湿热",
            "E": "肝经火盛"
          },
          "answer": "A",
          "analysis": "耳轮甲错，即耳轮肌肤甲错，多属久病血瘀，故选A。",
          "type": "多选题"
        },
        {
          "id": 15950,
          "title": "鼻衄是指",
          "options": {
            "A": "鼻流浊涕",
            "B": "鼻流清涕",
            "C": "鼻翼扇动",
            "D": "鼻腔出血",
            "E": "鼻柱溃陷"
          },
          "answer": "D",
          "analysis": "鼻腔出血称为“鼻衄”，故选D。",
          "type": "多选题"
        },
        {
          "id": 15951,
          "title": "口疮也称为“口糜”或“口疡”，多因",
          "options": {
            "A": "心脾积热",
            "B": "气血亏虚",
            "C": "瘀血内阻",
            "D": "肝气郁结",
            "E": "痰湿中阻"
          },
          "answer": "A",
          "analysis": "口疮指口腔内膜出现黄白色如豆大、表浅的小溃疡点，周围红晕，局部灼痛，也称为“口糜”或“口疡”，多因心脾积热，或由阴虚火旺所致，故选A。",
          "type": "多选题"
        },
        {
          "id": 15952,
          "title": "唇色淡白多属",
          "options": {
            "A": "阴虚",
            "B": "血虚",
            "C": "瘀血",
            "D": "气滞",
            "E": "痰湿"
          },
          "answer": "B",
          "analysis": "唇色淡白，多属血虚或失血，故选B。",
          "type": "多选题"
        },
        {
          "id": 15953,
          "title": "阳明热甚，津液大伤，多见",
          "options": {
            "A": "牙齿光燥如石",
            "B": "牙齿燥如枯骨",
            "C": "牙齿动摇",
            "D": "牙龈淡白",
            "E": "牙关紧闭"
          },
          "answer": "A",
          "analysis": "牙齿光燥如石，为阳明热甚，津液大伤，故选A。",
          "type": "多选题"
        },
        {
          "id": 15954,
          "title": "久病咽部嫩红，肿痛不甚，多属",
          "options": {
            "A": "血虚",
            "B": "阴虚",
            "C": "实热",
            "D": "痰湿",
            "E": "气滞"
          },
          "answer": "B",
          "analysis": "久病咽部嫩红，肿痛不甚，多属阴虚证，因肾阴亏虚，虚火上炎所致，故选B。",
          "type": "多选题"
        },
        {
          "id": 15955,
          "title": "颈前结喉处，单侧或双侧，有肿块突起，或大或小，可随吞咽上下移动，称为",
          "options": {
            "A": "方颅",
            "B": "瘰疬",
            "C": "瘿瘤",
            "D": "项软",
            "E": "解颅"
          },
          "answer": "C",
          "analysis": "颈前结喉处，单侧或双侧，有肿块突起，或大或小，可随吞咽上下移动，称为“瘿瘤”，故选C。",
          "type": "多选题"
        },
        {
          "id": 15956,
          "title": "皮肤出现的深红色或青紫色片状斑块，平铺于皮下，抚之不碍手，压之不褪色，称为",
          "options": {
            "A": "斑",
            "B": "疹",
            "C": "麻疹",
            "D": "风疹",
            "E": "湿疹"
          },
          "answer": "A",
          "analysis": "斑指皮肤出现的深红色或青紫色片状斑块，平铺于皮下，抚之不碍手，压之不褪色，故选A。",
          "type": "多选题"
        },
        {
          "id": 15957,
          "title": "下列不属于疮疡的是",
          "options": {
            "A": "痈",
            "B": "疽",
            "C": "疔",
            "D": "疖",
            "E": "疹"
          },
          "answer": "E",
          "analysis": "疮疡是指各种致病因素侵袭人体后引起的体表化脓性疾病，主要有痈、疽、疔、疖等，故选E。",
          "type": "多选题"
        },
        {
          "id": 15958,
          "title": "舌面脏腑分候，以五脏来划分，一般来说，舌尖属",
          "options": {
            "A": "心肺",
            "B": "肝胆",
            "C": "脾胃",
            "D": "肾",
            "E": "三焦"
          },
          "answer": "A",
          "analysis": "以五脏来划分，各家学说略有不同，但比较一致的观点是，舌尖属心肺，舌边属肝（胆），舌中属脾(胃)，舌根属肾，故选A。",
          "type": "多选题"
        },
        {
          "id": 15959,
          "title": "望舌质不包括",
          "options": {
            "A": "神",
            "B": "色",
            "C": "形",
            "D": "苔",
            "E": "津"
          },
          "answer": "E",
          "analysis": "望舌质包括舌的神、色、形、态四方面，以察脏腑的虚实，气血的盛衰，故选E。",
          "type": "多选题"
        },
        {
          "id": 15960,
          "title": "舌质干枯死板，毫无生气，失去光泽或活动不灵，称为",
          "options": {
            "A": "荣舌",
            "B": "枯舌",
            "C": "老舌",
            "D": "嫩舌",
            "E": "红舌"
          },
          "answer": "B",
          "analysis": "舌质干枯死板，毫无生气，失去光泽或活动不灵，故谓舌之无神，为气血衰败的征象。病见枯舌，多属危重病证，是为恶候，故选B。",
          "type": "多选题"
        },
        {
          "id": 15961,
          "title": "舌鲜红而起芒刺，或兼黄厚苔，多属",
          "options": {
            "A": "表热证",
            "B": "里热证",
            "C": "实热证",
            "D": "虚热证",
            "E": "阳虚证"
          },
          "answer": "C",
          "analysis": "舌鲜红而起芒刺，或兼黄厚苔，多属实热证，故选C。",
          "type": "多选题"
        },
        {
          "id": 15962,
          "title": "青紫舌主",
          "options": {
            "A": "气血两虚",
            "B": "阴阳两虚",
            "C": "火热上炎",
            "D": "气血瘀滞",
            "E": "热入营血"
          },
          "answer": "D",
          "analysis": "由于气血运行不畅，舌见青紫，主气血瘀滞，故选D。",
          "type": "多选题"
        },
        {
          "id": 15963,
          "title": "老嫩舌属于",
          "options": {
            "A": "舌形",
            "B": "舌神",
            "C": "舌色",
            "D": "舌态",
            "E": "舌苔"
          },
          "answer": "A",
          "analysis": "望舌形包括舌质老嫩、胖瘦、点刺、裂纹、齿痕等，故选A。",
          "type": "多选题"
        },
        {
          "id": 15964,
          "title": "刺指舌乳头突起如刺，摸之棘手的红色或黄黑色点刺，称为",
          "options": {
            "A": "红星舌",
            "B": "红点舌",
            "C": "芒刺舌",
            "D": "青紫舌",
            "E": "胖大舌"
          },
          "answer": "C",
          "analysis": "点指突起于舌面的红色、白色或黑色星点。大者为星，称红星舌；小者为点，称红点舌。刺指舌乳头突起如刺，摸之棘手的红色或黄黑色点刺，称为芒刺舌。点和刺相似，时常并见，故可合称点刺舌。点刺多见于舌的边尖部分，故选C。",
          "type": "多选题"
        },
        {
          "id": 15965,
          "title": "不属于强硬舌的临床意义的是",
          "options": {
            "A": "热入心包",
            "B": "热盛伤津",
            "C": "风痰阻络",
            "D": "中风先兆",
            "E": "脾虚湿盛"
          },
          "answer": "E",
          "analysis": "舌体板硬强直，失于柔和，屈伸不利，甚者语言謇涩。舌强硬而色红绛少津者，多因邪热炽盛所致。舌体强硬、胖大兼厚腻苔者，多因风痰阻络所致。舌强语言謇涩，伴肢体麻木、眩晕者，多为中风先兆。由于舌能调节发音，故强硬舌多兼见语言謇涩。故选E。",
          "type": "多选题"
        },
        {
          "id": 15966,
          "title": "不属于短缩舌的临床意义的是",
          "options": {
            "A": "寒凝",
            "B": "湿盛",
            "C": "痰阻",
            "D": "血虚",
            "E": "津伤"
          },
          "answer": "B",
          "analysis": "舌体卷短、紧缩，不能伸长，甚者伸舌难于抵齿。主寒凝、痰阻、血虚、津伤，故选B。",
          "type": "多选题"
        },
        {
          "id": 15967,
          "title": "舌苔多处剥脱，舌面仅斑驳残存少量舌苔者，称为",
          "options": {
            "A": "地图舌",
            "B": "镜面舌",
            "C": "类剥苔",
            "D": "花剥苔",
            "E": "红绛舌"
          },
          "answer": "D",
          "analysis": "舌面本有舌苔，疾病过程中舌苔全部或部分脱落，脱落处光滑无苔。舌苔多处剥脱，舌面仅斑驳残存 少量舌苔者，称为花剥苔；舌苔不规则地剥脱，边缘凸起，界限清楚，形似地图，部位时有转移者，称为地图舌；舌苔全部剥脱，舌面光洁如镜者，称为镜面舌，又称光滑舌；舌苔剥脱处舌面不光滑，仍有新生苔质颗粒可见者，称为类剥苔。故选D。",
          "type": "多选题"
        },
        {
          "id": 15968,
          "title": "黄苔多主",
          "options": {
            "A": "热证、里证",
            "B": "表证、寒证",
            "C": "虚证、阴证",
            "D": "实证、寒证",
            "E": "痰证、饮证"
          },
          "answer": "A",
          "analysis": "邪热熏灼于舌，故苔呈黄色。一般情况下，苔色愈黄，说明热邪愈甚，浅黄苔为热轻，深黄苔为热重，焦黄苔为热结。主热证、里证。故选A。        ",
          "type": "多选题"
        },
        {
          "id": 15969,
          "title": "舌下络脉粗胀、分叉，或呈青紫、绛、绛紫、紫黑色，多主",
          "options": {
            "A": "痰湿",
            "B": "气滞",
            "C": "血瘀",
            "D": "热盛",
            "E": "阳虚"
          },
          "answer": "C",
          "analysis": "舌下络脉粗胀、分叉，或呈青紫、绛、绛紫、紫黑色，或舌下细小络脉呈暗红色或紫色网络，或舌下络脉曲张如紫色珠子状大小不等的瘀血结节等改变，皆为血瘀的征象。故选C。",
          "type": "多选题"
        },
        {
          "id": 15970,
          "title": "观察小儿病理络脉的要点不包括",
          "options": {
            "A": "浮沉分表里",
            "B": "红紫辨寒热",
            "C": "淡滞定虚实",
            "D": "三关测轻重",
            "E": "长短分阴阳"
          },
          "answer": "E",
          "analysis": "观察小儿病理络脉，应注意其深浅、颜色、形态和长短四方面的变化，其要点可概括为：浮沉分表里、红紫辨寒热、淡滞定虚实、三关测轻重，故选E。",
          "type": "多选题"
        },
        {
          "id": 15971,
          "title": "痰少而质黏，难于咳出者，多属",
          "options": {
            "A": "寒痰",
            "B": "热痰",
            "C": "燥痰",
            "D": "湿痰",
            "E": "痰饮"
          },
          "answer": "C",
          "analysis": "痰少而质黏，难于咳出者，多属燥痰，因燥邪犯肺，耗伤肺津，或肺阴亏虚津亏，清肃失职所致，故选C。",
          "type": "多选题"
        },
        {
          "id": 15972,
          "title": "呕吐不消化、气味酸腐的食物，多属",
          "options": {
            "A": "寒呕",
            "B": "热呕",
            "C": "痰饮",
            "D": "伤食",
            "E": "湿热"
          },
          "answer": "D",
          "analysis": "呕吐不消化、气味酸腐的食物，多属伤食，因暴饮暴食，损伤脾胃，食积不化，胃气上逆，推邪外出所致，故选D。",
          "type": "多选题"
        },
        {
          "id": 15973,
          "title": "患者自觉怕冷，多加衣被或近火取暖仍不能缓解称为",
          "options": {
            "A": "恶风",
            "B": "恶寒",
            "C": "畏寒",
            "D": "发热",
            "E": "恶热"
          },
          "answer": "B",
          "analysis": "恶风、恶寒和畏寒。恶风是指患者遇风觉冷，避之可缓；恶寒是指患者自觉怕冷，多加衣被或近火取暖仍不能缓解；畏寒是指患者自觉怕冷，多加衣被或近火取暖能够缓解，故选B。",
          "type": "多选题"
        },
        {
          "id": 15974,
          "title": "发热重恶寒轻是下列哪项的特征",
          "options": {
            "A": "风热表证",
            "B": "风寒表证",
            "C": "伤风表证",
            "D": "邪热犯肺",
            "E": "痰浊阻肺"
          },
          "answer": "A",
          "analysis": "发热重恶寒轻指患者自觉发热较重，同时又有轻微怕冷的症状，由外感风热之邪所致， 是风热表证的特征，故选A。",
          "type": "多选题"
        },
        {
          "id": 15975,
          "title": "日晡(下午3-5时，即申时)发热明显，且热势较高，称为",
          "options": {
            "A": "壮热",
            "B": "湿温潮热",
            "C": "阴虚潮热",
            "D": "阳明潮热",
            "E": "湿热"
          },
          "answer": "D",
          "analysis": "阳明潮热，日晡(下午3-5时，即申时)发热明显，且热势较高，亦称为日晡潮热，故选D。",
          "type": "多选题"
        },
        {
          "id": 15976,
          "title": "午后热甚，兼身热不扬，头身困重等，称为",
          "options": {
            "A": "壮热",
            "B": "湿温潮热",
            "C": "阴虚潮热",
            "D": "阳明潮热",
            "E": "寒热往来"
          },
          "answer": "B",
          "analysis": "湿温潮热：午后热甚，兼身热不扬，头身困重等。因湿邪黏腻，湿遏热伏，故身热不扬；午后阳气盛，故午后发热明显。湿热潮热是湿热证特有的一种热型，常见于湿温病，故选B。",
          "type": "多选题"
        },
        {
          "id": 15977,
          "title": "下列不属于寒热往来的常见病的是",
          "options": {
            "A": "伤寒病的少阳病",
            "B": "温病的邪伏膜原",
            "C": "妇女热入血室",
            "D": "疟疾",
            "E": "伤寒病的阳明病"
          },
          "answer": "E",
          "analysis": "寒热往来是指自觉恶寒与发热交替发作的症状，是正邪相争，互为进退的病理反映，常见于伤寒病的少阳病，或温病的邪伏膜原，为邪在半表半里的特征；如果恶寒战栗与高热交替发作、每日或二三日发作一次、发有定时的症状，常见于疟疾；此外，气郁化火及妇女热入血室等，也可出现寒热往来。故选E。       ",
          "type": "多选题"
        },
        {
          "id": 15978,
          "title": "《素问·阴阳别论》记载阳加于阴谓之",
          "options": {
            "A": "汗",
            "B": "血",
            "C": "精",
            "D": "津",
            "E": "气"
          },
          "answer": "A",
          "analysis": "汗是阳气蒸化津液经玄府达于体表而成，故《素问·阴阳别论》说：“阳加于阴谓之汗。” 正常汗出有调和营卫、调节体温、滋润皮肤的作用。故选A。",
          "type": "多选题"
        },
        {
          "id": 15979,
          "title": "睡时汗出、醒则汗止，称为",
          "options": {
            "A": "自汗",
            "B": "盗汗",
            "C": "黄汗",
            "D": "绝汗",
            "E": "战汗"
          },
          "answer": "B",
          "analysis": "盗汗指睡时汗出、醒则汗止的症状，常兼潮热、舌红少苔、脉细数等症，多见于阴虚证。故选B。",
          "type": "多选题"
        },
        {
          "id": 15980,
          "title": "常见于外感热病或伤寒邪正剧烈斗争的阶段，是疾病发展的转折点的是",
          "options": {
            "A": "自汗",
            "B": "盗汗",
            "C": "黄汗",
            "D": "绝汗",
            "E": "战汗"
          },
          "answer": "E",
          "analysis": "战汗指先恶寒战栗而后汗出的症状。因邪盛正衰，邪伏不去， 一旦正气来复，正邪剧争，就可出现战汗，常见于外感热病或伤寒邪正剧烈斗争的阶段，是疾病发展的转折点。故选E。",
          "type": "多选题"
        },
        {
          "id": 15981,
          "title": "但头汗出，或头颈部汗出量多的症状，兼心胸烦闷、 口渴面赤，多因",
          "options": {
            "A": "元气将脱，阴阳离决，虚阳上越，津随阳泄",
            "B": "睡时阳气聚会于头部，蒸津而外泄",
            "C": "上焦热盛，迫津外泄",
            "D": "中焦湿热蕴结，湿郁热蒸，迫津上越",
            "E": "属于正常现象"
          },
          "answer": "D",
          "analysis": "头汗又称但头汗出，指汗出仅见于头部，或头颈部汗出量多的症状。若兼心胸烦闷、 口渴面赤，多因上焦热盛，迫津外泄；若兼身重倦怠、胃脘痞满，多因中焦湿热蕴结，湿郁热蒸，迫津上越；若兼四肢厥冷、气喘脉微，多因元气将脱，阴阳离决，虚阳上越，津随阳泄。小儿睡眠时，常有头汗较多，若无其他不适者，属正常现象，俗称“蒸笼头”，因小儿为纯阳之体，睡时阳气聚会于头部，蒸津而外泄。故选C。",
          "type": "多选题"
        },
        {
          "id": 15982,
          "title": "半身汗出多见于",
          "options": {
            "A": "感冒",
            "B": "郁证",
            "C": "阳虚",
            "D": "中风",
            "E": "阴虚"
          },
          "answer": "D",
          "analysis": "半身汗出指患者仅一侧身体汗出的症状，或左侧，或右侧，或见于上半身，或见于下半身，但汗出常见于健侧，无汗的半身常是病变的部位。半身汗出多见于痿病、中风及截瘫患者，多因风痰、痰瘀、风湿等阻滞经络，营卫不能周流，气血失和所致。故选D。",
          "type": "多选题"
        },
        {
          "id": 15983,
          "title": "气滞作痛的特点是",
          "options": {
            "A": "胀痛",
            "B": "刺痛",
            "C": "灼痛",
            "D": "冷痛",
            "E": "固定痛"
          },
          "answer": "A",
          "analysis": "胀痛指疼痛兼有胀感的症状，是气滞作痛的特点，常表现为部位不固定，受情绪波动影响，嗳气、矢气后减轻。故选A。 ",
          "type": "多选题"
        },
        {
          "id": 15984,
          "title": "胁肋胀痛或窜痛，情志抑郁或易怒，胸闷，善太息，属",
          "options": {
            "A": "肝胆湿热",
            "B": "肝胆火盛",
            "C": "肝郁气滞",
            "D": "肝血瘀阻",
            "E": "饮停胸胁"
          },
          "answer": "C",
          "analysis": "胁肋胀痛或窜痛，情志抑郁或易怒，胸闷，善太息，属肝郁气滞，故选C。",
          "type": "多选题"
        },
        {
          "id": 15985,
          "title": "寒邪犯胃多见",
          "options": {
            "A": "胃脘灼热疼痛、消谷善饥、口臭便秘",
            "B": "胃脘冷痛剧烈、得热痛减",
            "C": "胃脘胀痛、嗳气、 郁怒则痛甚",
            "D": "胃脘刺痛、痛有定处",
            "E": "胃脘剧痛暴作，出现腹部板硬、压痛及反跳痛"
          },
          "answer": "B",
          "analysis": "胃脘冷痛剧烈、得热痛减者，多属寒邪犯胃，故选B。",
          "type": "多选题"
        },
        {
          "id": 15986,
          "title": "腰部冷痛沉重，阴雨天加重，多因",
          "options": {
            "A": "肾虚",
            "B": "瘀血阻络",
            "C": "结石阻滞",
            "D": "寒湿",
            "E": "带脉损伤"
          },
          "answer": "D",
          "analysis": "腰部冷痛沉重，阴雨天加重，多因寒湿所致，故选D。",
          "type": "多选题"
        },
        {
          "id": 15987,
          "title": "感受风邪为主，见四肢疼痛，游走不定者，称为",
          "options": {
            "A": "行痹",
            "B": "痛痹",
            "C": "着痹",
            "D": "热痹",
            "E": "尪痹"
          },
          "answer": "A",
          "analysis": "四肢疼痛，游走不定者为行痹，以感受风邪为主，因风性善行数变，游走不定而致，故选A。",
          "type": "多选题"
        },
        {
          "id": 15988,
          "title": "心悸，颧红，盗汗，多属",
          "options": {
            "A": "气血两虚，心神失养",
            "B": "心脉痹阻，血行不畅",
            "C": "心阴不足，心神失养",
            "D": "胆郁痰扰，心神不安",
            "E": "心气、心阳亏虚，鼓动乏力"
          },
          "answer": "C",
          "analysis": "心悸，颧红，盗汗，多属心阴不足，心神失养，故选C。",
          "type": "多选题"
        },
        {
          "id": 15989,
          "title": "胁肋胀痛，身目发黄，口苦，苔黄腻，多因",
          "options": {
            "A": "肝气郁结",
            "B": "肝胆湿热",
            "C": "肝郁血虚",
            "D": "肝郁脾虚",
            "E": "肝阳上亢"
          },
          "answer": "B",
          "analysis": "胁肋胀痛，身目发黄，口苦，苔黄腻，多因肝胆湿热所致，故选B。",
          "type": "多选题"
        },
        {
          "id": 15990,
          "title": "脾胃气虚，多见",
          "options": {
            "A": "脘痞，饥不欲食，干呕，舌红少苔",
            "B": "脘痞，嗳腐吞酸",
            "C": "脘痞，纳呆呕恶，苔腻",
            "D": "脘痞，食少，便溏",
            "E": "脘痞，胃脘有振水声"
          },
          "answer": "D",
          "analysis": "脘痞，食少，便溏，多为脾胃气虚，故选D。",
          "type": "多选题"
        },
        {
          "id": 15991,
          "title": "下列属于实证耳鸣的是",
          "options": {
            "A": "肾精亏虚",
            "B": "脾气亏虚",
            "C": "气血亏虚",
            "D": "髓海不足",
            "E": "肝胆火扰"
          },
          "answer": "E",
          "analysis": "突发耳鸣，声大如雷，按之尤甚，属实证，多由肝胆火扰、肝阳上亢，或痰火壅结、气血瘀 阻、风邪上袭，或药毒损伤耳窍等所致，故选E。",
          "type": "多选题"
        },
        {
          "id": 15992,
          "title": "目眩兼头晕头胀、面赤耳鸣、腰膝痠软者，为",
          "options": {
            "A": "肝火上扰",
            "B": "肝胆湿热",
            "C": "肝肾阴虚，肝阳上亢",
            "D": "湿痰内蕴，清阳不升",
            "E": "风热上袭"
          },
          "answer": "C",
          "analysis": "目眩亦称眼花，是指患者自觉视物旋转动荡，如坐舟车，或眼前如有蚊蝇飞动的症状。兼头晕头胀、面赤耳鸣、腰膝痠软者，为肝肾阴虚，肝阳上亢所致，故选C。",
          "type": "多选题"
        },
        {
          "id": 15993,
          "title": "下列不属于虚证不寐的是",
          "options": {
            "A": "营血亏虚",
            "B": "阴虚火旺",
            "C": "心胆气虚",
            "D": "痰热内扰",
            "E": "心脾两虚"
          },
          "answer": "D",
          "analysis": "引起失眠的原因有很多，主要有两个方面： 一是营血亏虚，或阴虚火旺，心神失养，或心胆气虚，心神不安所致，其证属虚。二是邪气干扰，如火邪、痰热内扰心神，心神不安，或食积胃脘所致，其证属实，故选D。",
          "type": "多选题"
        },
        {
          "id": 15994,
          "title": "口干，但欲漱水不欲咽，兼舌质青紫、脉涩者，为",
          "options": {
            "A": "风热表证",
            "B": "营分证",
            "C": "湿热证",
            "D": "痰饮病",
            "E": "血瘀证"
          },
          "answer": "E",
          "analysis": "口干，但欲漱水不欲咽，兼舌质青紫、脉涩者，为血瘀证。因瘀血内阻，气化不利，津液输布异常，不能上承于口，故口干；体内津液本不匮乏，故欲漱水而不欲咽，故选E。",
          "type": "多选题"
        },
        {
          "id": 15995,
          "title": "饥不欲食多见于",
          "options": {
            "A": "胃阴虚证",
            "B": "脾阳虚证",
            "C": "胃热炽盛证",
            "D": "心脾两虚证",
            "E": "心肾不交证"
          },
          "answer": "A",
          "analysis": "饥不欲食指虽有饥饿的感觉但不欲进食，或进食不多的症状，多见于胃阴虚证，伴胃脘部嘈杂、嗳气、干呕、呃逆、咽干口燥等症状。故选A。",
          "type": "多选题"
        },
        {
          "id": 15996,
          "title": "口苦多见于",
          "options": {
            "A": "实寒证",
            "B": "实热证",
            "C": "脾胃虚弱证",
            "D": "阳虚证",
            "E": "阴虚证"
          },
          "answer": "B",
          "analysis": "口苦：指自觉口中有苦味，见于实热证，尤以心、肝、胆火旺者多见，兼心烦失眠者，乃心火上炎之故；兼胁痛、烦躁易怒者，为肝胆火盛所致。肝火上炎或胆气上泛，皆可致口苦。故选B。",
          "type": "多选题"
        },
        {
          "id": 15997,
          "title": "指胃中空虚，似饥非饥，似痛非痛，热辣不宁的症状称为",
          "options": {
            "A": "消谷善饥",
            "B": "饥不欲食",
            "C": "胃脘嘈杂",
            "D": "食欲减退",
            "E": "偏嗜食物"
          },
          "answer": "C",
          "analysis": "胃脘嘈杂指胃中空虚，似饥非饥，似痛非痛，热辣不宁的症状，伴有情绪抑郁、胸胁胀满、嗳腐吞酸等，因肝气不舒，郁久化热，肝火横逆，克伐胃腑所致。故选C。",
          "type": "多选题"
        },
        {
          "id": 15998,
          "title": "下列不属于便秘定义的是",
          "options": {
            "A": "排便时间延长",
            "B": "便次减少",
            "C": "便质干燥",
            "D": "排便困难",
            "E": "大便量少"
          },
          "answer": "E",
          "analysis": "便秘指排便时间延长，便次减少，便质干燥，或时间虽不延长但排便困难。故选E。",
          "type": "多选题"
        },
        {
          "id": 15999,
          "title": "泄泻腹痛，泻而不爽，粪色黄褐，气味臭秽，兼肛门灼热、小便短黄者，属于",
          "options": {
            "A": "寒湿泄泻",
            "B": "湿热泄泻",
            "C": "伤食泄泻",
            "D": "脾虚泄泻",
            "E": "肝郁乘脾"
          },
          "answer": "B",
          "analysis": "泄泻腹痛，泻而不爽，粪色黄褐，气味臭秽，兼肛门灼热、小便短黄者，属湿热泄泻。故选B。",
          "type": "多选题"
        },
        {
          "id": 16000,
          "title": "大便中夹有很多未被消化的食物称为",
          "options": {
            "A": "完谷不化",
            "B": "溏结不调",
            "C": "肛门灼热",
            "D": "里急后重",
            "E": "下利清水"
          },
          "answer": "A",
          "analysis": "完谷不化指大便中夹有很多未被消化的食物，多属脾肾阳虚或伤食，故选A。",
          "type": "多选题"
        },
        {
          "id": 16001,
          "title": "小便不畅、点滴而出者为",
          "options": {
            "A": "关",
            "B": "格",
            "C": "癃",
            "D": "闭",
            "E": "利"
          },
          "answer": "C",
          "analysis": "小便不畅、点滴而出者为“癃”；小便不通、点滴不出者为“闭”,统称为 “癃闭”，故选C。",
          "type": "多选题"
        },
        {
          "id": 16002,
          "title": "小便色清量多，多见于",
          "options": {
            "A": "寒证",
            "B": "热证",
            "C": "实证",
            "D": "表证",
            "E": "阳证"
          },
          "answer": "A",
          "analysis": "小便清长指小便色清量多，见于寒证，因阳虚气不化津，水液下渗膀胱所致，故选A。",
          "type": "多选题"
        },
        {
          "id": 16003,
          "title": "妇女问诊内容一般不包括",
          "options": {
            "A": "月经",
            "B": "带下",
            "C": "妊娠",
            "D": "产育",
            "E": "工龄"
          },
          "answer": "E",
          "analysis": "妇女有月经、带下、妊娠、产育等生理特点，故对于青春期开始之后的女性患者，除了一般 的问诊内容之外，还应注意询问月经、带下、妊娠、产育等方面的情况。故选E。",
          "type": "多选题"
        },
        {
          "id": 16004,
          "title": "月经先期，经色深红、质稠量多，为",
          "options": {
            "A": "血寒",
            "B": "血热",
            "C": "血虚",
            "D": "血瘀",
            "E": "气虚"
          },
          "answer": "B",
          "analysis": "月经先期，经色深红、质稠量多，为血热，多因素体阳盛，感受热邪，或肝郁化火，热扰于血，或肾阴亏损，阴血不足，虚热内生所致。故选B。",
          "type": "多选题"
        },
        {
          "id": 16005,
          "title": "指连续3个月经周期以上，月经时而提前，时而延后达7天以上的症状，称为",
          "options": {
            "A": "月经过多",
            "B": "月经先期",
            "C": "月经后期",
            "D": "月经先后不定期",
            "E": "月经过少"
          },
          "answer": "D",
          "analysis": "月经先后不定期指连续3个月经周期以上，月经时而提前，时而延后达7天以上的症状，亦称经期错乱，多因肝气郁滞，气机逆乱，或脾肾虚损，冲任失调，血海蓄溢失常所致。故选D。",
          "type": "多选题"
        },
        {
          "id": 16006,
          "title": "月经后期或行经后小腹隐痛、空痛，多属",
          "options": {
            "A": "气滞血瘀",
            "B": "气血两虚",
            "C": "湿热蕴结",
            "D": "阴寒内盛",
            "E": "热毒肉腐"
          },
          "answer": "B",
          "analysis": "月经后期或行经后小腹隐痛、空痛，多属气血两虚，或肾精不足，胞脉失养所致。 故选B。",
          "type": "多选题"
        },
        {
          "id": 16007,
          "title": "带下色白量多、质稀如涕、淋漓不绝而无臭味的症状，多因",
          "options": {
            "A": "湿热下注",
            "B": "湿毒蕴结",
            "C": "脾肾阳虚",
            "D": "肝经郁热",
            "E": "瘀血内结"
          },
          "answer": "C",
          "analysis": "白带指带下色白量多、质稀如涕、淋漓不绝而无臭味的症状，多因脾肾阳虚，寒湿下注所致。故选C。",
          "type": "多选题"
        },
        {
          "id": 16008,
          "title": "《难经·六十一难》记载，切而知之谓之",
          "options": {
            "A": "神",
            "B": "圣",
            "C": "工",
            "D": "巧",
            "E": "专"
          },
          "answer": "D",
          "analysis": "切诊是医生用手指或手掌对患者的某些部位进行触、摸、按、压，从而了解病情，诊察疾病的方法。切诊作为中医四诊之一，在获取健康与疾病相关信息方面，有着十分重要的作用。正如《难经·六十一难》所说：“切而知之谓之巧。”故选D。",
          "type": "多选题"
        },
        {
          "id": 16009,
          "title": "《伤寒杂病论》记载诊人迎、寸口、趺阳三脉，这一诊法称为",
          "options": {
            "A": "遍诊法",
            "B": "三部诊法",
            "C": "寸口诊法",
            "D": "三部九候诊法",
            "E": "按诊法"
          },
          "answer": "B",
          "analysis": "三部诊法见于《伤寒杂病论》，即诊人迎、寸口、趺阳三脉。其中诊寸口脉候脏腑病变，诊人迎、趺阳脉分候胃气，也有去趺阳加诊太溪以候肾气者。故选B。",
          "type": "多选题"
        },
        {
          "id": 16010,
          "title": "寸口诊法，根据《黄帝内经》“上竟上”、“下竟下”的原则，来划分寸口三部所分候的脏腑，左寸脉候",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "肾",
            "D": "肺",
            "E": "脾"
          },
          "answer": "A",
          "analysis": "根据《黄帝内经》“上竟上”、“下竟下”的原则，即上(寸脉)以候上 (身躯上部)，下(尺脉)以候下(身躯下部)，来划分寸口三部所分候的脏腑：左寸候心，右寸候肺，并统括胸以上及头部的疾病；左关候肝胆，右关候脾胃，并统括膈以下至脐以上部位的疾病；两尺候肾，并包括脐以下至足部的疾病。故选A。",
          "type": "多选题"
        },
        {
          "id": 16011,
          "title": "医生的手指用力较重，甚至按到筋骨以体察脉象，称为",
          "options": {
            "A": "举",
            "B": "按",
            "C": "寻",
            "D": "单按",
            "E": "总按"
          },
          "answer": "B",
          "analysis": "按指医生的手指用力较重，甚至按到筋骨以体察脉象。用按的指法取脉又称“沉取”。故选B。",
          "type": "多选题"
        },
        {
          "id": 16012,
          "title": "尺脉有力、沉取不绝，称为脉象",
          "options": {
            "A": "有气",
            "B": "有血",
            "C": "有胃",
            "D": "有神",
            "E": "有根"
          },
          "answer": "E",
          "analysis": "有根即脉有“根基”。脉之有根、无根主要反映肾气的盛衰。有根脉主要表现为尺脉有力、沉取不绝两个方面。故选E。",
          "type": "多选题"
        },
        {
          "id": 16013,
          "title": "浮脉一般见于",
          "options": {
            "A": "表证",
            "B": "里证",
            "C": "虚证",
            "D": "实证",
            "E": "热证"
          },
          "answer": "A",
          "analysis": "浮脉【脉象特征】轻取即得，重按稍减而不空，举之有余，按之不足。【临床意义】一般见于表证，亦见于虚阳浮越证。故选A。",
          "type": "多选题"
        },
        {
          "id": 16014,
          "title": "轻取不应，重按始得，举之不足，按之有余，称为",
          "options": {
            "A": "浮脉",
            "B": "沉脉",
            "C": "滑脉",
            "D": "弦脉",
            "E": "弱脉"
          },
          "answer": "B",
          "analysis": "沉脉【脉象特征】轻取不应，重按始得，举之不足，按之有余。【临床意义】主里证。有力为里实，无力为里虚。故选B。",
          "type": "多选题"
        },
        {
          "id": 16015,
          "title": "滑脉一般不见于",
          "options": {
            "A": "痰湿",
            "B": "食积",
            "C": "实热",
            "D": "青壮年",
            "E": "气虚"
          },
          "answer": "E",
          "analysis": "滑脉【脉象特征】往来流利，应指圆滑，如盘走珠。【临床意义】多见于痰湿、食积和实热等病证。若其人平素健康，脉来滑利而和缓，是荣卫充实之兆，属平脉，多见于青壮年人。育龄妇人经停而见脉滑，应考虑有妊娠可能。故选E。",
          "type": "多选题"
        },
        {
          "id": 16016,
          "title": "端直以长，如按琴弦，称为",
          "options": {
            "A": "浮脉",
            "B": "沉脉",
            "C": "滑脉",
            "D": "弦脉",
            "E": "弱脉"
          },
          "answer": "D",
          "analysis": "弦脉【脉象特征】端直以长，如按琴弦。【临床意义】多见于肝胆病、疼痛、痰饮等，或胃气衰败。故选D。",
          "type": "多选题"
        },
        {
          "id": 16017,
          "title": "脉来缓慢，时有中止，止无定数，称为",
          "options": {
            "A": "代脉",
            "B": "促脉",
            "C": "涩脉",
            "D": "结脉",
            "E": "缓脉"
          },
          "answer": "D",
          "analysis": "结脉【脉象特征】脉来缓慢，时有中止，止无定数。【临床意义】多见于阴盛气结、寒痰血瘀，亦可见于气血虚衰等证。故选D。",
          "type": "多选题"
        },
        {
          "id": 16018,
          "title": "患者症见心悸，失眠，多梦，健忘，头晕眼花，面色淡白或萎黄，唇舌色淡，脉细无力，证属",
          "options": {
            "A": "心血虚证",
            "B": "心阴虚证",
            "C": "心气虚证",
            "D": "心阳虚证",
            "E": "心阳虚脱证"
          },
          "answer": "A",
          "analysis": "心血虚证是指血液亏虚，心失濡养，以心悸、失眠、多梦及血虚症状为主要表现的证。\n【证候表现】心悸，失眠，多梦，健忘，头晕眼花，面色淡白或萎黄，唇舌色淡，脉细无力。故选A。",
          "type": "多选题"
        },
        {
          "id": 16019,
          "title": "在心气虚证的基础上出现虚寒症状为",
          "options": {
            "A": "心血虚证",
            "B": "心阴虚证",
            "C": "心气虚证",
            "D": "心阳虚证",
            "E": "心阳虚脱证"
          },
          "answer": "D",
          "analysis": "心阳虚证，在心气虚证的基础上出现虚寒症状，以畏寒肢冷为特征，且心悸加重，或出现心胸疼痛、面唇青紫等表现。故选D。",
          "type": "多选题"
        },
        {
          "id": 16020,
          "title": "心脉痹阻证的原因一般不包括",
          "options": {
            "A": "瘀血",
            "B": "痰浊",
            "C": "阴寒",
            "D": "气滞",
            "E": "虫积"
          },
          "answer": "E",
          "analysis": "心脉痹阻证是指瘀血、痰浊、阴寒、气滞等因素阻痹心脉，以心悸怔忡、心胸憋闷疼痛为主要表现的证。故选E。",
          "type": "多选题"
        },
        {
          "id": 16021,
          "title": "痰蒙心神证需与痰火扰神证的最大鉴别点在于",
          "options": {
            "A": "有无神志异常",
            "B": "有无痰湿",
            "C": "有无心悸",
            "D": "有无火热",
            "E": "有无不寐"
          },
          "answer": "D",
          "analysis": "痰蒙心神证为痰浊蒙蔽心神，其症以意识模糊、抑郁、错乱、痴呆为主，兼见苔腻、脉滑等痰浊内盛的症状，无明显火热证表现；痰火扰神证则既有痰又有火，其症以狂躁、谵语等动而多躁的表现为主，除了苔腻、脉滑等痰浊内盛的表现以外，还兼见舌红苔黄、脉 数等火热症状。故选D。",
          "type": "多选题"
        },
        {
          "id": 16022,
          "title": "小便赤涩疼痛、心烦、舌疮与实热症状共见为主要表现，辨证为",
          "options": {
            "A": "心火亢盛证",
            "B": "心肝火旺证",
            "C": "心血不足证",
            "D": "小肠实热证",
            "E": "心脾两虚证"
          },
          "answer": "D",
          "analysis": "小肠实热证是指心火下移小肠，热迫膀胱，气化失司，以小便赤涩疼痛、心烦、舌疮及实热症状为主要表现的证。故选D。",
          "type": "多选题"
        },
        {
          "id": 16023,
          "title": "患者见干咳无痰，或痰少而黏，不易咳出，或痰中带血，声音嘶哑，形体消瘦，口干咽燥，五心烦热，潮热盗汗，两颧潮红，舌红少津，脉细数，证属",
          "options": {
            "A": "肺气虚证",
            "B": "肺阴虚证",
            "C": "风寒犯肺证",
            "D": "风热犯肺证",
            "E": "燥邪犯肺证"
          },
          "answer": "B",
          "analysis": "肺阴虚证是指肺阴亏虚，虚热内生，肺失滋润，清肃失司，以干咳无痰，或痰少而黏及阴虚症状为主要表现的证。【证候表现】干咳无痰，或痰少而黏，不易咳出，或痰中带血，声音嘶哑，形体消瘦，口干咽燥，五心烦热，潮热盗汗，两颧潮红，舌红少津，脉细数。故选B。",
          "type": "多选题"
        },
        {
          "id": 16024,
          "title": "以咳嗽、气喘、胸痛与里实热症状共见为主要表现称为",
          "options": {
            "A": "肺热炽盛证",
            "B": "肺阴虚证",
            "C": "风寒犯肺证",
            "D": "风热犯肺证",
            "E": "燥邪犯肺证"
          },
          "answer": "A",
          "analysis": "肺热炽盛证是指热邪壅肺，肺失清肃，以咳嗽、气喘及里实热症状为主要表现的证。肺热炽盛证又称热邪壅肺证。故选A。",
          "type": "多选题"
        },
        {
          "id": 16025,
          "title": "咳嗽，气喘息粗，胸闷，或喉中痰鸣，咳痰黄稠量多，或咳吐脓血腥臭痰，胸痛，发热，口渴，小便短赤，大便秘结，舌红苔黄腻，脉滑数，为",
          "options": {
            "A": "肺热炽盛证",
            "B": "痰热壅肺证",
            "C": "寒痰阻肺证",
            "D": "风热犯肺证",
            "E": "燥邪犯肺证"
          },
          "answer": "B",
          "analysis": "痰热壅肺证是指痰热交结，壅滞于肺，肺失清肃，以咳喘、痰黄稠及痰热症状为主要表现的证。【证候表现】咳嗽，气喘息粗，胸闷，或喉中痰鸣，咳痰黄稠量多，或咳吐脓血腥臭痰，胸痛，发热，口渴，小便短赤，大便秘结，舌红苔黄腻，脉滑数。故选B。",
          "type": "多选题"
        },
        {
          "id": 16026,
          "title": "水饮停于胸胁，阻滞气机，以胸廓饱满、胸胁胀闷或痛，在四饮中称为",
          "options": {
            "A": "痰饮",
            "B": "支饮",
            "C": "溢饮",
            "D": "悬饮",
            "E": "水饮"
          },
          "answer": "D",
          "analysis": "饮停胸胁证是指水饮停于胸胁，阻滞气机，以胸廓饱满、胸胁胀闷或痛及饮停症状为主要表现的证，即属痰饮病之“悬饮”。故选D。",
          "type": "多选题"
        },
        {
          "id": 16027,
          "title": "肠热腑实证中见燥屎内结，加之邪热迫津下泄，故泻下稀水、气味恶臭，称为",
          "options": {
            "A": "热结旁流",
            "B": "日晡潮热",
            "C": "神昏谵语",
            "D": "肛门灼热",
            "E": "里热炽盛"
          },
          "answer": "A",
          "analysis": "燥屎内结，加之邪热迫津下泄，故泻下稀水、气味恶臭，即所谓“热结旁流”。故选A。",
          "type": "多选题"
        },
        {
          "id": 16028,
          "title": "患者见不欲食或纳少，腹胀，食后胀甚，便溏，神疲乏力，少气懒言，肢体倦怠，或浮肿，或消瘦，或肥胖，面色萎黄，舌淡苔白，脉缓或弱，证属",
          "options": {
            "A": "脾气虚证",
            "B": "脾虚气陷证",
            "C": "脾阳虚证",
            "D": "脾不统血证",
            "E": "寒湿困脾证"
          },
          "answer": "A",
          "analysis": "脾气虚证是指脾气不足，运化失职，以纳少、腹胀、便溏及气虚症状为主要表现的证。\n【证候表现】不欲食或纳少，腹胀，食后胀甚，便溏，神疲乏力，少气懒言，肢体倦怠，或浮肿，或消瘦，或肥胖，面色萎黄，舌淡苔白，脉缓或弱。故选A。",
          "type": "多选题"
        },
        {
          "id": 16029,
          "title": "脾气虚弱，统血失常，血溢脉外，以各种出血及脾气虚症状为主要表现的证，称为",
          "options": {
            "A": "脾气虚证",
            "B": "脾虚气陷证",
            "C": "脾阳虚证",
            "D": "脾不统血证",
            "E": "寒湿困脾证"
          },
          "answer": "D",
          "analysis": "脾不统血证是指脾气虚弱，统血失常，血溢脉外，以各种出血及脾气虚症状为主要表现的证。故选D。",
          "type": "多选题"
        },
        {
          "id": 16030,
          "title": "寒湿困脾证须与湿热蕴脾证鉴别要点为",
          "options": {
            "A": "是否有湿邪困脾",
            "B": "是否有纳呆",
            "C": "是否有便溏",
            "D": "是否有苔腻",
            "E": "寒热不同"
          },
          "answer": "E",
          "analysis": "寒湿困脾证须与湿热蕴脾证进行鉴别：\n       两证均有湿邪困脾，气机阻滞，可见脘腹胀闷、纳 呆、便溏不爽、肢体困重、苔腻、脉濡等症状。但两者病性有寒热的不同，寒湿困脾证为寒邪与 湿邪困阻脾阳，除了湿邪困脾的症状之外，可见身目发黄、黄色晦暗如烟熏、舌淡苔白等症 状；湿热蕴脾证为热邪与湿邪困阻中焦，除了湿邪困脾的症状之外，可见面目发黄色鲜明、口苦、身热不扬、舌红苔黄等热象。故选E。",
          "type": "多选题"
        },
        {
          "id": 16031,
          "title": "脾气虚证、脾阳虚证与胃气虚证、胃阳虚证，四证均有",
          "options": {
            "A": "食少纳呆",
            "B": "舌苔厚腻",
            "C": "畏寒",
            "D": "肢冷",
            "E": "便秘"
          },
          "answer": "A",
          "analysis": "脾气虚证、脾阳虚证与胃气虚证、胃阳虚证的鉴别：四证均有食少、脘腹隐痛及气虚或阳虚 的共同症状。故选A。",
          "type": "多选题"
        },
        {
          "id": 16032,
          "title": "以胃脘灼痛、消谷善饥及实热症状为主要表现的证，称为",
          "options": {
            "A": "胃阴虚证",
            "B": "胃气虚证",
            "C": "胃热炽盛证",
            "D": "食滞胃脘证",
            "E": "脾胃虚寒证"
          },
          "answer": "C",
          "analysis": "胃热炽盛证是指火热壅滞于胃，胃失和降，以胃脘灼痛、消谷善饥及实热症状为主要表现的证。故选C。",
          "type": "多选题"
        },
        {
          "id": 16033,
          "title": "头晕目眩，视力减退或夜盲，爪甲不荣，肢体麻木，失眠多梦，妇女月经量少、色淡，甚则闭经，面唇淡白，舌淡，脉细，证属",
          "options": {
            "A": "肝血虚证",
            "B": "肝阴虚证",
            "C": "肝郁气滞证",
            "D": "肝火炽盛证",
            "E": "肝风内动证"
          },
          "answer": "A",
          "analysis": "肝血虚证是指肝血不足，机体失养，以眩晕、视力减退、肢体麻木及血虚症状为主要表现的证。【证候表现】头晕目眩，视力减退或夜盲，爪甲不荣，肢体麻木，失眠多梦，妇女月经量少、色淡，甚则闭经，面唇淡白，舌淡，脉细。故选A。",
          "type": "多选题"
        },
        {
          "id": 16034,
          "title": "以头痛、胁痛、烦躁、耳鸣及实热症状为主要表现的证，称为",
          "options": {
            "A": "肝血虚证",
            "B": "肝阴虚证",
            "C": "肝郁气滞证",
            "D": "肝火炽盛证",
            "E": "肝风内动证"
          },
          "answer": "D",
          "analysis": "肝火炽盛证是指火热炽盛，内扰于肝，气火上逆，以头痛、胁痛、烦躁、耳鸣及实热症状为主要表现的证。肝火炽盛证又名肝火上炎证，故选D。",
          "type": "多选题"
        },
        {
          "id": 16035,
          "title": "肝风内动的病因一般不包括",
          "options": {
            "A": "阳亢",
            "B": "火热",
            "C": "阴虚",
            "D": "血亏",
            "E": "气郁"
          },
          "answer": "E",
          "analysis": "肝风内动证是指因阳亢、火热、阴虚、血亏等所致，出现以眩晕、麻木、抽搐、震颤等以 “动摇”症状为主要表现的一类证。故选E。",
          "type": "多选题"
        },
        {
          "id": 16036,
          "title": "少腹冷痛，阴囊收缩，睾丸引痛，或颠顶冷痛，遇寒痛甚，得温痛减，恶寒肢冷，舌苔白，脉沉弦或沉紧，证属",
          "options": {
            "A": "寒凝肝脉证",
            "B": "胆郁痰扰证",
            "C": "肝郁气滞证",
            "D": "肝火炽盛证",
            "E": "肝风内动证"
          },
          "answer": "A",
          "analysis": "寒凝肝脉证是指寒邪侵袭，凝滞肝经，以少腹、前阴、巅顶冷痛及实寒症状为主要表现的证。【证候表现】少腹冷痛，阴囊收缩，睾丸引痛，或颠顶冷痛，遇寒痛甚，得温痛减，恶寒肢冷，舌苔白，脉沉弦或沉紧。故选A。",
          "type": "多选题"
        },
        {
          "id": 16037,
          "title": "惊悸失眠、胆怯易惊与痰热症状共见为主要表现，称为",
          "options": {
            "A": "寒凝肝脉证",
            "B": "胆郁痰扰证",
            "C": "肝郁气滞证",
            "D": "肝火炽盛证",
            "E": "肝风内动证"
          },
          "answer": "B",
          "analysis": "胆郁痰扰证是指痰热内扰，胆气不宁，以胆怯易惊、心烦失眠及痰热症状为主要表现的证。故选B。",
          "type": "多选题"
        },
        {
          "id": 16038,
          "title": "腰膝酸软而痛，眩晕耳鸣，失眠多梦，形体消瘦，潮热盗汗，五心烦热，咽干颧红，或性欲偏亢，男子阳强易举、遗精早泄，女子经少、经闭、崩漏，舌红少苔或无苔，脉细数，证属",
          "options": {
            "A": "肾气虚证",
            "B": "肾阴虚证",
            "C": "肾阳虚证",
            "D": "肾虚水泛证",
            "E": "肾精不足证"
          },
          "answer": "B",
          "analysis": "肾阴虚证是指肾阴亏损，失于滋养，虚热内扰，以腰痠而痛、遗精、经少、头晕耳鸣及阴虚症状为主要表现的证。【证候表现】腰膝酸软而痛，眩晕耳鸣，失眠多梦，形体消瘦，潮热盗汗，五心烦热，咽干颧红，或性欲偏亢，男子阳强易举、遗精早泄，女子经少、经闭、崩漏，舌红少苔或无苔，脉细数，故选B。",
          "type": "多选题"
        },
        {
          "id": 16039,
          "title": "肾精不足证的主要症状不包括",
          "options": {
            "A": "小儿成长发育迟缓",
            "B": "男子精少不育",
            "C": "女子经闭不孕",
            "D": "遗精滑精",
            "E": "早衰"
          },
          "answer": "D",
          "analysis": "肾精不足证是指肾精亏损，脑与骨、髓失充，以生长发育迟缓、生育机能低下、成人早衰等为主要表现的证。【证候表现】小儿发育迟缓，身材矮小，囟门迟闭，骨骼痿软，智力低下；性欲减退，男子精少不育，女子经闭不孕；发脱齿摇，耳聋，耳鸣如蝉，腰膝痠软，足痿无力，健忘恍惚，神情呆钝，动作迟钝；舌淡苔白，脉弱，故选D。",
          "type": "多选题"
        },
        {
          "id": 16040,
          "title": "肾气亏虚，失于封藏、固摄，以腰膝痠软，小便、精液、经带、胎元不固及肾虚症状为主要表现的证，称为",
          "options": {
            "A": "肾气虚证",
            "B": "肾阴虚证",
            "C": "肾阳虚证",
            "D": "肾虚水泛证",
            "E": "肾气不固证"
          },
          "answer": "E",
          "analysis": "肾气不固证是指肾气亏虚，失于封藏、固摄，以腰膝痠软，小便、精液、经带、胎元不固及肾虚症状为主要表现的证。故选E。",
          "type": "多选题"
        },
        {
          "id": 16041,
          "title": "久病咳喘，呼多吸少，气不接续，动则喘甚，腰膝痠软，或自汗神疲，声音低怯，舌淡苔白，脉沉弱；或喘息加剧，冷汗淋漓，肢冷面青，脉浮大无根；或气短息促，颧红心烦，口燥咽干，舌红少苔，脉细数，证属",
          "options": {
            "A": "肾不纳气证",
            "B": "肾阴虚证",
            "C": "肾阳虚证",
            "D": "肾虚水泛证",
            "E": "肾气不固证"
          },
          "answer": "A",
          "analysis": "肾不纳气证是指肾气亏虚，纳气无权，以久病咳喘、呼多吸少、动则尤甚及肾虚症状为主要表现的证。肾不纳气证又称肺肾气虚证。【证候表现】久病咳喘，呼多吸少，气不接续，动则喘甚，腰膝痠软，或自汗神疲，声音低怯，舌淡苔白，脉沉弱；或喘息加剧，冷汗淋漓，肢冷面青，脉浮大无根；或气短息促，颧红心烦，口燥咽干，舌红少苔，脉细数。故选A。",
          "type": "多选题"
        },
        {
          "id": 16042,
          "title": "尿频，尿急，尿道涩滞灼痛，小便短黄或混浊，或尿血，或尿中砂石，小腹胀痛，或腰、腹掣痛，或伴发热，舌红苔黄腻，脉滑数，称为",
          "options": {
            "A": "肾不纳气证",
            "B": "膀胱湿热证",
            "C": "小肠湿热证",
            "D": "肾虚水泛证",
            "E": "肾气不固证"
          },
          "answer": "B",
          "analysis": "膀胱湿热证是指湿热侵袭，蕴结膀胱，以小便频急、涩滞灼痛及湿热症状为主要表现的证。【证候表现】尿频，尿急，尿道涩滞灼痛，小便短黄或混浊，或尿血，或尿中砂石，小腹胀痛，或腰、腹掣痛，或伴发热，舌红苔黄腻，脉滑数。故选B。",
          "type": "多选题"
        },
        {
          "id": 16043,
          "title": "心烦失眠、腰膝痠软、耳鸣、梦遗与虚热或虚寒症状共见为主要表现，证属",
          "options": {
            "A": "肾气虚证",
            "B": "心肾不交证",
            "C": "心火亢盛证",
            "D": "肾虚水泛证",
            "E": "肾精不足证"
          },
          "answer": "B",
          "analysis": "心肾不交证是指心肾水火既济失调，以心烦、失眠、耳鸣、腰膝痠软等为主要表现的证，故选B。",
          "type": "多选题"
        },
        {
          "id": 16044,
          "title": "心悸怔忡，失眠多梦，食欲不振，腹胀便溏，面色萎黄，眩晕耳鸣，神疲乏力或见各种慢性出血，血色淡，舌淡嫩，脉弱，证属",
          "options": {
            "A": "肾气虚证",
            "B": "心肾不交证",
            "C": "心肺气虚证",
            "D": "心脾两虚证",
            "E": "心肝血虚证"
          },
          "answer": "D",
          "analysis": "心脾两虚证是指脾气亏虚，心血不足，以心悸怔忡、失眠多梦、食少腹胀、便溏及气血两虚症状为主要表现的证。【证候表现】心悸怔忡，失眠多梦，食欲不振，腹胀便溏，面色萎黄，眩晕耳鸣，神疲乏力或见各种慢性出血，血色淡，舌淡嫩，脉弱。故选D。",
          "type": "多选题"
        },
        {
          "id": 16045,
          "title": "脾肺气虚证中，咳嗽气喘，耗伤肺气，日久运化失常，脾胃受损，称为",
          "options": {
            "A": "先天不足",
            "B": "五行相克",
            "C": "五行相生",
            "D": "母病及子",
            "E": "子病及母"
          },
          "answer": "E",
          "analysis": "多因久病咳喘，耗伤肺气，子病及母，运化失常；或饮食劳倦，脾胃受损，土不生金，累及于肺，宣降失司所致，故选E。",
          "type": "多选题"
        },
        {
          "id": 16046,
          "title": "胸胁灼痛，急躁易怒，头胀头晕，咳嗽阵作，痰黄黏稠，甚则咳血，烦热口苦，面红目赤，舌红苔薄黄，脉弦数，证属",
          "options": {
            "A": "肝火犯肺证",
            "B": "心肾不交证",
            "C": "心肺气虚证",
            "D": "心脾两虚证",
            "E": "心肝血虚证"
          },
          "answer": "A",
          "analysis": "肝火犯肺证是指肝火炽盛，上逆犯肺，肺失清肃，以胸胁灼痛、急躁易怒、咳嗽阵作或咳血及实热症状为主要表现的证。【证候表现】胸胁灼痛，急躁易怒，头胀头晕，咳嗽阵作，痰黄黏稠，甚则咳血，烦热口苦，面红目赤，舌红苔薄黄，脉弦数。故选A。",
          "type": "多选题"
        },
        {
          "id": 16047,
          "title": "腰膝、下腹冷痛，久泻久痢，或五更泄泻，完谷不化，便质清冷，或全身浮肿，小便不利，形寒肢冷，面色㿠白，舌淡胖，苔白滑，脉沉迟无力，称为",
          "options": {
            "A": "肝火犯肺证",
            "B": "脾肾阳虚证",
            "C": "心肺气虚证",
            "D": "心脾两虚证",
            "E": "心肝血虚证"
          },
          "answer": "B",
          "analysis": "脾肾阳虚证是指脾肾阳气亏虚，温化失职，虚寒内生，以久泻久痢、浮肿、腰腹冷痛及阳虚症状为主要表现的证。【证候表现】腰膝、下腹冷痛，久泻久痢，或五更泄泻，完谷不化，便质清冷，或全身浮肿，小便不利，形寒肢冷，面色㿠白，舌淡胖，苔白滑，脉沉迟无力。故选B。",
          "type": "多选题"
        },
        {
          "id": 16057,
          "title": "自言自语，喃喃不休，见人语止，首尾不续，称为",
          "options": {
            "A": "谵语",
            "B": "郑声",
            "C": "独语",
            "D": "错语",
            "E": "狂言"
          },
          "answer": "C",
          "analysis": "独语是指自言自语，喃喃不休，见人语止，首尾不续。多因心气不足，神失所养，或气郁痰阻，蒙蔽心神所致，属阴证，多见于癫病、郁病，故选C。",
          "type": "多选题"
        },
        {
          "id": 16058,
          "title": "呼吸困难、短促急迫，甚至张口抬肩，鼻翼扇动，难以平卧称为",
          "options": {
            "A": "哮",
            "B": "喘",
            "C": "咳",
            "D": "嗽",
            "E": "厥"
          },
          "answer": "B",
          "analysis": "喘是指呼吸困难、短促急迫，甚至张口抬肩，鼻翼扇动，难以平卧。其发病多与肺、 肾等脏腑有关，临床有虚实之分。故选B。",
          "type": "多选题"
        },
        {
          "id": 16059,
          "title": "哮的特征是",
          "options": {
            "A": "喉间哮鸣声",
            "B": "呼吸急促",
            "C": "鼻翼扇动",
            "D": "呼吸微弱而声低",
            "E": "气短不足以息"
          },
          "answer": "A",
          "analysis": "哮是指呼吸急促似喘，喉间有哮鸣音，常反复发作，缠绵难愈，多因痰饮内伏，复感外邪而诱发；也可因久居寒湿之地，或过食酸、咸、生冷，或闻刺激性气味等而诱发，哮以喉间哮鸣声为特征，故选A。",
          "type": "多选题"
        },
        {
          "id": 16060,
          "title": "有痰无声谓之",
          "options": {
            "A": "哮",
            "B": "喘",
            "C": "咳",
            "D": "嗽",
            "E": "厥"
          },
          "answer": "D",
          "analysis": "有声无痰谓之咳，有痰无声谓之嗽，有痰有声谓之咳嗽，故选D。",
          "type": "多选题"
        },
        {
          "id": 16061,
          "title": "咳声重浊，痰白清稀，鼻塞不通，多因",
          "options": {
            "A": "阴虚肺燥",
            "B": "燥邪犯肺",
            "C": "痰热蕴肺",
            "D": "风热犯肺",
            "E": "风寒袭肺"
          },
          "answer": "E",
          "analysis": "咳声重浊，痰白清稀，鼻塞不通，多因风寒袭肺，肺失宣降所致，故选E。",
          "type": "多选题"
        },
        {
          "id": 16062,
          "title": "有物无声为",
          "options": {
            "A": "干呕",
            "B": "吐",
            "C": "呕吐",
            "D": "喘",
            "E": "哮"
          },
          "answer": "B",
          "analysis": "前人以有声无物为干呕，有物无声为吐，有声有物为呕吐，故选B。",
          "type": "多选题"
        },
        {
          "id": 16063,
          "title": "嗳气频作而响亮，嗳气后脘腹胀减，发作因情志变化而增减者，多为",
          "options": {
            "A": "宿食内停",
            "B": "肝气犯胃",
            "C": "寒邪犯胃",
            "D": "胃阳亏虚",
            "E": "脾胃虚弱"
          },
          "answer": "B",
          "analysis": "嗳气频作而响亮，嗳气后脘腹胀减，发作因情志变化而增减者，多为肝气犯胃，属实证，故选B。",
          "type": "多选题"
        },
        {
          "id": 16064,
          "title": "口气酸臭，兼食少纳呆、脘腹胀满者，多属",
          "options": {
            "A": "胃热",
            "B": "胃寒",
            "C": "胃阴虚",
            "D": "胃阳虚",
            "E": "食积胃肠"
          },
          "answer": "E",
          "analysis": "口气酸臭，兼食少纳呆、脘腹胀满者，多属食积胃肠，故选E。",
          "type": "多选题"
        },
        {
          "id": 16065,
          "title": "鼻流浊涕日久，腥秽如鱼脑，为",
          "options": {
            "A": "肺热壅盛",
            "B": "鼻鼽",
            "C": "鼻渊",
            "D": "风寒表证",
            "E": "风热表证"
          },
          "answer": "C",
          "analysis": "鼻流浊涕日久，腥秽如鱼脑，为鼻渊，故选C。",
          "type": "多选题"
        },
        {
          "id": 16066,
          "title": "病室有烂苹果样气味，多见于",
          "options": {
            "A": "消渴病重症",
            "B": "有机磷农药中毒",
            "C": "水肿病晚期",
            "D": "溃腐疮疡",
            "E": "瘟疫类疾病"
          },
          "answer": "A",
          "analysis": "病室有烂苹果样气味，多见于消渴病重症，故选A。",
          "type": "多选题"
        },
        {
          "id": 16067,
          "title": "被誉为方书之祖的方书是？",
          "options": {
            "A": "《黄帝内经》",
            "B": "《五十二病方》",
            "C": "《千金方》",
            "D": "《普济方》",
            "E": "《伤寒杂病论》"
          },
          "answer": "E",
          "analysis": "《伤寒杂病论》所载之方，大多有理有法，组方严谨，选药精当，变化巧妙，后世大量方剂，皆或以仲景方为基础化裁而成，或效法其药物配伍组合规律，依据理法选药组成。故选E。",
          "type": "多选题"
        },
        {
          "id": 16068,
          "title": "《外台秘要》是何朝代的方书？",
          "options": {
            "A": "汉代",
            "B": "唐代",
            "C": "宋代",
            "D": "明代",
            "E": "清代"
          },
          "answer": "B",
          "analysis": "《外台秘要》作者王焘为唐代医家。故选B。",
          "type": "多选题"
        },
        {
          "id": 16069,
          "title": "下列何法不属于“八法”的内容？",
          "options": {
            "A": "汗法",
            "B": "和法",
            "C": "消法",
            "D": "固法",
            "E": "下法"
          },
          "answer": "D",
          "analysis": "八法的内容为“汗、和、下、消、吐、清、温、补”不含“固法”，故选D。",
          "type": "多选题"
        },
        {
          "id": 16070,
          "title": "下列哪项不属于汤剂的特点？",
          "options": {
            "A": "吸收快，药效发挥迅速",
            "B": "便于随证加减",
            "C": "便于服用或携带",
            "D": "服用量大",
            "E": "适于病证较重或病情不稳定的患者"
          },
          "answer": "C",
          "analysis": "汤剂的不足之处体现在服用量大，不便于携带等方面。故选C。",
          "type": "多选题"
        },
        {
          "id": 16071,
          "title": "麻黄汤主治证候的病机是？",
          "options": {
            "A": "外感风寒湿邪，内有蕴热",
            "B": "外感风寒，营卫不和",
            "C": "外感风寒，肺气失宣",
            "D": "外寒里饮",
            "E": "风邪犯肺，肺失清肃"
          },
          "answer": "C",
          "analysis": "麻黄汤功能发汗解表、宣肺平喘，故主治证的病机应为外感风寒、肺气失宣。故选C。",
          "type": "多选题"
        },
        {
          "id": 16072,
          "title": "症见恶寒发热，头痛身痛，无汗而喘，舌苔薄白，脉浮紧。治当首选？",
          "options": {
            "A": "麻黄汤",
            "B": "桂枝汤",
            "C": "九味羌活汤",
            "D": "小柴胡汤",
            "E": "小青龙汤"
          },
          "answer": "A",
          "analysis": "此为外感风寒表实证。麻黄汤功能发汗解表，宣肺平喘，为主治外感风寒表实证的基础方。故选A。",
          "type": "多选题"
        },
        {
          "id": 16073,
          "title": "症见恶风发热，汗出，头痛，鼻鸣干呕，苔白不渴，脉浮缓。治当首选？",
          "options": {
            "A": "麻黄汤",
            "B": "败毒散",
            "C": "华盖散",
            "D": "玉屏风散",
            "E": "桂枝汤"
          },
          "answer": "E",
          "analysis": "此为外感风寒表虚证。桂枝汤功能解肌发表、调和营卫，为主治外感风寒表虚证的代表方。故选E。",
          "type": "多选题"
        },
        {
          "id": 16074,
          "title": "桂枝汤中桂枝与芍药的用量比例是？",
          "options": {
            "A": "1比2",
            "B": "2比1",
            "C": "3比2",
            "D": "1比1",
            "E": "2比3"
          },
          "answer": "D",
          "analysis": "桂枝汤中桂、芍等量合用，为本方外可解肌发表，内调营卫、阴阳的基本结构。故选D。",
          "type": "多选题"
        },
        {
          "id": 16125,
          "title": "具有辛凉解表，清热解毒功用的方剂是？",
          "options": {
            "A": "黄连解毒汤",
            "B": "银翘散",
            "C": "柴葛解肌汤",
            "D": "败毒散",
            "E": "升麻葛根汤"
          },
          "answer": "B",
          "analysis": "银翘散以疏散、解毒的银花、连翘为君药；臣以薄荷、牛蒡疏散风热，荆芥穗、淡豆豉解表散邪；佐以芦根、竹叶清热生津，桔梗宣肺止咳利咽；使以甘草调和药性。其功用为辛凉透表，清热解毒。故选B。",
          "type": "多选题"
        },
        {
          "id": 16126,
          "title": "银翘散具有疏散风热，清利头目，且可解毒利咽配伍意义的药组是？",
          "options": {
            "A": "薄荷、牛蒡子",
            "B": "荆芥穗、淡豆豉",
            "C": "芦根、竹叶",
            "D": "芦根、生甘草",
            "E": "银花、连翘"
          },
          "answer": "A",
          "analysis": "银翘散中的薄荷、牛蒡子疏散风热，清利头目，且可解毒利咽。故选A。",
          "type": "多选题"
        },
        {
          "id": 16127,
          "title": "主治证病机为气虚外感风寒湿邪，宜选的方剂是？",
          "options": {
            "A": "参苏饮",
            "B": "再造散",
            "C": "败毒散",
            "D": "荆防败毒散",
            "E": "葱白七味饮"
          },
          "answer": "C",
          "analysis": "败毒散功能散寒祛湿，益气解表。故其主治证的病机为气虚外感风寒湿邪。故选C。",
          "type": "多选题"
        },
        {
          "id": 16128,
          "title": "下列证候中，哪一项不属于十枣汤的主治？",
          "options": {
            "A": "咳唾胸胁引痛",
            "B": "日晡潮热",
            "C": "心下痞硬",
            "D": "干呕短气",
            "E": "头痛目眩"
          },
          "answer": "B",
          "analysis": "日晡潮热为阳明里实之常见热型，患者多兼大便不通、腹痛拒按、按之坚硬等症，非水饮所致的十枣汤证候。故选B。",
          "type": "多选题"
        },
        {
          "id": 16129,
          "title": "具有温里散寒，通便止痛功用的方剂是?",
          "options": {
            "A": "厚朴温中丸",
            "B": "理中丸",
            "C": "大黄附子汤",
            "D": "三物备急丸",
            "E": "济川煎"
          },
          "answer": "C",
          "analysis": "大黄附子汤以辛热之附子温里散寒，苦寒之大黄泻下通便，荡涤积滞共为君药；配细辛助附子温里散寒。功能温里散寒，通便止痛，故选C。",
          "type": "多选题"
        },
        {
          "id": 16130,
          "title": "以大便秘结，小便频数，舌苔微黄为辨证要点的方剂是？",
          "options": {
            "A": "黄龙汤",
            "B": "济川煎",
            "C": "麻子仁丸",
            "D": "增液承气汤",
            "E": "五仁丸"
          },
          "answer": "C",
          "analysis": "麻子仁丸功能润肠泄热，行气通便。是治疗胃肠燥热，脾津不足之“脾约”证的常用方。其辨证要点当为大便秘结，小便频数，舌苔微黄，故选C。",
          "type": "多选题"
        },
        {
          "id": 16131,
          "title": "下列除哪项外，均属于小柴胡汤的组成？",
          "options": {
            "A": "柴胡、黄芩",
            "B": "半夏、生姜",
            "C": "人参、大枣",
            "D": "白芍",
            "E": "甘草"
          },
          "answer": "D",
          "analysis": "小柴胡汤由柴胡、黄芩、半夏、人参、甘草、生姜、大枣组成。故选D。",
          "type": "多选题"
        },
        {
          "id": 16132,
          "title": "仙方活命饮的君药是？",
          "options": {
            "A": "赤芍",
            "B": "白芷",
            "C": "金银花",
            "D": "乳香",
            "E": "皂角刺"
          },
          "answer": "C",
          "analysis": "仙方活命饮主治阳证痈疡肿毒初起，金银花为疮疡圣药，故用以为君，选C。",
          "type": "多选题"
        },
        {
          "id": 16133,
          "title": "患者壮热面赤，烦渴引饮，汗出恶热，脉洪而有力。治宜首选？",
          "options": {
            "A": "白虎汤",
            "B": "竹叶石膏汤",
            "C": "白虎加人参汤",
            "D": "白虎加桂枝汤",
            "E": "芍药汤"
          },
          "answer": "A",
          "analysis": "白虎汤的辨证要点为身大热，汗大出，口大渴，脉洪大。故选A。",
          "type": "多选题"
        },
        {
          "id": 16134,
          "title": "越鞠丸所治“六郁”证不包括？",
          "options": {
            "A": "湿郁",
            "B": "火郁",
            "C": "寒郁",
            "D": "痰郁",
            "E": "食郁"
          },
          "answer": "C",
          "analysis": "“六郁”证乃因喜怒无常，忧思过度，或饮食失节，寒温不适所致气、血、痰、火、湿、食六郁之证。故选C。",
          "type": "多选题"
        },
        {
          "id": 16135,
          "title": "半夏厚朴汤配伍苏叶的意义不包括？",
          "options": {
            "A": "行气",
            "B": "理肺",
            "C": "疏肝",
            "D": "散郁",
            "E": "散寒"
          },
          "answer": "E",
          "analysis": "半夏厚朴汤中苏叶芳香行气，理肺舒肝，助厚朴行气宽胸，宣通郁结之气。故选E。",
          "type": "多选题"
        },
        {
          "id": 16136,
          "title": "患者喘咳短气，胸膈满闷，腰痛脚弱，肢体浮肿，舌苔白滑，脉弦滑。治宜选用？",
          "options": {
            "A": "小青龙汤",
            "B": "苏子降气汤",
            "C": "定喘汤",
            "D": "麻黄汤",
            "E": "止嗽散"
          },
          "answer": "B",
          "analysis": "此为上实下虚咳喘证。由痰涎壅肺，肾阳不足所致，且以上实为主。治当降气平喘、祛痰止咳，宜选苏子降气汤，故选B。",
          "type": "多选题"
        },
        {
          "id": 16137,
          "title": "“有诸内必形诸外”体现了以下哪个观点？",
          "options": {
            "A": "人体是一个有机的整体",
            "B": "人与自然统一",
            "C": "人与环境和谐",
            "D": "人与社会关系统一",
            "E": "以上都不是"
          },
          "answer": "A",
          "analysis": "人体内脏有病，可反应于外在的相应的形体官窍，体现了人是一个有机整体，故选A",
          "type": "多选题"
        },
        {
          "id": 16138,
          "title": "患者自觉头部疼痛，那头部疼痛属于以下哪项？ ",
          "options": {
            "A": "疾病",
            "B": "证候",
            "C": "症状",
            "D": "体征",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "患者异常的主观感觉或行为表现称为症状，头部疼痛是患者自我感觉，属于症状，故选C.",
          "type": "多选题"
        },
        {
          "id": 16139,
          "title": "“天暑衣厚则腠理开，故汗出”体现了以下哪个观点？",
          "options": {
            "A": "人体是一个有机的整体",
            "B": "人与自然统一",
            "C": "人与环境和谐",
            "D": "人与社会关系统一",
            "E": "以上都不是"
          },
          "answer": "B",
          "analysis": "季节变化对人体会有影响，人会随着季节变化做的适应性调节，体现了“人与天地相应”，即人与自然统一，故选B",
          "type": "多选题"
        },
        {
          "id": 16140,
          "title": "以下哪项不是辨证施护的内涵？",
          "options": {
            "A": "通过四诊收集资料",
            "B": "对资料进行分析、综合",
            "C": "概括、诊断为某种性质的证候",
            "D": "根据辨证结果确定相应调护措施",
            "E": "施护是辨证的前提与依据"
          },
          "answer": "E",
          "analysis": "辨证是指将四诊所收集的有关疾病的各种现象和体征加以分析、综合、概括、诊断为某种性质的证候。施护是根据辨证的结果，遵循辨证的理论，确立相应的调护措施，辨证是施护的前提与依据，故选E",
          "type": "多选题"
        },
        {
          "id": 16141,
          "title": " “一方水土养一方人”体现了以下哪个观点？",
          "options": {
            "A": "人体是一个有机的整体",
            "B": "人与自然统一",
            "C": "人与环境和谐",
            "D": "人与社会关系统一",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "生活某个地区环境的人，总是适应这个地区的气候环境，体现了人与环境的和谐，故选C",
          "type": "多选题"
        },
        {
          "id": 16144,
          "title": "以下哪个原则体现了中医护理“治未病”思想？",
          "options": {
            "A": "三因制宜",
            "B": "护病求本",
            "C": "扶正祛邪 ",
            "D": "预防为主",
            "E": "调整阴阳"
          },
          "answer": "D",
          "analysis": "预防为主体现了“治未病”的思想，故选D",
          "type": "多选题"
        },
        {
          "id": 16145,
          "title": "疾病的本质和现象相一致情况下，逆其证候性质而选择护理措施的原则是？",
          "options": {
            "A": "寒因寒用",
            "B": "塞因塞用",
            "C": "寒者热之",
            "D": "通因通用",
            "E": "热因热用"
          },
          "answer": "C",
          "analysis": "疾病的本质和现象相一致情况下，逆其证候性质而选择护理措施的原则是正护法，常用正护法有“寒者热之”“热者寒之”“虚则补之”“实则泻之”，故选C。",
          "type": "多选题"
        },
        {
          "id": 16146,
          "title": "以下哪项不属于调整阴阳原则？",
          "options": {
            "A": "补其不足",
            "B": "寒因寒用",
            "C": "补其偏衰",
            "D": "损其偏盛",
            "E": "损其有余"
          },
          "answer": "B",
          "analysis": "调整阴阳原则包括损其偏盛又称损其有余和补其偏衰又称补其不足，寒因寒用属于护病求本中反护法，故选B。",
          "type": "多选题"
        },
        {
          "id": 16147,
          "title": "以下关于同病异护说法正确的是哪项？",
          "options": {
            "A": "同一种病的证不同可采取不同的护理方法",
            "B": "对于胃痛患者都可采取相同的护理方法",
            "C": "同一种病的证不同可采取相同的护理方法",
            "D": "不同疾病表现相似或相同的证",
            "E": "以上都是"
          },
          "answer": "A",
          "analysis": "同一种疾病在不同的发展阶段，其病理变化、临床表现不同，因而有着不同的证型，可采取不同的护理方法，故选A ",
          "type": "多选题"
        },
        {
          "id": 16148,
          "title": "急则护标属于哪种护治原则？",
          "options": {
            "A": "预防为主",
            "B": "扶正祛邪",
            "C": "调整阴阳",
            "D": "护病求本",
            "E": "三因制宜"
          },
          "answer": "D",
          "analysis": "护病求本包括标本缓急、正护和反护、同病异护和异病同护，急则护标属于标本缓急原则的一种，故选D",
          "type": "多选题"
        },
        {
          "id": 16443,
          "title": "哪项不是肺的生理功能所主？",
          "options": {
            "A": "主气，司呼吸",
            "B": "主宣发与肃降",
            "C": "通调水道",
            "D": "贮藏精气",
            "E": "肺朝百脉，主治节"
          },
          "answer": "D",
          "analysis": "肺主要功能是主气、司呼吸，主宣发和肃降，通调水道，朝百脉、 主治节。",
          "type": "多选题"
        },
        {
          "id": 16444,
          "title": "六淫不包括哪一项？",
          "options": {
            "A": "风",
            "B": "寒",
            "C": "暑",
            "D": "雨",
            "E": "火"
          },
          "answer": "D",
          "analysis": "所谓六淫，是风、寒、暑、湿、燥、火六种外感病邪的统称。",
          "type": "多选题"
        },
        {
          "id": 16445,
          "title": "风寒袭肺证的表现有哪些？",
          "options": {
            "A": "咳嗽声重",
            "B": "咯白稀痰",
            "C": "舌淡、苔薄白",
            "D": "脉浮紧",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "风寒袭肺证的表现有咳嗽声重，咯白稀痰，舌淡、苔薄白，脉浮紧。",
          "type": "多选题"
        },
        {
          "id": 16446,
          "title": "内伤咳嗽的特点有哪些？",
          "options": {
            "A": "多为久病，病程长",
            "B": "常反复发作，病势缓",
            "C": "可伴有其他脏腑兼证",
            "D": "脏为本，肺为标",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "内伤咳嗽的特点包括了多为久病，病程长；常反复发作，病势缓； 可伴有其他脏腑兼证；脏为本，肺为标。",
          "type": "多选题"
        },
        {
          "id": 16447,
          "title": "针对咳嗽，耳穴贴压常选用的穴位有？",
          "options": {
            "A": "肺",
            "B": "气管",
            "C": "神门",
            "D": "平喘",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "耳穴贴压 : 主穴 : 肺、气管、支气管等穴。配穴 : 平喘、神门、枕、 大肠、脾、肾等。频次 : 三天一次。",
          "type": "多选题"
        },
        {
          "id": 16448,
          "title": "外感发热患者出现头重如裹症状的辨证分型是",
          "options": {
            "A": "风寒束表证",
            "B": "风热犯表证",
            "C": "暑湿袭表证",
            "D": "卫气同病证",
            "E": "热入心包证"
          },
          "answer": "C",
          "analysis": "暑湿袭表证的表现为身热，微恶风，汗少，肢体酸重或疼痛， 头昏重胀痛，咳嗽痰粘，鼻流浊涕，心烦口渴，或口中粘腻，渴不多饮，胸闷，泛恶， 小便短赤，舌苔薄黄而腻，脉濡数。",
          "type": "多选题"
        },
        {
          "id": 16449,
          "title": "服用中、西药的时候，需要间隔：",
          "options": {
            "A": "不用间隔",
            "B": "1～2小时",
            "C": "2～3小时",
            "D": "3～4小时",
            "E": "4～5小时"
          },
          "answer": "B",
          "analysis": "服用中药与西药间隔 1~2 小时为好。",
          "type": "多选题"
        },
        {
          "id": 16450,
          "title": "患者高热时可以选择的适宜技术，但是营养状况差的患者需要谨慎应用的项目是",
          "options": {
            "A": "穴位按摩",
            "B": "中药擦浴",
            "C": "穴位放血",
            "D": "耳穴贴压",
            "E": "中药外敷"
          },
          "answer": "C",
          "analysis": "穴位放血 : 高热者，可选择三棱针点刺放血，合谷、大椎、风池、 曲池、少商等穴 ( 营养状况差者慎用 )。",
          "type": "多选题"
        },
        {
          "id": 16451,
          "title": "下面关于呕吐的阐述哪项是错误的",
          "options": {
            "A": "有物有声谓之呕",
            "B": "有物无声谓之吐",
            "C": "无物有声谓之干呕",
            "D": "呕与吐不常同时发生",
            "E": "呕与吐常同时发生"
          },
          "answer": "D",
          "analysis": "临床呕与吐常兼见，难以分开，故合称呕吐。",
          "type": "多选题"
        },
        {
          "id": 16452,
          "title": "中医认为恶心呕吐的病因主要有哪些",
          "options": {
            "A": "外邪犯胃",
            "B": "情志失调",
            "C": "饮食不节",
            "D": "脾胃虚弱",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "恶心呕吐的病因包括了外邪犯胃、情志失调、饮食不节、脾胃虚弱。",
          "type": "多选题"
        },
        {
          "id": 16453,
          "title": "哪项不是饮食停滞者的饮食原则",
          "options": {
            "A": "饮食控制",
            "B": "禁食",
            "C": "可少量多餐",
            "D": "可食用山楂、陈皮、焦三仙粥",
            "E": "禁食油腻、辛辣、煎炸之品"
          },
          "answer": "C",
          "analysis": "饮食停滞者的饮食原则应与脘腹胀满饮食原则类似，需要避免食 用硬固不易消化之品和油煎厚味项，而选项 C 中的多食油腻和少食多餐都不符合 这一原则。",
          "type": "多选题"
        },
        {
          "id": 16454,
          "title": "哪项不是实证呕吐患者适宜的中医护理技术",
          "options": {
            "A": "穴位贴敷",
            "B": "耳穴贴压",
            "C": "中药热熨敷",
            "D": "经穴推拿",
            "E": "穴位注射"
          },
          "answer": "C",
          "analysis": "中药热熨敷实证呕吐患者慎用。",
          "type": "多选题"
        },
        {
          "id": 16455,
          "title": "便秘的发生机制与多种因素有关，其主要病机是什么？",
          "options": {
            "A": "大肠的传导失常",
            "B": "肠胃积热",
            "C": "气机郁滞",
            "D": "阴寒凝滞",
            "E": "津亏血少"
          },
          "answer": "A",
          "analysis": "气机郁滞，情志不舒、忧愁思虑、久坐少动、久病卧床等引起气 机郁滞，致使大肠传导失职、糟粕内停，而成秘结。",
          "type": "多选题"
        },
        {
          "id": 16456,
          "title": "患者证见大便硬结难下，少腹疼痛，按之胀痛，口干口臭，舌红，苔黄燥，少津，脉数，属于哪种证型的便秘？",
          "options": {
            "A": "肠道热结证",
            "B": "肠道气滞证",
            "C": "津亏血少证",
            "D": "脾肾阳虚证",
            "E": "肺脾气虚证"
          },
          "answer": "A",
          "analysis": "热结证，中医病证名。是指邪热伤津，燥实内结，使大肠传导失职， 腑气不通的证候。临床表现为腹满胀痛拒按，大便干结，或热结旁流，潮热，面赤， 口渴，小便短赤，舌苔黄燥，或焦黑起刺，脉沉实或洪数有力。",
          "type": "多选题"
        },
        {
          "id": 16457,
          "title": "便秘患者行穴位贴敷治疗，最常用的腹部上的穴位是？",
          "options": {
            "A": "关元穴",
            "B": "中脘穴",
            "C": "神阙穴",
            "D": "气海穴",
            "E": "梁门"
          },
          "answer": "C",
          "analysis": "穴位贴敷：将大黄等药物研磨成粉末加甘油或者醋调成糊状，取神阙穴、天枢、足三里等穴，每次贴敷 6~8 小时。",
          "type": "多选题"
        },
        {
          "id": 16458,
          "title": "哪种类型的虚秘患者适合多食益气润肠之品，如山药粥、扁豆粥等？",
          "options": {
            "A": "肠道气滞证",
            "B": "肠道热结证",
            "C": "津亏血少证",
            "D": "气虚秘",
            "E": "实秘"
          },
          "answer": "D",
          "analysis": "虚性便秘者多吃山药扁豆。在虚秘中，气虚秘的特点是虽有便意， 但排便困难，使劲用力则汗出气短，便后疲乏 ; 阳虚秘主要表现为大便干或不干， 排出困难，腹中冷痛。这两类人应少吃有顺气作用的食物，如佛手、萝卜、杏仁、 芥菜、橘子等 ; 宜多吃健脾、益气、润肠的食物，如山药、扁豆、无花果、胡桃、 芋头等。用胡萝卜、白术、甘薯煮粥，既是香甜可口之饭食，又是益气润肠之佳品。",
          "type": "多选题"
        },
        {
          "id": 16459,
          "title": "在下列便秘患者的护理措施中不正确的是？",
          "options": {
            "A": "观察患者每日排便情况：周期、次数，粪质的性状、颜色、气味等；患者患者伴随症状：如腹胀、腹痛等。",
            "B": "告知患者宜食具有润肠通便作用的食物和富含粗纤维的蔬菜和水果，多饮水，避免过食辛辣、煎炸之物，勿过度饮酒，亦不可过食寒凉生冷。 ",
            "C": "指导患者养成定时排便的习惯。",
            "D": "告知患者排便时勿努责。",
            "E": "告知患者服药方法、注意事项，如热秘者\"中药汤剂宜饭前空腹或睡前热服，虚证便秘者，中药汤剂宜空腹温服，气虚秘者，可多服用补气养阴的茶饮，如党参茶。 "
          },
          "answer": "E",
          "analysis": "热秘者中药汤剂宜饭前空腹或睡前凉服虚证便秘者，中药汤剂宜 空腹温服，气虚秘者，可多服用补气养阴的茶饮，如党参茶。",
          "type": "多选题"
        },
        {
          "id": 16460,
          "title": "下列对疼痛的认识，错误的是",
          "options": {
            "A": "疼痛是伴随现有的或潜在的组织损伤而产生的主观感受",
            "B": "疼痛是机体对有害刺激的一种保护性防御反应",
            "C": "疼痛的反应不受个体的文化程度、体质的敏感程度、耐受力等因素的影响",
            "D": "同样的组织损害或生理改变会引起不同程度的疼痛反应",
            "E": "疼痛是多种疾病的共有症状"
          },
          "answer": "C",
          "analysis": "疼痛的反应受个体的文化程度、体质的敏感程度、耐受力等因素 的影响，同样的组织损害或生理改变会引起不同程度的疼痛反应。",
          "type": "多选题"
        },
        {
          "id": 16461,
          "title": "下列对疼痛患者进评估时，望诊包括的内容有",
          "options": {
            "A": "舌苔、面容、体位等",
            "B": "患者是否呻吟",
            "C": "疼痛的时间和规律",
            "D": "喜按还是拒按",
            "E": "是否有便秘、恶心、呕吐、腹泻、头晕等"
          },
          "answer": "A",
          "analysis": "望诊包括的内容有疼痛部位皮肤、面容 ( 苍白、皱眉、咬唇等 )、 体位 ( 辗转不安、被迫体位 )、舌苔等。",
          "type": "多选题"
        },
        {
          "id": 16462,
          "title": "在对疼痛进行评估时，应询问疼痛的",
          "options": {
            "A": "部位",
            "B": "时间和规律    ",
            "C": "性质",
            "D": "程度",
            "E": "以上都包括"
          },
          "answer": "E",
          "analysis": "在对疼痛进行评估时，应询问疼痛的部位、时间和规律、性质、程度。",
          "type": "多选题"
        },
        {
          "id": 16463,
          "title": "下列哪项不是对疼痛性质的描述",
          "options": {
            "A": "刺痛 ",
            "B": "对称痛    ",
            "C": "灼痛",
            "D": "隐痛",
            "E": "压痛"
          },
          "answer": "B",
          "analysis": "疼痛的性质：刺痛、灼痛、隐痛、压痛、胀痛、绞痛。",
          "type": "多选题"
        },
        {
          "id": 16464,
          "title": "寒性疼痛的特点是",
          "options": {
            "A": "遇热痛甚，得寒痛减",
            "B": "遇寒痛甚，得温则减",
            "C": "痛而拒按",
            "D": "痛如针刺，固定不移",
            "E": "沉重酸痛，固定不移"
          },
          "answer": "B",
          "analysis": "寒性疼痛的特点为遇寒痛甚，得温则减。",
          "type": "多选题"
        },
        {
          "id": 16465,
          "title": "以下哪种证型属于实证失眠",
          "options": {
            "A": "心胆气虚",
            "B": "胃气失和",
            "C": "心脾两虚",
            "D": "心肾不交",
            "E": ""
          },
          "answer": "B",
          "analysis": "胃气失和证属于实证失眠：食滞不化，嗳腐酸臭，大便臭秽，纳 呆食少，舌红苔厚腻，脉心烦不寐，脘腹痞闷弦或滑数。",
          "type": "多选题"
        },
        {
          "id": 16466,
          "title": "以下选项中哪个是关于肺的正确描述？",
          "options": {
            "A": "主气司呼吸，主行水，朝百脉，主治节。为“五脏之华盖”",
            "B": "主运化水谷精微，输布津液，统摄血液。为“后天之本”",
            "C": "主藏精，主水，主纳气，主生殖，被称之为“先天之本”",
            "D": "主疏泄、主藏血、主筋华爪、开窍于目，",
            "E": ""
          },
          "answer": "A",
          "analysis": "肺主气司呼吸，主行水，朝百脉，主治节。肺为华盖 : 盖，即伞。 华盖，原指古代帝王的车盖。肺为华盖是指肺在体腔中位居最高，具有保护诸脏、 抵御外邪的作用。",
          "type": "多选题"
        },
        {
          "id": 16467,
          "title": "肺胀稳定期常见症状不正确的是？",
          "options": {
            "A": "咳嗽、咳痰",
            "B": "喘气、气短",
            "C": "失眠、多梦",
            "D": "自汗、盗汗",
            "E": ""
          },
          "answer": "C",
          "analysis": "肺胀稳定期常见症状有咳嗽、咳痰；喘气、气短；自汗、盗汗；纳呆、 腹胀。",
          "type": "多选题"
        },
        {
          "id": 16468,
          "title": "对于肺胀稳定期常见症状--喘气、气短症状，下列哪项护理方式不正确？",
          "options": {
            "A": "取合适体位，如高枕卧位、半卧位或端坐位，缓慢呼吸、全身肌肉放松",
            "B": "遵医嘱拔火罐，取阴谷穴、承山穴、太冲穴、上仙点穴",
            "C": "遵医嘱穴位贴敷，取大椎、定喘、肺俞、天突等穴",
            "D": "遵医嘱穴位按摩，取列缺、内关、气海、光元等穴",
            "E": ""
          },
          "answer": "B",
          "analysis": "拔火罐不适用于喘气、气短症状。",
          "type": "多选题"
        },
        {
          "id": 16469,
          "title": "下列哪本专著，开创了腹痛诊治先河",
          "options": {
            "A": "《金匮要略-腹满寒疝宿食病脉证洽》",
            "B": "《灵枢》",
            "C": "《素问•气交变大论》",
            "D": "《血证论》",
            "E": "《伤寒论》"
          },
          "answer": "A",
          "analysis": "《金匮要略—腹满寒疝宿食病脉证洽》对腹痛的辨证论治作了较 为全面的论述，对脾胃虚寒、水湿内停证及寒邪攻冲证分别提出用附子粳米汤及 大建中汤治疗等，开创了腹痛诊治先河。",
          "type": "多选题"
        },
        {
          "id": 16470,
          "title": "腹胀腹痛艾灸原则：“先阳后阴”的意恩是",
          "options": {
            "A": "指先灸上面的穴位后灸下面的穴位",
            "B": "指初灸者灸量宜先小后大，以便身体能逐渐适应",
            "C": "先灸前胸的穴位，再灸后背上的穴位 ，后背属阴，前胸属阳。",
            "D": "指初灸者灸量宜先大后小，以便身体能逐渐适应",
            "E": "先灸后背上的穴位，再灸前胸的穴 ，后背属阳，前胸属阴。"
          },
          "answer": "E",
          "analysis": "“先阳后阴”的意恩是先灸后背上的穴位，再灸前胸的穴位。 后背属阳前胸属阴。",
          "type": "多选题"
        },
        {
          "id": 16471,
          "title": "老人、小孩、体弱者在开四穴前要先刮经络是",
          "options": {
            "A": "三焦经、小肠经、心经",
            "B": "肺经、大肠经、小肠经",
            "C": "心经、心包经、肺经",
            "D": "肺经、三焦经、心经",
            "E": "肺经、心包经、小肠经"
          },
          "answer": "C",
          "analysis": "老人、小孩、体弱者在开四穴前要先刮心经、心包经、肺经稳定上焦。",
          "type": "多选题"
        },
        {
          "id": 16472,
          "title": "虎符铜砭刮痧首开的四穴是",
          "options": {
            "A": "大椎、大杼、风门、神堂",
            "B": "大椎、肺俞、膏肓、神堂",
            "C": "大椎、大杼、膏肓、心俞",
            "D": "大椎、大杼、膏肓、神堂",
            "E": "肩井、大杼、膏肓、神堂"
          },
          "answer": "D",
          "analysis": "虎符铜砭刮痧首开的四穴是大椎穴、大杼穴、膏肓穴、神堂穴。",
          "type": "多选题"
        },
        {
          "id": 16473,
          "title": "骨痹中寒湿痹阻证的疼痛特点为？",
          "options": {
            "A": "关节酸痛，得热痛减，遇寒痛增",
            "B": "关节隐隐作痛",
            "C": "关节刺痛，痛处固定",
            "D": "关节疼痛，痛处不定",
            "E": "关节肿胀疼痛，活动时加重"
          },
          "answer": "A",
          "analysis": "寒湿痹阻证：肢体关节酸痛，或关节局部肿胀，屈伸不利，局部畏寒，皮色不红，触之不热，得热痛减，遇寒痛增，活动时疼痛加重 ; 或伴腰膝酸软，四肢乏力 ; 或纳食欠佳，大便溏薄，小便清长。舌苔薄白或白滑。",
          "type": "多选题"
        },
        {
          "id": 16474,
          "title": "骨痹的常见临床症状包括哪几项？",
          "options": {
            "A": "关节疼痛",
            "B": "关节肿胀",
            "C": "关节刺痛",
            "D": "屈伸不利",
            "E": "腰膝酸软"
          },
          "answer": "A#B#D",
          "analysis": "主要症状为关节疼痛，常为休息痛，表现为休息后出现疼痛，活 动片刻即缓解，但活动过多后，疼痛又加剧。另一症状是关节僵硬，常出现在早 晨起床时或白天关节长时间保持一定体位后。检查受累关节可见关节肿胀、压痛， 活动时有摩擦感或“咔嗒”声，病情严重者可有肌肉萎缩及关节畸形。",
          "type": "多选题"
        },
        {
          "id": 16475,
          "title": "关节疼痛时不适宜选择的中医护理操作为？",
          "options": {
            "A": "中药塌渍",
            "B": "穴位贴敷",
            "C": "耳穴贴压",
            "D": "腕踝针",
            "E": "刮痧"
          },
          "answer": "E",
          "analysis": "关节疼痛时不适宜选择的中医护理操作为刮痧。",
          "type": "多选题"
        },
        {
          "id": 16476,
          "title": "关节肿胀时不适宜进行的中医操作为？",
          "options": {
            "A": "中药塌渍",
            "B": "穴位贴敷",
            "C": "耳穴贴压",
            "D": "中药熏蒸",
            "E": "刮痧"
          },
          "answer": "E",
          "analysis": "关节肿胀时不适宜进行的中医操作为刮痧。",
          "type": "多选题"
        },
        {
          "id": 16477,
          "title": "慢性肾衰根本病机是？",
          "options": {
            "A": "肾元虚衰，水毒潴留",
            "B": "感受外邪，劳倦过度",
            "C": "劳倦过度，饮食不当",
            "D": "肾元亏虚，脾阳不足",
            "E": "湿浊内蕴，水湿泛滥"
          },
          "answer": "A",
          "analysis": "慢性肾衰根本病机为肾元虚衰，水毒潴留。",
          "type": "多选题"
        },
        {
          "id": 16478,
          "title": "慢性肾衰病位主要是？",
          "options": {
            "A": "脾 肾",
            "B": "肺 肾",
            "C": "肾",
            "D": "肺 脾 肾",
            "E": "肝 脾 肾"
          },
          "answer": "C",
          "analysis": "“慢性肾脏病都是内伤，伤甚为虚，虚极为劳”“最严重的要说 是肾劳”，邹云翔先生所说的“肾劳”即指慢性肾衰竭的严重状态，其病机为气 血阴阳俱虚，五脏俱损，以肾为主。",
          "type": "多选题"
        },
        {
          "id": 16479,
          "title": "慢性肾衰标实兼证主要病机是",
          "options": {
            "A": "水气",
            "B": "湿热",
            "C": "湿浊内蕴",
            "D": "血瘀",
            "E": "肝风"
          },
          "answer": "C",
          "analysis": "慢性肾衰标实兼证主要病机是湿浊内蕴。",
          "type": "多选题"
        },
        {
          "id": 16480,
          "title": "患者倦怠乏力，气短懒言，食少纳呆，脘腹胀满，腰酸膝软，口淡不渴，大便不实，舌淡有齿痕，脉细弱，该患者证型是？",
          "options": {
            "A": "脾肾阳虚证",
            "B": "气阴两虚证",
            "C": "阴阳两虚证",
            "D": "肝肾阴虚证",
            "E": "脾肾气虚证"
          },
          "answer": "E",
          "analysis": "脾肾气虚主症：倦怠乏力 ; 食少纳呆 ; 舌淡有齿痕。次症：气短懒言 ; 腰膝酸软 ; 大便不实。其他：脘腹胀满 ; 自汗易感 ; 口淡不渴 ; 脉沉细。",
          "type": "多选题"
        },
        {
          "id": 16481,
          "title": "慢性肾衰的护治原则是？",
          "options": {
            "A": "固护脾胃",
            "B": "扶正祛邪",
            "C": "泄浊和络",
            "D": "活血化瘀",
            "E": "维护肾气"
          },
          "answer": "B",
          "analysis": "慢性肾衰的护治原则是扶正祛邪。",
          "type": "多选题"
        },
        {
          "id": 16482,
          "title": "慢性肾衰综合调护是？",
          "options": {
            "A": "病情观察",
            "B": "起居调护",
            "C": "辨证施膳",
            "D": "康复护理",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "慢性肾衰综合调护有病情观察、起居调护、辨证施膳、康复护理。",
          "type": "多选题"
        },
        {
          "id": 16483,
          "title": "干预慢性肾衰脾肾阳虚证水肿首选中医特色技术是？",
          "options": {
            "A": "灸法",
            "B": "耳穴压豆",
            "C": "耳尖放血",
            "D": "揿针",
            "E": "腕踝针"
          },
          "answer": "A",
          "analysis": "灸法适应症：腰膝酸软、倦怠乏力、水肿、恶心呕吐 , 畏寒肢冷 等症状。",
          "type": "多选题"
        },
        {
          "id": 16484,
          "title": "慢性肾衰饮食护理基本的要求是？",
          "options": {
            "A": "高蛋白、低脂、低磷，高热量、高必需氨基酸",
            "B": "低蛋白、低脂、高磷、高必需氨基酸",
            "C": "高蛋白、低脂、低磷，高热量、低必需氨基酸",
            "D": "优质低蛋白、低脂、低磷，高热量、高必需氨基酸",
            "E": "优质低蛋白、低脂、高磷，高热量、高必需氨基酸"
          },
          "answer": "D",
          "analysis": "三低二高，低蛋白、低脂、低磷，高热量、高必需氨基酸。",
          "type": "多选题"
        },
        {
          "id": 16485,
          "title": "用于慢性肾衰肾虚湿热证的食疗方是？",
          "options": {
            "A": "赤小豆冬瓜煲黑鱼",
            "B": "当归枸杞炖排骨",
            "C": "黄芪炖羊肉",
            "D": "枸杞羊肉汤",
            "E": "当归羊肉汤"
          },
          "answer": "A",
          "analysis": "慢性肾衰肾虚湿热证的食疗方是赤小豆冬瓜煲黑鱼。",
          "type": "多选题"
        },
        {
          "id": 16486,
          "title": "以少尿甚或无尿，或以精神萎靡，面色无华，口有尿味等为常见症状的疾病是？",
          "options": {
            "A": "慢肾风",
            "B": "腰痛",
            "C": "慢性肾衰",
            "D": "淋证",
            "E": "水肿"
          },
          "answer": "C",
          "analysis": "慢性肾衰是指由肾病日久，致肾气衰竭，气化失司 , 湿浊尿毒不 得下泄，以少尿甚或无尿，或以精神萎靡，面色无华，口有尿味等为常见症状的 疾病。",
          "type": "多选题"
        },
        {
          "id": 16487,
          "title": "对不寐进行脏腑辨证施护时，以下辨证正确的是",
          "options": {
            "A": "心烦易惊，多梦而不寐者，多归心、胆 ",
            "B": "胸闷痰多，脘闷苔腻而不寐，多为心、肾",
            "C": "急躁易怒而不寐，多为脾、胃",
            "D": "心烦心悸，头晕健忘而不寐，多为心、肝",
            "E": ""
          },
          "answer": "A",
          "analysis": "心虚胆怯，心胆气虚，多见心烦易惊，多梦而不寐归心、胆。",
          "type": "多选题"
        },
        {
          "id": 16488,
          "title": "“告之以其败，语之以其善，导之以其所便，开之以其所苦”属于情志护理中的",
          "options": {
            "A": "情志相胜法",
            "B": "说理开导法",
            "C": "移情易性法",
            "D": "顺情从志法",
            "E": ""
          },
          "answer": "B",
          "analysis": "说理开导 : 告之以其败，语之以其善，导之以其所便，开之以其 所苦 ( 辨证施言 )。",
          "type": "多选题"
        },
        {
          "id": 16489,
          "title": "水肿的病位在 ",
          "options": {
            "A": "肺、脾、肾",
            "B": "心、肝、肾",
            "C": "肝、脾、肾",
            "D": "心、肺、肾",
            "E": "心、脾、肾"
          },
          "answer": "A",
          "analysis": "故其本在肾，其末在肺诸湿肿满，皆属于脾。",
          "type": "多选题"
        },
        {
          "id": 16490,
          "title": "不属于风水泛滥型水肿的症状是             ",
          "options": {
            "A": "眼睑浮肿，继则四肢及全身水肿",
            "B": "小便通利",
            "C": "来势迅速",
            "D": "发热恶风",
            "E": "肢节酸痛"
          },
          "answer": "B",
          "analysis": "风水泛滥型水肿的症状为主证 : 眼睑浮肿，继而四肢及全身水肿， 来势迅速。兼证 : 发热恶风，肢节酸痛，小便不利，或伴风热、风寒表证。",
          "type": "多选题"
        },
        {
          "id": 16491,
          "title": "不符合湿毒浸淫型水肿的描述是",
          "options": {
            "A": "眼睑水肿，延及全身",
            "B": "尿少色赤",
            "C": "身患疮痍",
            "D": "伴恶风发热",
            "E": "苔白腻，脉浮数"
          },
          "answer": "E",
          "analysis": "湿毒浸淫型水肿主证 : 眼睑浮肿，延及全身，尿少色赤。兼证 : 身 发疮痍，甚则溃烂，伴恶风发热。苔脉 : 舌质红，苔黄，脉浮数或滑数。",
          "type": "多选题"
        },
        {
          "id": 16492,
          "title": "哪项不是水肿的病因病机",
          "options": {
            "A": "风邪袭表",
            "B": "疮毒内犯",
            "C": "饮食不节",
            "D": "外感水湿",
            "E": "情志失调"
          },
          "answer": "E",
          "analysis": "水肿的病因病机包括风邪袭表、疮毒内犯、饮食不节、外感水湿。",
          "type": "多选题"
        },
        {
          "id": 16493,
          "title": "关于阳水特点的描述错误的是？",
          "options": {
            "A": "发病急",
            "B": "肿多从头面部开始",
            "C": "病性为表证、实证",
            "D": "肤色萎黄或会晦暗",
            "E": "肿处皮肤按之凹陷即起"
          },
          "answer": "D",
          "analysis": "阳水的特点：发病急，肿多于头面部开始由上而下，肿处皮肤绷 急光亮按之凹陷即起。",
          "type": "多选题"
        },
        {
          "id": 16494,
          "title": "风湿痹阻宜食（）食品",
          "options": {
            "A": "温经散寒",
            "B": "祛风除湿",
            "C": "清热祛湿",
            "D": "活血化瘀",
            "E": "补益气血"
          },
          "answer": "B",
          "analysis": "风湿痹阻 : 宜食祛风除湿、通络止痛的食品，如鱼、薏苡仁、木 瓜樱桃等。食疗方 : 薏仁粥、葱豉汤。",
          "type": "多选题"
        },
        {
          "id": 16495,
          "title": "尪痹共有（）种证型",
          "options": {
            "A": "5种",
            "B": "6种",
            "C": "7种",
            "D": "4种",
            "E": "8种"
          },
          "answer": "B",
          "analysis": "尪痹分为以下六种证型 : 风湿痹阻证、痰瘀痹阻证、寒湿痹阻证、 湿热痹阻证、气血两虚证、肝肾不足证。",
          "type": "多选题"
        },
        {
          "id": 16496,
          "title": "下列哪些是胃脘痛（慢性胃炎）的基本证型？",
          "options": {
            "A": "肝胃气滞证",
            "B": "肝胃郁热证",
            "C": "脾胃气虚证",
            "D": "脾胃虚寒证",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "以上都属于胃脘痛（慢性胃炎）的基本证型。",
          "type": "多选题"
        },
        {
          "id": 16497,
          "title": "下列不是肝胃郁热证的主要症状的是？",
          "options": {
            "A": "胃脘部灼痛",
            "B": "心烦易怒",
            "C": "舌质红苔黄",
            "D": "四肢湿冷",
            "E": "大便干燥"
          },
          "answer": "D",
          "analysis": "肝胃郁热证 : 胃脘饥嘈不适或灼痛，心烦易怒，嘈杂反酸，口干口苦， 大便干燥。舌质红苔黄，脉弦或弦数。",
          "type": "多选题"
        },
        {
          "id": 16498,
          "title": "自然界的五行包括",
          "options": {
            "A": "升",
            "B": "长",
            "C": "化",
            "D": "收",
            "E": "藏"
          },
          "answer": "A#B#C#D#E",
          "analysis": "自然界的五行：升长化收藏。",
          "type": "多选题"
        },
        {
          "id": 16499,
          "title": "针对足三里下列说法正确的是：",
          "options": {
            "A": "足阳明胃经穴位",
            "B": "调理脾胃",
            "C": "补中益气",
            "D": "止痛",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "足三里：足阳明胃经主穴，调理脾胃、补中益气、对胃痛胃胀效 果显著。",
          "type": "多选题"
        },
        {
          "id": 16500,
          "title": "脾胃湿热证患者不可以吃哪些食物？",
          "options": {
            "A": "赤小豆",
            "B": "马齿苋",
            "C": "百合",
            "D": "羊肉",
            "E": "荸荠"
          },
          "answer": "D",
          "analysis": "脾胃湿热证 : 进食清热除湿的食物，如荸荠、百合、马齿苋、赤小豆等。",
          "type": "多选题"
        },
        {
          "id": 16501,
          "title": "胃脘痛慢性胃炎中医辨证分型错误的一项是？",
          "options": {
            "A": "肝胃气滞证",
            "B": "肝胃郁热证",
            "C": "脾胃湿热证",
            "D": "脾胃气滞证",
            "E": ""
          },
          "answer": "D",
          "analysis": "胃脘痛（慢性胃炎）中医辨证分型不包括脾胃气滞证。",
          "type": "多选题"
        },
        {
          "id": 16502,
          "title": "关于肝胃郁热证的症状错误的是？",
          "options": {
            "A": "口干口苦",
            "B": "大便干燥",
            "C": "嘈杂反酸",
            "D": "嗳气频作",
            "E": ""
          },
          "answer": "D",
          "analysis": "肝胃郁热证 : 胃脘饥嘈不适或灼痛，心烦易怒，嘈杂反酸，口干口苦， 大便干燥。舌质红苔黄，脉弦或弦数。",
          "type": "多选题"
        },
        {
          "id": 16503,
          "title": "刮痧手法中的补法用于什么证型的患者？",
          "options": {
            "A": "虚证",
            "B": "实证",
            "C": "热证",
            "D": "寒证",
            "E": "以上都是"
          },
          "answer": "A",
          "analysis": "补法 : 用于虚证，刮拭按压力小，速度慢，激发正气。",
          "type": "多选题"
        },
        {
          "id": 16504,
          "title": "糖尿病患者最佳的运动时间是？",
          "options": {
            "A": "空腹",
            "B": "餐后",
            "C": "晨起",
            "D": "餐后1小时运动（从第一口饭算起）",
            "E": "以上都是"
          },
          "answer": "D",
          "analysis": "餐后 1 小时运动最佳 ( 从第一口饭算起 )。",
          "type": "多选题"
        },
        {
          "id": 16505,
          "title": "糖尿病患者为什么运动后要监测血糖？",
          "options": {
            "A": "警惕迟发型低血糖",
            "B": "医嘱要求",
            "C": "了解药效",
            "D": "警惕高血糖",
            "E": "以上都是"
          },
          "answer": "A",
          "analysis": "在剧烈、持久运动后，血糖可持续下降 4~10 小时，警迟发型低血糖。",
          "type": "多选题"
        },
        {
          "id": 16506,
          "title": "胸痹的病名最早见于？",
          "options": {
            "A": "金匮要略",
            "B": "五十二病方",
            "C": "内经",
            "D": "证治准绳",
            "E": "世医得效方"
          },
          "answer": "A",
          "analysis": "“胸痹”的病名，最早见于汉代张仲景《金匮要略》。",
          "type": "多选题"
        },
        {
          "id": 16507,
          "title": "下列各项，不属胸痹病因的是？",
          "options": {
            "A": "寒邪内侵",
            "B": "心虚胆怯",
            "C": "饮食失调",
            "D": "情志失节",
            "E": "年迈体虚"
          },
          "answer": "B",
          "analysis": "胸痹病因有：寒邪内侵、饮食失调、情志失节、年迈体虚、劳倦内伤。",
          "type": "多选题"
        },
        {
          "id": 16508,
          "title": "中医病因学中的外因，其中六淫为",
          "options": {
            "A": "风冷热湿燥火",
            "B": "寒热虚实表里",
            "C": "风气湿毒邪疫",
            "D": "暑湿寒风火燥",
            "E": ""
          },
          "answer": "D",
          "analysis": "六淫为暑湿寒风火燥。",
          "type": "多选题"
        },
        {
          "id": 16509,
          "title": "胸痹心痛病在心痛缓解期，辨证分型不包括",
          "options": {
            "A": "痰阻血瘀证",
            "B": "寒凝血瘀证",
            "C": "气滞血瘀证",
            "D": "热毒血瘀证",
            "E": "气虚血瘀证"
          },
          "answer": "B",
          "analysis": "胸痹心痛病在心痛缓解期，辨证分型包括痰阻血瘀证、气滞血瘀证、 热毒血瘀证、气虚血瘀证、心血瘀阻证。",
          "type": "多选题"
        },
        {
          "id": 16510,
          "title": "眩晕（原发性高血压）的病变与下列哪些脏腑相关（多选）",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "肝",
            "D": "脾",
            "E": "肾"
          },
          "answer": "A#C#D#E",
          "analysis": "病位 : 在头窍，病变脏腑与心、肝、脾、肾相关。",
          "type": "多选题"
        },
        {
          "id": 16511,
          "title": "眩晕（原发性高血压）常见辨证分型包括：",
          "options": {
            "A": "肾气亏虚",
            "B": "痰瘀互结",
            "C": "肝火亢盛",
            "D": "阴虚阳亢",
            "E": "以上全对"
          },
          "answer": "E",
          "analysis": "眩晕（原发性高血压）常见辨证分型包括肾气亏虚证、痰瘀互结证、 肝火亢盛证、阴虚阳亢证。",
          "type": "多选题"
        },
        {
          "id": 16512,
          "title": "目前提出眩晕的主要病因不包括",
          "options": {
            "A": "风",
            "B": "痰",
            "C": "虚",
            "D": "火",
            "E": "寒"
          },
          "answer": "E",
          "analysis": "目前提出眩晕的病因主要为风、痰、虚、火、瘀。",
          "type": "多选题"
        },
        {
          "id": 16513,
          "title": "眩晕痰瘀阻窍证患者饮食指导错误的是",
          "options": {
            "A": "宜食活血通络、化痰开窍之品",
            "B": "宜食活血通络、化痰开窍之品",
            "C": "车前子粳米粥",
            "D": "橙子、红豆",
            "E": "甲鱼、枸杞、银耳"
          },
          "answer": "E",
          "analysis": "痰瘀阻窍食疗 : 宜食活血通络、化痰开窍之品。如西瓜、冬瓜、橙子、 红豆等。车前子粳米粥。",
          "type": "多选题"
        },
        {
          "id": 16514,
          "title": "眩晕风痰上扰证治疗和护理原则为",
          "options": {
            "A": "镇肝熄风，滋阴潜阳",
            "B": "补肾填精，充养脑髓",
            "C": "祛风化痰、健脾和胃",
            "D": "平肝潜阳，清肝泻火",
            "E": "活血通络，化痰开窍"
          },
          "answer": "C",
          "analysis": "眩晕风痰上扰证治疗和护理原则为祛风化痰、健脾和胃。",
          "type": "多选题"
        },
        {
          "id": 16515,
          "title": "下列不属于眩晕的护理措施为",
          "options": {
            "A": "观察眩晕发作的频次、程度、持续时间、诱发因素",
            "B": "眩晕发作时应卧床休息，改变体位时应动作缓慢",
            "C": "眩晕而昏仆不省人事，并立即报告医师",
            "D": "若眩晕加重伴有呕吐、视物模糊、语言蹇涩、肢体麻木或行动不便者，要立即报告医师，配合诊治抢救",
            "E": "眩晕发作时不用观察血压的变化"
          },
          "answer": "E",
          "analysis": "眩晕的护理措施为 1. 观察眩晕发作的频次、程度、持续时间、诱 发因素 2. 眩晕发作时应卧床休息，改变体位时应动作缓慢 3. 眩晕而昏仆不省人事， 并立即报告医师 4. 若眩晕加重伴有呕吐、视物模糊、语言蹇涩、肢体麻木或行动 不便者，要立即报告医师，配合诊治抢救。",
          "type": "多选题"
        },
        {
          "id": 16516,
          "title": "耳穴综合治疗包括",
          "options": {
            "A": "耳穴按摩法",
            "B": "耳轮放血法",
            "C": "耳廓刮痧法",
            "D": "耳穴贴压法",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "耳穴综合治疗 : 是将耳穴按摩法、耳轮放血法、耳刮痧法、耳穴 贴压法等综合操作技术，通过神经与经络的传感效应，调整内在脏腑与气血失调、 清脑明目、改善情绪达到治疗效果。",
          "type": "多选题"
        },
        {
          "id": 16517,
          "title": "腰推间盘突出症，出现鞍区麻木及二便功能障碍时，通常是因为突出间盘压迫了",
          "options": {
            "A": "脊髓腰膨大部大",
            "B": "脊髓圆锥",
            "C": "马尾神经",
            "D": "骶1神经根",
            "E": "骶2神经根"
          },
          "answer": "C",
          "analysis": "腰椎间盘突出症中，当患者出现鞍区（会阴部）麻木以及二便（大 小便）功能障碍时，这通常是由于突出的椎间盘压迫到了马尾神经。马尾神经是 指在脊髓末端向下延伸出的一束神经根，在腰椎和骶椎水平穿过。",
          "type": "多选题"
        },
        {
          "id": 16518,
          "title": "腰椎间盘突出症的典型症状是",
          "options": {
            "A": "腰背痛",
            "B": "下肢无力",
            "C": "腰痛伴坐骨神经痛",
            "D": "坐骨神经痛",
            "E": "腰部活动受限"
          },
          "answer": "C",
          "analysis": "腰椎间盘突出症的典型症状包括但不限于腰痛、坐骨神经痛、感 觉异常、肌肉无力、反射改变。",
          "type": "多选题"
        },
        {
          "id": 16519,
          "title": "不属于拔罐注意事项的是 ",
          "options": {
            "A": "病室温度适宜 , 避免直接吹风 , 防止受凉",
            "B": "拔罐时动作要稳、准、慢 ",
            "C": " 拔罐中应注意询问患者的感觉 , 观察局部情况",
            "D": "拔罐时应取合理、舒适的体位   ",
            "E": "拔罐过程中，体位切勿移动，以免罐体脱落"
          },
          "answer": "B",
          "analysis": "拔罐时动作要稳、准、快。慢不属于拔罐注意事项。",
          "type": "多选题"
        },
        {
          "id": 16520,
          "title": "下列哪项不是穴位贴敷的禁忌症",
          "options": {
            "A": "哮喘持续状态",
            "B": "精神病患者",
            "C": "糖尿病",
            "D": "4岁儿童",
            "E": "反复发作的呼吸道感染"
          },
          "answer": "D",
          "analysis": "穴位贴敷的禁忌症有哮喘持续状态、精神病患者、糖尿病、反复 发作的呼吸道感染。",
          "type": "多选题"
        },
        {
          "id": 16521,
          "title": "腰椎前屈的正常幅度是",
          "options": {
            "A": "120º",
            "B": "160º",
            "C": "90º",
            "D": "60º",
            "E": "30º"
          },
          "answer": "C",
          "analysis": "腰椎前屈的正常幅度是 90°。",
          "type": "多选题"
        },
        {
          "id": 16522,
          "title": "下列哪项不是腰痛的病因病机",
          "options": {
            "A": "感受寒湿",
            "B": "肾虚体亏",
            "C": "闪挫撞击",
            "D": "气滞血瘀",
            "E": "饮食不节"
          },
          "answer": "E",
          "analysis": "腰痛的病因病机有感受寒湿、肾虚体亏、闪挫撞击、气滞血瘀。",
          "type": "多选题"
        },
        {
          "id": 16523,
          "title": "循行于背部正中线的是",
          "options": {
            "A": "冲脉",
            "B": "仁脉",
            "C": "督脉",
            "D": "肾经",
            "E": "膀胱经"
          },
          "answer": "C",
          "analysis": "循行于背部正中线的是督脉。",
          "type": "多选题"
        },
        {
          "id": 16524,
          "title": "下列哪项是中风（脑梗死恢复期）最常见的临床症状？",
          "options": {
            "A": "便秘",
            "B": "吞咽困难",
            "C": "舌强语謇",
            "D": "半身不遂",
            "E": "二便失禁"
          },
          "answer": "D",
          "analysis": "中风（脑梗死恢复期）最常见的临床症状之一是运动功能障碍，尤其是偏瘫。偏瘫指的是身体一侧的肌肉力量减弱或丧失，这通常是由于大脑的一侧 受损导致对侧身体控制能力下降所引起的。患者可能难以移动受影响的手臂、腿部， 甚至面部肌肉。",
          "type": "多选题"
        },
        {
          "id": 16525,
          "title": "将中风患者由床上转移到轮椅上，以下操作不正确的是？",
          "options": {
            "A": "患臂置于胸前。",
            "B": "患者健手、健足作为支撑。",
            "C": "协助者左腿置于患者双腿之间，前后跨步稳定重心，右腿屈膝顶住患者患肢膝部。",
            "D": "协助者双手抓住患者腋下，以患者健足为轴转至背靠椅背。",
            "E": "确认双腿后侧贴近椅子后正对椅子坐下。"
          },
          "answer": "D",
          "analysis": "D 不正确正确的为：协助者双手抓住患者裤腰，抬起患者臀部以 患者健足为轴转至背靠椅背。",
          "type": "多选题"
        },
        {
          "id": 4401,
          "title": "中医护理学的基本特点是()",
          "options": {
            "A": "阴阳五行",
            "B": "藏象理论",
            "C": "气血津液",
            "D": "辨证施护",
            "E": "未病先防"
          },
          "answer": "D",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 4404,
          "title": "在下列中医护理原则中，“急则护标”属于（   ）",
          "options": {
            "A": "扶正祛邪",
            "B": "护病求本",
            "C": "标本缓急",
            "D": "调整阴阳",
            "E": "三因制宜"
          },
          "answer": "C",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 4406,
          "title": "在下列中医护理原则中，因地域季节不同采取不同护理措施属于( )",
          "options": {
            "A": "扶正祛邪",
            "B": "护病求本",
            "C": "标本缓急",
            "D": "调整阴阳",
            "E": "三因制宜"
          },
          "answer": "E",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 6801,
          "title": "提出“六气病源”说，谓“六气，曰阴、阳、风、雨、晦、明”，被称为病因理论的创始人是",
          "options": {
            "A": "张仲景",
            "B": "葛洪",
            "C": "巢元方",
            "D": "医和",
            "E": ""
          },
          "answer": "D",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 6802,
          "title": "提出“三因学说”的是：",
          "options": {
            "A": "内经",
            "B": "难经",
            "C": "陈无择",
            "D": "张仲景",
            "E": ""
          },
          "answer": "C",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 6803,
          "title": "《内经》中阴阳分类法，生于阳（　　）",
          "options": {
            "A": "得之风雨寒暑",
            "B": "得之饮食居处，阴阳喜怒",
            "C": "得之七情",
            "D": "得之阴阳喜怒",
            "E": ""
          },
          "answer": "A",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 6804,
          "title": "《内经》中三部分类法，喜怒不节则伤",
          "options": {
            "A": "脏",
            "B": "腑",
            "C": "上",
            "D": "下",
            "E": ""
          },
          "answer": "A",
          "analysis": "",
          "type": "多选题"
        },
        {
          "id": 11873,
          "title": "中医学的基本特点，主要是？",
          "options": {
            "A": "阴阳五行与脏象经络",
            "B": "整体观念与辨证论治",
            "C": "以五脏为主的整体观",
            "D": "望闻问切与辨证论治",
            "E": "辨证求因与审因论治"
          },
          "answer": "B",
          "analysis": "中医学理论体系的主要特点，包括整体观念和辨证论治两个方面。故选B。",
          "type": "多选题"
        },
        {
          "id": 11874,
          "title": "我国现存中医学最早的一部典籍是？",
          "options": {
            "A": "《伤寒杂病论》",
            "B": "《黄帝内经》",
            "C": "《难经》",
            "D": "《神农本草经》",
            "E": "《温疫论》"
          },
          "answer": "B",
          "analysis": "《黄帝内经》简称《内经》，为中医学现存最早的经典著作，本书分为《素问》和《灵枢》两部，约成书于战国至秦汉时期。故选B。",
          "type": "多选题"
        },
        {
          "id": 11875,
          "title": "中医学中成功运用辨证论治的第一部专著是？",
          "options": {
            "A": "《难经》",
            "B": "《黄帝内经》",
            "C": "《伤寒杂病论》",
            "D": "《神农本草经》",
            "E": "《小儿药证直诀》"
          },
          "answer": "C",
          "analysis": "《伤寒杂病论》张机（字仲景）所著，成书于东汉，为中医学第一部辨证论治的专著。故选C。",
          "type": "多选题"
        },
        {
          "id": 11876,
          "title": "人是一个有机的整体,其中心是？",
          "options": {
            "A": "五脏",
            "B": "六腑",
            "C": "经络",
            "D": "命门",
            "E": "脑"
          },
          "answer": "A",
          "analysis": "人体以五脏为中心，配合六腑、形体、官窍，通过经络系统的联系作用，构成了心、肝、脾、肺、肾五个生理系统。故选A。",
          "type": "多选题"
        },
        {
          "id": 11877,
          "title": "中医学关于“证”的概念是？",
          "options": {
            "A": "对阴阳气血失调临床表现的概括",
            "B": "对疾病症状与体征的鉴别概括",
            "C": "对疾病表现症状的综合概括",
            "D": "对疾病症状与体征的分析概括",
            "E": "对疾病发展过程中某一阶段的病理概括"
          },
          "answer": "E",
          "analysis": "证，即证候，是指疾病发展过程中某一个阶段的病理属性的概括。故选E。",
          "type": "多选题"
        },
        {
          "id": 11878,
          "title": "阴阳的最初含义是",
          "options": {
            "A": "日月",
            "B": "动静",
            "C": "气候寒暖",
            "D": "日光向背",
            "E": "水火"
          },
          "answer": "D",
          "analysis": "阴阳的最初含义是日光的向背，其余四项阴阳的相对表现，故选D。",
          "type": "多选题"
        },
        {
          "id": 11879,
          "title": "阴阳的属性是",
          "options": {
            "A": "相对的",
            "B": "不变的",
            "C": "绝对的",
            "D": "量变的",
            "E": "质变的"
          },
          "answer": "A",
          "analysis": "阴阳的属性是相对的，故选A。",
          "type": "多选题"
        },
        {
          "id": 11880,
          "title": "下列哪一项，不属于阴阳互根的关系",
          "options": {
            "A": "阳在外，阴之使也",
            "B": "孤阴不生，独阳不长",
            "C": "阴在内，阳之守也",
            "D": "重阴必阳，重阳必阴",
            "E": "阴损及阳，阳损及阴"
          },
          "answer": "D",
          "analysis": "“孤阴不生，独阳不长”、“阴损及阳，阳损及阴”、“阳在外，阴之使也”、“阴在内，阳之守”都属于互根；“重阴必阳，重阳必阴”属于阴阳的相互转化，不属于阴阳互根，故选D。",
          "type": "多选题"
        },
        {
          "id": 11881,
          "title": "阴阳交感是指",
          "options": {
            "A": "阴阳二气的运动",
            "B": "阴阳二气的和谐状态",
            "C": "阴阳二气相互对立的状态",
            "D": "阴阳二气相互感应",
            "E": "阴阳二气在运动中相互感应而交合的过程"
          },
          "answer": "E",
          "analysis": "阴阳交感是指阴阳二气在运动中相互感应而交合的过程，E选项与原文符合，故选E。",
          "type": "多选题"
        },
        {
          "id": 11882,
          "title": "患者男，30岁。胃脘部冷痛，遇寒加重，或得温则减，口淡不渴，便泻清稀，形寒肢冷，舌苔白润，脉沉紧。按阴阳学说分析，该患者属于",
          "options": {
            "A": "寒证",
            "B": "虚证",
            "C": "热证",
            "D": "实证",
            "E": "里证"
          },
          "answer": "A",
          "analysis": "寒证的临床表现为恶寒肢冷,神疲乏力，口淡喜热饮,面白舌淡,尿清便溏,脉沉迟或细弱等。热证的临床表现为身体发热、口渴、舌头红、大便秘结甚至烦躁不安、脉搏增快发热。表证的临床特点包括多感受六淫、疫疠等邪气;以恶寒发热、脉浮为主要临床表现;内部脏腑症状不明显;具有起病急、病位浅、病程短的特点。里证临床症状特点包括病程长、病势重、不恶风寒、脏腑功能失调等。虚证临床表现为面部唇色发白,颜色比较淡,神疲乏力,体倦,心悸,气短,自汗或者盗汗,大便比较稀,小便频数,舌嫩无苔,脉细弱,无力等。该患者胃脘部冷痛，遇寒加重，或得温则减，口淡不渴，便泻清稀，形寒肢冷，舌苔白润，脉沉紧。按阴阳学说分析，该患者属于寒症，故选A。",
          "type": "多选题"
        },
        {
          "id": 11902,
          "title": "“热者寒之”的治疗方法主要适用于",
          "options": {
            "A": "实寒证",
            "B": "实热证",
            "C": "虚寒证",
            "D": "虚热证",
            "E": "表实证"
          },
          "answer": "B",
          "analysis": "实寒证治疗方法为“寒者热之”；虚寒证的治疗方法“扶阳袪寒调经”；虚热证治法“滋阴降火”；表实证治宜补里兼及解表；“热者寒之”的治疗方法主要适用于实热证，故选B。",
          "type": "多选题"
        },
        {
          "id": 11903,
          "title": "“阳病治阴”的方法适用于",
          "options": {
            "A": "阳偏盛",
            "B": "阴偏盛",
            "C": "阳偏衰",
            "D": "阴偏衰",
            "E": "阴阳两虚"
          },
          "answer": "D",
          "analysis": "阳病治阴是一种治疗原则即在阴偏衰的情况下通过调整阳分的方法使阴阳恢复平衡,故“阳病治阴”的方法适用于阴偏衰证，所以选D。",
          "type": "多选题"
        },
        {
          "id": 11904,
          "title": "“益火之源，以消阴翳”的治法适用于",
          "options": {
            "A": "实寒证",
            "B": "实热证",
            "C": "虚寒证",
            "D": "虚热证",
            "E": "阴阳两虚证"
          },
          "answer": "C",
          "analysis": "实寒证治疗方法为“寒者热之”；实热证宜“热者寒之”；虚热证治法宜“滋阴降火”；阴阳两虚证宜采用阴阳并补，养阴温阳和滋阴壮阳等补法；“益火之源，以消阴翳”的治法适用于阳虚证，阳虚则寒之，即为虚寒证，故选C。",
          "type": "多选题"
        },
        {
          "id": 11905,
          "title": "“壮水之主，以制阳光”的治法适用于",
          "options": {
            "A": "实寒证",
            "B": "实热证",
            "C": "虚寒证",
            "D": "虚热证",
            "E": "阴阳两虚证"
          },
          "answer": "D",
          "analysis": "实寒证治疗方法为“寒者热之”；实热证宜“热者寒之”；虚寒证的治疗方法“扶阳袪寒调经”；虚热证治法宜“滋阴降火”；阴阳两虚证宜采用阴阳并补，养阴温阳和滋阴壮阳等补法；“壮水之主，以制阳光”的治法适用于阴虚证，阴虚则热之，即为虚热证，故选D。",
          "type": "多选题"
        },
        {
          "id": 11906,
          "title": "患者男，30岁，口干体瘦，食少懒倦，遗精盗汗，骨蒸肉烁，唇红颧赤，咳嗽痰血，舌红少苔，脉细数。该患者的证候属",
          "options": {
            "A": "阴虚",
            "B": "阳虚",
            "C": "阴盛",
            "D": "阳盛",
            "E": "阴阳两虚"
          },
          "answer": "A",
          "analysis": "骨蒸肉烁，唇红颧赤，咳嗽痰血舌红，口干皆表现为热证，体瘦，食少懒倦，遗精盗汗，少苔皆表现为虚证，故两者综合为虚热证。该证是因气血阴液不足即阴虚，或邪盛伤正所致的热证，故选A。",
          "type": "多选题"
        },
        {
          "id": 11907,
          "title": "患者女，42岁，面色淡白无华，精神萎靡，少气乏力，畏寒肢冷，自汗，小便清长，舌质淡胖，苔润滑脉微细无力。该患者的证候属于",
          "options": {
            "A": "阴虚",
            "B": "阳虚",
            "C": "阴盛",
            "D": "阳盛",
            "E": "阴阳两虚"
          },
          "answer": "B",
          "analysis": "面色淡白无华，畏寒肢冷，小便清长，为寒证。精神萎靡，少气乏力，自汗，舌质淡胖为虚证，故两者综合为虚寒证。虚寒证是指人体未受到明显寒邪的情况下,因为自身的身体虚弱,导致体内阳气不足而阴气过盛,出现虚寒的情况，阳虚则寒之，为阳虚证，故选B。",
          "type": "多选题"
        },
        {
          "id": 11914,
          "title": "按五行属性分类，五化中属土者是",
          "options": {
            "A": "生",
            "B": "长",
            "C": "化",
            "D": "收",
            "E": "藏"
          },
          "answer": "C",
          "analysis": "五行属性分类中，五化中木火土金水分别对应生长化收藏。故属土者为化，故选C。",
          "type": "多选题"
        },
        {
          "id": 11915,
          "title": "依据五行学说，脾病及肺的五行传变是",
          "options": {
            "A": "五行相乘",
            "B": "子病犯母",
            "C": "母病及子",
            "D": "五行相侮",
            "E": "五行相克"
          },
          "answer": "C",
          "analysis": "依据五行学说，脾脏五行属土，肺脏五行属金，土生金，故脾病及肺的五行传变是母病及子，故选C。",
          "type": "多选题"
        },
        {
          "id": 11916,
          "title": "一年季节中，“长夏”所属的是",
          "options": {
            "A": "木",
            "B": "火",
            "C": "土",
            "D": "金",
            "E": "水"
          },
          "answer": "C",
          "analysis": "一年季节中，春、夏、长夏、秋、冬分别对应五行木、火、土、金、水，故“长夏”对应五行土，故选C。",
          "type": "多选题"
        },
        {
          "id": 11917,
          "title": "依据五行学说，土壅木郁体现的关系是",
          "options": {
            "A": "母病及子",
            "B": "子病及母",
            "C": "相乘传变",
            "D": "相侮传变",
            "E": "以上都不是"
          },
          "answer": "D",
          "analysis": "土壅木郁中土侮木，即相侮传变，故选D。",
          "type": "多选题"
        },
        {
          "id": 11918,
          "title": "患者男，45岁。胃脘疼痛伴急躁易怒,胸胁胀满，口苦，舌质红，苔黄，脉弦，某医生诊断为“肝胃不和”。根据五行学说，回答以下问题。肝与胃在五行中分别属于",
          "options": {
            "A": "水与火",
            "B": "金与木",
            "C": "水与金",
            "D": "木与土",
            "E": "土与水"
          },
          "answer": "D",
          "analysis": "肝属木，胃属土，故选D。",
          "type": "多选题"
        },
        {
          "id": 11919,
          "title": "患者女，39岁。2月前与邻居发生口角，而见情绪低落，胁肋部胀闷不舒，善太息；近日不思饮食，腹部胀满，头晕乏力。根据五行学说，该患体现的五行关系是",
          "options": {
            "A": "木乘土",
            "B": "木克土",
            "C": "土侮木",
            "D": "子病及母",
            "E": "母病及子"
          },
          "answer": "A",
          "analysis": "与领居发生口角，以致情绪低落，善太息，为肝气郁结，而不思饮食，腹部胀满为胃部受损，在五行中，肝属木，胃属土，即影响由肝传变到胃，肝病传脾，及木病传土，木克土太过即为木乘土，故选A。",
          "type": "多选题"
        },
        {
          "id": 11926,
          "title": "见肝之病，知肝传脾”是指",
          "options": {
            "A": "木乘土",
            "B": "木克土",
            "C": "土侮木",
            "D": "子病及母",
            "E": "母病及子"
          },
          "answer": "A",
          "analysis": "肝五行属木，脾五行属土，肝病传脾即木过度克制土，为木乘土，故选A。",
          "type": "多选题"
        },
        {
          "id": 11927,
          "title": "根据五行学说确定治法”培土生金”的理论依据是",
          "options": {
            "A": "五行相生",
            "B": "五行相克",
            "C": "无行相侮",
            "D": "母病及子",
            "E": "五行相乘"
          },
          "answer": "A",
          "analysis": "五行土生金，培土生金即为五行相生，故选A。",
          "type": "多选题"
        },
        {
          "id": 11928,
          "title": "根据五行学说确定治法”泻南补北”的理论依据是",
          "options": {
            "A": "五行相生",
            "B": "五行相克",
            "C": "无行相侮",
            "D": "母病及子",
            "E": "五行相乘"
          },
          "answer": "B",
          "analysis": "“泻南补北法”也叫作“泻火补水法”，因为水克火，为相克规律里面的抑强，故其理论依据是五行相克，故选B。",
          "type": "多选题"
        },
        {
          "id": 11929,
          "title": "五行学说认为病情较轻的色脉关系是",
          "options": {
            "A": "色与脉的五行属性相生",
            "B": "色与脉的五行属性相克",
            "C": "色与脉的五行属性相同",
            "D": "客色胜主色",
            "E": "主色胜客色"
          },
          "answer": "A",
          "analysis": "病情较轻时色与脉的关系为五行相生，病情较重时，色与脉的关系为五行相克，故选A。",
          "type": "多选题"
        },
        {
          "id": 11930,
          "title": "患者男，54岁。现症见头晕目眩，齿摇发脱，耳鸣、五心烦热，失眠多梦，潮热盗汗，肢体麻木、筋脉拘急，舌红少苔，脉细数。根据五行学说，该患者的治疗方法是",
          "options": {
            "A": "佐金平木",
            "B": "泻南补北",
            "C": "金水相生",
            "D": "滋水涵木",
            "E": "益火补土"
          },
          "answer": "D",
          "analysis": "头晕目眩，齿摇发脱，耳鸣，失眠多梦，为肾虚证；肢体麻木，筋脉拘急为肝虚证；无心烦热，潮热盗汗，舌红少苔，脉细数为虚热证，即阴虚证；综合来看为肝肾阴虚证，应滋肾养肝，而水对应肾木对应肝，即用滋水涵木法，故选D。",
          "type": "多选题"
        },
        {
          "id": 11931,
          "title": "患者男，54岁。先出现鼻塞、咳嗽、忧虑等，进而见口甜、面黄、肌瘦,厌食腹胀等症。根据五行学说，回答以下问题。两脏在生理上,按五行关系应属",
          "options": {
            "A": "相生",
            "B": "相克",
            "C": "相乘",
            "D": "相侮",
            "E": "制化"
          },
          "answer": "A",
          "analysis": "鼻塞，咳嗽，忧虑，为肺脏有异，肺五行属金；口甜，面黄肌瘦，厌食腹胀为脾脏有异，脾五行属土；肺与脾在生理上按五行关系（金与木）属于相生，故选A。",
          "type": "多选题"
        },
        {
          "id": 11938,
          "title": "体质的构成正确的是？",
          "options": {
            "A": "形态结构、生理机能、心理状态",
            "B": "社会因素、心理因素、机体状态",
            "C": "先天因素、后天因素、个人因素",
            "D": "形态结构、心理机能、后天因素",
            "E": "社会因素、自然因素、个人因素"
          },
          "answer": "A",
          "analysis": "体质由形态结构、生理机能和心理状态三个方面的差异性构成。故选A。",
          "type": "多选题"
        },
        {
          "id": 11939,
          "title": "反映体质的体表形态标志？",
          "options": {
            "A": "体格",
            "B": "体型",
            "C": "体重",
            "D": "体姿",
            "E": "性征"
          },
          "answer": "A",
          "analysis": "体表形态包括体格、体型、体重、体姿、性征等，体格反映了人体生长发育水平，营养状况和锻炼程度的状态，是反映体质的标志。故选A。",
          "type": "多选题"
        },
        {
          "id": 11940,
          "title": "影响体质形成的先天因素不包括以下哪一项？",
          "options": {
            "A": "父母生殖之精的质量",
            "B": "父母血缘关系的远近",
            "C": "父母孕育年龄",
            "D": "母亲养胎及妊娠期疾病的影响",
            "E": "饮食起居的影响"
          },
          "answer": "E",
          "analysis": "影响体质形成的先天因素包括：父母生殖之精的质量、父母孕育年龄、父母血缘关系的远近、母亲妊娠期的养胎情况以及母亲妊娠期疾病的影响。选项E饮食起居是影响体质的后天因素，故选E。",
          "type": "多选题"
        },
        {
          "id": 11941,
          "title": "先天禀赋决定着体质的相对？",
          "options": {
            "A": "可变性",
            "B": "连续性",
            "C": "复杂性",
            "D": "普遍性",
            "E": "稳定性"
          },
          "answer": "E",
          "analysis": "体质禀承于先天，先天禀赋决定着个体体质的相对稳定性和特异性。故选E。",
          "type": "多选题"
        },
        {
          "id": 11942,
          "title": "后天各种因素使体质具有？",
          "options": {
            "A": "可变性",
            "B": "稳定性",
            "C": "全面性",
            "D": "普遍性",
            "E": "复杂性"
          },
          "answer": "A",
          "analysis": "体质得养于后天，后天各种环境因素，营养状况、饮食习惯、精神因素、年龄变化、疾病损害、针药治疗等均可对体质形成影响，使体质具有可变性。故选A。",
          "type": "多选题"
        },
        {
          "id": 11943,
          "title": "决定某种病邪的易感性的主要因素是？",
          "options": {
            "A": "环境",
            "B": "体质",
            "C": "精神状态",
            "D": "阴阳",
            "E": "脏腑"
          },
          "answer": "B",
          "analysis": "体质与发病：不同的体质，在发病中可①决定发病倾向，如体质虚弱，则易感邪发病，且发病后易形成虚实夹杂证。②决定对某种病邪的易感性，如阳虚之体，每易感受寒邪;阴虚之质，每易感受热邪等。③决定某些疾病发生的证候类型，如感湿邪，阳盛之体易热化形成温热病变;阳虚者则易寒化为寒湿病变等。故选B。",
          "type": "多选题"
        },
        {
          "id": 11944,
          "title": "具有面色红润、精力充沛、耐受寒热等特征的体质为?",
          "options": {
            "A": "阳虚型",
            "B": "气虚型",
            "C": "混合型",
            "D": "平和型",
            "E": "特禀型"
          },
          "answer": "D",
          "analysis": "以体态适中、面色红润、精力充沛、脏腑功能状态强健壮实为主要特征的一种体质状态，称为“平和质”。故选D。",
          "type": "多选题"
        },
        {
          "id": 11945,
          "title": "以下哪项不是气虚质的特征？",
          "options": {
            "A": "气短懒言",
            "B": "容易疲乏",
            "C": "体形肥胖",
            "D": "语音低弱",
            "E": "易出汗"
          },
          "answer": "C",
          "analysis": "气虚质总体特征：元气不足，以疲乏、气短、自汗等气虚表现为主要特征。选项C形体肥胖为痰湿质特征。故选C。",
          "type": "多选题"
        },
        {
          "id": 11946,
          "title": "阴虚质的施护方法是？",
          "options": {
            "A": "化痰利湿，少食甘肥",
            "B": "利湿健脾，少食湿热之品",
            "C": "多食活血化瘀之品，少食肥甘厚味",
            "D": "温补脾肾，慎食生冷",
            "E": "滋补肾阴，少食辛辣"
          },
          "answer": "E",
          "analysis": "阴虚质施护：保持稳定的心态，避免急躁，缓解心理压力，滋补肾阴，少食辛辣，坚持中小强度运动，避免汗出过多。故选E。",
          "type": "多选题"
        },
        {
          "id": 11947,
          "title": "具有面垢红光、口苦口干、舌苔黄腻等特征的体质为?",
          "options": {
            "A": "湿热质",
            "B": "痰湿质",
            "C": "混合型",
            "D": "平和型",
            "E": "特禀型"
          },
          "answer": "A",
          "analysis": "湿热质具有面垢红光、易患疮疖、形体偏胖、口苦口干、身体困倦、心烦急躁、舌苔黄腻等特征。故选A。",
          "type": "多选题"
        },
        {
          "id": 11948,
          "title": "以下哪项不是气郁质的特征？",
          "options": {
            "A": "神情抑郁",
            "B": "烦闷不乐",
            "C": "易患过敏",
            "D": "易患脏燥",
            "E": "敏感多虑"
          },
          "answer": "C",
          "analysis": "气郁质特征：神情抑郁，体型多瘦，烦闷不乐，性格内向，敏感多虑，易患脏燥、梅核气、郁证。选项C易患过敏为特禀质特征。故选C。",
          "type": "多选题"
        },
        {
          "id": 11949,
          "title": "“藏象”一词，始见于？",
          "options": {
            "A": "《素问》",
            "B": "《灵枢》",
            "C": "《类经》",
            "D": "《难经》",
            "E": "《伤寒杂病论》"
          },
          "answer": "A",
          "analysis": "“藏象”一词，始见于《素问·六节藏象论》。故选A。",
          "type": "多选题"
        },
        {
          "id": 11950,
          "title": "对藏象学说“象”的认识，以下说法不正确的是?",
          "options": {
            "A": "指以五脏为中心的生理病理系统的外在现象",
            "B": "指五脏生理系统与自然界相通应的事物和现象",
            "C": "指内在以五脏为中心的五个生理病理系统",
            "D": "指五脏病理系统与自然界相通应的事物和现象",
            "E": "指表现于外的生理病理征象"
          },
          "answer": "C",
          "analysis": "“象 ”，是对以五脏为中心的这五个生理病理系统的外在现象和比象，其涵义有二：一是指表现于外的生理病理征象 ; 二是指内在以五脏为中心的五个生理病理系统与外在自然环境的事物与现象类比所获得的比象。故选C。",
          "type": "多选题"
        },
        {
          "id": 11951,
          "title": "藏象学说的形成基础，以下哪项不正确？",
          "options": {
            "A": "古代解剖学知识的积累，认识了内脏的一些机能",
            "B": "长期对生活实践的观察总结，了解了脏腑的一些机能",
            "C": "古代哲学思想的渗透，使藏象理论系统化",
            "D": "临床经验大量积累，丰富并完善了藏象理论",
            "E": "古代解剖学知识的积累，使藏象理论不断得到丰富充实和修正完善"
          },
          "answer": "E",
          "analysis": "藏象学说的形成基础主要有四： ① 古代解剖学知识的积累，认识了内脏的某些机能 ; ②长期生活实践的观察总结，认识了人体的复杂机能，并赋予相应的脏腑 ; ③古代哲学思想的渗透，使藏象理论系统化 ; ④临床经验的大量积累，可升华而形成理论，并通过临床疗效来探索和反证脏腑的生理病理，使藏象理论不断得到丰富充实和修正完善。故选E。",
          "type": "多选题"
        },
        {
          "id": 11953,
          "title": "具有“泻而不藏”特点的是?",
          "options": {
            "A": "五脏",
            "B": "六腑",
            "C": "奇恒之腑",
            "D": "五体",
            "E": "五液"
          },
          "answer": "B",
          "analysis": "六腑的共同生理功能特点是受盛和传化水谷，由于六腑不断地输泻水谷，故称“泻而不藏”。故选B。",
          "type": "多选题"
        },
        {
          "id": 11954,
          "title": "五脏、六腑、奇恒之腑区别的主要依据是？",
          "options": {
            "A": "解剖形态的差异",
            "B": "经脉络属的有无",
            "C": "生理功能的差异",
            "D": "所在部位的不同",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "人体的内脏，主要按照脏腑不同的生理功能，分为五脏、六腑和奇恒之腑三大类。故选C。",
          "type": "多选题"
        },
        {
          "id": 11955,
          "title": "被称为“君主之官”的是？",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "B",
          "analysis": "心在脏腑中居于首要地位，起主宰作用，故《素问·灵兰秘典论》曰：“心者，君主之官，神明出焉。”故选B。",
          "type": "多选题"
        },
        {
          "id": 11956,
          "title": "“血府”是指?",
          "options": {
            "A": "脉",
            "B": "心",
            "C": "肝",
            "D": "脾",
            "E": "冲脉"
          },
          "answer": "A",
          "analysis": "人体的血液运行于血脉之中，故《素问·脉要精微论》说：“夫脉者，血之府也。”故选A。",
          "type": "多选题"
        },
        {
          "id": 11957,
          "title": "与心相表里的是？",
          "options": {
            "A": "大肠",
            "B": "小肠",
            "C": "心包",
            "D": "三焦",
            "E": "胃"
          },
          "answer": "B",
          "analysis": "手少阴心经与手太阳小肠经相表里。故选B。",
          "type": "多选题"
        },
        {
          "id": 11958,
          "title": "“心主神明”是指心主宰人体的？",
          "options": {
            "A": "生理活动",
            "B": "心理活动",
            "C": "生理、心理活动",
            "D": "精神意识活动",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "心主神明的“神”包括生理活动和心理活动。故选C。",
          "type": "多选题"
        },
        {
          "id": 11959,
          "title": "下列哪种说法是错误的?",
          "options": {
            "A": "舌为心之苗",
            "B": "汗为心之液",
            "C": "心为神之舍",
            "D": "心其华在面",
            "E": "心为血之府"
          },
          "answer": "E",
          "analysis": "脉为血之府。故选E。",
          "type": "多选题"
        },
        {
          "id": 11960,
          "title": "观察心主血脉的功能是否正常，与哪项关系较小？",
          "options": {
            "A": "面色",
            "B": "舌色",
            "C": "脉象",
            "D": "爪色",
            "E": "心胸部感觉"
          },
          "answer": "D",
          "analysis": "心主血脉的功能正常与否，主要从面色、舌色、脉象和心胸部感觉等方面来观察。故选D。",
          "type": "多选题"
        },
        {
          "id": 11962,
          "title": "“相傅之官”指?",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "肝",
            "D": "脾",
            "E": "肾"
          },
          "answer": "B",
          "analysis": "《素问·灵兰秘典论》曰：“肺者，相傅之官，治节出焉。”故选B。",
          "type": "多选题"
        },
        {
          "id": 11963,
          "title": "肺“通调水道”主要依赖于？",
          "options": {
            "A": "肺主一身之气",
            "B": "肺朝百脉",
            "C": "肺司呼吸",
            "D": "肺主肃降",
            "E": "肺主宣发和肃降"
          },
          "answer": "E",
          "analysis": "肺通调水道的功能，是肺气的宣发和肃降在水液代谢方面的体现。故选E。",
          "type": "多选题"
        },
        {
          "id": 11964,
          "title": "“水之上源”指？",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "脾",
            "D": "肝",
            "E": "肾"
          },
          "answer": "B",
          "analysis": "肺位最高，通过宣发肃降运动调节水液代谢，故有“肺为水之上源”之说。故选B。",
          "type": "多选题"
        },
        {
          "id": 11965,
          "title": "皮肤感邪，常内传于?",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "肝",
            "D": "脾",
            "E": "肾"
          },
          "answer": "B",
          "analysis": "肺外合皮毛，故皮肤感邪，常内传于肺。故选B。",
          "type": "多选题"
        },
        {
          "id": 11966,
          "title": "“娇脏”是指？",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "D",
          "analysis": "肺叶娇嫩，通过鼻直接与外界相通，且外合皮毛，易被外邪侵害，又不耐寒热，故称其为娇脏。故选D。",
          "type": "多选题"
        },
        {
          "id": 11967,
          "title": "“后天之本”指？",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "脾",
            "D": "肝",
            "E": "肾"
          },
          "answer": "C",
          "analysis": "由于人体出生后所需的营养物质均赖脾化生的水谷精微供养，故称脾为“后天之本”。故选C。",
          "type": "多选题"
        },
        {
          "id": 11968,
          "title": "“生痰之源”是指？",
          "options": {
            "A": "肺",
            "B": "心",
            "C": "肝",
            "D": "脾",
            "E": "肾"
          },
          "answer": "D",
          "analysis": "脾主运化水液，脾失健运则水液代谢障碍而生痰、生湿，故有“脾为生痰之源”之说。故选D。",
          "type": "多选题"
        },
        {
          "id": 11969,
          "title": "脾主运化是指脾能够？",
          "options": {
            "A": "运化水液",
            "B": "运化水谷",
            "C": "化生血液",
            "D": "化生气血",
            "E": "运化水谷和水液"
          },
          "answer": "E",
          "analysis": "脾主运化体现在脾能够运化水谷和运化水液两个方面。故选E。",
          "type": "多选题"
        },
        {
          "id": 11970,
          "title": "脾其华在？",
          "options": {
            "A": "唇",
            "B": "口",
            "C": "面",
            "D": "爪",
            "E": "肉"
          },
          "answer": "A",
          "analysis": "脾开窍于口，其华在唇。故选A。",
          "type": "多选题"
        },
        {
          "id": 11971,
          "title": "脾的生理特性是？",
          "options": {
            "A": "喜燥恶湿主升",
            "B": "喜燥恶湿主降",
            "C": "喜润恶燥主降",
            "D": "喜润恶燥主升",
            "E": "以上都不是"
          },
          "answer": "A",
          "analysis": "脾的生理特性是喜燥恶湿，脾气的运动特点是主升。故选A。",
          "type": "多选题"
        },
        {
          "id": 11972,
          "title": "“刚脏”是指？",
          "options": {
            "A": "心",
            "B": "脾",
            "C": "肝",
            "D": "肺",
            "E": "肾"
          },
          "answer": "C",
          "analysis": "肝的特性是主升主动，喜条达而恶抑郁，故称之为刚脏。故选C。",
          "type": "多选题"
        },
        {
          "id": 11973,
          "title": "“罢极之本”是?",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "脾",
            "D": "肝",
            "E": "肾"
          },
          "answer": "D",
          "analysis": "《素问·六节藏象论》说：“肝者，罢极之本。”故选D。",
          "type": "多选题"
        },
        {
          "id": 11974,
          "title": "协助脾胃升降的脏为？",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "B",
          "analysis": "肝主疏泄，调畅气机，有助于脾胃之气升降，是保证脾胃运化功能正常的重要条件。故选B。",
          "type": "多选题"
        },
        {
          "id": 11975,
          "title": "“筋之余”是指？",
          "options": {
            "A": "齿",
            "B": "发",
            "C": "骨",
            "D": "肝",
            "E": "爪"
          },
          "answer": "E",
          "analysis": "爪甲为筋延伸到体表的外露部分，故有“爪为筋之余”之说。故选E。",
          "type": "多选题"
        },
        {
          "id": 11976,
          "title": "肝在体合?",
          "options": {
            "A": "爪",
            "B": "脉",
            "C": "肉",
            "D": "骨",
            "E": "筋"
          },
          "answer": "E",
          "analysis": "筋有赖肝之阴血的滋养才能发挥其连接和约束骨节，主持运动等功能，故言肝在体合筋。故选E。",
          "type": "多选题"
        },
        {
          "id": 11977,
          "title": "肝主疏泄和藏血的关系，常表述为？",
          "options": {
            "A": "肝体阴而用阳",
            "B": "肝为刚脏",
            "C": "肝体常不足",
            "D": "肝用常有余",
            "E": "肝为将军之官"
          },
          "answer": "A",
          "analysis": "肝“体阴”主要指肝贮藏阴血之本体，“用阳”主要指肝的气机主升主动的功能及特性，故常用“体阴用阳”来概括肝主疏泄和藏血二者的关系。故选A。",
          "type": "多选题"
        },
        {
          "id": 11978,
          "title": "“先天之本”指？",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "脾",
            "D": "肝",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "肾藏有先天之精，为构成人体胚胎的原始物质，是脏腑阴阳之根，故称其为“先天之本”。故选E。",
          "type": "多选题"
        },
        {
          "id": 11979,
          "title": "肾脏所藏之精是?",
          "options": {
            "A": "先天之精",
            "B": "后天之精",
            "C": "先后天之精",
            "D": "脏腑之精",
            "E": "生殖之精"
          },
          "answer": "C",
          "analysis": "肾所藏之精包括先天之精和后天之精。故选C。",
          "type": "多选题"
        },
        {
          "id": 11980,
          "title": "天癸的产生主要取决于？",
          "options": {
            "A": "肝血的充足",
            "B": "肾中精气的充盈",
            "C": "脾气的健运",
            "D": "肾阴的滋润",
            "E": "肾阳的蒸化"
          },
          "answer": "B",
          "analysis": "肾中精气充盛到一定的程度，便可产生一种促进和维持生殖机能的精微物质，即天癸。故选B。",
          "type": "多选题"
        },
        {
          "id": 11981,
          "title": "“……筋骨坚，发长极，身体盛壮……”是指？",
          "options": {
            "A": "男子，三八",
            "B": "男子，四八",
            "C": "男子，五八",
            "D": "女子，三七",
            "E": "女子，四七"
          },
          "answer": "E",
          "analysis": "《素问·上古天真论》：“女子七岁，肾气盛，齿更，发长；二七而天癸至，任脉通，太冲脉盛，月事以时下，故有子；三七，肾气平均，故真牙生而长极；四七，筋骨坚，发长极，身体盛壮……”。故选E。",
          "type": "多选题"
        },
        {
          "id": 11982,
          "title": "肾阳对机体的作用不包括哪项?",
          "options": {
            "A": "温煦",
            "B": "推动",
            "C": "宁静",
            "D": "制约肾阴",
            "E": "气化"
          },
          "answer": "C",
          "analysis": "肾阳又称元阳，能补充全身各脏所需之阳，制约肾阴，对机体组织具有温煦、推动、气化、兴奋作用。故选C。",
          "type": "多选题"
        },
        {
          "id": 11983,
          "title": "除哪项外，均为肾阴对机体的作用？",
          "options": {
            "A": "滋润",
            "B": "气化",
            "C": "宁静",
            "D": "制约肾阳",
            "E": "濡养"
          },
          "answer": "B",
          "analysis": "肾阴，又称元阴，能补充全身脏腑所需之阴，制约肾阳，并具有滋润、濡养、宁静的功能特点。故选B。",
          "type": "多选题"
        },
        {
          "id": 11984,
          "title": "维持呼吸的深度需哪脏的功能？",
          "options": {
            "A": "肝",
            "B": "肺",
            "C": "肾",
            "D": "脾",
            "E": "心"
          },
          "answer": "C",
          "analysis": "肾具有摄纳肺所吸入的清气以防止呼吸表浅，协助肺完成呼吸的功能，故维持呼吸的深度需肾脏的参与。故选C。",
          "type": "多选题"
        },
        {
          "id": 11985,
          "title": "水脏是指?",
          "options": {
            "A": "肺",
            "B": "肾",
            "C": "心",
            "D": "脾",
            "E": "肝"
          },
          "answer": "B",
          "analysis": "由于肾在水液代谢中的至关重要的作用，故称“肾为水脏”。故选B。",
          "type": "多选题"
        },
        {
          "id": 11986,
          "title": "后阴为何脏之窍？",
          "options": {
            "A": "脾",
            "B": "肺",
            "C": "心",
            "D": "肝",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "肾开窍于前、后二阴。故选E。",
          "type": "多选题"
        },
        {
          "id": 11987,
          "title": "“骨之余”是指？",
          "options": {
            "A": "齿",
            "B": "髓",
            "C": "发",
            "D": "爪",
            "E": "筋"
          },
          "answer": "A",
          "analysis": "牙齿为骨骼的外露部分，故谓“齿为骨之余”。故选A。",
          "type": "多选题"
        },
        {
          "id": 11988,
          "title": "肾在液为?",
          "options": {
            "A": "涎",
            "B": "唾",
            "C": "泪",
            "D": "涕",
            "E": "尿"
          },
          "answer": "B",
          "analysis": "唾为肾精所化，故肾在液为唾。故选B。",
          "type": "多选题"
        },
        {
          "id": 11989,
          "title": "“肾之外候”为？",
          "options": {
            "A": "发",
            "B": "耳",
            "C": "齿",
            "D": "恐",
            "E": "唾"
          },
          "answer": "A",
          "analysis": "肾中精气的盛衰可显露于头发，即发为肾之外候。故选A。",
          "type": "多选题"
        },
        {
          "id": 11990,
          "title": "“户门”是指？",
          "options": {
            "A": "唇",
            "B": "齿",
            "C": "胃上口",
            "D": "会厌",
            "E": "肛门"
          },
          "answer": "B",
          "analysis": "齿为户门，户指通向内部的门户，水谷进入口腔，牙齿咀嚼、消磨水谷，故为“户门”。故选B。",
          "type": "多选题"
        },
        {
          "id": 11991,
          "title": "下列哪项不是指胆?",
          "options": {
            "A": "中精之府",
            "B": "中清之府",
            "C": "精明之府",
            "D": "清净之府",
            "E": "中正之官"
          },
          "answer": "C",
          "analysis": "精明之府指头。故选C。",
          "type": "多选题"
        },
        {
          "id": 11992,
          "title": "胆汁分泌排泄正常主要取决于？",
          "options": {
            "A": "胆贮藏胆汁",
            "B": "胆排泄胆汁",
            "C": "脾运化水谷",
            "D": "肝疏泄正常",
            "E": "以上都不是"
          },
          "answer": "D",
          "analysis": "胆汁分泌排泄正常全赖肝疏泄正常。故选D。",
          "type": "多选题"
        },
        {
          "id": 11993,
          "title": "胃的生理特性是？",
          "options": {
            "A": "喜燥恶湿主升",
            "B": "喜燥恶湿主降",
            "C": "喜润恶燥主降",
            "D": "喜润恶燥主升",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "胃的生理特性喜润而恶燥，其生理功能特点以畅通下降为主。故选C。",
          "type": "多选题"
        },
        {
          "id": 11994,
          "title": "“利小便即所以实大便”治法的依据是?",
          "options": {
            "A": "脾主运化水液",
            "B": "小肠泌别清浊",
            "C": "肺主通调水道",
            "D": "膀胱贮尿排尿",
            "E": "肾主司二便"
          },
          "answer": "B",
          "analysis": "小肠泌别清浊的功能失常，清浊不分，水谷精微和食物残渣俱下于大肠，可见肠鸣泄泻，小便短少，故治疗泄泻常用“利小便即所以实大便”的分利方法。故选B。",
          "type": "多选题"
        },
        {
          "id": 11995,
          "title": "大肠主？",
          "options": {
            "A": "汗",
            "B": "尿",
            "C": "津",
            "D": "液",
            "E": "泪"
          },
          "answer": "C",
          "analysis": "大肠具有吸收食物残渣中部分水分的功能，故曰“大肠主津”。故选C。",
          "type": "多选题"
        },
        {
          "id": 11996,
          "title": "膀胱的生理功能为？",
          "options": {
            "A": "受纳和腐熟水谷",
            "B": "贮存和排泄尿液",
            "C": "泌别清浊",
            "D": "通调水道",
            "E": "化生尿液"
          },
          "answer": "B",
          "analysis": "膀胱为州都之官，其生理功能是贮尿和排尿。受纳和腐熟水谷为胃的生理功能，小肠主泌别清浊，肺主通调水道，尿液的生成则由肾的蒸腾气化实现，故选B。",
          "type": "多选题"
        },
        {
          "id": 11997,
          "title": "“孤府”所指的脏腑是？",
          "options": {
            "A": "胃",
            "B": "胆",
            "C": "膀胱",
            "D": "小肠",
            "E": "三焦"
          },
          "answer": "E",
          "analysis": "《灵枢·本输》“三焦者，中渎之府也，水道出焉，属膀胱，孤之府也。”，三焦在脏腑关系中没有表里相配，故称“孤府”，故选E。",
          "type": "多选题"
        },
        {
          "id": 11998,
          "title": "上焦生理功能的特点是？",
          "options": {
            "A": "若雾露之溉",
            "B": "主气之升发",
            "C": "通行宗、营、卫三气",
            "D": "原气之别使",
            "E": "主宣发与肃降"
          },
          "answer": "A",
          "analysis": "上焦生理功能的特点是若雾露之溉。主气之升发是上焦功能活动的一个方面，不能全面反映上焦的功能。通行宗、营、卫三气是上焦的功能活动之一，不是上焦生理功能的特点。原气之别使指三焦而言。主宣发与肃降是肺的功能，故选A。",
          "type": "多选题"
        },
        {
          "id": 11999,
          "title": "具有“通行诸气和运行水液”生理功能的腑是？",
          "options": {
            "A": "胆",
            "B": "膀胱",
            "C": "胃",
            "D": "三焦",
            "E": "小肠"
          },
          "answer": "D",
          "analysis": "三焦的生理功能：①通行诸气：三焦是气机升降出入的通道，全身之气通过三焦运行于上下；三焦通行元气，元气以三焦为通道，布散全身；②运行水液：三焦具有疏通水道，运行水液的作用，是全身水液升降出入的通道。三焦运行水液与通行元气相互关联，故选D。",
          "type": "多选题"
        },
        {
          "id": 12000,
          "title": "“中焦如沤”是描述？",
          "options": {
            "A": "胃的受纳功能",
            "B": "脾的散精功能",
            "C": "小肠泌别清浊功能",
            "D": "脾、胃、肝、胆等脏腑的消化饮食物的生理过程",
            "E": "心、肺输布气血的作用"
          },
          "answer": "D",
          "analysis": "此题考核对三焦生理特点的理解与掌握，《灵枢·营卫生会》中把三焦的生理特点分别概括为“上焦如雾，中焦如沤，下焦如渎”。中焦如沤，喻指脾胃肝胆等脏腑对饮食物消化、吸收并输布其水谷精微和化生血液的生理过程，故选D。",
          "type": "多选题"
        },
        {
          "id": 12001,
          "title": "下列脏腑中属于奇恒之腑的是？",
          "options": {
            "A": "三焦",
            "B": "胆",
            "C": "膀胱",
            "D": "心",
            "E": "小肠"
          },
          "answer": "B",
          "analysis": "奇恒之腑是指脑、髓、骨、脉、胆、女子胞的总称，胆属五脏六腑，亦为奇恒之腑，故选B。",
          "type": "多选题"
        },
        {
          "id": 12002,
          "title": "与脑髓充盈关系最密切的脏是？",
          "options": {
            "A": "心",
            "B": "肺",
            "C": "肝",
            "D": "脾",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "脑为髓汇聚而成，髓由肾精所化生。肾精充足，髓海得养，则思维敏捷、精力充沛；反之，肾精亏虚，髓海失养，则思维迟钝、记忆力减退，故选E。",
          "type": "多选题"
        },
        {
          "id": 12003,
          "title": "“元神之府”指的是？",
          "options": {
            "A": "脑",
            "B": "胆",
            "C": "骨",
            "D": "髓",
            "E": "女子胞"
          },
          "answer": "A",
          "analysis": "明·李时珍《本草纲目》记载“脑为元神之府”，脑的生理功能为主宰人体生命活动、精神活动和感觉运动，故选A。",
          "type": "多选题"
        },
        {
          "id": 12004,
          "title": "人体的骨骼发育主要依赖于？",
          "options": {
            "A": "肝藏血以养骨",
            "B": "肾藏精生髓以养骨",
            "C": "脾运化精微以养骨",
            "D": "心主血脉，推动气血以养骨",
            "E": "肺主治节，辅心行血以养骨"
          },
          "answer": "B",
          "analysis": "肾精充足，骨髓生化有源，骨骼得到骨髓的滋养，则生长发育正常，才能保持其坚刚之性。若肾精亏虚，骨髓失养，就会出现骨骼脆弱无力或发育不良等，故选B。",
          "type": "多选题"
        },
        {
          "id": 12005,
          "title": "下列哪项与女子胞的生理功能最为密切？",
          "options": {
            "A": "心、肺、脾、胃、冲脉、督脉",
            "B": "心、肺、肾、胃、阳明脉、带脉",
            "C": "心、肝、肾、胃、冲脉、任脉",
            "D": "心、肺、脾、肝、冲脉、任脉",
            "E": "心、肝、脾、肾、冲脉、任脉"
          },
          "answer": "E",
          "analysis": "与女子胞功能活动关系最密切的因素是肾中精气和天癸的作用，随着肾中精气的不断充盛，天癸至；其次，其功能活动以血液为物质基础，而心、肝、脾具有主血、藏血、统血、生血等功能，调节血液生成与运行。冲任二脉起于女子胞，且冲为血海，任主胞胎，故选E。",
          "type": "多选题"
        },
        {
          "id": 12011,
          "title": "心与肺的关系主要体现在？",
          "options": {
            "A": "呼吸运动",
            "B": "精神调节",
            "C": "气机升降",
            "D": "气血为用",
            "E": "食物运化"
          },
          "answer": "D",
          "analysis": "心主一身之血，肺主一身之气，两者相互协调，从而保证气血的正常运行，故选D。",
          "type": "多选题"
        },
        {
          "id": 12012,
          "title": "心与脾的生理联系，主要表现于？",
          "options": {
            "A": "血液的统摄和贮藏",
            "B": "津液与血液的互化",
            "C": "血液的生成和运行",
            "D": "精髓与血液的互化",
            "E": "血液的运行和贮藏"
          },
          "answer": "C",
          "analysis": "心与脾的关系主要表现在血液的生成和运行方面。心主血，心血靠脾气转输的水谷而化生，脾的转输功能又赖心血来滋养。脾气健，水谷精微充足，心血充盈；心血足，脾亦健运。心主血，推动血液循行不休；脾统血，统摄血液行于脉中而不溢出脉外，心脾两脏的相互配合、相互为用，维持血液充盈并且正常运行，故选C。",
          "type": "多选题"
        },
        {
          "id": 12013,
          "title": "表现于行血与藏血以及精神调节等方面关系密切的两脏是？",
          "options": {
            "A": "心与肺",
            "B": "心与肾",
            "C": "心与脾",
            "D": "心与肝",
            "E": "肺与脾"
          },
          "answer": "D",
          "analysis": "心主血，推动血液运行，肝藏血，贮藏调节血液量，两者协同作用以助血液正常运行；心主神志，主管精神活动，肝主疏泄，调节情志活动，两者共同维持精神情志活动，故选D。",
          "type": "多选题"
        },
        {
          "id": 12014,
          "title": "脏与脏之间主要表现为阴阳水火互济互制关系的是？",
          "options": {
            "A": "心与肺",
            "B": "心与肾",
            "C": "肾与肝",
            "D": "脾与肾",
            "E": "心与肝"
          },
          "answer": "B",
          "analysis": "心在上为阳，五行属火；肾在下为阴，五行属水。心火下降于肾，使肾水不寒，肾水上济于心，使心火不亢。心与肾之间的阴阳水火升降互济，保持了两脏之间的生理功能的平衡协调，故选B。",
          "type": "多选题"
        },
        {
          "id": 12016,
          "title": "肝肺之间的关系主要表现在？",
          "options": {
            "A": "气机的调节",
            "B": "血液的运行",
            "C": "津液的输布",
            "D": "气的生成",
            "E": "血的生成"
          },
          "answer": "A",
          "analysis": "肺主肃降，肝主升发，肝肺之间的关系主要表现在气机的调节方面，故选A。",
          "type": "多选题"
        },
        {
          "id": 12017,
          "title": "“肾为气之根”主要是指？",
          "options": {
            "A": "肾为阳气之根本",
            "B": "肾为先天之本",
            "C": "肾藏精",
            "D": "肾主纳气",
            "E": "肾主水液"
          },
          "answer": "D",
          "analysis": "《类证治裁》言“肺为气之主，肾为气之根。肺主出气，肾主纳气”。肾主纳气，是指由肺吸入的自然界清气下达到肾，经过肾的摄纳潜藏，才能保持吸气的深度，故选D",
          "type": "多选题"
        },
        {
          "id": 12018,
          "title": "肝能促进脾胃运化功能的机制是？",
          "options": {
            "A": "调和气血",
            "B": "调畅情志",
            "C": "调畅气机",
            "D": "调节血量",
            "E": "贮藏血液"
          },
          "answer": "C",
          "analysis": "肝主疏泄是保持脾胃正常消化吸收的重要条件。肝对脾胃消化吸收功能的促进作用，是通过协调脾胃的气机升降，和分泌、排泄胆汁而实现的，故选C。",
          "type": "多选题"
        },
        {
          "id": 12019,
          "title": "大肠功能失常，可直接影响？",
          "options": {
            "A": "肾失气化",
            "B": "肝失疏泄",
            "C": "肺失肃降",
            "D": "脾失健运",
            "E": "脾失升清"
          },
          "answer": "C",
          "analysis": "大肠传导功能正常有利于肺气之肃降，反之，若大肠传导糟粕功能失常，则可直接影响肺气的肃降。当然，大肠传导功能正常与否，与脾气的运化、肾气的蒸腾与气化、肝气的疏泄作用有一定的关系，但最直接影响的是肺的肃降，故选C。",
          "type": "多选题"
        },
        {
          "id": 12020,
          "title": "肺与大肠在功能上的联系，主要体现于？",
          "options": {
            "A": "肺气宣发布津于大肠",
            "B": "肺气肃降输送水液于大肠",
            "C": "肺气肃降以助大肠之传导",
            "D": "宗气充足以推动大肠之传导",
            "E": "肺主治节，以调节大肠之功能"
          },
          "answer": "C",
          "analysis": "肺与大肠相表里，肺气肃降，有利于大肠的传导，使粪便排泄通畅，故选C。",
          "type": "多选题"
        },
        {
          "id": 12021,
          "title": "在脾胃的相互关系中，最根本的是？",
          "options": {
            "A": "脾燥胃湿，燥湿相济",
            "B": "太阴湿土得阳始运，阳明燥土得阴自安",
            "C": "胃主纳谷，脾主磨谷",
            "D": "脾主升清，胃主降浊",
            "E": "胃为水谷之海，脾为胃行其津液"
          },
          "answer": "D",
          "analysis": "脾胃同居中焦，脾为阴土，胃为阳土，脾主升清，“脾以升为健”；胃主降浊，“胃以降为和”，一升一降，相互为用，为气机升降枢纽，故选D。",
          "type": "多选题"
        },
        {
          "id": 12022,
          "title": "胆汁的生成源于？",
          "options": {
            "A": "肝之余气",
            "B": "肺之宗气",
            "C": "心之营气",
            "D": "脾胃之精气",
            "E": "肾之元气"
          },
          "answer": "A",
          "analysis": "胆的主要功能是贮存和排泄胆汁，而胆汁的生成则在肝脏，故《脉经》言“肝之余气溢于胆，取而成精”，说明胆汁源于肝而藏于胆。肝气条畅是胆汁正常排泄的动力和条件，故选A。",
          "type": "多选题"
        },
        {
          "id": 12023,
          "title": "脾和胃之间的病理关系不包括以下哪个选项？",
          "options": {
            "A": "纳运失调",
            "B": "升降反作",
            "C": "湿邪犯脾",
            "D": "热灼胃津",
            "E": "气机郁滞"
          },
          "answer": "E",
          "analysis": "脾与胃的病理机制表现为纳运失调、升降反作、燥湿不济，胃纳不佳则影响脾的运化与升清；脾失健运，则影响胃的受纳与和降；脾胃升降失调，会导致清气在下、浊气在上，而产生飧泄䐜胀等不适；湿易犯脾，困遏脾阳，影响胃纳；热邪犯胃，灼伤胃津，影响脾运，故选E。",
          "type": "多选题"
        },
        {
          "id": 12024,
          "title": "膀胱的开合主要受哪项的调控影响？",
          "options": {
            "A": "肺的肃降",
            "B": "脾的升清",
            "C": "肝的疏泄",
            "D": "肾的气化",
            "E": "心的温煦"
          },
          "answer": "D",
          "analysis": "肾主水，生成、排泄小便；膀胱司开合，贮存、排泄尿液；肾的蒸腾气化调控膀胱的开合，两者共同协调帮助小便生成、贮存、排泄正常。若肾气不足，固摄无权、气化失常，则膀胱开合失度，而产生遗尿、尿失禁、小便不利等病理表现，故选D。",
          "type": "多选题"
        },
        {
          "id": 12025,
          "title": "五脏的生理功能特点是？",
          "options": {
            "A": "传化物而不藏，实而不能满",
            "B": "藏精气而不泻，实而不能满",
            "C": "传化物而不藏，满而不能实",
            "D": "藏精气而不泻，满而不能实",
            "E": "虚实交替，泻而不藏"
          },
          "answer": "D",
          "analysis": "五脏的生理功能特点是化生贮藏精气，精气对人体起到重要作用，故宜藏而不泻；五脏所藏精气宜充满、不宜呆实，精气不断运作，才能维持五脏正常生理功能，故选D。",
          "type": "多选题"
        },
        {
          "id": 12026,
          "title": "肝在志为？",
          "options": {
            "A": "魂",
            "B": "怒",
            "C": "喜",
            "D": "悲",
            "E": "恐"
          },
          "answer": "B",
          "analysis": "肝在志为怒，心在志为喜，脾在志为思，肺在志为悲，肾在志为恐。魂属五神范畴，肝主魂，故选B。",
          "type": "多选题"
        },
        {
          "id": 12027,
          "title": "化生“涎”的脏腑是？",
          "options": {
            "A": "肾",
            "B": "肺",
            "C": "肝",
            "D": "脾",
            "E": "心"
          },
          "answer": "D",
          "analysis": "五液由五脏所化生，即心为汗，肺为涕，肝为泪，脾为涎，肾为唾。涎为口津，即唾液中较清稀的部分，由脾精、脾气所化生并转输布散，故说“脾在液为涎”，故选D。",
          "type": "多选题"
        },
        {
          "id": 12028,
          "title": "下列哪项不属于人体之精的功能？",
          "options": {
            "A": "化气",
            "B": "化血",
            "C": "化神",
            "D": "统摄",
            "E": "濡养"
          },
          "answer": "D",
          "analysis": "人体之精的功能包括繁衍生命、濡养、化血、化气、化神，统摄是人体之气的功能，故选D。",
          "type": "多选题"
        },
        {
          "id": 12029,
          "title": "人体之精的生成来源有先天之精和？",
          "options": {
            "A": "肾精",
            "B": "脏腑之精",
            "C": "后天之精",
            "D": "生殖之精",
            "E": "津液"
          },
          "answer": "C",
          "analysis": "中医学中精有多种内涵，生殖之精属于狭义之精的范畴；广义之精包含了人体内一切精华物质，如血、津液、水谷之精、脏腑之精、肾精等。而从精的生成来源而言，只有先天之精和后天之精两个方面，故选C。",
          "type": "多选题"
        },
        {
          "id": 12030,
          "title": "先天之精主要藏于？",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "人体之精贮藏于脏腑身形中，其中先天之精主要藏于肾，故选E。",
          "type": "多选题"
        },
        {
          "id": 12034,
          "title": "生成血液的最基本的物质是？",
          "options": {
            "A": "水谷精微",
            "B": "肾精",
            "C": "元气",
            "D": "宗气",
            "E": "卫气"
          },
          "answer": "A",
          "analysis": "《灵枢·决气》指出“中焦受气取汁，变化而赤，是谓血。”说明中焦脾胃受纳运化饮食物，吸取其中的精微物质，即谓“汁”，其中包含化为营气的精专物质和有用的津液，二者进入脉中，变化而成红色的血液。因此，由水谷精微化生的营气和津液是化生血液的基本物质，也是血液主要构成成分，故选A。",
          "type": "多选题"
        },
        {
          "id": 12035,
          "title": "影响血液运行的因素除了？",
          "options": {
            "A": "气的推动",
            "B": "脉道的通畅",
            "C": "血液的性态",
            "D": "邪气的入侵",
            "E": "脾胃的受纳"
          },
          "answer": "E",
          "analysis": "影响血液运行的因素有①气的推动与固摄、温煦与凉润作用之间的平衡协调；②脉道的完好无损与通畅无阻；③血液的物理性态：清浊及粘稠状态；④病邪的影响，脾胃的受纳水谷作用对血液的运行并无直接影响，故选E。",
          "type": "多选题"
        },
        {
          "id": 12036,
          "title": "血液的运行与下列哪个脏腑无关？",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "血液的运行与心、肺、脾、肝相关，心主血脉，肺朝百脉，脾主统血，肝主疏泄，故选E。",
          "type": "多选题"
        },
        {
          "id": 12040,
          "title": "津液在体内流注输布的通道是？",
          "options": {
            "A": "经络",
            "B": "腠理",
            "C": "三焦",
            "D": "脉道",
            "E": "胃肠"
          },
          "answer": "C",
          "analysis": "三焦对水液有通调决渎之功，是津液在体内流注输布的通道。津液的输布主要是由脾、肺、肾和三焦来完成的。脾将胃肠而来的津液上输于肺，肺通过宣发肃降功能，经三焦通道，使津液外达皮毛，内灌脏腑，输布全身，胃肠是津液吸收生成的场所，故选C。",
          "type": "多选题"
        },
        {
          "id": 12041,
          "title": "下列哪项不是津液的功能？",
          "options": {
            "A": "滋养脑髓",
            "B": "滑利关节",
            "C": "充养血脉",
            "D": "调节阴阳",
            "E": "温煦推动"
          },
          "answer": "E",
          "analysis": "津液的功能包括滋润濡养，两者根据分布部位不同，其功能的发挥各有侧重；其外还有津血同源，充养血脉以及调节机体阴阳平衡的功能，温煦推动是气的功能，故选E。",
          "type": "多选题"
        },
        {
          "id": 12042,
          "title": "五脏中与津液的输布没有密切相关的是？",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "B",
          "analysis": "津液的输布与脾气散精，上输于肺，“以灌四傍”；肺的通调水道；肾主水，肾气对津液输布的推动和调控作用；肝主疏泄，调畅气机，气行则水行，促进津液输布的畅通等相关，与心没有密切联系，故选B。",
          "type": "多选题"
        },
        {
          "id": 12046,
          "title": "“吐下之余，定无完气”说明哪一项病理变化？",
          "options": {
            "A": "气血两虚",
            "B": "气随血脱",
            "C": "气不化水",
            "D": "气不摄血",
            "E": "气随津脱"
          },
          "answer": "E",
          "analysis": "此语出自《金匮要略心典》，表达了津液和气之间的密切关系。在正常生理情况下，津液是气的载体之一，在剧烈吐泻之后，机体丢失大量津液，同时人体之气也会随之耗损，称为气随津脱，故选E。",
          "type": "多选题"
        },
        {
          "id": 12047,
          "title": "“夺血者无汗，夺汗者无血”说明哪两者之间的密切关系？",
          "options": {
            "A": "气与津液",
            "B": "气与血",
            "C": "血液与精",
            "D": "血液与津液",
            "E": "以上都不是"
          },
          "answer": "D",
          "analysis": "“夺”为大量丢失之意，此句意为当患者出现大量出血的情况时，请不要再用发汗的治疗方法，出现大量出汗时，也不要再用放血、破血的方法治疗。其原因在于汗是津液所化，而津液与血都是由饮食水谷精微所化生，二者相互资生，相互转化，称为“津血同源”，故选D。",
          "type": "多选题"
        },
        {
          "id": 12048,
          "title": "用补气法治疗出血的理论依据是？",
          "options": {
            "A": "气能生血",
            "B": "气能摄血",
            "C": "气能行血",
            "D": "血能载气",
            "E": "血能养气"
          },
          "answer": "B",
          "analysis": "血液在脉中正常循行离不开气的固摄作用，主要体现在脾气统血的生理功能中，防止其逸出脉外，故临床治疗气不摄血的出血证，可用补气法以摄血，故选B。",
          "type": "多选题"
        },
        {
          "id": 12049,
          "title": "治疗血瘀证时，酌情配以益气或理气之品，其理论依据是？",
          "options": {
            "A": "血能载气",
            "B": "气能行血",
            "C": "气能摄血",
            "D": "气能生血",
            "E": "血能养气"
          },
          "answer": "B",
          "analysis": "气能行血，是指血液的运行必须依靠气的推动作用。气为阳，血为阴，阳主动而阴主静，所以血液的运行药依靠气的推动，气行则血行，所以在治疗血瘀证时，常酌配补气、行气或降气药物，故选B。",
          "type": "多选题"
        },
        {
          "id": 12050,
          "title": "“治痰先治气”理论依据为？",
          "options": {
            "A": "气能生津",
            "B": "气能载津",
            "C": "气能行津",
            "D": "气能摄津",
            "E": "津能生气"
          },
          "answer": "C",
          "analysis": "气能行津是指气能推动和调控津液的正常输布运行，气的功能正常则津液代谢正常，若气虚则津液代谢障碍，生成痰、饮、水、湿等病理产物。要消除这些病理产物及其产生的病理影响，常常将利水湿、化痰饮的方法与补气、行气法结合，即是气能行津的具体运用，故选C。",
          "type": "多选题"
        },
        {
          "id": 12056,
          "title": "下列哪本著作标志着针灸学理论体系的基本形成？",
          "options": {
            "A": "黄帝内经",
            "B": "难经",
            "C": "针灸甲乙经",
            "D": "针灸大成",
            "E": "针灸逢源"
          },
          "answer": "A",
          "analysis": "《黄帝内经》是最早论述针灸的医著，其中的《灵枢经》称为《针经》，标志着针灸学理论体系的基本形成（对针灸学的第一次大总结），故选A。",
          "type": "多选题"
        },
        {
          "id": 12057,
          "title": "标志着针灸达到鼎盛时期的著作为？",
          "options": {
            "A": "黄帝内经",
            "B": "难经",
            "C": "针灸甲乙经",
            "D": "针灸大成",
            "E": "针灸逢源"
          },
          "answer": "D",
          "analysis": "明代杨继洲的《针灸大成》是对针灸学的第三次大总结，书中记载经穴359个，标志着针灸到达鼎盛时期，故选D。",
          "type": "多选题"
        },
        {
          "id": 12058,
          "title": "经络的功能不包括以下哪项？",
          "options": {
            "A": "运行全身气血",
            "B": "联络脏腑肢节",
            "C": "调节阴阳平衡",
            "D": "沟通上下内外",
            "E": "调节体内各部"
          },
          "answer": "C",
          "analysis": "经络是人体内运行气血的通道，包括经脉和络脉，是运行全身气血，联络脏腑肢节，沟通上下内外，调节体内各部的特殊系统，故选C。",
          "type": "多选题"
        },
        {
          "id": 12059,
          "title": "十二经脉中，行于躯干胸腹面的阳经是？",
          "options": {
            "A": "手太阳经",
            "B": "足少阳经",
            "C": "足太阳经",
            "D": "手阳明经",
            "E": "足阳明经"
          },
          "answer": "E",
          "analysis": "十二经脉中，行于躯干胸腹面共有4条经脉，有足三条阴经和足阳明经。足少阳经行于人体侧面，足太阳经行于人体后面（背部），手太阳经、手阳明经和手少阳经行于肩部和肩胛部，故选E。",
          "type": "多选题"
        },
        {
          "id": 12060,
          "title": "按十二经脉流注次序，小肠经下接？",
          "options": {
            "A": "膀胱经",
            "B": "大肠经",
            "C": "心经",
            "D": "肾经",
            "E": "三焦经"
          },
          "answer": "A",
          "analysis": "十二经脉流注次序的规律是：①从肺开始，至肝经结束；②从肺→表里经→同名经→再到表里经；③经过三中，心中、胸中、肺中。因此手太阳小肠经下接同名经，即足太阳膀胱经，故选A。",
          "type": "多选题"
        },
        {
          "id": 12061,
          "title": "十二经筋的分布，多结聚于？",
          "options": {
            "A": "胸腹部",
            "B": "肌肤体表部位",
            "C": "关节和骨骼附近",
            "D": "四肢末端",
            "E": "头面及项部"
          },
          "answer": "C",
          "analysis": "十二经筋是十二经脉循行分布筋肉关节的体系，有约束骨骼，维护关节的运动的功能，故选C。",
          "type": "多选题"
        },
        {
          "id": 12065,
          "title": "“一源而三歧”的奇经是指？",
          "options": {
            "A": "冲、任、带脉",
            "B": "任、督、带脉",
            "C": "冲、任、督脉",
            "D": "督、冲、带脉",
            "E": "冲、任、跷脉"
          },
          "answer": "C",
          "analysis": "督脉、任脉、冲脉三经都起于胞中，三经同一起点，循行不同，名称不同，功能不同，故“一源而三歧”，故选C。",
          "type": "多选题"
        },
        {
          "id": 12066,
          "title": "约束纵行诸脉的经脉是？",
          "options": {
            "A": "冲脉",
            "B": "任脉",
            "C": "带脉",
            "D": "督脉",
            "E": "以上均非"
          },
          "answer": "C",
          "analysis": "带脉起于季肋部（侧胸部11、12肋），斜向下行，绕身一周，在腹面的带脉下垂少腹，具有约束纵行诸经的功能，故选C。",
          "type": "多选题"
        },
        {
          "id": 12067,
          "title": "称为“十二经脉之海”的经脉是？",
          "options": {
            "A": "督脉",
            "B": "任脉",
            "C": "冲脉",
            "D": "胃经",
            "E": "肾经"
          },
          "answer": "C",
          "analysis": "冲脉在体内可以调节十二经脉及五脏六腑之气血，具有重要作用，故有“十二经脉之海”“血海”之称；足阳明胃经是一条多气多血之经，但不能调节十二经脉的气血；督脉可以调节阳经气血，为“阳脉之海”；任脉可以调节阴经气血，为“阴脉之海”，故选C。",
          "type": "多选题"
        },
        {
          "id": 12068,
          "title": "经络的生理功能不包括下列哪项？",
          "options": {
            "A": "联系脏腑",
            "B": "运行气血",
            "C": "抗御病邪",
            "D": "传导感应",
            "E": "化生气血"
          },
          "answer": "E",
          "analysis": "经络具有联系脏腑、沟通内外；运行气血、营养全身；抗御病邪、保卫机体；传导感应、调整虚实等生理功能，而无法化生气血，故选E。",
          "type": "多选题"
        },
        {
          "id": 12069,
          "title": "经络学说在指导辨证归经方面有重要意义，比如前额及前头痛常提示病位在？",
          "options": {
            "A": "阳明",
            "B": "少阳",
            "C": "太阳",
            "D": "少阴",
            "E": "厥阴"
          },
          "answer": "A",
          "analysis": "前额为阳明经所过，前额头痛，病位多在阳明经；少阳头痛部位在侧头部；太阳头痛部位在后头及项；少阴头痛多以全头疼痛为主；厥阴头痛部位多在巅顶或连目系，故选A。",
          "type": "多选题"
        },
        {
          "id": 12071,
          "title": "小腿前外侧，犊鼻穴下3寸，距胫骨前缘1横指是？",
          "options": {
            "A": "三阴交",
            "B": "内关",
            "C": "足三里",
            "D": "伏兔",
            "E": "丰隆"
          },
          "answer": "C",
          "analysis": "足三里穴在小腿前外侧，犊鼻穴下3寸，距胫骨前缘1横指处，有强身健体，提高免疫力，补益脾胃的作用，故选C。",
          "type": "多选题"
        },
        {
          "id": 12072,
          "title": "睡眠不足，头昏脑胀时可按摩？",
          "options": {
            "A": "足三里",
            "B": "中脘",
            "C": "三阴交",
            "D": "风池",
            "E": "曲池"
          },
          "answer": "D",
          "analysis": "风池穴善治头部疾病，具有清热降火，通畅气血，疏通经络的作用，按摩该穴可以促进头部气血循环，达到疏散头部气血，益智健脑的功效，故选D。",
          "type": "多选题"
        },
        {
          "id": 12073,
          "title": "下列哪项穴位按摩法对缓解头痛帮助不大？",
          "options": {
            "A": "开天门",
            "B": "推坎宫",
            "C": "揉太阳",
            "D": "拿风池",
            "E": "按中脘"
          },
          "answer": "E",
          "analysis": "开天门、推坎宫、揉太阳、拿风池等按摩手法可以帮助缓解头痛症状，而中脘穴一般用于增强脾胃，故选E。",
          "type": "多选题"
        },
        {
          "id": 12084,
          "title": "六淫的概念是？",
          "options": {
            "A": "风、寒、暑、湿、燥、火六种正常的气候变化",
            "B": "风、寒、暑、湿、燥、火六种病邪",
            "C": "风、寒、暑、湿、燥、火六种外感病邪的统称",
            "D": "内风、内寒、内暑、内湿、内燥、内火",
            "E": "外风、外寒、外暑、外湿、外燥、外火"
          },
          "answer": "C",
          "analysis": "六淫是风、寒、暑、湿、燥、火（热）六种外感病邪的统称。自然界中风、寒、暑、湿、燥、火六种正常的气候变化称为“六气”。六淫即是超过了限度的六气。故选C。",
          "type": "多选题"
        },
        {
          "id": 12085,
          "title": "下列各项，不属于六淫共同致病特点的是？",
          "options": {
            "A": "季节性",
            "B": "相兼性",
            "C": "外感性",
            "D": "流行性",
            "E": "地区性"
          },
          "answer": "D",
          "analysis": "六淫共同致病特点：季节性、相兼性、外感性、地区性、转化性。疠气是有别于六淫而具有强烈传染性的外感病邪，流行性强。故选D。",
          "type": "多选题"
        },
        {
          "id": 12086,
          "title": "六淫中为百病之长的是？",
          "options": {
            "A": "风",
            "B": "寒",
            "C": "暑",
            "D": "湿",
            "E": "火"
          },
          "answer": "A",
          "analysis": "风为百病之长。指风邪为六淫之首，是六淫邪气治病的主要致病因素，是外感病致病的先导。寒、湿、暑、燥、火邪多依附于风邪侵犯人体致病，故临床上有风寒、风湿、风燥、风火等证。故选A。",
          "type": "多选题"
        },
        {
          "id": 12087,
          "title": "易袭阳位，具有升发向上特性的邪气是？",
          "options": {
            "A": "风邪",
            "B": "寒邪",
            "C": "暑邪",
            "D": "湿邪",
            "E": "火邪"
          },
          "answer": "A",
          "analysis": "“伤于风者，上先受之”，风具有轻扬浮越、升散开泄、向上向外的特性，常侵袭人体的头面部、肌表、腰背部、阳经经络等属阳部位。故选A。",
          "type": "多选题"
        },
        {
          "id": 12088,
          "title": "风邪伤人，病变部位不固定主要由其哪种性质决定的？",
          "options": {
            "A": "风性主动",
            "B": "风性数变",
            "C": "风性善行",
            "D": "风性开泄",
            "E": "风性轻扬"
          },
          "answer": "C",
          "analysis": "风邪致病，病位游移不定，例如风疹发无定处，此起彼伏。风具有善动不居、行无定处的特点称为风性善行。故选C。",
          "type": "多选题"
        },
        {
          "id": 12089,
          "title": "何邪致病以疼痛为特点？",
          "options": {
            "A": "风邪",
            "B": "暑邪",
            "C": "寒邪",
            "D": "湿邪",
            "E": "燥邪"
          },
          "answer": "C",
          "analysis": "寒性凝滞，如同水寒凝冰、阻塞不通。寒袭经脉，气血通行不畅，不通则痛；寒袭肌表，营卫通行不畅，头痛、身痛；寒侵筋骨关节，肢体关节疼痛、拘急、屈伸不利。故疼痛是寒邪的重要特征，故选C。",
          "type": "多选题"
        },
        {
          "id": 12090,
          "title": "六淫中最具有明显季节性的邪气是？",
          "options": {
            "A": "风邪",
            "B": "暑邪",
            "C": "寒邪",
            "D": "湿邪",
            "E": "燥邪"
          },
          "answer": "B",
          "analysis": "暑邪致病具有严格季节性，独发于夏令，故选B。",
          "type": "多选题"
        },
        {
          "id": 12091,
          "title": "六淫之中只有外感而无内生的邪气是？",
          "options": {
            "A": "风邪",
            "B": "寒邪",
            "C": "暑邪",
            "D": "湿邪",
            "E": "火邪"
          },
          "answer": "C",
          "analysis": "六淫指风、寒、暑、湿、燥、火（热）六种外感病邪统称；内生“五邪”指疾病发展过程中，机体功能失常而产生的化风、化寒、化湿、化燥、化火等病理变化。暑邪无内生一说，故选C。",
          "type": "多选题"
        },
        {
          "id": 12092,
          "title": "下列哪项不是寒邪的性质和致病特点？",
          "options": {
            "A": "寒性凝滞",
            "B": "寒性清澈",
            "C": "寒为阴邪，易伤阳气",
            "D": "寒性重浊",
            "E": "寒主收引"
          },
          "answer": "D",
          "analysis": "湿性重浊，其余均为寒邪的性质和致病特点，故选D。",
          "type": "多选题"
        },
        {
          "id": 12093,
          "title": "感冒患者，恶寒发热轻微，但以脘腹冷痛，呕吐，腹泻为主症，舌苔薄，脉紧。其病机是",
          "options": {
            "A": "寒邪伤及肌表",
            "B": "寒邪伤及太阴",
            "C": "寒邪直中少阴",
            "D": "寒邪直中脾胃",
            "E": "寒邪伤及厥阴"
          },
          "answer": "D",
          "analysis": "寒邪直中脾胃，脾阳受损，可见脘腹冷痛、呕吐、腹泻等证的表现，与本体患者表现相符，故选D。",
          "type": "多选题"
        },
        {
          "id": 12094,
          "title": "下列哪项属于湿邪的性质？",
          "options": {
            "A": "凝滞",
            "B": "粘滞",
            "C": "涩滞",
            "D": "瘀滞",
            "E": "动血"
          },
          "answer": "B",
          "analysis": "湿性粘滞（粘腻、停滞），阻遏气机，故选B。",
          "type": "多选题"
        },
        {
          "id": 12095,
          "title": "六淫中具有病程长，难以速愈的邪气是？",
          "options": {
            "A": "风邪",
            "B": "暑邪",
            "C": "寒邪",
            "D": "湿邪",
            "E": "燥邪"
          },
          "answer": "D",
          "analysis": "湿性粘滞，病程缠绵、反复发作：如湿疹、湿痹等。故选D。",
          "type": "多选题"
        },
        {
          "id": 12096,
          "title": "其性下趋的邪气是？",
          "options": {
            "A": "风邪",
            "B": "燥邪",
            "C": "湿邪",
            "D": "火邪",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "湿性趋下，易伤阴位，湿邪伤人多始于下部且易于下注，故选C。",
          "type": "多选题"
        },
        {
          "id": 12097,
          "title": "湿邪、寒邪的共同致病特点是",
          "options": {
            "A": "损伤阳气",
            "B": "阻遏气机",
            "C": "粘腻重浊",
            "D": "凝滞收引",
            "E": "易袭阴位"
          },
          "answer": "A",
          "analysis": "湿性、寒邪均为阴邪，易损伤阳气。其余阻遏气机、黏腻重浊、易袭阴位为湿邪的性质和致病特点，凝滞收引为寒邪的性质和致病特点，故选A。",
          "type": "多选题"
        },
        {
          "id": 12098,
          "title": "六淫邪气中，最易伤肺的是？",
          "options": {
            "A": "风邪",
            "B": "暑邪",
            "C": "寒邪",
            "D": "燥邪",
            "E": "火邪"
          },
          "answer": "D",
          "analysis": "燥邪的性质和致病特点：燥性干涩，易伤津液；燥易伤肺。肺为娇脏喜润恶燥，又主司呼吸，与大气相通，外合皮毛，开窍于鼻，故燥邪伤人，从口鼻而入最易损伤肺之气津，选D。",
          "type": "多选题"
        },
        {
          "id": 12099,
          "title": "下列哪项属于火邪、燥邪、暑邪共同的致病特点？",
          "options": {
            "A": "耗气",
            "B": "上炎",
            "C": "伤津",
            "D": "动血",
            "E": "生风"
          },
          "answer": "C",
          "analysis": "火热易伤津耗气；燥性干涩，易伤津液；暑性升散，扰神伤津耗气。共同致病特点是伤津，故选C。",
          "type": "多选题"
        },
        {
          "id": 12100,
          "title": "六淫中最易致肿疡的邪气是？",
          "options": {
            "A": "风邪",
            "B": "火邪",
            "C": "寒邪",
            "D": "湿邪",
            "E": "燥邪"
          },
          "answer": "B",
          "analysis": "火邪易致疮痈：火邪入于血分，可聚于局部，腐蚀血肉，发为痈肿疮疡。故选B。",
          "type": "多选题"
        },
        {
          "id": 12101,
          "title": "在六淫中，易扰心神的邪气是",
          "options": {
            "A": "风邪",
            "B": "燥邪",
            "C": "寒邪",
            "D": "湿邪",
            "E": "火邪"
          },
          "answer": "E",
          "analysis": "火热为阳邪，其性炎上：阳主躁动而向上，火热之性，亦升腾上炎，故属阳邪。因此，火热伤人，多见高热、恶热、烦渴、汗出、脉洪数等症。又因其主动而炎上，故火热伤人则常见神明扰乱，表现为心烦、失眠、狂躁妄动、神昏谵语等。故选E。",
          "type": "多选题"
        },
        {
          "id": 12102,
          "title": "君火内寄于？",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "肾",
            "D": "胆",
            "E": "三焦"
          },
          "answer": "A",
          "analysis": "君火内寄于心，相火内寄于肝、肾、胆、膀胱、三焦等，故选A。",
          "type": "多选题"
        },
        {
          "id": 12103,
          "title": "《黄帝内经》论六淫，热胜则",
          "options": {
            "A": "肿",
            "B": "动",
            "C": "干",
            "D": "浮",
            "E": "濡泻"
          },
          "answer": "A",
          "analysis": "《黄帝内经》论“六淫”：“风胜则动,热胜则肿,燥胜则干,寒胜则浮,湿胜则濡泻”。热邪太过，则能发生红肿，故选A。",
          "type": "多选题"
        },
        {
          "id": 12105,
          "title": "疠气致病最重要的特点是",
          "options": {
            "A": "病情重，预后差",
            "B": "高热持续不退",
            "C": "易伤津耗气",
            "D": "扰动心神",
            "E": "传染性强"
          },
          "answer": "E",
          "analysis": "疠气可通过空气、饮食、皮肤直接接触等多种途径在人群中广泛地传播，故传染性和流行性是疠气的主要特性。故选E。",
          "type": "多选题"
        },
        {
          "id": 12106,
          "title": "与痰饮生成最密切的脏腑是？",
          "options": {
            "A": "肺、脾、肾、三焦",
            "B": "心、肺、脾、肾",
            "C": "肝、胆、脾、肾",
            "D": "心、肝、肺、肾",
            "E": "肝、胆、肾、三焦"
          },
          "answer": "A",
          "analysis": "肺、脾、肾、三焦与水液代谢关系密切。肺主宣降，敷布津液，通调水道；脾主运化水湿；肾阳主水液蒸化；三焦为水液通行之道路。故选A。",
          "type": "多选题"
        },
        {
          "id": 12107,
          "title": "人体水液代谢障碍而形成的病理产物是？",
          "options": {
            "A": "痰饮",
            "B": "瘀血",
            "C": "结石",
            "D": "积食",
            "E": "血瘀"
          },
          "answer": "A",
          "analysis": "痰饮人体水液代谢障碍而形成的病理产物，故选A。",
          "type": "多选题"
        },
        {
          "id": 12109,
          "title": "下列不属于痰饮致病特点的是？",
          "options": {
            "A": "蒙蔽心神",
            "B": "致病广泛",
            "C": "变化多端",
            "D": "阻滞气血",
            "E": "损伤脉络"
          },
          "answer": "E",
          "analysis": "痰饮致病易于阻滞气血运行，不易损伤脉络。故选E。",
          "type": "多选题"
        },
        {
          "id": 12110,
          "title": "下列哪项不属于瘀血的主要临床特点",
          "options": {
            "A": "疼痛",
            "B": "紫绀",
            "C": "发热",
            "D": "肿块",
            "E": "出血"
          },
          "answer": "C",
          "analysis": "瘀血致病的特点：疼痛（多为刺痛，痛处固定不移）；肿块（瘀血积于皮下可见肿块）；出血（瘀血阻滞，损伤血络，导致血溢脉外）；面色紫黯，口唇、爪甲青紫，舌质紫黯或有瘀斑瘀点；脉细涩或结代。发热不为主要致病临床特点，故选C。",
          "type": "多选题"
        },
        {
          "id": 12111,
          "title": "下列有关瘀血致病的特点，错误的是",
          "options": {
            "A": "疼痛多为胀痛，有昼轻夜重的特点",
            "B": "脉细涩或结代",
            "C": "出血血色紫黯或夹有瘀血块",
            "D": "肿块固定不移或拒按",
            "E": "口唇、面部、爪甲青紫"
          },
          "answer": "A",
          "analysis": "瘀血致病疼痛一般表现为刺痛，其余各项均为瘀血致病特点。故选A。",
          "type": "多选题"
        },
        {
          "id": 12112,
          "title": "下列因素中，易于蒙蔽心神的是？",
          "options": {
            "A": "结石",
            "B": "瘀血",
            "C": "痰饮",
            "D": "积食",
            "E": "血瘀"
          },
          "answer": "C",
          "analysis": "痰饮致病，随气上逆，可蒙蔽清窍，扰乱心神，导致神志活动失常，故选C。",
          "type": "多选题"
        },
        {
          "id": 12113,
          "title": "下列因素中，可影响新血生成的病因是（ ）",
          "options": {
            "A": "结石",
            "B": "瘀血",
            "C": "痰饮",
            "D": "积食",
            "E": "血瘀"
          },
          "answer": "B",
          "analysis": "瘀血阻滞，尤其是瘀血日久不散，严重影响气血运行，脏腑失养，生机受阻，势必影响新血的生成。故选B。",
          "type": "多选题"
        },
        {
          "id": 12120,
          "title": "饮食因素致病，易致聚湿、化热、生痰的是",
          "options": {
            "A": "饮食过饥",
            "B": "饮食过饱",
            "C": "饮食不洁",
            "D": "五味偏嗜",
            "E": "寒热偏嗜"
          },
          "answer": "B",
          "analysis": "饮食过饱，若食滞日久，可积而化热；伤于生冷寒热，又可聚湿、生痰。小儿尤为多见。（选B）",
          "type": "多选题"
        },
        {
          "id": 12121,
          "title": "最易导致脘腹胀满，嗳腐泛酸，厌食症状的是",
          "options": {
            "A": "摄食不足",
            "B": "饮食不洁",
            "C": "暴饮暴食",
            "D": "饮食偏寒偏热",
            "E": "饮食五味偏嗜"
          },
          "answer": "C",
          "analysis": "饮食过量，或暴饮暴食，或中气虚弱而强食，以致脾胃难以运化而致病。轻则饮食积滞不化，以致“宿食”内停，可见脘腹胀满疼痛，嗳腐泛酸，呕吐、泄泻、厌食等。重则食滞日久，可致脾胃大伤，或可聚湿、化热、生痰而变生他病。故选C。",
          "type": "多选题"
        },
        {
          "id": 12122,
          "title": "下列不属于过饥的是？",
          "options": {
            "A": "饥不得食",
            "B": "摄食不足",
            "C": "有意识地限制饮食",
            "D": "因脾胃功能不足而不思饮食",
            "E": "进食不规律"
          },
          "answer": "E",
          "analysis": "过饥指摄食不足，或饥不得食，或有意识地限制饮食，或因脾胃功能不足而不思饮食等。进食不规律不属于过饥，E为本题正确答案。",
          "type": "多选题"
        },
        {
          "id": 12123,
          "title": "下列中哪一项不属于饮食不洁",
          "options": {
            "A": "不清洁食物",
            "B": "不卫生食物",
            "C": "有毒食物",
            "D": "陈腐变质食物",
            "E": "偏嗜某种食物"
          },
          "answer": "E",
          "analysis": "饮食不洁指进食不洁净、陈腐变质或有毒的食物。偏嗜某种食物属于饮食偏嗜，故选E。",
          "type": "多选题"
        },
        {
          "id": 12124,
          "title": "易致人体阴阳失调的饮食因素是？",
          "options": {
            "A": "饮食过饥",
            "B": "饮食过饱",
            "C": "五味偏嗜",
            "D": "寒热偏嗜",
            "E": "饮食不洁"
          },
          "answer": "D",
          "analysis": "过分偏寒或偏热饮食，其致病特点主要是导致机体阴阳的偏胜偏衰。故选D。",
          "type": "多选题"
        },
        {
          "id": 12125,
          "title": "《素问·五脏生成篇》说：“多食甘，则____”",
          "options": {
            "A": "肉胝陷而唇揭",
            "B": "骨痛而发落",
            "C": "筋急而爪枯",
            "D": "脉凝泣而色变",
            "E": "皮槁而毛拔"
          },
          "answer": "B",
          "analysis": "“多食咸，则脉凝泣而色变；多食苦，则皮槁而毛拔；多食辛，则筋急而爪枯；多食酸，则肉胝陷(即皮厚而皱缩)而唇揭；多食甘，则骨痛而发落。”故选B。",
          "type": "多选题"
        },
        {
          "id": 12126,
          "title": "可损伤心脾的因素是( )",
          "options": {
            "A": "劳力过度",
            "B": "劳神过度",
            "C": "房劳过度",
            "D": "过饥",
            "E": "过饱"
          },
          "answer": "B",
          "analysis": "心藏神，脾主思，劳神过度，损伤脾气，可致新心神失养，神志不宁，故选B。",
          "type": "多选题"
        },
        {
          "id": 12127,
          "title": "可损伤肾精的因素是( )",
          "options": {
            "A": "劳力过度",
            "B": "劳神过度",
            "C": "房劳过度",
            "D": "过饥",
            "E": "过饱"
          },
          "answer": "C",
          "analysis": "肾藏精，为封藏之本，若房事不节，则耗泄肾精。房劳过度又称“肾劳”。故选C。",
          "type": "多选题"
        },
        {
          "id": 12128,
          "title": "依据《素问·宣明五气篇》理论，久卧易伤及的是？",
          "options": {
            "A": "气",
            "B": "血",
            "C": "肉",
            "D": "精",
            "E": "筋"
          },
          "answer": "A",
          "analysis": "“久视伤血,久卧伤气,久坐伤肉,久立伤骨,久行伤筋,是谓五劳所伤。”过度卧床，易使肺吸入的新鲜空气缺乏，肺的机能变弱，而肺主一身之气，所以久卧伤气。故选A。",
          "type": "多选题"
        },
        {
          "id": 12129,
          "title": "疾病发生的内在因素是？",
          "options": {
            "A": "邪气偏盛",
            "B": "邪盛正衰",
            "C": "正气不足",
            "D": "正胜邪衰",
            "E": "正虚邪恋"
          },
          "answer": "C",
          "analysis": "正气不足是发病的内在因素，邪气是发病的重要条件。故选C。",
          "type": "多选题"
        },
        {
          "id": 12130,
          "title": "肝病日久发臌胀所属发病类型是？",
          "options": {
            "A": "卒发",
            "B": "徐发",
            "C": "伏而后发",
            "D": "继发",
            "E": "复发"
          },
          "answer": "D",
          "analysis": "继发是指在原发疾病的基础上，继而发生新的疾病，如肝病日久发臌胀、久虐。故选D。",
          "type": "多选题"
        },
        {
          "id": 12131,
          "title": "温毒邪盛，感而爆发所属发病类型是？",
          "options": {
            "A": "卒发",
            "B": "徐发",
            "C": "伏而后发",
            "D": "继发",
            "E": "复发"
          },
          "answer": "A",
          "analysis": "卒发指感邪后立即发病，发病迅速之意。如感受风寒、风热、温热、暑热、温毒邪气，邪气较盛时，多感邪即发。故选A。",
          "type": "多选题"
        },
        {
          "id": 12132,
          "title": "合病是指？",
          "options": {
            "A": "多部位同时受邪",
            "B": "表证未罢又见里证",
            "C": "寒湿合邪而侵入",
            "D": "经脉间病证传变",
            "E": "湿热合邪而致病"
          },
          "answer": "A",
          "analysis": "合病是指两经或两个部位以上同时受邪所出现的病证。强调“同时”，故选A。",
          "type": "多选题"
        },
        {
          "id": 12133,
          "title": "食用鱼虾海鲜导致瘾疹复发属于？",
          "options": {
            "A": "重感致复",
            "B": "食复",
            "C": "劳复",
            "D": "药复",
            "E": "情志致复"
          },
          "answer": "B",
          "analysis": "食复指因饮食不和而致复发者，例如饮食不节可致脾胃病复发，鱼虾海鲜可致瘾疹和哮喘病复发。故选B。",
          "type": "多选题"
        },
        {
          "id": 12139,
          "title": "各种致病因素又可称为",
          "options": {
            "A": "疠气",
            "B": "邪气",
            "C": "六淫",
            "D": "虚邪",
            "E": "正邪"
          },
          "answer": "B",
          "analysis": "邪气泛指一切致病因素，正气是人的正常功能的高度概括，包括防御能力、抗病能力、康复能力。故选B。",
          "type": "多选题"
        },
        {
          "id": 12140,
          "title": "证候虚实的“实”是指？",
          "options": {
            "A": "体质壮实",
            "B": "正气旺盛",
            "C": "邪气亢盛",
            "D": "病邪内生",
            "E": "外邪侵袭"
          },
          "answer": "C",
          "analysis": "实，是指以邪气盛为主要矛盾的一种病理变化。故选C。",
          "type": "多选题"
        },
        {
          "id": 12141,
          "title": "疾病治疗及时，趋于好转痊愈的病机是？",
          "options": {
            "A": "正胜邪退",
            "B": "邪去正虚",
            "C": "邪胜正衰",
            "D": "邪正相持",
            "E": "正虚邪恋"
          },
          "answer": "A",
          "analysis": "正胜邪退，疾病趋向于好转和痊愈；邪去正虚，多见于重病的恢复期；邪盛正衰，疾病趋向恶化；邪正相持，疾病趋向于慢性化；正虚邪恋，多见于疾病后期，慢性疾病久治不愈或遗留后遗症的主要原因之一。故选A。",
          "type": "多选题"
        },
        {
          "id": 12142,
          "title": "阴偏衰所形成的病理变化是？",
          "options": {
            "A": "实热",
            "B": "实寒",
            "C": "虚热",
            "D": "虚寒",
            "E": "真寒假热"
          },
          "answer": "C",
          "analysis": "阴偏衰多表现为阴液不足和滋养、宁静功能减退以及阳气相对亢盛的虚热证。故选C。",
          "type": "多选题"
        },
        {
          "id": 12143,
          "title": "阳偏胜所形成的病理变化是？",
          "options": {
            "A": "实热",
            "B": "实寒",
            "C": "虚热",
            "D": "虚寒",
            "E": "真寒假热"
          },
          "answer": "A",
          "analysis": "阳偏盛多表现为阳热亢盛而阴液未亏或亏损不甚的实热证候。故选A。",
          "type": "多选题"
        },
        {
          "id": 12144,
          "title": "最易发生阴阳互损的脏是？",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "阴阳互损，是指在阴或阳任何一方虚损的前提下，病变发展影响另外一方，形成阴阳两虚的病机。在阴虚的基础上，继而导致阳虚，称为阴损及阳；在阳虚的基础上，继而导致阴虚，称为阳损及阴。由于肾为五脏阴阳之本，故无论阴虚或阳虚，多在损及肾之阴阳及肾本身阴阳失调的情况下，才易发生阴阳互损的病理变化。故本题选E。",
          "type": "多选题"
        },
        {
          "id": 12145,
          "title": "以阴阳失调来阐释真寒假热或真热假寒，其病机是？",
          "options": {
            "A": "阴阳偏盛",
            "B": "阴阳偏衰",
            "C": "阴阳格拒",
            "D": "阴阳互损",
            "E": "阴阳离决"
          },
          "answer": "C",
          "analysis": "阴阳相互格拒的机理，在于阴阳双方的对立排斥，即阴或阳的一方偏盛至极，壅遏于内，将另一方排斥格拒于外，迫使阴阳之间不相维系，从而出现真寒假热或真热假寒的复杂病变。故选C。",
          "type": "多选题"
        },
        {
          "id": 12146,
          "title": "下列哪项不是亡阳证的表现",
          "options": {
            "A": "面色苍白",
            "B": "汗出而热",
            "C": "呼吸微弱",
            "D": "脉微欲绝",
            "E": "四肢厥冷"
          },
          "answer": "B",
          "analysis": "亡阳证常表现为精神淡漠，面色苍白，冷汗淋漓，四肢厥逆，呼吸微弱，口不渴或渴喜热饮，舌淡，脉微欲绝。故A、C、D、E均为亡阳证表现，选B。",
          "type": "多选题"
        },
        {
          "id": 12147,
          "title": "下面哪一项不属于气机失调？",
          "options": {
            "A": "气滞",
            "B": "气逆",
            "C": "气陷",
            "D": "气虚",
            "E": "气脱"
          },
          "answer": "D",
          "analysis": "气的失常包括气虚和气机失调两个方面的病理变化。气机失调一般概括为：气滞(气的流通障碍)、气逆(气的上升运动过强或下降运动不及)、气陷(气的上升力量不足或下降力量过强)、气闭(气的外出受阻)和气脱(气不内守而外脱)等。气虚不属于气机失调。故选D。",
          "type": "多选题"
        },
        {
          "id": 12148,
          "title": "内脏下垂的病机是",
          "options": {
            "A": "气滞",
            "B": "气逆",
            "C": "气闭",
            "D": "气陷",
            "E": "气脱"
          },
          "answer": "D",
          "analysis": "中气下陷，则内脏位置维系无力，可发生某些内脏的位置下移。故选D。",
          "type": "多选题"
        },
        {
          "id": 12149,
          "title": "气出入受阻，突然昏厥的病理变化为",
          "options": {
            "A": "气滞",
            "B": "气逆",
            "C": "气闭",
            "D": "气陷",
            "E": "气脱"
          },
          "answer": "C",
          "analysis": "气闭，即气机闭阻，外出严重障碍，以致清窍闭塞，出现昏厥的一种病理状态。故本题选C。",
          "type": "多选题"
        },
        {
          "id": 12150,
          "title": "血虚证可见",
          "options": {
            "A": "唇色淡白",
            "B": "唇色红润",
            "C": "唇色深红",
            "D": "唇色青黑",
            "E": "唇色紫黯"
          },
          "answer": "A",
          "analysis": "血虚病人典型的症状为面色无华，唇色淡白，爪甲不荣。唇色红润为正常征象。唇色深红为里热炽盛。唇色青紫为瘀血阻滞。故选A。",
          "type": "多选题"
        },
        {
          "id": 12151,
          "title": "血瘀疼痛表现为",
          "options": {
            "A": "疼痛如针刺刀割",
            "B": "牵掣作痛",
            "C": "疼痛范围广",
            "D": "日间较甚",
            "E": "痛无定处"
          },
          "answer": "A",
          "analysis": "血瘀疼痛特点：痛如针刺，痛处固定，痛而夜甚。故选A。",
          "type": "多选题"
        },
        {
          "id": 12152,
          "title": "津亏血瘀的病机是？",
          "options": {
            "A": "津少不能化血",
            "B": "血瘀不能化津",
            "C": "血脉瘀阻，津液停聚",
            "D": "津液枯涸，燥热内生",
            "E": "津液亏耗，脉失濡润"
          },
          "answer": "E",
          "analysis": "津亏血瘀,主要指津液耗损导致血行瘀滞不畅的病理状态。津液大量亏耗，则血量减少，血液循行滞涩不畅，从而发生血瘀之病变。故选E。",
          "type": "多选题"
        },
        {
          "id": 12153,
          "title": "以下哪项一般不属于气与血关系失常的病理变化（ ）",
          "options": {
            "A": "气滞血瘀",
            "B": "气不摄血",
            "C": "气随血脱",
            "D": "气虚血热",
            "E": "气虚血瘀"
          },
          "answer": "D",
          "analysis": "气与血关系失常的病理变化包括气滞血瘀、气虚血瘀、气不摄血、津亏血瘀、气血两虚。气虚血热不在其中，故选D。",
          "type": "多选题"
        },
        {
          "id": 12154,
          "title": "《临证指南医案》说“内风’产生之机理为",
          "options": {
            "A": "体内气机之逆乱",
            "B": "体内阳气之变动",
            "C": "体内筋脉之失养",
            "D": "体内阴血之不足",
            "E": "周身络脉之失濡"
          },
          "answer": "B",
          "analysis": "风气内动，是阳气亢逆变动而形成的病理变化，《临证指南医案》说：“内风乃身内阳气之变动。”故选B。体内气机之逆乱是肝阳化风的病因，体内筋脉之失养、体内阴血之不足、周身络脉之失濡是血虚生风的病因。",
          "type": "多选题"
        },
        {
          "id": 12155,
          "title": "湿浊内生主要责之何脏功能障碍？",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "C",
          "analysis": "湿浊内生，又称“内湿”，是指由于脾的运化水湿功能和输布津液的功能障碍，从而引起水湿痰浊蓄积停滞的病理变化。由于内生之湿多因脾虚，故又称之为脾虚生湿。内湿的产生，多因素体肥胖，痰湿过盛；或因恣食生冷，过食肥甘，内伤脾胃，致使脾失健运，津液的输布发生障碍所致，脾的运化功能失职是湿浊内生的关键。《素问・至真要大论》：“诸湿肿满，皆属于脾”。故选C。",
          "type": "多选题"
        },
        {
          "id": 12156,
          "title": "以下哪项不属于内火？",
          "options": {
            "A": "五气化火",
            "B": "五志化火",
            "C": "阴虚火旺",
            "D": "热陷心包",
            "E": "阳亢化火"
          },
          "answer": "D",
          "analysis": "火热内生的病机主要有，阳气过盛化火、阴虚火旺、邪郁化火、五志郁而化热。热陷心包是外感热邪内陷心包，不属于火热内生。故选D。",
          "type": "多选题"
        },
        {
          "id": 12157,
          "title": "下列内容中除何项外均属治则的内容",
          "options": {
            "A": "正治与反治",
            "B": "治标与治本",
            "C": "扶正与祛邪",
            "D": "调整阴阳",
            "E": "调理脾胃"
          },
          "answer": "E",
          "analysis": "治则为治疗的基本原则，治法是在治则指导下在临床实践中治法的具体运用。本题调理脾胃属于治法，其余均属于治则。故选E。",
          "type": "多选题"
        },
        {
          "id": 12158,
          "title": "下列属于相克治法的是？",
          "options": {
            "A": "滋水涵木法",
            "B": "金水相生法",
            "C": "培土生金法",
            "D": "益火补土法",
            "E": "泻南补北法"
          },
          "answer": "E",
          "analysis": "心主火，火属南方；肾主水，水属北方。泻南补北法，即泻心火滋肾水，又称泻火补水法。适用于肾阴不足，心火偏旺，水火不济，心肾不交之证。水克火，属于相克治法，其余均为相生治法。故选E。",
          "type": "多选题"
        },
        {
          "id": 12159,
          "title": "既病防变属于",
          "options": {
            "A": "治病求本",
            "B": "治未病",
            "C": "因人制宜",
            "D": "因地制宜",
            "E": "因时制宜"
          },
          "answer": "B",
          "analysis": "治未病，包括未病先防、既病防变、愈后防复三个方面。故本题选B。",
          "type": "多选题"
        },
        {
          "id": 12163,
          "title": "“见肝之病，知肝传脾，当先实脾”的治法属于（ ）",
          "options": {
            "A": "控制疾病传变",
            "B": "提高抗邪能力",
            "C": "避免病邪侵入",
            "D": "早期诊断治疗",
            "E": "防止疾病发生"
          },
          "answer": "A",
          "analysis": "“见肝之病，知肝传脾，当先实脾”是指肝病发展，病邪会侵犯脾脏，治疗应当先实脾气，使脾气旺而不受邪，以阻断病邪的传变。属于控制疾病传变，故选A。",
          "type": "多选题"
        },
        {
          "id": 12164,
          "title": "未病先防，应顺应季节，慎避外邪，如秋天防（ ）",
          "options": {
            "A": "风",
            "B": "暑",
            "C": "燥",
            "D": "寒",
            "E": "湿"
          },
          "answer": "C",
          "analysis": "春天防风，夏天防暑，秋天防燥，冬天防寒。故选C。",
          "type": "多选题"
        },
        {
          "id": 12165,
          "title": "“春夏养阳，秋冬养阴”是属于哪一种养生原则( )",
          "options": {
            "A": "顺应自然",
            "B": "养性调神",
            "C": "护肾保精",
            "D": "调摄饮食",
            "E": "体魄锻炼"
          },
          "answer": "A",
          "analysis": "“春夏养阳，秋冬养阴”属于顺应季节之变化。提示人应主动根据四时气候变化规律调摄，顺从四时寒暑变化，保持与外界环境的协调统一。故本题选A。",
          "type": "多选题"
        },
        {
          "id": 12169,
          "title": "先扶正后祛邪适用于",
          "options": {
            "A": "虚证",
            "B": "实证",
            "C": "虚实夹杂证",
            "D": "邪盛正虚，尚耐攻伐，兼顾扶正会助邪",
            "E": "正虚邪盛，不耐攻伐，兼顾祛邪会伤正"
          },
          "answer": "E",
          "analysis": "正虚邪盛，不耐攻伐，兼顾祛邪会伤正应先扶正后祛邪。故选E。",
          "type": "多选题"
        },
        {
          "id": 12170,
          "title": "正虚不甚，邪势方张，正气尚能耐攻者应用哪一项治法？",
          "options": {
            "A": "扶正",
            "B": "祛邪",
            "C": "扶正兼祛邪",
            "D": "先扶正后祛邪",
            "E": "先祛邪后扶正"
          },
          "answer": "E",
          "analysis": "正虚不甚，邪势方张，正气尚能耐攻者应先祛邪后扶正。故选E。",
          "type": "多选题"
        },
        {
          "id": 12171,
          "title": "正虚为主的虚实夹杂证应用哪一项治法？",
          "options": {
            "A": "扶正",
            "B": "祛邪",
            "C": "扶正兼祛邪",
            "D": "先扶正后祛邪",
            "E": "先祛邪后扶正"
          },
          "answer": "C",
          "analysis": "正虚为主的虚实夹杂证应使用扶正兼祛邪。故选C。",
          "type": "多选题"
        },
        {
          "id": 12172,
          "title": "“通因通用”适用于治疗的病证是？",
          "options": {
            "A": "实证",
            "B": "虚证",
            "C": "虚实错杂证",
            "D": "真虚假实证",
            "E": "真实假虚证"
          },
          "answer": "E",
          "analysis": "“通因通用”即以通治通，是指用通利的药物来治疗具有通泻症状的实证。适用于因实邪内阻而出现通泻症状的真实假虚证。故选E。",
          "type": "多选题"
        },
        {
          "id": 12173,
          "title": "“阴中求阳”的治疗方法适用于(  )？",
          "options": {
            "A": "阴虚",
            "B": "阳虚",
            "C": "阴盛",
            "D": "阳盛",
            "E": "阴阳两虚"
          },
          "answer": "B",
          "analysis": "因为阴阳之间存在着互根互用的关系。当阴阳之间发生病理性变化时可以出现阴阳互损的情况。阴阳互损导致阴阳两虚，所以临床上应采用阴阳双补的治疗原则。补阳时适当作以补阴药谓之阴中求阳，适用于阳虚。故选B。",
          "type": "多选题"
        },
        {
          "id": 12174,
          "title": "寒性病变出现寒象，用温热药来治疗，应概括为下列哪一项？",
          "options": {
            "A": "寒者热之",
            "B": "热者寒之",
            "C": "用寒远寒",
            "D": "用热远热",
            "E": "逆者正治"
          },
          "answer": "A",
          "analysis": "寒性病变出现寒象，用温热药来治疗，就是寒者热之。故本题选A。",
          "type": "多选题"
        },
        {
          "id": 12191,
          "title": "“用寒远寒，用热远热”属于下列哪项治则？",
          "options": {
            "A": "因病制宜",
            "B": "因地制宜",
            "C": "因人制宜",
            "D": "因时制宜",
            "E": "以上都是"
          },
          "answer": "D",
          "analysis": "“用寒远寒，用热远热”是指用寒凉方药及食物时，当避其气候之寒凉；用温热方药及食物时，当避其气候之温热，属于因时制宜范畴，故选D。",
          "type": "多选题"
        },
        {
          "id": 12193,
          "title": "以下哪种治法符合“用寒远寒”的观点？",
          "options": {
            "A": "虚寒证慎用寒药",
            "B": "实寒证慎用寒药",
            "C": "冬季慎用寒药",
            "D": "寒热错杂证慎用寒药",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "“用寒远寒”是指用寒凉方药及食物时，当避其气候之寒凉",
          "type": "多选题"
        },
        {
          "id": 12194,
          "title": "应慎用温热之剂的体质是？",
          "options": {
            "A": "阳盛之体",
            "B": "阴盛之体",
            "C": "阳虚之体",
            "D": "气虚之体",
            "E": "痰湿之体"
          },
          "answer": "A",
          "analysis": "患同一疾病，体质不同，治法也有所区别，阳盛之体阳气旺盛，用药时应注意慎用温热之剂，故选A。",
          "type": "多选题"
        },
        {
          "id": 12197,
          "title": "魏晋南北朝至隋唐时期属于中医护理学发展的:",
          "options": {
            "A": "成熟阶段",
            "B": "充实阶段",
            "C": "发展阶段",
            "D": "初步形成阶段",
            "E": "原始萌芽阶段"
          },
          "answer": "C",
          "analysis": "远古至公元前21世纪属于中医护理学发展的原始萌芽阶段；夏至春秋时期属于中医护理学发展的早期实践阶段；战国至东汉时期属于中医护理学发展的初步形成阶段；魏晋南北朝至隋唐时期属于中医护理学发展的发展阶段；宋金元时期属于中医护理学发展的充实阶段；明清时期属于中医护理学发展的成熟阶段，故选C。",
          "type": "多选题"
        },
        {
          "id": 12200,
          "title": "夏至春秋时期属于中医护理学发展的：",
          "options": {
            "A": "成熟阶段",
            "B": "早期实践阶段",
            "C": "发展阶段",
            "D": "初步形成阶段",
            "E": "原始萌芽阶段"
          },
          "answer": "B",
          "analysis": "远古至公元前21世纪属于中医护理学发展的原始萌芽阶段；夏至春秋时期属于中医护理学发展的早期实践阶段；战国至东汉时期属于中医护理学发展的初步形成阶段；魏晋南北朝至隋唐时期属于中医护理学发展的发展阶段；宋金元时期属于中医护理学发展的充实阶段；明清时期属于中医护理学发展的成熟阶段，故选B。",
          "type": "多选题"
        },
        {
          "id": 12212,
          "title": "下列书籍中，属于中医学骨伤科代表作的是：",
          "options": {
            "A": "《黄帝内经》",
            "B": "《伤寒杂病论》",
            "C": "《神农本草经》",
            "D": "《千金要方》",
            "E": "《仙授理伤续断方》"
          },
          "answer": "E",
          "analysis": "《黄帝内经》是我国现存最早的医学经典；《伤寒杂病论》是我国第一部理法方药具备的医学经典著作；《神农本草经》是我国第一部药物学专著；《千金要方》是我国现存最早的临床实用百科全书;《仙授理伤续断方》属于中医学骨伤科代表作，故选E。",
          "type": "多选题"
        },
        {
          "id": 12231,
          "title": "以喜胜悲的情志护理，属于()",
          "options": {
            "A": "以情胜情法",
            "B": "移情易性法",
            "C": "语言开导法",
            "D": "劝说疏导法",
            "E": "顺情从欲法"
          },
          "answer": "A",
          "analysis": "移情易性法属于转移法，是把患者的注意力转移和情志转移的一种方法；语言开导法，就是通过交谈，用浅显明白的道理，经过说服教育，使其发泄心中屈情，了解内心郁悄的性质以及自己所能做的努力，主动解除消极的心理状态的一种疗法；顺情从欲法为顺从患者的意志，意愿，情绪，满足其心身的需要，以解除患者心理病因的一种情志护理方法；劝说疏导法正确地运用“言语”这一工具，对病人采取启发诱导的方法；以情胜情法又称为情志制约法，以一种情志克胜以制约另一种情志的方法，而以喜胜悲的情志护理，就属于以情胜情法，故选A。",
          "type": "多选题"
        },
        {
          "id": 12235,
          "title": "“动静结合”、“形劳而不倦”属于（   ）",
          "options": {
            "A": "顺应四时调整阴阳",
            "B": "起居有常",
            "C": "安卧有方",
            "D": "谨防劳伤",
            "E": "居处适宜"
          },
          "answer": "D",
          "analysis": "顺应四时调整阴阳即为尊重自然规律,顺应自然规律;起居有常指按规定时间睡眠与起床；安卧有方就是要做到工作和睡眠符合自然规律和人体的生理节律；居处适宜相当于环境养生，即居住之处的环境要安静与适宜；谨防劳伤即谨慎防止因劳动或锻炼而产生的身体损伤，“动静结合”、“形劳而不倦”就属于劳逸结合，适度锻炼，故为谨防劳伤，故选D。",
          "type": "多选题"
        },
        {
          "id": 12236,
          "title": "保持病室环境适宜属于（  ）",
          "options": {
            "A": "顺应四时调整阴阳",
            "B": "起居有常",
            "C": "安卧有方",
            "D": "谨防劳伤",
            "E": "居处适宜"
          },
          "answer": "E",
          "analysis": "顺应四时调整阴阳即为尊重自然规律,顺应自然规律;起居有常指按规定时间睡眠与起床；安卧有方就是要做到工作和睡眠符合自然规律和人体的生理节律；谨防劳伤即谨慎防止因劳动或锻炼而产生的身体损伤；居处适宜相当于环境养生，即居住之处的环境要安静与适宜，而保持病室环境适宜就属于居处适宜，故选E。",
          "type": "多选题"
        },
        {
          "id": 12245,
          "title": "我国现存最早的本草专著是？",
          "options": {
            "A": "《开宝本草》",
            "B": "《嘉佑本草》",
            "C": "《神农本草经》",
            "D": "《新修本草》",
            "E": "《本草拾遗》"
          },
          "answer": "C",
          "analysis": "我国现存最早的本草专著当推《神农本草经》，一般认为该书约成于西汉末年至东汉初年，是汉以前药学知识和经验的第一次大总结，故选C。",
          "type": "多选题"
        },
        {
          "id": 12249,
          "title": "醋炙香附的目的是？",
          "options": {
            "A": "增强疗效",
            "B": "减低毒性",
            "C": "改变药性",
            "D": "便于服用",
            "E": "有利贮藏"
          },
          "answer": "A",
          "analysis": "醋炙香附可增强其疏肝止痛的功效，故选A。",
          "type": "多选题"
        },
        {
          "id": 12250,
          "title": "具有升浮性质的性味是？",
          "options": {
            "A": "甘、辛、凉",
            "B": "辛、苦、热",
            "C": "辛、甘、温",
            "D": "淡、甘、寒",
            "E": "以上都不是"
          },
          "answer": "C",
          "analysis": "一般来讲，味属辛、甘，性属温、热的药物，大多数为升浮药，如麻黄、升麻、黄芪等药，故选C。",
          "type": "多选题"
        },
        {
          "id": 12252,
          "title": "人参配莱菔子，莱菔子能削弱人参的补气作用，这种配伍关系属于？",
          "options": {
            "A": "相须",
            "B": "相使",
            "C": "相畏",
            "D": "相杀",
            "E": "相恶"
          },
          "answer": "E",
          "analysis": "人参恶莱菔子，是指人参与莱菔子配伍同用，莱菔子能削弱人参的补气作用，这种配伍关系属于相恶，故选E。",
          "type": "多选题"
        },
        {
          "id": 12310,
          "title": "以下哪项不是得神的表现？",
          "options": {
            "A": "神志清楚",
            "B": "语言动作如常",
            "C": "目光明亮",
            "D": "颧红如妆",
            "E": ""
          },
          "answer": "D",
          "analysis": "得神临床表现为神志清楚，语言清晰；目光明亮，精彩内含；面色荣润含蓄，表情丰富自然；反应灵敏，动作灵活，体态自如；呼吸平稳，肌肉不削。故选D。",
          "type": "多选题"
        },
        {
          "id": 12312,
          "title": "哪项症状不是失神病人的临床表现？",
          "options": {
            "A": "呼吸异常",
            "B": "颧赤如妆",
            "C": "言语失伦",
            "D": "动作失灵",
            "E": ""
          },
          "answer": "B",
          "analysis": "颧赤如妆为假神病人的临床表现，故选B。",
          "type": "多选题"
        },
        {
          "id": 12316,
          "title": "“大骨枯槁，大肉陷下”属于下列哪项的表现？",
          "options": {
            "A": "中焦火盛",
            "B": "脾虚有湿",
            "C": "阴虚火旺",
            "D": "脏腑精气衰竭",
            "E": ""
          },
          "answer": "D",
          "analysis": "大骨枯槁，大肉下陷为脏腑精气衰竭，气液严重损耗，机体失充而致。故选D。",
          "type": "多选题"
        },
        {
          "id": 12318,
          "title": "神具体反映在人的",
          "options": {
            "A": "目光",
            "B": "面色",
            "C": "表情",
            "D": "言语",
            "E": ""
          },
          "answer": "A#B#C#D",
          "analysis": "神，具体反映在人的目光、面色、表情、神识、言语、体态等方面，这是望神的主要内容。故选ABCD。",
          "type": "多选题"
        },
        {
          "id": 12330,
          "title": "对病人面色的观察，首先应注意鉴别",
          "options": {
            "A": "主色与客色",
            "B": "常色与病色",
            "C": "主色与病色",
            "D": "善色与恶色",
            "E": ""
          },
          "answer": "D",
          "analysis": null,
          "type": "多选题"
        },
        {
          "id": 12340,
          "title": "面色赤与下列哪项疾病有关？",
          "options": {
            "A": "虚热证",
            "B": "实热证",
            "C": "真寒假热",
            "D": "戴阳证",
            "E": ""
          },
          "answer": "A#B#C#D",
          "analysis": null,
          "type": "多选题"
        },
        {
          "id": 12357,
          "title": "舌体瘦薄，舌色淡白，说明：",
          "options": {
            "A": "阴亏",
            "B": "伤津",
            "C": "气血两虚",
            "D": "阳虚",
            "E": ""
          },
          "answer": "C",
          "analysis": "舌色淡白而瘦瘪，为阴阳两虚，气血不足，不能充盈舌体，日久因舌体得不到濡养而瘦瘪。故选C。",
          "type": "多选题"
        },
        {
          "id": 12359,
          "title": "裂纹舌的主病是：",
          "options": {
            "A": "热盛伤阴",
            "B": "阴虚液损",
            "C": "血虚不润",
            "D": "脾虚湿浸",
            "E": ""
          },
          "answer": "A#B#C#D",
          "analysis": "裂纹舌主病：热盛伤阴，多为红绛舌有裂纹；血虚不润，多为淡白舌有裂纹，脾虚湿浸，多舌质淡白胖嫩，边有齿痕，又有裂纹。故选ABCD。",
          "type": "多选题"
        },
        {
          "id": 12389,
          "title": "患者发热，头痛，咳嗽，咽喉肿痛，大便溏泻，小便清长，证属",
          "options": {
            "A": "上热下寒",
            "B": "真热假寒",
            "C": "表热里寒",
            "D": "表实里虚",
            "E": ""
          },
          "answer": "C",
          "analysis": "表热里寒临床表现为既有发热、头痛、恶风等表热症。又同时出现大便溏泄、小便清长、肢冷、不渴等里寒证。故选C。",
          "type": "多选题"
        },
        {
          "id": 12391,
          "title": "寒热往来、胸肋苦满、心烦喜呕、默默不欲食，证属",
          "options": {
            "A": "表寒里热证",
            "B": "寒热错杂证",
            "C": "上热下寒证",
            "D": "半表半里证",
            "E": ""
          },
          "answer": "D",
          "analysis": "半表半里证表现为寒热往来，胸胁苦满，心烦喜呕，默默不欲饮食，口苦，咽干，目眩，脉弦等。故选D。",
          "type": "多选题"
        },
        {
          "id": 12400,
          "title": "冷汗淋漓见于",
          "options": {
            "A": "气虚证",
            "B": "阳虚证",
            "C": "亡阳证",
            "D": "亡阴证",
            "E": ""
          },
          "answer": "C",
          "analysis": "亡阳证临床表现: 冷汗淋漓、汗质稀淡,神情淡、漠,肌肤不温,手足厥冷,呼吸气弱,面色苍白,舌淡而润,脉微欲绝等。故选C。",
          "type": "多选题"
        },
        {
          "id": 12410,
          "title": "患者自觉口甜黏腻，多属",
          "options": {
            "A": "脾胃气虚",
            "B": "肝胃蕴热",
            "C": "脾胃湿热",
            "D": "脾阳虚",
            "E": ""
          },
          "answer": "C",
          "analysis": "口甜是指病人自觉口中有甜味的症状。多见于脾胃湿热或脾虚之证。故选C。",
          "type": "多选题"
        },
        {
          "id": 12411,
          "title": "嗜睡的主要病机是",
          "options": {
            "A": "阳虚阴盛",
            "B": "阳盛阴虚",
            "C": "阴阳两虚",
            "D": "阴盛格阳",
            "E": ""
          },
          "answer": "A",
          "analysis": "常见于肾阳虚不能温养脏腑所致的阴寒内盛证候。症见嗜睡、形寒肢冷、痰饮、水肿、泄泻等。故选A。",
          "type": "多选题"
        },
        {
          "id": 12412,
          "title": "大便稀溏如黄糜，泻下不爽者，属于",
          "options": {
            "A": "脾阳不振",
            "B": "寒湿困脾",
            "C": "湿热蕴结大肠",
            "D": "肝脾不调",
            "E": ""
          },
          "answer": "C",
          "analysis": "大肠湿热，主要表现腹痛、腹泻、粪便黄褐色、气秽、肛门灼热、腹痛即泄、心烦口渴、小便短赤、舌黄苔厚腻。故选C。",
          "type": "多选题"
        },
        {
          "id": 12429,
          "title": "正式提出八纲名称的是",
          "options": {
            "A": "张仲景",
            "B": "方隅",
            "C": "张景岳",
            "D": "祝味菊",
            "E": "无考"
          },
          "answer": "D",
          "analysis": "祝味菊崇尚温阳，首提“八纲”一词，独创“伤寒五段’“本体疗法”等思想，新解发热机制，重识四气五味，临床上善用附子，创多种温热配伍法,是沪上“火神派”的代表人物。故选D.",
          "type": "多选题"
        },
        {
          "id": 12430,
          "title": "里证的成因是",
          "options": {
            "A": "外邪直接侵犯脏腑",
            "B": "表邪不解内传入里",
            "C": "情志内伤",
            "D": "旧疾加新疾",
            "E": "内有宿食、外感风热"
          },
          "answer": "A#B#C",
          "analysis": "“里证是指外邪内侵脏腑，引起脏腑功能失调所产生的症候，多见于外感病的中后期，以及各种内伤疾病。里证多是由于表邪不解，由表人里而致，或是由于六淫邪气直接侵犯脏腑形成 里热证。如春温，是一种发于春季的温病，病一开始即为里热证。”故选ABC。",
          "type": "多选题"
        },
        {
          "id": 12450,
          "title": "真热假寒证最突出的证候是",
          "options": {
            "A": "脉沉有力",
            "B": "神昏息粗",
            "C": "高热肢厥",
            "D": "口渴引饮",
            "E": "胸腹灼热"
          },
          "answer": "C",
          "analysis": "真热假寒证内热炽盛而外见寒象的证候。即阳证似阴。因内热过盛，阳气闭郁不能外达所致。《景岳全书·传忠录》：“阳极反能寒厥，乃内热而外寒，即真热假寒也。假寒者，火极似水也。凡伤寒热甚，失于汗下，以致阳邪亢极，郁伏于内，则邪自阳经传入阴分，故为身热发厥，神气昏沉，或时畏寒，状若阴证。”其证又见声壮气粗，形强有力，或唇焦舌黑，口渴饮冷，小便赤涩，大便秘结，或因多饮药水，以致下利纯清水，而其中乃有燥粪及矢气极臭，六脉皆沉滑有力，则为阳证真热。内实者，宜择用三承气汤，潮热者以大柴胡汤解而下之。内不实者，以白虎汤之类清之。至于杂证之假寒者，或为畏寒或为战栗，以热极于内，而寒侵于外，寒热之气两不相投，因而寒栗。察其内证，或为喜冷，或为便结，或小便热涩，或口臭躁烦，脉滑实有力，当以凉隔散加苓、连之属，使内热既除，则外寒自伏。故选C。",
          "type": "多选题"
        },
        {
          "id": 12451,
          "title": "患肺痨两年、有潮热、盗汗、颧红、现恶寒甚、低热、头痛、无汗、舌红苔白、脉浮细数、最宜诊断为",
          "options": {
            "A": "表实热里虚热证",
            "B": "表热里寒证",
            "C": "表实寒里虚寒证",
            "D": "表实热里虚寒证",
            "E": "表实寒里虚热证"
          },
          "answer": "E",
          "analysis": "表实寒里虚热证的临床表现：里虚热证，心烦不眠，口燥咽干，潮热盗汗，大便秘结，舌红，脉细数等。 经行淋漓日久不止，色鲜质稠；伴两颧潮红，五心烦热，口咽干燥，舌红少苔，脉细数。故选E。",
          "type": "多选题"
        },
        {
          "id": 12452,
          "title": "根据中医学理论，下列哪项最常见",
          "options": {
            "A": "表虚热里虚寒证",
            "B": "表里虚热证",
            "C": "表热里寒证",
            "D": "里虚寒表实寒证",
            "E": "里虚热表实寒证"
          },
          "answer": "D",
          "analysis": "中医学理论中最常见的是：里虚寒证面（白光）少华，精神不振，畏寒肢冷，得热则舒，腹痛喜按，小便清长，大便稀薄，舌淡苔白，脉沉迟缓弱。故选D。",
          "type": "多选题"
        },
        {
          "id": 12453,
          "title": "常提到的证候真假有",
          "options": {
            "A": "表里真假",
            "B": "寒热真假",
            "C": "虚实真假",
            "D": "阴阳真假",
            "E": "标本真假"
          },
          "answer": "B#C",
          "analysis": "症候真假的辨识包含寒热真假的鉴别、虚实真假的鉴别。故选BC。",
          "type": "多选题"
        },
        {
          "id": 12499,
          "title": "胃痛的病变部位主要为哪些脏腑",
          "options": {
            "A": "胃、肝、脾",
            "B": "胃、肾、脾",
            "C": "胃、脾、肝、胆",
            "D": "胃、心、肝",
            "E": "胃、肝、肾"
          },
          "answer": "A",
          "analysis": "胃痛，多由外感寒邪、饮食所伤、情志不畅和脾胃素虚等病因而引发。胃是主要病变脏腑，常与肝脾等脏有密切关系。故此题选A。",
          "type": "多选题"
        },
        {
          "id": 12500,
          "title": "以下哪项属于胃痛的病理特点",
          "options": {
            "A": "饮食不节，胃失和降",
            "B": "肝失疏泄，横逆犯胃",
            "C": "脾失健运，胃气阻滞",
            "D": "胃气阻滞，胃失和降，不通则痛",
            "E": "胃阴不足，胃失濡养"
          },
          "answer": "D",
          "analysis": "胃痛，多由外感寒邪、饮食所伤、情志不畅和脾胃素虚等病因而引发。胃是主要病变脏腑，常与肝脾等脏有密切关系，胃气郁滞、失于和降是胃痛的主要病机。其病理特点主要为胃气阻滞，胃失和降，不通则痛，其他选项为病因，故此题选D。",
          "type": "多选题"
        },
        {
          "id": 12501,
          "title": "张某，男43岁，自述胃脘胀痛拒按，呕吐一次，为胃内容物，其味腐臭，吐后痛减，不思饮食，大便不爽，苔厚腻，脉滑，应选用哪种方药治疗",
          "options": {
            "A": "柴胡疏肝散",
            "B": "化肝煎",
            "C": "黄芪建中汤",
            "D": "良附丸",
            "E": "保和丸"
          },
          "answer": "E",
          "analysis": "柴胡疏肝散主治肝气郁滞证；化肝煎主治主治怒气伤肝，气逆动火，胁痛胀满，烦热动血等症；黄芪建中汤主治阴阳气血俱虚证；良附丸主治温胃理气，用于寒凝气滞，脘痛吐酸，胸腹胀满。保和丸主治消食，导滞，和胃。题目所述张某为食积，故此题应选E。",
          "type": "多选题"
        },
        {
          "id": 12502,
          "title": "下列不是脾胃虚寒型胃痛主证的是",
          "options": {
            "A": "胃痛隐隐、喜温喜按",
            "B": "口干思饮、大便秘结",
            "C": "空腹痛甚、得食痛减",
            "D": "神疲乏力、四肢倦怠",
            "E": "泛吐清水、大便溏薄"
          },
          "answer": "B",
          "analysis": "脾胃虚寒型胃痛以胃痛隐隐，绵绵不休，喜暖喜按，空腹痛甚，得食则缓，劳累或受凉后发作或加重，泛吐清水，神疲乏力，四肢不温，大便溏薄，舌淡苔白，脉虚弱无力或迟缓为辨证要点。故口干思饮、大便秘结不是此型胃痛的主证，答案选B。",
          "type": "多选题"
        },
        {
          "id": 12503,
          "title": "胃脘隐隐灼痛，口燥咽干，五心烦热，消瘦乏力，大便干结，此型不宜采取的中医外治法是",
          "options": {
            "A": "穴位按摩",
            "B": "耳穴压丸",
            "C": "隔姜灸",
            "D": "拔火罐",
            "E": "穴位贴敷"
          },
          "answer": "C",
          "analysis": "题目上述症状依据中医辩证属于胃阴亏虚证，从五心烦热，消瘦乏力可看出阴虚；胃脘隐隐灼痛，口燥咽干，大便干结可看出其有热；若进行隔姜灸将会使其热上加热，故此题应选C选项。",
          "type": "多选题"
        },
        {
          "id": 12504,
          "title": "郑某，女50岁，近一年来胃部隐隐灼痛，似饥而不欲食，口燥咽干，五心烦热，消瘦乏力，大便干结，舌红少津，脉细数，该患者的护理措施错误的是",
          "options": {
            "A": "病室宜凉爽舒适",
            "B": "饮食宜温热，食温中健脾之品",
            "C": "食疗方可选石斛麦冬茶饮",
            "D": "怡情放怀，多听轻缓音乐、下棋、读报、登山等",
            "E": "中药汤剂宜久煎、偏凉、少量频服"
          },
          "answer": "B",
          "analysis": "胃阴虚主要表现在胃脘隐痛、饥不欲食、口燥咽干、大便干结或脘痞不舒或干呕见逆、舌红少苔、脉细数等，其治疗主要是滋阴养胃、健脾益气。饮食方面宜多食滋养胃阴和滋养胃津的食物，禁忌食物主要为性质温热且有助热伤阴的食物和辛辣食物，多吃容易耗伤胃阴。故此题选B。\n",
          "type": "多选题"
        },
        {
          "id": 12511,
          "title": "哮证的治疗原则是",
          "options": {
            "A": "扶正固本",
            "B": "发时治表、平时治本",
            "C": "补肾化痰",
            "D": "驱邪化痰",
            "E": "以上均非"
          },
          "answer": "B",
          "analysis": "哮证是一种发作性痰鸣，气喘疾病，以呼吸急促，喉间哮鸣为主要特征。主要病根是宿痰内伏肺系，常因感受外邪或饮食不当而诱发。故它的治疗原则是发时治表、平时治本，此题选B。",
          "type": "多选题"
        },
        {
          "id": 12512,
          "title": "下列哪项对哮与喘的鉴别诊断无意义",
          "options": {
            "A": "哮必兼喘",
            "B": "有无夙根",
            "C": "呼吸急促",
            "D": "喘必兼哮",
            "E": "喉中有无水鸣声"
          },
          "answer": "D",
          "analysis": "哮病以声音命名，以喉中有声、气喘，可以自行缓解为主要特点。喘证则主要是气喘，喉咙一般没有声音，不会自行缓解。两者区别点主要是有没有喉咙声音，能不能自行缓解。哮必有喘，而喘未必有哮。故此题选D。",
          "type": "多选题"
        },
        {
          "id": 12513,
          "title": "哮证的病因病机不包括下列哪项",
          "options": {
            "A": "肺失宣降",
            "B": "脾失健运",
            "C": "肺肾虚",
            "D": "“伏痰”遇感引触，痰随气升，气因痰阻，相互搏结，壅塞气道",
            "E": "肺失宣降，肾失摄纳"
          },
          "answer": "E",
          "analysis": " 哮证的基本病机是“伏痰”(宿痰)内伏于肺，每因外感、饮食、情志、劳倦等诱因而引触，致痰随气升，气因痰阻，痰气搏结，壅塞气道，肺管狭窄，气道挛急，通畅不利，肺气宣降失常，引动停积之痰，而致痰鸣气喘。故此题选E。",
          "type": "多选题"
        },
        {
          "id": 12514,
          "title": "以下关于哮证的辨证施护措施不当的是",
          "options": {
            "A": "哮喘发作时，及时吸氧吸痰，保持呼吸道通畅",
            "B": "热哮患者房间易凉爽通风、衣被适中",
            "C": "寒哮者，适宜进食淡豆豉、荸荠汁、葱白、生姜等温热散寒之品等",
            "D": "热哮者，适宜进食梨汁、琵琶叶粥、川贝母粥等清热化痰之品",
            "E": "肺虚者，适宜进食猪肺、黄芪、灵芝等益气补肺之品"
          },
          "answer": "C",
          "analysis": "寒哮，要保持病房温度，湿度适宜，空气清新，光照充足，防止患者着凉；疾病发作有规律的患者，在发作前两小时服药以控制病情，服药时要注意汤药的温度，一定要温服；患者可服用葱，姜，胡椒等温热宜通的调味品，切忌服用油腻生冷的食物。热哮，病房要凉爽，防治闷热，经常开窗通风，以保持空气新鲜，但要避免直接吹风。患者的饮食原则是清淡易消化，患者可以多喝梨汁，以清热润肺化痰患者要戒烟戒酒，忌食辛辣油腻的食物。肺虚者要根据气候的变化，增减衣物，避免患者着凉，尤其要做好废输血的保暖，防治感冒患者，戒烟戒酒，适宜进补一些党参，黄芪，燕窝等补品。故此题选C。",
          "type": "多选题"
        },
        {
          "id": 12515,
          "title": "患者刘某，男性，58岁，平素短气息促，动则为甚、腰膝酸软、脑转耳鸣、每于劳动后易发哮喘、舌质红少苔、脉细数。方药宜选用",
          "options": {
            "A": "金匮肾气丸加减",
            "B": "七味都气丸加减",
            "C": "六君子汤加减",
            "D": "玉屏风散加减",
            "E": "射干麻黄汤加减"
          },
          "answer": "A",
          "analysis": "该患者平素短气息促，动则为甚，说明其肺虚；腰膝酸软、脑转耳鸣说明其肾虚；每于劳动后易发哮喘、舌质红少苔、脉细数故其为肺肾两虚证，其用药应当补益肺肾故此题选金匮肾气丸加减，选A。",
          "type": "多选题"
        },
        {
          "id": 12516,
          "title": "患者王某，男性，67岁，哮证反复发作，此次发作痰鸣如吼，色黄黏浊稠厚，舌苔黄腻，脉滑数，烦闷不安。以下辨治要点及施护要点不正确的是",
          "options": {
            "A": "方剂易选择定喘汤",
            "B": "病房环境易凉爽通风、忌当头风、衣被适中",
            "C": "汗出较多时，用软毛巾或温水毛巾擦干",
            "D": "食疗方可选择菊花薄荷泡水、牛肺萝卜汤、丝瓜藤液",
            "E": "饮食可选择温热散寒之品如淡豆豉、葱白、生姜等"
          },
          "answer": "E",
          "analysis": "该患者通过中医辨证属热哮，故其病房要凉爽，防治闷热，经常开窗通风，以保持空气新鲜，但要避免直接吹风。患者的饮食原则是清淡易消化，患者可以多喝梨汁，以清热润肺化痰患者要戒烟戒酒，忌食辛辣油腻的食物。故此题答案选E。",
          "type": "多选题"
        },
        {
          "id": 12517,
          "title": "实喘的病位主要在",
          "options": {
            "A": "心",
            "B": "肝",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "D",
          "analysis": "实喘是指邪气盛实所致的气喘。由风寒束肺，暑火郁热，痰浊胶固，水饮上凌等因，致肺气壅塞，气道不利而成。起病较急，病程较短，呼吸急促、气粗有力。故此题实喘主要病位在肺，选D。",
          "type": "多选题"
        },
        {
          "id": 12518,
          "title": "喘证辨证时宜首选辨别",
          "options": {
            "A": "表里",
            "B": "寒热",
            "C": "虚实",
            "D": "阴阳",
            "E": "外感内伤"
          },
          "answer": "C",
          "analysis": "喘证的病理性质有虚实之分，治疗以虚实为纲，因此辨证当以辨别虚实最为重要。故此题应选C。",
          "type": "多选题"
        },
        {
          "id": 12519,
          "title": "喘证的病因除下列哪项",
          "options": {
            "A": "外感六淫",
            "B": "饮食",
            "C": "伏痰",
            "D": "情志",
            "E": "劳欲"
          },
          "answer": "C",
          "analysis": "喘证基本病因病机 外感、内伤，导致肺失宣降，肺气上逆；气无所主，肾失摄纳。故此题答案选C。",
          "type": "多选题"
        },
        {
          "id": 12520,
          "title": "喘证痰热郁肺型的治护法则为",
          "options": {
            "A": "宣肺散寒",
            "B": "宣肺泄热",
            "C": "清泄痰热",
            "D": "祛痰降逆",
            "E": "开郁降气"
          },
          "answer": "C",
          "analysis": "风寒壅肺证：宣肺散寒。表寒肺热证：解表清里。痰热郁肺证：清热化痰，宣肺平喘。痰浊阻肺证：祛痰降逆，宣肺平喘。肺气郁痹证：开郁降气平喘。故此题答案选C。",
          "type": "多选题"
        },
        {
          "id": 12521,
          "title": "患者，女性，56岁。每遇情志刺激而诱发，发时突然呼吸短促，息粗气憋，胸闷\n胸痛，咽中如窒，但喉中痰鸣不著，平素常多忧思抑郁，失眠，心悸，苔薄，脉弦。证属",
          "options": {
            "A": "风寒袭肺型",
            "B": "表寒里热型",
            "C": "痰热郁肺型",
            "D": "痰浊阻肺型",
            "E": "肺气郁闭型"
          },
          "answer": "E",
          "analysis": "从中医辨证分析该患者呼吸短促，息粗气憋，胸闷胸痛，咽中如窒，故其为实喘，喉中痰鸣不著，说明其证型属于肺气郁闭型，此题答案为E。",
          "type": "多选题"
        },
        {
          "id": 12522,
          "title": "患者，女性，42岁。呼吸急促，气短，咳嗽、咳痰，咳声低微，痰为白痰。平素易感冒，舌质淡红，脉细弱。诊断为喘证，肺虚型。与督灸治疗。在实施操作过程中不正确的是",
          "options": {
            "A": "施灸过程中患者取舒适体位，不宜随意活动",
            "B": "治疗室排烟通畅，要有防火设备",
            "C": "督灸激发人体阳气，适用于寒邪、湿邪、体质虚弱的人群",
            "D": "女性在经期也可实施督灸疗法",
            "E": "饮食清淡，忌食肥甘厚腻之品，注意保暖"
          },
          "answer": "D",
          "analysis": "对肺虚的患者可进行督脉灸，督灸激发人体阳气，适用于寒邪、湿邪、体质虚弱的人群，施灸过程中患者取舒适体位，不宜随意活动，治疗室排烟通畅，要有防火设备，饮食需清淡，忌食肥甘厚腻之品，注意保暖。而在女性经期时不宜进行督灸。故此题答案选D。",
          "type": "多选题"
        },
        {
          "id": 12529,
          "title": "感冒的主要病因",
          "options": {
            "A": "风邪",
            "B": "寒邪",
            "C": "暑邪",
            "D": "燥邪",
            "E": "火邪"
          },
          "answer": "A",
          "analysis": "感冒，中医又称为伤风，是风邪侵犯人体所致的常见的一种外感疾病，临床可以表现为鼻塞、咳嗽、头痛、恶寒发热、全身不适等症状，全年均可以发生，尤以春季多见。故其主要病因为风邪，选A。",
          "type": "多选题"
        },
        {
          "id": 12530,
          "title": "下列哪项不是时行感冒的特征",
          "options": {
            "A": "传染性强",
            "B": "全身症状明显",
            "C": "可入里化热，变生它病",
            "D": "发病季节性强",
            "E": "相互传染，呈流行性"
          },
          "answer": "D",
          "analysis": "时行感冒全身症状明显，临床以突然恶寒、发热、头痛、全身酸痛为主要特征。一年四季均可发生，冬春两季较为多见。起病急骤，传播迅速，传染性强，常可引起大流行。故此题选D。",
          "type": "多选题"
        },
        {
          "id": 12531,
          "title": "患者发热，恶寒较甚，无汗，头痛身楚，咳嗽，痰白，咳痰无力，舌淡苔白，脉浮而无力，此患者属于",
          "options": {
            "A": "风寒束表证",
            "B": "风热犯表证",
            "C": "暑湿伤表证",
            "D": "气虚感冒",
            "E": "阴虚感冒"
          },
          "answer": "D",
          "analysis": "该患者痰白，咳痰无力，舌淡苔白，脉浮而无力说明其气虚，咳嗽头痛身楚说明其为感冒。综上该患者为气虚感冒，故此题选项为D。",
          "type": "多选题"
        },
        {
          "id": 12532,
          "title": "风寒型和风热型感冒的辨证依据，以下哪项是错误的",
          "options": {
            "A": "恶寒、发热的轻重",
            "B": "咽喉红肿疼痛与否",
            "C": "渴与不渴",
            "D": "舌苔黄与白",
            "E": "脉浮与不浮"
          },
          "answer": "E",
          "analysis": "其一：风寒感冒是风寒之邪外袭、肺气失宣所致。症状可见：恶寒重、发热轻、无汗、头痛身痛、鼻塞流清涕、咳嗽吐稀白痰、口不渴或渴喜热饮、苔薄白。治法应以辛温解表及宣肺散寒为主。 其二：风热感冒是风热之邪犯表、肺气失和所致。症状表现为发热重、微恶风、头胀痛、有汗、咽喉红肿疼痛、咳嗽、痰粘或黄、鼻塞黄涕、口渴喜饮、舌尖边红、苔薄白微黄。治法应以辛凉解表及肃肺泻热为主。 故此题应选E，脉的浮沉看病位表里。",
          "type": "多选题"
        },
        {
          "id": 12533,
          "title": "感冒的用药护理不正确的是",
          "options": {
            "A": "解表药宜武火快煎",
            "B": "服用解表药后宜多出汗，以使体温尽快降至正常",
            "C": "出汗时忌吹风，以免复感",
            "D": "服解表药时忌食生冷之品",
            "E": "风热型感冒汤药宜温服"
          },
          "answer": "B",
          "analysis": "感冒后的护理:汤药宜武火快煎;服药后应观察汗和体温的变化;用药应中病即止;以遍身微汗、热退、脉静、身凉为佳;服药后可多饮热水或热稀粥以助药力;出汗时忌吹风，以免复感;服解表药时忌食生冷之品;风热型感冒汤药宜温服。出汗应当适宜，故此题选B。",
          "type": "多选题"
        },
        {
          "id": 12534,
          "title": "杨某，60岁，近一月来寒热持续不解，恶寒较甚，发热无汗，身倦乏力，咳嗽，咳痰无力，舌淡苔白，脉浮无力。患者适合食用那种食物",
          "options": {
            "A": "百合莲子粥",
            "B": "黄芪大枣粥",
            "C": "鸭肉",
            "D": "枸杞",
            "E": "防风粥"
          },
          "answer": "B",
          "analysis": "该患者痰白，咳痰无力，舌淡苔白，脉浮而无力说明其气虚；综上该患者为气虚感冒，需进行益气解表，而黄芪大枣汤有很好的补气作用故此题选项为B。",
          "type": "多选题"
        },
        {
          "id": 12535,
          "title": "痹病新发，风寒湿热之邪明显者为",
          "options": {
            "A": "虚证",
            "B": "实证",
            "C": "肝肾亏虚证",
            "D": "虚实夹杂证",
            "E": "痰瘀互结证"
          },
          "answer": "B",
          "analysis": "痹病新发以风寒湿热或痰浊，瘀血痹阻为主，多为实证。后期，则往往气阴不足或肝肾亏虚，同时伴有痰瘀凝结，甚则形成顽痰死血，发为虚实交错，以虚证为主。故此题选B。",
          "type": "多选题"
        },
        {
          "id": 12536,
          "title": "记载了痹症之手指关节肿大者称为“鼓槌风”的著作是",
          "options": {
            "A": "《内经》",
            "B": "《金匮要略》",
            "C": "《诸病源候论》",
            "D": "《证治准绳》",
            "E": "《医宗必读》"
          },
          "answer": "D",
          "analysis": "记载了痹症之手指关节肿大者称为“鼓槌风”的著作是《证治准绳》；《黄帝内经》是我国现存最早的医学经典；《伤寒杂病论》分为《伤寒论》和《金匮要略》，分别讲述了伤寒论和杂病论，为我国第一部临床护理专著；《诸病源候论》反映了我国7世纪时医学理论与临证医学的发展水平，对后世影响深远；<医宗必读>系清代李中梓著,凡十卷,载药三百六十余种,涉及主治肿瘤的药物二十余种,设积聚专篇,创\"阴阳攻积丸\",尤在治则方面倡攻补兼施,后人称为治癌经典.故此题选D。",
          "type": "多选题"
        },
        {
          "id": 12537,
          "title": "行痹的病机是",
          "options": {
            "A": "寒邪兼挟风湿，痹阻经络",
            "B": "风湿热邪，留滞经络，气血痹阻不通",
            "C": "风邪兼挟寒湿，痹阻经络",
            "D": "虚邪兼挟风寒，留滞经络，痹阻气血",
            "E": "痰瘀互结，留滞肌肤，痹阻经络"
          },
          "answer": "C",
          "analysis": "素体阳虚，卫外不固，劳累之后，汗出当风；或涉水冒寒，久卧湿地，以致风寒湿邪乘虚侵入，经络痹阻，发为风寒湿痹。由于感受风寒湿三气各有偏胜，故以风气胜为行痹，寒气胜者为痛痹，湿气胜者为着痹。故此题为C。",
          "type": "多选题"
        },
        {
          "id": 12538,
          "title": "下列除哪项外，均可为痹病初起的主要症状之一",
          "options": {
            "A": "疼痛",
            "B": "重着",
            "C": "痿软无力",
            "D": "麻木",
            "E": "肿胀"
          },
          "answer": "C",
          "analysis": "肌肉、筋骨、关节疼痛为痹病的主要证候特征，但疼痛的性质有酸痛、胀痛、隐痛、刺痛、冷痛、热痛或重着疼痛等各异。疼痛的部位，或以上肢为主或以下肢为甚，可对称发作亦可非对称发生，或累计单个关节或多个关节同病，可为游走不定或为固定不移。或局部红肿灼热，或单纯肿胀疼痛，皮色不变。或喜热熨，或喜冷敷。多为慢性久病，病势缠绵，亦可急性起病，病程较短，病重者，关节屈伸不利，甚者关节僵硬、变形，生活困难。故此题应选C。",
          "type": "多选题"
        },
        {
          "id": 12539,
          "title": "患者姚某，女，50岁，主诉双膝关节疼痛反复发作3年，证见：双膝关节灼热红肿，痛不可触，发热烦渴，舌红，苔黄腻，脉滑数，此患者的证型及施护法则是",
          "options": {
            "A": "痛痹，温经散寒，祛风除湿",
            "B": "行痹，祛风通络，散寒除湿",
            "C": "热痹，清热通络，祛风除湿",
            "D": "着痹，除湿通络，祛风散寒",
            "E": "痛痹，化痰通络，祛风除湿"
          },
          "answer": "C",
          "analysis": "1）行痹①证候肢体关节、肌肉酸痛，上下左右关节游走不定，但以上肢为多见，以寒痛为多，亦可轻微热痛，或见恶风寒，舌苔薄白或薄腻，脉多浮或浮紧。②治则祛风通络，散寒除湿。③主方宣痹达经汤。\n（2）痛痹①证候肢体关节疼痛较剧，甚至关节不可屈伸，遇冷痛甚，得热则减，痛处多固定，亦可游走，皮色不红，触之不热，苔薄白，脉弦紧。②治则温经散寒，祛风除湿。③主方乌头汤。\n（3）着痹①证候肢体关节疼痛重着、酸楚，或有肿胀，痛有定处，肌肤麻木，手足困重，活动不便，苔白腻，脉濡缓。②治则除湿通络，祛风散寒。③主方薏苡仁汤加减。\n（4）热痹①证候肢体关节疼痛，痛处掀红灼热，肿胀疼痛剧烈，得冷则舒，筋脉拘急，日轻夜重，多兼有发热，口渴，烦闷不安，舌质红，苔黄腻或黄燥，脉滑数。②治则清热通络，祛风除湿。③主方白虎加桂枝汤。\n（5）尪痹①证候肢体关节疼痛，屈伸不利，关节肿大、僵硬、变形，甚则肌肉萎缩，筋脉拘急，肘膝不得伸，或尻以代踵、脊以代头而成废人，舌质暗红，脉细涩。②治则补肾祛寒，活血通络。③主方补肾祛寒治尪汤。\n（6）气血亏虚证①证候四肢乏力，关节酸沉，绵绵而痛，麻木尤甚，汗出畏寒，时见心悸，纳呆，颜面微青而白，形体虚弱，舌质淡红欠润滑，苔黄或薄白，脉多沉虚而缓。②治则益气养血，舒筋活络。③主方气血并补荣筋汤。该患者证候与热痹相类似故此题因故此题应选C。",
          "type": "多选题"
        },
        {
          "id": 12540,
          "title": "患者张某，女，48岁，渔民，主诉双指关节疼痛肿胀反复发作1年余，出海受寒后急性发作12h，证见：双指关节肿胀，局部皮色不红，触之不热，疼痛剧烈，舌苔薄白，脉弦紧，对此患者现阶段的健康指导不合适的是",
          "options": {
            "A": "改变工作环境",
            "B": "宜居住温暖向阳房间",
            "C": "加强手指关节运动",
            "D": "注意保护关节，戴手套",
            "E": "食用温经散寒食物"
          },
          "answer": "C",
          "analysis": "痛痹①证候肢体关节疼痛较剧，甚至关节不可屈伸，遇冷痛甚，得热则减，痛处多固定，亦可游走，皮色不红，触之不热，苔薄白，脉弦紧。②治则温经散寒，祛风除湿。③主方乌头汤。故该患者为痛痹。患者平时要注意调摄，增强体质和加强病后调摄护理，便显得格外重要。预防方面，锻炼身体，增强机体御邪能力；创造条件，改善阴冷潮湿等不良的工作、生活环境，避免外邪入侵；一旦受寒、冒雨等应及时治疗，如服用姜汤、午时茶等以祛邪等措施都有助于预防痹病的发生。病后调摄护理方面，更需做好防寒保暖等预防工作；应保护病变肢体，提防跌扑等以免受伤；视病情适当对患处进行热熨、冷敷等，可配合针灸、推拿等进行治疗；鼓励和帮助患者对病变肢体进行功能锻炼，有助痹病康复。上述C选项应当为适当锻炼手指关节而非加强故此题应选C。",
          "type": "多选题"
        },
        {
          "id": 12541,
          "title": "眩晕的特点是",
          "options": {
            "A": "头痛头胀",
            "B": "头重如蒙",
            "C": "头晕眼花",
            "D": "恶心呕吐",
            "E": "坐立不安"
          },
          "answer": "C",
          "analysis": "眩晕轻者闭目自止。重者旋转不定，伴恶心或呕吐、汗出等症。故其特点为头晕眼花所以选C。",
          "type": "多选题"
        },
        {
          "id": 12542,
          "title": "下列讨论眩晕病理的主张，哪一条是《丹溪心法》提出的",
          "options": {
            "A": "无瘀不作眩",
            "B": "无风不作眩",
            "C": "无虚不作眩",
            "D": "无痰不作眩",
            "E": "无火不作眩"
          },
          "answer": "D",
          "analysis": "元代朱丹溪倡导痰火致眩学说，《丹溪心法·头眩》说：“头眩，痰挟气虚并火，治痰为主，挟补气药及降火药。无痰不作眩，痰因火动，又有湿痰者，有火痰者。”故其主张为无痰不作眩，选D。",
          "type": "多选题"
        },
        {
          "id": 12543,
          "title": "下列哪项不是眩晕的主要病理因素",
          "options": {
            "A": "风",
            "B": "寒",
            "C": "火",
            "D": "瘀",
            "E": "痰"
          },
          "answer": "B",
          "analysis": "眩晕病位在清窍，由气血亏虚、肾精不足致脑髓空虚，清窍失养，或肝阳上亢、痰火上逆、瘀血阻窍而扰动清窍发生眩晕，与肝、脾、肾三脏关系密切。故其受到的邪扰为风、火、痰、瘀。故此题应选B。",
          "type": "多选题"
        },
        {
          "id": 12544,
          "title": "眩晕的发生，与下列哪些脏腑功能失调密切相关",
          "options": {
            "A": "心肝脾",
            "B": "肺脾肾",
            "C": "心肝肾",
            "D": "肝脾肾",
            "E": "心脾肾"
          },
          "answer": "D",
          "analysis": "眩晕病位在清窍，由气血亏虚、肾精不足致脑髓空虚，清窍失养，或肝阳上亢、痰火上逆、瘀血阻窍而扰动清窍发生眩晕，与肝、脾、肾三脏关系密切。故此题应选D。",
          "type": "多选题"
        },
        {
          "id": 12545,
          "title": "患者突发眩晕，耳鸣，头目胀痛，口苦，失眠多梦，遇烦劳、郁怒而加重，甚则仆倒、颜面潮红、急躁易怒，肢麻震颤，舌红苔黄，脉弦或数。证属",
          "options": {
            "A": "肾精不足",
            "B": "痰火上扰",
            "C": "痰瘀阻窍",
            "D": "肝阳上亢",
            "E": "气血亏虚"
          },
          "answer": "D",
          "analysis": "肝阳上亢，上冒清空，故头晕头痛；劳则伤肾，怒则伤肝，均可使肝阳更盛，故头晕、头痛加甚，且伴耳鸣；阳升则面部潮红；肝旺则急躁易怒；肝火扰动心神，故少寐多梦；口苦，舌红苔黄，脉弦，皆是肝阳上亢之征。故此题选D。",
          "type": "多选题"
        },
        {
          "id": 12546,
          "title": "患者凌某，男，40岁，1年前头部外伤后常自觉头晕头痛，健忘失眠，耳鸣,精神不振，面唇紫暗，舌暗红，脉弦涩。本病治疗方药宜首选",
          "options": {
            "A": "血府逐瘀汤",
            "B": "身痛逐瘀汤",
            "C": "桃红四物汤",
            "D": "补阳还五汤",
            "E": "通窍活血汤"
          },
          "answer": "E",
          "analysis": "该患者眩晕头痛，兼见健忘，失眠，心悸，精神不振，耳鸣耳聋，面唇紫暗，舌瘀点或瘀斑，且脉弦涩故其为淤血阻窍证。治法宜活血化瘀，通窍活络，故选用通窍活血汤。方中用赤芍、川芎、桃仁、红花活血化瘀通络；麝香芳香走窜，开窍散结止痛，老葱散结通阳，二者共呈开窍通阳之功；黄酒辛窜，以助血行；大枣甘温益气，缓和药性，配合活血化瘀、通阳散结开窍之品，以防耗伤气血。全方共呈活血化瘀、通窍活络之功。此题选E。",
          "type": "多选题"
        },
        {
          "id": 12547,
          "title": "消渴的病变脏腑主要是哪三个",
          "options": {
            "A": "脾、胃、肾",
            "B": "肺、胃、肾",
            "C": "肝、脾、胃",
            "D": "肺、肾、膀胱",
            "E": "脾、肺、肾"
          },
          "answer": "B",
          "analysis": "消渴基本病机为阴津亏损，燥热偏盛，而以阴虚为本，燥热为标，两者互为因果，阴愈虚则燥热愈盛，燥热愈盛则阴愈虚。消渴病变的脏腑主要在肺、胃、肾，三脏之中，虽可有所偏重，但往往又互相影响。其中，尤以肾最为重要。故此题选B。",
          "type": "多选题"
        },
        {
          "id": 12548,
          "title": "消渴患者伴视物模糊，采用中药眼部雾化技术后给予穴位按摩，常选哪些穴位",
          "options": {
            "A": "四白、睛明、丝竹空",
            "B": "合谷、四白、太阳",
            "C": "四白、睛明、人中",
            "D": "攒竹、睛明、足三里",
            "E": "鱼腰、攒竹、涌泉"
          },
          "answer": "A",
          "analysis": "消渴伴视物模糊的措施:1.注意视力变化,定期检查眼底,减少阅读、看电视及使用电脑,宜闭目养神,饮用菊花茶或银杞明目汤等。2.按摩睛明、四白、丝竹空等穴位以辅助通络明目。3,遵医嘱予珍珠明目液滴眼或中药眼部雰化以改善症状4评估跌倒高危因素,落实防跌倒措施。故此题选A，眼部近取穴。",
          "type": "多选题"
        },
        {
          "id": 12549,
          "title": "下面关于消渴患者用药护理描述正确的是",
          "options": {
            "A": "中药汤剂宜饭后热服",
            "B": "胰岛素注射后均需立即进餐",
            "C": "口服降糖药可自行调整用药",
            "D": "阴阳两虚证者中药宜温服",
            "E": "中药汤剂与西药可同时服用"
          },
          "answer": "D",
          "analysis": "中药汤剂宜饭前热服；胰岛素注射后均不可立即进食，速效胰岛素应当饭前二十到三十分钟注射；口服降糖药不可自行调整用药，应当遵循医嘱；中药汤剂与西药不可同时服用，以免造成药性相冲。故此题应选D，阴阳两虚证者中药宜温服。",
          "type": "多选题"
        },
        {
          "id": 12550,
          "title": "气阴两虚消渴患者可选用下面哪个食疗方以缓解不适症状，达到益气养阴的作用",
          "options": {
            "A": "白萝卜汁",
            "B": "冬瓜炒竹笋",
            "C": "韭菜炒虾仁",
            "D": "苦瓜山药烧豆腐",
            "E": "鲫鱼豆腐汤"
          },
          "answer": "E",
          "analysis": "气阴两虚证的糖尿病患者多表现为:消瘦、倦怠乏力、气短懒言、易汗出、胸闷憋气,腰膝酸软、使澳、口千口苦、脉虚细无力。宜食用益气养阴之品，例如瘦肉、蛋类、鱼肉等。故此题应选鲫鱼豆腐汤，选E。",
          "type": "多选题"
        },
        {
          "id": 12551,
          "title": "患者，男，50岁，患消渴病史20年余，诉小便频数，夜尿增多，浑浊如脂如膏，五心烦热，口干咽燥，畏寒肢冷，面色苍白，神疲乏力，腰膝酸软，脘腹胀满，食纳不香，五更泄泻，舌淡体胖，苔白而干，脉沉细无力。此消渴患者属什么证型",
          "options": {
            "A": "气阴两虚",
            "B": "胃肠实热",
            "C": "上热下寒",
            "D": "阴阳两虚",
            "E": "肝胃郁热"
          },
          "answer": "D",
          "analysis": "1.肺胃燥热 证候：烦渴引饮，消谷善饥，小便色黄、次频量多，身形渐瘦，舌红苔少，脉滑数。治则：清热生津，止渴除烦。主方：白虎加人参汤或玉泉丸、玉液汤等。\n2.肠燥津伤 证候：多食易饥，口渴引饮，大便燥结或不通，舌红少津，苔黄燥，脉实有力。治则：滋养津液，润肠通腑。主方：增液承气汤。\n3.肝肾阴虚 证候：头晕耳鸣，腰膝酸软，多梦遗精，皮肤瘙痒，尿频量多，浑浊如脂膏，舌红少苔，脉细数。治则：滋养肝肾，滋阴养血。主方：六味地黄丸。\n4.脾胃气虚 证候：口渴引饮，多食与便溏并见，或精神不振，纳食减少，四肢乏力，舌淡苔白，脉细弱无力。治则：健脾益气，生津止渴。主方：七味白术散或参苓白术散\n5.阴阳两虚 证候：手足心热，口干舌燥，腰膝酸软，畏寒怕冷，小便频数，甚则饮一溲一，舌淡苔白而干，脉沉细无力。治则：温阳滋阴补肾。主方：金匮肾气丸。\n6.湿热中阻 证候：多食善饥，渴而多饮，脘腹痞满，舌苔黄腻，脉濡缓。治则：清热化湿。主方：黄芩滑石汤。  上述患者症状与阴阳两虚症状相符故此题选D。                                                 ",
          "type": "多选题"
        },
        {
          "id": 12552,
          "title": "患者王某，男，35岁，体检发现FPG：10.4mmol/L，诉大便秘结，口干口苦，口渴喜冷饮，饮水量多，多食易饥，舌红，边有瘀斑，舌下络脉青紫，苔黄，脉滑数，下面辨证施护措施正确的是",
          "options": {
            "A": "宜食清利胃肠实热之品，如芦荟、马齿苋、苦瓜等。食疗方：凉拌马齿苋等",
            "B": "可适当食用肥甘厚腻过咸伤肾之品",
            "C": "此消渴患者属肝胃郁热证",
            "D": "大便干结可多食香蕉、火龙果",
            "E": "宜食滋阴降火之品，如甲鱼等。食疗方：银耳莲子百合饮等"
          },
          "answer": "A",
          "analysis": "该患者为肺胃燥热证，其证候为烦渴引饮，消谷善饥，小便色黄、次频量多，身形渐瘦，舌红苔少，脉滑数。治则：清热生津，止渴除烦。主方：白虎加人参汤或玉泉丸、玉液汤等。故其应食用宜食清利胃肠实热之品，如芦荟、马齿苋、苦瓜等。食疗方：凉拌马齿苋等。其余选项错误，此题选A。",
          "type": "多选题"
        },
        {
          "id": 12559,
          "title": "哪项不是心血虚证的临床表现",
          "options": {
            "A": "眩晕健忘",
            "B": "舌红脉数",
            "C": "心悸怔忡",
            "D": "唇舌淡白",
            "E": "脉细弱"
          },
          "answer": "B",
          "analysis": "心血虚证的临床表现包括心悸，失眠，多梦，健忘，头晕眼花，面色淡白或萎黄，唇舌色淡，脉细无力。故B选项不是心血虚证的表现,选B。",
          "type": "多选题"
        },
        {
          "id": 12560,
          "title": "病人出现头晕、目眩、手足发麻是以为",
          "options": {
            "A": "心气不足",
            "B": "心血不足",
            "C": "肝气郁结",
            "D": "肝阴虚",
            "E": "肝阳虚"
          },
          "answer": "B",
          "analysis": "血虚不能上荣头面，故见头晕眼花、健忘、目眩；心血供应不足无法荣于四肢故见手足发麻，所以本题原因是心血不足，故选B。",
          "type": "多选题"
        },
        {
          "id": 12561,
          "title": "张某，女，78岁，近日出现坐而不得卧，心慌难止，卧则气逆喘促，舌质淡，舌苔白，脉迟缓。辨证为",
          "options": {
            "A": "热证",
            "B": "阴虚",
            "C": "心阳不振",
            "D": "肾气亏虚",
            "E": "心脾两虚"
          },
          "answer": "C",
          "analysis": "1.心虚胆怯 证候：心悸不宁，善惊易恐，坐卧不安，少寐多梦而易惊醒，食少纳呆，恶闻声响，苔薄白，脉细略数或细弦。\n2.心脾两虚 证候：心悸气短，头晕目眩，少寐多梦，健忘，面色无华，神疲乏力，纳呆食少，腹胀便溏，舌淡红，脉细弱。\n3.阴虚火旺 证候：心悸易惊，心烦失眠，五心烦热，口干，盗汗，思虑劳心则症状加重，伴有耳鸣，腰酸，头晕目眩，舌红少津，苔薄黄或少苔，脉细数。\n4.心阳不振 证候：心悸不安，胸闷气短，动则尤甚，面色苍白，形寒肢冷，舌淡苔白，脉虚弱，或沉细无力。\n5.水饮凌心 证候：心悸，胸闷痞满，渴不欲饮，下肢浮肿，形寒肢冷，伴有眩晕，恶心呕吐，流涎，小便短少，舌淡苔滑或沉细而滑。\n6.心血瘀阻 证候：心悸，胸闷不适，心痛时作，痛如针刺，唇甲青紫，舌质紫暗或有瘀斑，脉涩或结或代。\n7.痰火扰心 证候：—心悸时发时止，受惊易作，胸闷烦躁，失眠多梦，口干苦，大便秘结，小便短赤，舌红苔黄腻，脉弦滑。\n故此题选C。",
          "type": "多选题"
        },
        {
          "id": 12562,
          "title": "心脉痹阻者的护治原则是",
          "options": {
            "A": "活血化瘀",
            "B": "养血安神",
            "C": "回阳救逆",
            "D": "清心泻火",
            "E": "补肾壮阳"
          },
          "answer": "A",
          "analysis": "心脉痹阻证治疗以通为原则,主要应从瘀论治,以活血通脉为大法。故选A。",
          "type": "多选题"
        },
        {
          "id": 12563,
          "title": "心血虚者的护治原则是",
          "options": {
            "A": "舒经活络",
            "B": "养血安神",
            "C": "回阳救逆",
            "D": "疏肝解郁",
            "E": "大补元气"
          },
          "answer": "B",
          "analysis": "心血虚证的护治原则主要为补血养心安神，故选B。",
          "type": "多选题"
        },
        {
          "id": 12564,
          "title": "下列哪项不是胸痹的病因？",
          "options": {
            "A": "年老体虚",
            "B": "饮食不当",
            "C": "心虚胆怯",
            "D": "情志失调",
            "E": "寒邪内侵"
          },
          "answer": "C",
          "analysis": "寒邪内侵 寒主收引，遏制阳气，使得血行不畅，发为本病  饮食失调 饮食失节，过食肥甘厚味，或者嗜烟嗜酒，导致脾胃损伤，运化失调，聚湿生痰，上犯心胸，阻遏心阳，气机不畅，心脉痹阻而发为此病。情志失节 忧思伤脾，脾失健运，聚湿成痰；郁怒伤肝，肝气瘀滞，甚则气郁化火，灼津成痰。气滞和痰阻均可使血行不畅，心脉痹阻，而发为胸痹。劳倦内伤 劳倦伤脾，脾虚失运，气血化生无源，心脉失养而胸痹；或者积劳伤阳，心肾阳微，鼓动无力，熊阳不振，阴寒内侵，血行不畅而发为胸痹。年迈体虚 年过半百，肾气自半，精血渐衰，肾阳虚衰，则不能鼓舞五脏之阳，肾阴亏虚，则不能润养五脏，心脉失于温养而发为胸痹。故答案选C。",
          "type": "多选题"
        },
        {
          "id": 12565,
          "title": "关于胸痹疼痛特点描述错误的是",
          "options": {
            "A": "痰浊壅塞者可见闷痛",
            "B": "心血瘀阻可见刺痛",
            "C": "疼痛可有劳累过度而诱发",
            "D": "疼痛可持续几十分钟至几小时",
            "E": "一般休息或用药后可缓解"
          },
          "answer": "D",
          "analysis": "胸痹疼痛的特点：1.突然发病，时作时止，反复发作。2.持续时间：几秒至数十秒3.诱发因素：劳累过度，情绪激动，气候变化，暴饮暴食。4.缓解方式：停止活动、休息后或者服用硝酸甘油可见迅速缓解。另：心血瘀阻型症见胸部刺痛，固定不移，舌质紫暗，脉弦涩。痰浊壅塞型症见胸闷而痛，或痛引背部，气短喘促，体胖，痰多。舌苔浊腻，脉滑。此题故选D。",
          "type": "多选题"
        },
        {
          "id": 12566,
          "title": "关于胸痹患者饮食护理描述错误的是",
          "options": {
            "A": "心血瘀阻者，可少量饮酒以助活血化瘀",
            "B": "总原则：宜低盐、低脂、低胆固醇，以清补为主",
            "C": "阴寒凝滞者，宜温热性食物，忌生冷及寒凉食物",
            "D": "痰浊壅塞者，可用少量干姜、川椒等调味，以温运中阳",
            "E": "气阴两虚者，宜食补气养阴之品，如山药粥、莲子羹、百合粥"
          },
          "answer": "D",
          "analysis": "胸痹患者的总原则：宜低盐、低脂、低胆固醇，以清补为主;心血瘀阻者，宜清淡、少油；可少量饮酒以助活血化瘀之功。阴寒凝滞者，宜温热性食物，忌生冷及寒凉食物;痰浊壅塞者，宜食健脾化痰之品，忌食肥甘厚味，以防助湿生痰。气阴两虚者，宜食补气养阴之品，如山药粥、莲子羹、百合粥。故答案D错误。",
          "type": "多选题"
        },
        {
          "id": 12567,
          "title": "下列关于胸痹的健康指导错误的是那一项？",
          "options": {
            "A": "发作期指导患者可少量进行康复锻炼",
            "B": "指导患者及家属应急措施、缓解方法、遵医嘱 用药",
            "C": "指导患者应自备急救药物，易取，易用",
            "D": "合理调整饮食，保持大便通畅",
            "E": "可予低流量吸氧"
          },
          "answer": "A",
          "analysis": "胸痹的健康指导有患者及家属应急措施、缓解方法、遵医嘱 用药；指导患者应自备急救药物，易取，易用；合理调整饮食，保持大便通畅；可予低流量吸氧。胸痹的患者发作期不可以指导患者进行康复训练，会出现呼吸不畅。故选项A错误。",
          "type": "多选题"
        },
        {
          "id": 12568,
          "title": "患者男性，70岁，左侧胸部疼痛3小时，疼痛向左肩部放射，伴心慌、头晕，大汗出，面色苍白，四肢厥冷，舌紫，苔白腻。治则为",
          "options": {
            "A": "通阳泄浊，豁痰开结",
            "B": "补益心气，活血化瘀",
            "C": "宣通胸阳，散寒化浊",
            "D": "益气温阳，活血通络",
            "E": ""
          },
          "answer": "D",
          "analysis": "若心肾阳虚，虚阳欲脱厥逆者，用四逆加人参汤，温阳益气，回阳救逆。若见面色苍白大汗淋漓、脉微欲绝等亡阳证，应用参附龙牡汤，并加用大剂山萸肉，以温阳益气，回阳固脱。活血通络。故答案选 D。",
          "type": "多选题"
        },
        {
          "id": 12569,
          "title": "患者女性，66岁，近期主诉心胸阵阵隐痛，胸闷气短，动则喘息，心中动悸，倦怠乏力，面色少华，遇劳则甚，舌偏红，脉细弱无力。医嘱予益气养阴中药一日一剂，现为患者制定食疗方，下列不适宜的是哪个",
          "options": {
            "A": "白萝卜排骨汤",
            "B": "黄芪乌鸡汤",
            "C": "山药粥",
            "D": "百合莲子羹",
            "E": "土豆炖牛肉"
          },
          "answer": "A",
          "analysis": "胸痹患者不建议吃白萝卜排骨汤，因为萝卜本身是具有清热解毒功效的一种膳食，萝卜中含有大量的维生素C，配合排骨汤，里面含有丰富的维生素、矿物质、氨基酸、微量元素，能够补充体力、提高免疫力。建议标本同治，虚实兼顾。治标常以散寒、化痰、行气、活血为主，扶正固本包括温阳、补气、益气养阴等法。活血通脉是其基本治法。建议喝黄芪乌鸡汤，山药粥，百合莲子羹，土豆炖牛肉。故答案A错误。",
          "type": "多选题"
        },
        {
          "id": 12570,
          "title": "我国现存的第一部外科学专著：",
          "options": {
            "A": "《五十二病方》   ",
            "B": "《刘涓子鬼遗方》  ",
            "C": "《外科精义》",
            "D": "《外科枢要》",
            "E": "《外科正宗》"
          },
          "answer": "B",
          "analysis": "《刘涓子鬼遗方》 （公元495 ～ 499 年）南齐、龚庆宣着。五卷。现存最早的外科专书，主要有外伤、痈疽、湿疹、疥癣等。对疔疽引起的脓毒血症的早期治疗，外伤肠出的医护，切口引流的部位以及消毒 手术等方面有独到之处。故选B。",
          "type": "多选题"
        },
        {
          "id": 12571,
          "title": "后世评价“列证最详，论治最精”的外科专著是：",
          "options": {
            "A": "《黄帝内经》",
            "B": "《外科正宗》",
            "C": "《外科证治全生集》",
            "D": "《疡科心得集》",
            "E": "《刘涓子鬼遗方》  "
          },
          "answer": "B",
          "analysis": "《外科正宗》（公元 1617 年）明．陈实功（若虚，毓仁）着。四卷。所叙疾病百余种，每病列病理、症状、诊断、治法、成败病案，最后选列方剂。既重视内治，也强调外治，既主张早期手术，又反对滥施针刀。故选B。",
          "type": "多选题"
        },
        {
          "id": 12572,
          "title": "世界上最早进行死骨剔出术和剖腹术的外科学家是：",
          "options": {
            "A": "扁鹊",
            "B": "郑玄",
            "C": "华佗",
            "D": "医竘",
            "E": "张仲景"
          },
          "answer": "C",
          "analysis": "华佗被后人称为“外科圣手”、“外科鼻祖”。被后人多用神医华佗称呼他，又以“华佗再世”、“元化重生”称誉有杰出医术的医师。故选C。",
          "type": "多选题"
        },
        {
          "id": 12573,
          "title": "我国第一部论述梅毒的专著：",
          "options": {
            "A": "《金创瘛疭方》   ",
            "B": "《刘涓子鬼遗方》    ",
            "C": "《霉疮秘录》    ",
            "D": "《外科枢要》",
            "E": "《外科正宗》"
          },
          "answer": "C",
          "analysis": "陈司成，字九韶，明代人。陈家八代行医，精外科。司成受家庭熏陶，自幼爱好医道。年轻时应试杭州，曾参考祖传秘授，治愈友人性病。后专业行医。博览医学经典，临床悉心体察，并遍游江浙，向名医请教，历时20年，终于探索出一套治疗梅毒方法。于天启三年(1623)写成我国第一部性病专著《霉疮秘录》。书中对梅毒症状、传染及遗传等作了详细记述，提出“解毒、清热、杀虫”的治疗方案，并采用砷、汞为主的“生生乳”治疗，具有实用价值。他是用砷剂治梅毒的首创者，对医学有杰出贡献。故选C。",
          "type": "多选题"
        },
        {
          "id": 12574,
          "title": "最早提出用截趾手术治疗脱疽的专著是：",
          "options": {
            "A": "《金创瘛疭方》   ",
            "B": "《刘涓子鬼遗方》    ",
            "C": "《疡科心得集》    ",
            "D": "《黄帝内经》",
            "E": "《外科正宗》"
          },
          "answer": "D",
          "analysis": "《素问·生气通天论》最早提出用截趾手术治疗脱疽。《黄帝内经》包括《灵枢》和《素问》两部分。故选D。",
          "type": "多选题"
        },
        {
          "id": 12575,
          "title": "创立了外科证治中以阴阳为核心的辨证论治法则的专著是：",
          "options": {
            "A": "《黄帝内经》",
            "B": "《外科正宗》",
            "C": "《外科证治全生集》",
            "D": "《疡科心得集》",
            "E": "《刘涓子鬼遗方》"
          },
          "answer": "C",
          "analysis": "“全生派”：清·王维德《外科全生集》。“阴虚阳实”论，创立了外科证治中以阴阳为核心的辨证论治法则，指出：“红肿乃阳实之证，气血热而毒沸；白疽乃阴虚之证，气血寒而凝。”对阴疽的治疗提出“阳和通腠，温补气血”法则，并主张“以消为贵，以托为畏”，反对滥用刀针。创立了阳和汤、阳和解凝膏、犀黄丸、小金丹。故选C。",
          "type": "多选题"
        },
        {
          "id": 12582,
          "title": "手指甲下成脓时，以下哪种辨脓方法最适用：",
          "options": {
            "A": "触按辨脓",
            "B": "穿刺辨脓",
            "C": "透光辨脓",
            "D": "B超辨脓",
            "E": "手压辨脓"
          },
          "answer": "C",
          "analysis": "透光辨脓即以患指（趾）遮挡住手电筒的光线，然后注意观察患指（趾）部表面，若见其局部有深黑色的阴影即为有脓。不同部位的脓液积聚，其阴影可在其相应部位显现。此法适用于指、趾部甲下的辨脓，因其局部组织纤薄且能透光。故选C。",
          "type": "多选题"
        },
        {
          "id": 12583,
          "title": "湿邪所致外科疾病好发于人体：",
          "options": {
            "A": "上部",
            "B": "下部",
            "C": "中部",
            "D": "上肢",
            "E": "背部"
          },
          "answer": "B",
          "analysis": "湿邪有下趋之势，易于伤及人体的下部，其病，多见于下部。如：水肿，多以下肢明显。故选B。",
          "type": "多选题"
        },
        {
          "id": 12584,
          "title": "外科疾病辨证的总纲是：",
          "options": {
            "A": "脏腑",
            "B": "经络",
            "C": "气血",
            "D": "阴阳",
            "E": "局部"
          },
          "answer": "D",
          "analysis": "阴阳是八纲辨证的总纲。欲使外科疾病的辨证正确，首先必须辨清阴阳属性 。外  科可根据疾病的发生、发展、症状和转归等各方面的相对性直接辨认阳证或阴证 。故选D。",
          "type": "多选题"
        },
        {
          "id": 12585,
          "title": "肿势或软如绵，或硬如馒，形态各异，不红不热。其肿的性质是",
          "options": {
            "A": "热肿 ",
            "B": "寒肿",
            "C": "风肿",
            "D": "痰肿",
            "E": "湿肿"
          },
          "answer": "D",
          "analysis": "痰肿的特点是:肿势或软如棉、馒,或硬如结核,不红不热。根据根据题意及选项，故选D。",
          "type": "多选题"
        },
        {
          "id": 12586,
          "title": "患者大便干燥，便时疼痛，点滴下血，口干咽燥，五行烦热；舌质红，苔少，脉细数。中医辨证证型为",
          "options": {
            "A": "热毒炽盛",
            "B": "阴虚津亏",
            "C": "湿热下注",
            "D": "血热肠燥",
            "E": "肝经风热"
          },
          "answer": "B",
          "analysis": "阴虚津亏会导致人体阴阳失调，出现阴液不足，并且容易引起阴虚内热的症状。最为常见的是会出现急躁、脾气暴躁、面色潮红、咽干口燥、耳鸣、大便干、失眠多梦以及皮肤干燥、五心烦热、舌质红，苔少，脉细数等。在没有治疗的情况下，还会伴随有干咳、久咳、气短等。有的还会出现腰膝酸软、眼睛干涩等。故选B。",
          "type": "多选题"
        },
        {
          "id": 12587,
          "title": "患者，男，40岁。患慢性淋病，小便短涩，淋漓不尽，腰酸腿软，五心烦热，食少纳差，舌红，苔少，脉细数。其证候是",
          "options": {
            "A": "湿热毒蕴",
            "B": "脾肾阳虚",
            "C": "阴虚毒恋",
            "D": "脾虚肝旺",
            "E": "阴虚火旺"
          },
          "answer": "E",
          "analysis": "阴虚火旺的症状主要有午后潮热，或夜间发热，发热不欲近衣，手足心发热，或骨蒸潮热，心烦，少寐，多梦，颧红、盗汗、口干咽燥，大便干结，尿少色黄，舌质干红或有裂纹，无苔或少苔，脉细数。或伴有口腔溃疡反复发作，疼痛，伴头昏，腰酸乏力等。故选E。",
          "type": "多选题"
        },
        {
          "id": 12588,
          "title": "下列各项，不属溻渍法适应证的是（   ）",
          "options": {
            "A": "阳证疮疡初起",
            "B": "阴证疮疡",
            "C": "美容",
            "D": "保健",
            "E": "创面干燥，僵而不敛"
          },
          "answer": "E",
          "analysis": "溻渍适应症丹毒、脱痘、急性湿疹、足癣感染、烧伤、肢端骨髓炎、扭挫伤、筋骨关节劳损等。选项E不属于，故选E。",
          "type": "多选题"
        },
        {
          "id": 12589,
          "title": "溃疡疮口太小，脓腐难去，常用的腐蚀药是（  ）",
          "options": {
            "A": "红灵丹",
            "B": "白降丹",
            "C": "七三丹",
            "D": "八宝丹",
            "E": "九黄丹"
          },
          "answer": "B",
          "analysis": "白降丹，中药材名。本品为二氯化汞和氯化亚汞的混合结晶。功能主治为：治痈疽发背，一切疔毒。水调敷疮头上，初起者立刻起疱消散，成脓者即溃，腐者即脱，消肿。是常用的腐蚀药，故选B。",
          "type": "多选题"
        },
        {
          "id": 12590,
          "title": "中医外科内治法的总则是（  ）",
          "options": {
            "A": "温、托、补",
            "B": "清、消、补",
            "C": "清、补、托",
            "D": "消、通、补",
            "E": "消、托、补"
          },
          "answer": "E",
          "analysis": "外科的治疗方法分内治和外治两大类。内治之法基本与内科相同，但其中有透脓、托毒等法，以及结合某些外科疾病应用某些比较独特的方药，则与内科有显著区别，为外科内治法特点；而外治法中的外用药物、手术疗法和其他疗法中的引流、垫棉、挂线等法，则为外科所独有。临证时由于病种不同，病情不一，有时专恃外治而竟全功，亦有专用内治而获痊愈的。 但一般说来，大部分外科疾病必须外治与内治并重，相辅相成，以增强疗效。中医外科内治法的总则是消、托、补，故选E。",
          "type": "多选题"
        },
        {
          "id": 12591,
          "title": "乳痈切开排脓的切口应该是（   ）",
          "options": {
            "A": "切口尽量大",
            "B": "切口宜高",
            "C": "纵切口",
            "D": "横切口",
            "E": "按乳络方向"
          },
          "answer": "E",
          "analysis": "乳房后脓肿切开术的切口位置,应该选择乳房与胸壁皮肤交界的皱壁部位。切口按乳络方向,必要时可以做对口引流,并且容易达到脓肿内部保证引流通畅。故选E。",
          "type": "多选题"
        },
        {
          "id": 12592,
          "title": "患儿，男性，6岁，颈部结块，形如鸡卵，皮色潮红，灼热疼痛，边界清楚，伴风温外感症。治法应为（   ）",
          "options": {
            "A": "清热利湿，和营消肿",
            "B": "和营托毒，清热利湿",
            "C": "散风清热，化痰消肿",
            "D": "清热解毒，和营消肿",
            "E": "清热解毒，和营消肿"
          },
          "answer": "C",
          "analysis": "锁喉痈痰热蕴结证治法：散风清热，化痰解毒。代表方：普济消毒饮加减。故选C。",
          "type": "多选题"
        },
        {
          "id": 12593,
          "title": "适用于乳漏疮口漏乳不止，脓腐已脱尽后的外治法是（   ）",
          "options": {
            "A": "腐蚀法",
            "B": "垫棉法",
            "C": "切开法",
            "D": "挂线法 ",
            "E": "结扎法"
          },
          "answer": "B",
          "analysis": "垫棉法适用于疮口漏乳不止和乳房部漏脓腐脱尽后，以促进疮口愈合。故选B。",
          "type": "多选题"
        },
        {
          "id": 12594,
          "title": "下列说法中对蛇串疮认识错误的是",
          "options": {
            "A": "蛇串疮是指皮肤在红斑基础上出现成簇水疱，痛如火燎的一种急性疱疹性皮肤病",
            "B": "相当于西医学的带状疱疹",
            "C": "蛇串疮以缠腰肋而发者最为多见，故又称 “缠腰火丹”等",
            "D": "其发于面部者称“蜘蛛疮”",
            "E": "因其皮疹色红，又称“丹毒”"
          },
          "answer": "E",
          "analysis": "儿童初次感染时能引起水痘，恢复后病毒潜伏在体内，而潜伏体内的病毒受到某些刺激后（如：劳累，炎热，寒冷，X射线照射等）复发引起带状疱疹，多见于成年人和老年人，故称为水痘一带状疱疹病毒。故选B。",
          "type": "多选题"
        },
        {
          "id": 12597,
          "title": "蛇串疮的临床表现多样，下列说法正确的是",
          "options": {
            "A": "疱疹为本病的主要特征",
            "B": "多先为带片状的红色斑丘疹，很快转变为绿豆到黄豆大小的水疱，3～5个簇集成群，累累如串珠，排列成带状",
            "C": "疼痛只发生在皮损出现之后",
            "D": "疼痛程度较轻",
            "E": "皮肤有异常感，瘙痒、疼痛"
          },
          "answer": "E",
          "analysis": "初期局部皮肤有异常感，瘙痒、疼痛，进而出现红疹、疱疹，串连成带状，以躯干和面额部为多见，呈单侧分布，病程约3周左右，少数可达数月之久。并发症有脑脊髓炎和眼结膜炎等。故选E。",
          "type": "多选题"
        },
        {
          "id": 12598,
          "title": "对于蛇串疮的日常预防注意事项，下列说法错误的是",
          "options": {
            "A": "平素注意调适情绪，保持心情舒畅",
            "B": "起居有常，睡眠充足，避免劳累，顺应四时气候。顾护正气，注意个人卫生",
            "C": "合理膳食，清淡为宜",
            "D": "适当锻炼，增强体质",
            "E": "愈后出院，患者如出现局部遗留神经疼痛，持续几日可自行消退，不必就医"
          },
          "answer": "E",
          "analysis": "适当锻炼，增强体质。合理膳食，清淡为宜，平素注意调适情绪，保持心情舒畅，起居有常，睡眠充足，避免劳累，顺应四时气候。顾护正气，注意个人卫生肥肉、饴糖、牛奶及甘甜等食物，多具滋腻、肥甘壅塞之性，易使本病之湿热毒邪内蕴不达，带状疱疹病情缠绵不愈。故选E。",
          "type": "多选题"
        },
        {
          "id": 12599,
          "title": "患者丁某，女，56岁，因左侧胁肋部疱疹疼痛一周来院就诊。查体可见：左侧胸胁皮肤大片红斑，水疱集簇成群，疱壁紧张发亮，灼热刺痛。患者自述口干口苦，心绪烦躁易怒，不思饮食，舌红苔黄或腻，脉弦数。下列针对此患者该采取的护理措施中，不恰当的是",
          "options": {
            "A": "以生理盐水冷敷患处，一次30分钟，每日3次，可使患部迅速干燥，减轻疼痛",
            "B": "病室宜安静、整洁，室温宜偏高",
            "C": "注意情志护理，使患者保持心情舒畅",
            "D": "饮食宜清淡，忌食辛辣、鱼腥等动风发物及肥甘厚味动火之食",
            "E": "口服汤剂不宜久煎"
          },
          "answer": "B",
          "analysis": "根据患者临床症状可诊断为蛇串疮，根据选项蛇串疮的护理措施如下：1.生理盐水冷敷，一次30分钟，每日3次，可使患部迅速干燥，减轻疼痛。2.病室宜安静、整洁，室温宜凉，湿盛者宜偏干燥。3.情志护理：本病因多情志不遂，肝胆火旺，患者多性情急躁，需做好心理安慰。4.饮食护理：饮食宜清淡，忌食辛辣、鱼腥等动风发物及肥甘厚味动火之食。故答案选B。",
          "type": "多选题"
        },
        {
          "id": 12600,
          "title": "外科辨肿，“肿而皮肉重垂胀急，深则按之如烂棉不起，浅则光亮如水疱，破流黄水”其成因属",
          "options": {
            "A": "风 ",
            "B": "虚 ",
            "C": "热 ",
            "D": "湿 ",
            "E": "痰"
          },
          "answer": "D",
          "analysis": "湿肿：皮肉重垂胀急，深按凹陷，如烂棉不起，浅则光亮如水疱，破流黄水，浸淫皮肤。见于股肿、湿疮。故D正确。",
          "type": "多选题"
        },
        {
          "id": 12601,
          "title": "下列关于乳痈的说法中，错误的是",
          "options": {
            "A": "是乳房部急性化脓性疾病",
            "B": "相当于西医急性化脓性乳腺炎（乳房炎）",
            "C": "多见于哺乳期妇女",
            "D": "以经产妇多见",
            "E": "好发于产后第3－4周"
          },
          "answer": "D",
          "analysis": "乳痈是以乳房红肿疼痛，乳汁排出不畅，以致结脓成痈的急性化脓性病证。多发于产后哺乳的产妇，尤其是初产妇更为多见。俗称奶疮。根据发病时期的不同，又有几种名称：发生于哺乳期者，称外吹乳痈；发生于怀孕期者，名内吹乳痈；在非哺乳期和非怀孕期发生者，名非哺乳期乳痈。现代医学之急性化脓性乳腺炎属于乳痈范畴。故选D。",
          "type": "多选题"
        },
        {
          "id": 12602,
          "title": "导致乳痈的原因有很多，常见的有感受外邪、肝胃郁热和乳汁郁积，下列哪项可以导致乳汁郁积，在对产妇进行健康教育时，需着重强调",
          "options": {
            "A": "外感风邪",
            "B": "乳儿口中热毒之气内侵",
            "C": "挤压碰撞",
            "D": "哺乳不当",
            "E": "情志不畅，肝失疏泄"
          },
          "answer": "D",
          "analysis": "对于很多新妈妈来说，掌握正确的哺乳方法是正确的，既有利于宝宝的健康又可避免乳腺炎的发生。故选D。",
          "type": "多选题"
        },
        {
          "id": 12603,
          "title": "对初产妇进行健康哺乳宣教的时候，下列哪些说法不正确",
          "options": {
            "A": "提醒产妇，预防乳痈的关键在于避免乳汁郁积",
            "B": "哺乳期间，防止乳头破损",
            "C": "哺乳期间，保持乳头清洁",
            "D": "发生乳痈，可坚持哺乳，不必断乳",
            "E": "注意生活起居有常，保持情绪舒畅"
          },
          "answer": "D",
          "analysis": "乳痈是发生于乳房的一种急性感染,致病菌最常见的是金黄色葡萄球菌,可以是发生于哺乳期,也可以见于乳房皮肤的皮脂腺继发梗阻，发生乳痈时因停止哺乳。故选D。",
          "type": "多选题"
        },
        {
          "id": 12604,
          "title": "下列哪项不是乳痈患者成脓期的临床表现",
          "options": {
            "A": "肿块不消，逐渐增大",
            "B": "疼痛剧烈，逐渐加重，搏动性疼痛",
            "C": "皮色焮红、灼热伴明显触痛，高热、口渴、口苦咽干、便秘溲赤",
            "D": "头身疼痛，患侧淋巴结肿大、压痛，全身症状明显",
            "E": "乳汁从疮口流出"
          },
          "answer": "E",
          "analysis": "患乳肿块逐渐增大，局部疼痛加重，或有鸡啄样疼痛，皮肤焮红灼热。同侧腋窝淋巴结肿大压痛；病情进一步发展，肿块中央渐渐变软，按之应指有波动感，穿刺抽吸出脓液，有时脓液可从乳窍中流出。全身症状加剧，壮热不退，口渴思饮，小便短赤，舌红苔黄腻，脉洪数。故选E。",
          "type": "多选题"
        },
        {
          "id": 12605,
          "title": "患者甲，29岁，初产妇，产后第四周，因乳房左外下象限肿胀疼痛2天来院就诊，查体可见：乳房局部变硬、压痛、皮色微红、微热，伴身困不适，头痛、烦燥、食欲不振。下列对该患者处置正确的是",
          "options": {
            "A": "该患者处于乳痈初起阶段，可进行乳房按摩",
            "B": "该患者处于乳痈成脓阶段，不能乳房按摩",
            "C": "该患者应该切开排脓",
            "D": "建议该患者停止哺乳",
            "E": "该患者的护理原则为提脓祛腐，生肌收口"
          },
          "answer": "A",
          "analysis": "初起：常有乳头皲裂，哺乳时乳头刺痛，伴有乳汁排泄不畅或结块，乳房局部肿胀疼痛，皮色不红或微红，皮肤不热或微热。或伴有全身不适，恶寒发热，食欲不振，脉滑数。可适当按摩，故选A。",
          "type": "多选题"
        },
        {
          "id": 12606,
          "title": "患者李某，27岁，产后3周，因乳房肿痛10天来院就诊，查体：肿块顶部中心变软，按之应指，波动感，舌红苔黄，脉弦数。家属述其自产后情绪容易激动。下列对该患者处置错误的是",
          "options": {
            "A": "以清热解毒为原则",
            "B": "用药考虑托里透脓",
            "C": "必要时需切开排脓",
            "D": "应采用十字状切口",
            "E": "注意情绪疏导"
          },
          "answer": "D",
          "analysis": "乳痈切开引流采用与乳头方向呈放射状的切口。故选D。",
          "type": "多选题"
        },
        {
          "id": 12607,
          "title": "对于湿疮的理解，下列说法中错误的是",
          "options": {
            "A": "皮损为多形性损害",
            "B": "易有渗出倾向",
            "C": "剧烈瘙痒",
            "D": "常单侧分布",
            "E": "反复发作的过敏性炎症性皮肤病"
          },
          "answer": "D",
          "analysis": "湿疮，中医病名。湿疮是一种由多种内外因素引起的过敏性炎症性皮肤病。以多形性皮损，对称分布，易于渗出，自觉瘙痒，反复发作和慢性化为临床特征。故选D。",
          "type": "多选题"
        },
        {
          "id": 12608,
          "title": "对于湿疮的分类，下列说法中错误的是",
          "options": {
            "A": "根据病程可分为急性、亚急性、慢性三类",
            "B": "急性湿疮以丘疱疹为主，有渗出倾向",
            "C": "慢性湿疮以苔藓样变为主，易反复发作",
            "D": "根据病程可分为急性、慢性两类",
            "E": "根据皮损特点分为干性和湿性"
          },
          "answer": "D",
          "analysis": "根据病程和皮损特点，一般分为急性、亚急性、慢性三类。故选D。",
          "type": "多选题"
        },
        {
          "id": 12609,
          "title": "日常预防湿疮尤为重要，下列预防措施中正确的是",
          "options": {
            "A": "急性湿疮可用热水烫洗",
            "B": "急性湿疮可用肥皂等刺激物洗患处",
            "C": "湿疮患者剧痒时可搔抓患处",
            "D": "湿疮患者应忌食辛辣、鱼、虾、鸡、鹅、牛、羊肉等发物，亦应忌食香菜、韭菜、芹菜、姜、葱、蒜等辛香之品",
            "E": "急性湿疮或慢性湿疮急性发作期间，可预防注射各种疫苗和接种牛痘"
          },
          "answer": "D",
          "analysis": "急性者忌用热水烫洗和肥皂等刺激物洗涤。不论急性、慢性，均应避免搔抓，并忌食辛辣、鸡鸭、牛羊肉、鱼腥海鲜等发物。急性湿疮或慢性湿疮急性发作期间，应暂缓预防注射。故选D。",
          "type": "多选题"
        },
        {
          "id": 12610,
          "title": "对于幼儿湿疮的认识，下列说法错误的是",
          "options": {
            "A": "多发于l～2岁婴幼儿的",
            "B": "好发在头面，重者可延及躯干和四肢",
            "C": "患儿常有家族过敏史",
            "D": "多见于母乳喂养的婴儿",
            "E": "又称“奶癣”、“胎敛疮”"
          },
          "answer": "D",
          "analysis": "湿疹遗传因素发挥着重要作用，有过敏体质家族史的小儿更容易发生湿疹。主要原因为对食入物、吸入物或接触物不耐受或过敏所致。而并不是多见于母乳喂养的婴儿，故选D。",
          "type": "多选题"
        },
        {
          "id": 12611,
          "title": "患者李某因皮肤破溃瘙痒2周来院就诊，查体可见：皮损呈多形性，由斑丘疹、疱疹、水疱组成，集族成片状，边缘不清。由于搔抓，引起糜烂。有灼热及瘙痒感，反复发作。患者李某得的是",
          "options": {
            "A": "急性湿疮",
            "B": "亚急性湿疮",
            "C": "慢性湿疮",
            "D": "带状疱疹",
            "E": "接触性皮炎"
          },
          "answer": "A",
          "analysis": "以多形性皮损，对称分布，易于渗出，自觉瘙痒，反复发作和慢性化为临床特征。故选A。",
          "type": "多选题"
        },
        {
          "id": 12612,
          "title": "患者李某因皮肤破溃瘙痒2周来院就诊，查体可见：皮损呈多形性，由斑丘疹、疱疹、水疱组成，集族成片状，边缘不清。由于搔抓，引起糜烂。有灼热及瘙痒感，反复发作。在对其护理中，应注意的事项不包括",
          "options": {
            "A": "水疱少而无渗液时，外护宜清热安抚，避免刺激",
            "B": "若水疱糜烂、渗出明显时，宜用收敛、消炎药剂促进表皮恢复",
            "C": "急性湿疮后期滋水减少时，宜保护皮损，避免刺激，促进角质新生，清除残余炎症",
            "D": "建议患者勤换衣物，保持个人卫生",
            "E": "建议多洗热水澡，水温适当调高一些"
          },
          "answer": "E",
          "analysis": "患湿疮时，洗澡水不宜过热，并停止使用沐浴露。故选E。",
          "type": "多选题"
        },
        {
          "id": 12613,
          "title": "下列哪个疾病，不属于脱疽范畴（  ）",
          "options": {
            "A": "肢端动脉痉挛病",
            "B": "血栓闭塞性脉管炎",
            "C": "动脉硬化性闭塞症",
            "D": "糖尿病性肢端坏疽",
            "E": "糖尿病足病"
          },
          "answer": "A",
          "analysis": "脱疽相当于西医学的血栓闭塞性脉管炎和动脉粥样硬化闭塞症。选项中不属于脱疽的是肢端动脉痉挛病，故选A。",
          "type": "多选题"
        },
        {
          "id": 12614,
          "title": "糖尿病性肢端坏疽中，最多见的是（  ）",
          "options": {
            "A": "气性坏疽",
            "B": "湿性坏疽",
            "C": "干性坏疽",
            "D": "混合性坏疽",
            "E": "炭疽"
          },
          "answer": "B",
          "analysis": "湿性坏疽。肢端体表局部软组织糜烂，形成浅溃疡，继之溃烂深入肌层，甚则烂断肌腱，骨质受破坏，大量组织坏死，形成大脓腔，排出较多分泌物。此型坏疽多见，占72。5%，主要病理基础是微血管基底膜增厚所致微循环障碍。故选B。",
          "type": "多选题"
        },
        {
          "id": 12615,
          "title": "周围血管病总的治则是(  )",
          "options": {
            "A": "活血化瘀",
            "B": "温经散寒",
            "C": "清热利湿",
            "D": "益气活血",
            "E": "清热解毒"
          },
          "answer": "A",
          "analysis": "非手术治疗主要目的为降低血脂和血压，改善血液高凝状态，促进侧支循环形成。活血化瘀是周围性血管病总的治则。故选A。",
          "type": "多选题"
        },
        {
          "id": 12616,
          "title": "血栓闭塞性脉管炎，多见于（   ）",
          "options": {
            "A": "青年女性",
            "B": "青壮年",
            "C": "50～70岁男性",
            "D": "50岁以上，男女均可",
            "E": "70岁以上男性"
          },
          "answer": "B",
          "analysis": "多见于青壮年，好发于下肢。患肢呈现一时性或持续性苍白、发绀、有灼热及刺痛，病肢下垂时皮色变红，上举时变白，继之足趾麻木，小腿肌肉疼痛，行走时激发，休息时消失；小腿部常发生浅表性静脉炎和水肿。故选B。",
          "type": "多选题"
        },
        {
          "id": 12617,
          "title": "有高血压史二十余年。局部体征：双下肢尚对称，右足五趾及足背肤色苍白，扪之发凉，趺阳脉搏动较右侧明显减弱。血压160/90mmHg。舌质淡边有瘀斑，苔白腻，脉弦滑。中医诊断是（）",
          "options": {
            "A": "溃疡",
            "B": "丹毒",
            "C": "淋巴结炎",
            "D": "脱疽",
            "E": "股肿"
          },
          "answer": "D",
          "analysis": "局部体征：双下肢尚对称，右足五趾及足背肤色苍白，扪之发凉，趺阳脉搏动较右侧明显减弱。为脱疽的临床表现，故选D。",
          "type": "多选题"
        },
        {
          "id": 12618,
          "title": "患者，男性，45岁。右足怕冷不温1年，步履不便，五趾疼痛伴间隙性跛行2月，检查：右足五趾肤色苍白，扪之发凉，趺阳脉搏动减弱，舌淡，苔白，脉沉细。主方宜选用（  ）",
          "options": {
            "A": "桃红四物汤",
            "B": "阳和汤",
            "C": "四妙勇安汤",
            "D": "顾步汤",
            "E": "四妙丸"
          },
          "answer": "B",
          "analysis": "阳和汤的功效有：温阳补血，散寒通滞。主治阳虚寒凝而成的流注，阴疽，多疽，鹤膝风，石疽，贴骨疽等漫肿无头，平塌白陷。皮色不变，疼痛，无热。不渴，舌淡苔白者。故选B。",
          "type": "多选题"
        },
        {
          "id": 12619,
          "title": "对于金黄膏过敏者，宜改用以下哪种（  ）",
          "options": {
            "A": "青黛膏",
            "B": "红油膏",
            "C": "疯油膏",
            "D": "白玉膏",
            "E": "冲和膏"
          },
          "answer": "A",
          "analysis": "青黛膏主要用于收湿止痒、清热解毒，多用于皮肤焮红痒痛及各种油膏过敏者。红油膏主要用于防腐生肌，一切溃疡。疯油膏主要用于功能润燥、杀虫、止痒。白玉膏主要用于活血消肿，祛腐生肌。治臁疮溃后，日久不敛。冲和膏主要用于活血止痛、疏风祛寒、消肿软坚用于半阴半阳证。故选A。",
          "type": "多选题"
        },
        {
          "id": 12620,
          "title": "具有箍毒围聚、收束疮毒作用的药物是（  ）",
          "options": {
            "A": "箍围药",
            "B": "消散药",
            "C": "腐蚀药",
            "D": "提脓祛腐药",
            "E": "止血药"
          },
          "answer": "A",
          "analysis": "箍围药，是借药粉具有箍集围聚、收束疮毒的作用，从而促使肿疡初起轻者可以消散；即使毒已结聚，也能促使疮形缩小，趋于局限，达到早日成脓和破溃；就是在破溃后，余肿未消者，也可用它来消肿，截其余毒。故选A。",
          "type": "多选题"
        },
        {
          "id": 12621,
          "title": "适用于半阴半阳之证的外用药是（   ）",
          "options": {
            "A": "太乙膏",
            "B": "红油膏",
            "C": "金黄膏",
            "D": "冲和膏",
            "E": "青黛膏"
          },
          "answer": "D",
          "analysis": "冲和膏主治: 痈疡之症，似溃非溃，介于半阴半阳者。故选D。",
          "type": "多选题"
        },
        {
          "id": 12622,
          "title": "具有生肌收口作用的药物是（  ）",
          "options": {
            "A": "生肌散",
            "B": "青黛散",
            "C": "桃花散",
            "D": "金黄散",
            "E": "九一丹"
          },
          "answer": "A",
          "analysis": "生肌散。由象皮(滑石烫)、龙骨(煅)、没药(醋炙)、儿茶、血竭、冰片、赤石脂、乳香(醋炙)组成。具有解毒，生肌的功效。用于疮疖久溃，肌肉不生，久不收口。故选A。",
          "type": "多选题"
        },
        {
          "id": 12623,
          "title": "患者中年男性，过食辛辣油腻后，项后发际出现红肿结块，约5cm×5cm，触之较硬，肤温高，自觉疼痛，伴大便秘结，舌质红，苔薄，脉细数。请问该患者应选哪种油膏外用（  ）",
          "options": {
            "A": "冲和膏",
            "B": "回阳玉龙膏",
            "C": "金黄膏",
            "D": "红油膏",
            "E": "白玉膏"
          },
          "answer": "C",
          "analysis": "根据题干给出的信息，已明确告知该患者为颈痈，结合其症状表现，患者未颈部肿块未化脓，还处在初期。故外治上初起用金黄膏外敷。故C正确。",
          "type": "多选题"
        },
        {
          "id": 12624,
          "title": "患者，男性，70岁。右足怕冷不温半年，步履不便，足趾疼痛伴间隙性跛行2月，检查：右足五趾肤色苍白，扪之发凉，趺阳脉搏动减弱，舌淡，苔白，脉沉细。外用药物宜选用（  ）",
          "options": {
            "A": "青黛膏",
            "B": "回阳玉龙膏",
            "C": "金黄膏",
            "D": "红油膏",
            "E": "白玉膏"
          },
          "answer": "B",
          "analysis": "青黛膏主要用于收湿止痒、清热解毒，多用于皮肤焮红痒痛及各种油膏过敏者。回阳玉龙膏主要用于温经散寒、活血化瘀，用于阴症。                                          金黄膏主要用于治疗各种损伤引起的骨折和肌肉损伤，包括刀伤、枪伤或烫伤。红油膏主要用于防腐生肌，一切溃疡。                                                        白玉膏主要用于活血消肿，祛腐生肌。治臁疮溃后，日久不敛。                            故选B。",
          "type": "多选题"
        },
        {
          "id": 12625,
          "title": "周期性疼痛是下列哪种疾病的主要症状",
          "options": {
            "A": "肛裂",
            "B": "内痔",
            "C": "肛瘘",
            "D": "肛管直肠癌",
            "E": "外痣"
          },
          "answer": "A",
          "analysis": "肛裂的疼痛呈周期性，多由排便引起，排便时会刺激溃疡面的神经末梢引起灼痛，便后片刻疼痛缓解，此为疼痛间歇期，随后由于内括约肌痉挛出现肛门剧痛，难以忍受，有的还会放射到会阴部，两大腿内侧和臀部，可持续数分钟至数小时，直至内括约肌松弛，疼痛停止。故选A。",
          "type": "多选题"
        },
        {
          "id": 12626,
          "title": "内痔分期中，指出哪项错误：",
          "options": {
            "A": "痔核小，无疼痛，不脱出，以便血为特征属I期",
            "B": "痔核较大，便血或多或少，便时可脱出肛外，便后自行回纳，属II期",
            "C": "痔核更大，出血更多，大便时可脱出，亦可自行回纳，属III期",
            "D": "痔核大，出血不多，便后脱出不能自行回纳，属III期",
            "E": ""
          },
          "answer": "D",
          "analysis": "内痔根据患者不同的临床症状和严重程度，一般分为三期。一期内痔主要是轻度的肛门局部便血或者疼痛，一般可以通过口服痔速宁片以及肛塞痔疮栓和肛门口涂抹痔疮膏得到明显缓解。二期内痔和三期内痔主要是以脱出性的症状为常见。二期内痔脱出以后可以自行回缩至肛管内，患者可以选择保守用药治疗，也可以进行手术。而三期内痔一般脱出以后，很难自行回缩，每次排便和下蹲以后都需要患者用手送回。三期内痔的主要治疗方法是以手术为主，需要尽早进行手术，避免病情加重。故选D。",
          "type": "多选题"
        },
        {
          "id": 12627,
          "title": "患者，蔡某，女性，20岁，有大便困难病史十年，自诉近2周来，排便时肛门呈刀割样疼痛，约持续半天，伴有出血，量少，色鲜红。舌淡，苔薄，脉细。若肛门局部检查时发现肛门溃疡表面呈灰白色，伴皮下瘘、肛乳头肥大形成，根治的方法宜选",
          "options": {
            "A": "注射疗法",
            "B": "结扎疗法",
            "C": "扩肛法",
            "D": "切开疗法",
            "E": "熏洗疗法"
          },
          "answer": "E",
          "analysis": "熏洗疗法适用于各期内痔，内痔嵌顿肿痛、出血、年老体弱兼有其他严重慢性疾病。故选E。",
          "type": "多选题"
        },
        {
          "id": 12628,
          "title": "以截石位为标准，找出下列哪一种病不是其好发部位：",
          "options": {
            "A": "内痔好发于齿线上3、7、11点；",
            "B": "血栓外痔好发于肛缘3、9点；",
            "C": "肛裂好发于6、12点；",
            "D": "赘皮外痔好发于齿线下3、9；",
            "E": "混合痔好发于3、7、11点；"
          },
          "answer": "D",
          "analysis": "赘皮外痔女性患者(尤其经产妇)多见，且常见于肛门正前方（12点）。故D错误，选D。",
          "type": "多选题"
        },
        {
          "id": 12629,
          "title": "II、III期内痔临床上以痔核脱出为主，远期疗效最佳的是：",
          "options": {
            "A": "内服法",
            "B": "熏洗法",
            "C": "塞药法",
            "D": "贯穿结扎法",
            "E": "赘皮外痔"
          },
          "answer": "D",
          "analysis": "贯穿结扎法是在痔核深部用粗线贯穿结扎，使痔核缺血坏死而脱落，以达到痊愈的目的。适用于Ⅱ～Ⅲ期内痔，特别是纤维型内痔。故选D。",
          "type": "多选题"
        },
        {
          "id": 12630,
          "title": "患者，张某，男性，45岁，便时出血2个月，色鲜红，点滴而下，无疼痛，伴有块物自肛门内脱出，能自行复位，舌质淡红，苔薄，脉细,应选用的手术方法是：",
          "options": {
            "A": "切开疗法",
            "B": "切除疗法",
            "C": "结扎疗法",
            "D": "引流疗法",
            "E": "挂线疗法"
          },
          "answer": "C",
          "analysis": "据题意张某属所患为Ⅱ期内痔，痔疮结扎疗法适用于Ⅱ期以上内痔、混合痔以及外痔的治疗。故选C。",
          "type": "多选题"
        },
        {
          "id": 12636,
          "title": "具有峻下热结功用的方剂是？",
          "options": {
            "A": "大黄牡丹汤",
            "B": "大承气汤",
            "C": "大柴胡汤",
            "D": "三物备急丸",
            "E": "黄龙汤"
          },
          "answer": "B",
          "analysis": "大承气汤以大黄苦寒泻热，荡涤肠胃邪热积滞为君药；配芒硝咸寒泻热，软坚润燥通便为臣药；更配枳实、厚朴行气导滞，消痞除满为佐药。功能峻下热结，故选B。",
          "type": "多选题"
        },
        {
          "id": 12641,
          "title": "下列药物中，性善“上行头目”，为治头痛的要药是？",
          "options": {
            "A": "羌活",
            "B": "川芎",
            "C": "细辛",
            "D": "白芷",
            "E": "吴茱萸"
          },
          "answer": "B",
          "analysis": "以上五味药物均能止痛，治疗头痛。但羌活、白芷、细辛均能散寒解表止痛，其中羌活善于治疗风寒太阳经头痛，白芷善于治疗阳明经头痛，细辛则善于治疗少阴经头痛；吴茱萸暖肝散寒止痛，并能降逆止呕，善于治疗厥阴经颠顶头痛；川芎既能活血行气，又能祛风止痛，既升且降，其升浮而善“上行头目”，可治疗多种类型、任何部位的头痛，但以感受外邪和血瘀头痛为主，是治疗头痛的要药，所谓“头痛不离川芎”。故选B。",
          "type": "多选题"
        },
        {
          "id": 12642,
          "title": "“行血中气滞，气中血滞，专治一身上下诸痛”的药物是？",
          "options": {
            "A": "川芎",
            "B": "郁金",
            "C": "延胡索",
            "D": "姜黄",
            "E": "乳香"
          },
          "answer": "C",
          "analysis": "延胡索为治疗痛证的要药，既能活血止痛，又能行气止痛，善于治疗各部位气滞血瘀的痛证。故选C。",
          "type": "多选题"
        },
        {
          "id": 12643,
          "title": "郁金既能活血止痛，又能行气止痛，治疗气滞血瘀痛证，常配伍下列哪味药？",
          "options": {
            "A": "木香",
            "B": "香附",
            "C": "檀香",
            "D": "沉香",
            "E": "青木香"
          },
          "answer": "A",
          "analysis": "郁金既入血分以活血化瘀而止痛，又入气分以行气解郁而止痛，是治疗瘀滞痛证的要药，然以入血分治瘀痛为主；木香专入气分，长于行气止痛，是治疗气滞痛证的要药;郁金配伍木香，活血行气止痛的作用更强，如颠倒木金散（《医宗金鉴》），故选A。",
          "type": "多选题"
        },
        {
          "id": 12644,
          "title": "下列何项不是郁金的功效？",
          "options": {
            "A": "利尿通淋",
            "B": "清心凉血",
            "C": "活血止痛",
            "D": "行气解郁",
            "E": "利胆退黄"
          },
          "answer": "A",
          "analysis": "郁金辛、苦、微寒，既入血分，又入气分，能活血止痛、行气解郁、清心凉血、利胆退黄，故选A。",
          "type": "多选题"
        },
        {
          "id": 12645,
          "title": "为增强活血祛瘀药的功效，常配伍的药物是？",
          "options": {
            "A": "解表药",
            "B": "理气药",
            "C": "温里药",
            "D": "泻下药",
            "E": "补虚药"
          },
          "answer": "B",
          "analysis": "由于气血之间的密切关系，在使用活血化瘀药时，常配伍理气药，以增强活血化瘀之力，故选B。",
          "type": "多选题"
        },
        {
          "id": 12646,
          "title": "既能活血，又能凉血，并能养血的药物是？",
          "options": {
            "A": "丹参",
            "B": "大黄",
            "C": "鸡血藤",
            "D": "郁金",
            "E": "生地黄"
          },
          "answer": "A",
          "analysis": "丹参既能活血调经，治疗瘀血阻滞之月经不调和其他病证，又能凉血消痈以治疮疡痈肿，并能养血安神以治热入营血，烦躁不寐，及血不养心之心悸失眠等。故选A。",
          "type": "多选题"
        },
        {
          "id": 12647,
          "title": "具有活血行气、通经止痛作用，长于行肢臂而除痹痛的药物是？",
          "options": {
            "A": "丹参",
            "B": "姜黄",
            "C": "乳香",
            "D": "红花",
            "E": "川芎"
          },
          "answer": "B",
          "analysis": "以上五味药均能活血行气止痛，而用于瘀滞痛证。但姜黄辛散苦燥温通，外散风寒湿邪，内行气血、通经止痛，而长于行肢臂经脉而除痹痛。故选B。",
          "type": "多选题"
        },
        {
          "id": 12648,
          "title": "下列药物中入汤剂宜包煎的是？",
          "options": {
            "A": "红花",
            "B": "月季花",
            "C": "马钱子",
            "D": "五灵脂",
            "E": "骨碎补"
          },
          "answer": "D",
          "analysis": "以上五味药物中马钱子一般不入汤剂，多入丸散剂；而红花、骨碎补入汤剂的煎法无特殊要求；月季花入汤剂不宜久煎；五灵脂遇水易散开呈粉状，引起药液浑浊，故入汤剂需包煎。故选D。",
          "type": "多选题"
        },
        {
          "id": 12649,
          "title": "桃仁既能活血祛瘀，又能润肠通便，下列亦属于桃仁的功效的是？",
          "options": {
            "A": "行气止痛",
            "B": "止咳平喘",
            "C": "利水消肿",
            "D": "凉血消痈",
            "E": "化瘀止血"
          },
          "answer": "B",
          "analysis": "桃仁专入血分，长于活血祛瘀，又药用种子，富含油脂，入大肠经，能润滑肠道而通便，且味苦，性沉降，能降肺气而止咳平喘。故选B。",
          "type": "多选题"
        },
        {
          "id": 12651,
          "title": "长于促进骨折愈合的药物是？",
          "options": {
            "A": "骨碎补",
            "B": "血竭",
            "C": "刘寄奴",
            "D": "土鳖虫",
            "E": "自然铜"
          },
          "answer": "E",
          "analysis": "自然铜具有散瘀消肿、接骨疗伤的功能，尤其长于促进骨折的愈合。故选E。",
          "type": "多选题"
        },
        {
          "id": 12652,
          "title": "骨碎补的功效是？",
          "options": {
            "A": "散瘀止痛，接骨疗伤",
            "B": "活血疗伤，祛瘀通经",
            "C": "活血续伤，补肾强骨",
            "D": "祛风湿，强筋骨，止血",
            "E": "活血定痛，化瘀止血"
          },
          "answer": "C",
          "analysis": "散瘀止痛，接骨疗伤是自然铜的功效；活血疗伤，祛瘀通经是苏木的功效；活血续伤，补肾强骨是骨碎补的功效；祛风湿、强筋骨、止血是鹿衔草的功效；活血定痛、化瘀止血是血竭的功效。故选C。",
          "type": "多选题"
        },
        {
          "id": 12653,
          "title": "怀牛膝的产地是？",
          "options": {
            "A": "四川",
            "B": "云南",
            "C": "广东",
            "D": "河南",
            "E": "湖南"
          },
          "answer": "D",
          "analysis": "牛膝入药用苋科植物牛膝和川牛膝的根。牛膝即为怀牛膝，河南产者量大质佳，为河南所产四大怀药之一。其“怀”意为古时的“怀庆”地区。故选D。",
          "type": "多选题"
        },
        {
          "id": 12654,
          "title": "有“呕家圣药”之称的药物是？",
          "options": {
            "A": "柴胡",
            "B": "辛夷",
            "C": "升麻",
            "D": "生姜",
            "E": "白芷"
          },
          "answer": "D",
          "analysis": "生姜辛散温通，能温胃散寒，和中降逆，其止呕功良，随证配伍可治疗多种呕吐，故素有“呕家圣药”之称。其它四味解表药都没有止呕功效。故选D。",
          "type": "多选题"
        },
        {
          "id": 12664,
          "title": "下列除哪项外均为大黄的功效？",
          "options": {
            "A": "泻下攻积",
            "B": "清热泻火",
            "C": "凉血解毒",
            "D": "逐瘀痛经",
            "E": "利尿通淋"
          },
          "answer": "E",
          "analysis": " A、B、C、D均为大黄的功效。大黄临床上虽可用治湿热淋证，但主要是取其泻下通便导湿热积滞外出，而本身无利尿通淋作用。故选E。",
          "type": "多选题"
        },
        {
          "id": 12665,
          "title": "具有软坚散结、清热功效的药物是？",
          "options": {
            "A": "大黄",
            "B": "芦荟",
            "C": "芒硝",
            "D": "番泻叶",
            "E": "郁李仁"
          },
          "answer": "C",
          "analysis": "本题中的五味药物虽然均有泻下作用，但其中只有芒硝味咸可软坚。故选C。",
          "type": "多选题"
        },
        {
          "id": 12666,
          "title": "既可润肠通便，又能利水消肿的药物是？",
          "options": {
            "A": "决明子",
            "B": "生地黄",
            "C": "火麻仁",
            "D": "郁李仁",
            "E": "松子仁"
          },
          "answer": "D",
          "analysis": "本题中的五个备选药物中，虽然均具有润肠通便的作用，但只有郁李仁尚具有利水消肿之功。故选D。",
          "type": "多选题"
        },
        {
          "id": 12675,
          "title": "治疗脾胃气滞，脘腹胀痛及泻痢里急后重，宜首选？",
          "options": {
            "A": "陈皮",
            "B": "枳壳",
            "C": "佛手",
            "D": "木香",
            "E": "大腹皮"
          },
          "answer": "D",
          "analysis": "5个备选答案中的药物都可用于治疗脾胃气滞，脘腹胀痛，惟木香辛行苦降，善行大肠之滞气而治泻痢里急后重，故宜首选D。",
          "type": "多选题"
        },
        {
          "id": 12676,
          "title": "既能破气消积，又能化痰除痞的药物是?",
          "options": {
            "A": "枳实",
            "B": "青皮",
            "C": "沉香",
            "D": "川楝子",
            "E": "绿梅花"
          },
          "answer": "A",
          "analysis": "首先，备选答案中理气作用强，能破气消积的药物是枳实和青皮，二者之中同时又具备化痰和除痞功效的只有枳实，故选A。",
          "type": "多选题"
        },
        {
          "id": 12678,
          "title": "沉香治疗喘证，是取其何种功效？",
          "options": {
            "A": "宣肺平喘",
            "B": "纳气平喘",
            "C": "清肺平喘",
            "D": "益气平喘",
            "E": "温肺平喘"
          },
          "answer": "B",
          "analysis": "喘证有虚实之分，沉香治疗的喘证是肾不纳气或上盛下虚的虚喘，能温肾纳气、降逆平喘，沉香无宣肺、清肺、益气和温肺之功，故选B。",
          "type": "多选题"
        },
        {
          "id": 12679,
          "title": "治疗胸痹证是取薤白的哪方面功效？",
          "options": {
            "A": "通阳散结",
            "B": "理气健脾",
            "C": "化痰宽胸",
            "D": "宣肺化痰",
            "E": "破气除痞"
          },
          "answer": "A",
          "analysis": "胸痹证主要病机为寒痰阻滞或痰瘀阻闭，胸阳不振所致。薤白辛散苦降、温通滑利，善散阴寒之凝滞，通胸阳之闭结，为治胸痹之要药。故选A。",
          "type": "多选题"
        },
        {
          "id": 12683,
          "title": "就病变过程中矛盾主次关系而言，其标本之划分，下列何项表述为错？",
          "options": {
            "A": "正气为本，邪气为标",
            "B": "病机为标，症状为本",
            "C": "先病为本，后病为标",
            "D": "原发病为本，继发病为标",
            "E": "脏腑病为本，肌表经络病为标"
          },
          "answer": "B",
          "analysis": "本是事物的主要矛盾，标是事物的次要矛盾。标本是随着疾病发展变化的具体情况所指有所不同。就邪正而言，正气为本，邪气为标；就疾病先后言，先病、原发病为本，后病、继发病为标；就病位而言，脏腑精气病为本，肌表经络病为标等；就病机与症状而言，病机为本，症状为标；故选B。",
          "type": "多选题"
        },
        {
          "id": 12684,
          "title": "素体气虚，抗病力低下，反复感冒，治之以益气解表，以标本先后缓急治则言之，属于下列中哪一项？",
          "options": {
            "A": "急则治其标",
            "B": "本急则先治其本",
            "C": "缓则治其本",
            "D": "本缓则先治其标",
            "E": "标本兼治"
          },
          "answer": "E",
          "analysis": "气虚为本，外感为标，单用补气则会留邪，单用解表则会伤正，应标本兼治，故选E。",
          "type": "多选题"
        },
        {
          "id": 12685,
          "title": "病人出现大量腹水，呼吸喘促，大小便不利等急重症状，应采用下列哪种治则？",
          "options": {
            "A": "虚则补之",
            "B": "标本兼治",
            "C": "通因通用",
            "D": "急则治标",
            "E": "缓则治本"
          },
          "answer": "D",
          "analysis": "目前病人出现的标症甚急，已成为疾病现阶段的主要矛盾，故应按照急则治标的原则，用逐水通便之法先治其标，待大小便通利，腹水减轻或消除后，再调理肝脾以治其本，故选D。",
          "type": "多选题"
        },
        {
          "id": 12687,
          "title": "寒因寒用，系指采用寒凉性质的药物来治疗下列哪一病症？",
          "options": {
            "A": "寒证",
            "B": "虚寒证",
            "C": "真热假寒证",
            "D": "真寒假热证",
            "E": "寒热错杂证"
          },
          "answer": "C",
          "analysis": "寒因寒用，是指采用寒凉性质的药物来治疗具有假寒征象的病症，适用于阳盛格阴的真热假寒证。如热厥证中，由于里热盛极，阳气郁阻于内，不能外达于肢体起温煦作用，并格阴于外而见手足厥冷，脉沉伏之假寒之象。但细究之，患者手足虽冷，但躯干部却壮热而欲掀衣揭被，或见恶热、烦渴饮冷、小便短赤、舌红绛、苔黄等里真热的征象。这是阳热内盛，深伏于里所致。外在寒象是假，里热盛极才是病之本质，须用寒凉药清其里热。故选C。",
          "type": "多选题"
        },
        {
          "id": 12688,
          "title": "对热因热用的表述，下列何项为错？",
          "options": {
            "A": "用热性药物治疗真寒假热之证",
            "B": "用热性药物治疗阴盛格阳所致的病证",
            "C": "用温热药物应尽量避免在炎热的季节使用",
            "D": "所采用方药的性质顺从疾病的假象",
            "E": "实质上用温热方药仍是以治其本"
          },
          "answer": "C",
          "analysis": "热因热用是指用热性药物来治疗具有假热征象的病证，适用于阴盛格阳的真寒假热证。阴盛格阳证中，由于阴寒充塞于内，逼迫阳气浮越于外，故可见身反不恶寒，面赤如妆等假热之象，但由于阴寒内盛是病本，故同时也见下利清谷，四肢厥逆，脉微欲绝，舌淡苔白等内真寒的表现。因此，虽然治疗假热但实则仍为用温热方药以治其本。用温热药物应尽量避免在炎热的季节使用，属于“用热远热”，不属于“热因热用”，故选C。",
          "type": "多选题"
        },
        {
          "id": 12689,
          "title": "同一疾病由于阶段不同，证不同，所以治法也各不相同，此属于下列何种治法？",
          "options": {
            "A": "同病异治",
            "B": "异病同治",
            "C": "因时论治",
            "D": "因地论治",
            "E": "因人论治"
          },
          "answer": "A",
          "analysis": "同病异治指同一种病，由于发病的时间、地域不同，或所处的疾病的阶段或类型不同、或患者的体质有异，故反映出的证不同，因而治疗也有异，故选A。",
          "type": "多选题"
        },
        {
          "id": 12690,
          "title": "因中气下陷所致的久痢、脱肛及子宫下垂，都可采用升提中气法治疗，此属于下列何种治法？",
          "options": {
            "A": "因人制宜",
            "B": "同病异治",
            "C": "异病同治",
            "D": "审因论治",
            "E": "虚则补之"
          },
          "answer": "C",
          "analysis": "异病同治，指几种不同的疾病，在其发展变化过程中出现了大致相同的病机，表现为大致相同证，因而采用大致相同的治法和方药来治疗。如久痢、脱肛及子宫下垂等不同的病变，在其发展变化过程中，均可出现“中气下陷”的病机，表现为大致相同的证，故皆可用补益中气的方法来治疗，故选C。",
          "type": "多选题"
        },
        {
          "id": 12691,
          "title": "同病异治的实质是？",
          "options": {
            "A": "证同治异",
            "B": "证异治异",
            "C": "病同治异",
            "D": "证异治同",
            "E": "病同治同"
          },
          "answer": "B",
          "analysis": "中医学诊治疾病的着眼点是对证的辨析和因证而治，即所谓“证同治亦同，证异治亦异”，这是辨证论治的精神实质。同病异治的实质上是证异治异，故选B。",
          "type": "多选题"
        },
        {
          "id": 12692,
          "title": "下列不属于内伤病因的是？",
          "options": {
            "A": "七情内伤",
            "B": "饮食失宜",
            "C": "六淫",
            "D": "过劳",
            "E": "过逸"
          },
          "answer": "C",
          "analysis": "内伤病因主要包括七情内伤、饮食失宜、劳逸失度等。六淫、疠气均属于外感病因。故选C。",
          "type": "多选题"
        },
        {
          "id": 12693,
          "title": "七情是指？",
          "options": {
            "A": "喜、怒、忧、思、悲、恐、惊",
            "B": "喜、怒、忧、愁、悲、恐、惊",
            "C": "喜、怒、忧、思、愁、恐、惊",
            "D": "乐、怒、忧、思、悲、恐、吓",
            "E": "乐、怒、忧、思、悲、恐、惊"
          },
          "answer": "A",
          "analysis": "七情是指喜、怒、忧、思、悲、恐、惊，故选A。",
          "type": "多选题"
        },
        {
          "id": 12694,
          "title": "恐惧过度易伤及的脏是？",
          "options": {
            "A": "肝",
            "B": "心",
            "C": "脾",
            "D": "肺",
            "E": "肾"
          },
          "answer": "E",
          "analysis": "肾在志为恐，恐伤肾，故选E。",
          "type": "多选题"
        },
        {
          "id": 12695,
          "title": "七情内伤影响脏腑气机，导致“气上”的是",
          "options": {
            "A": "怒",
            "B": "喜",
            "C": "悲",
            "D": "思",
            "E": "恐"
          },
          "answer": "A",
          "analysis": "“怒则气上”指大怒易致使肝气上逆，甚则血随气逆的病机变化。故选A。",
          "type": "多选题"
        },
        {
          "id": 12696,
          "title": "七情内伤影响脏腑气机，导致“气下”的是",
          "options": {
            "A": "怒",
            "B": "喜",
            "C": "悲",
            "D": "思",
            "E": "恐"
          },
          "answer": "E",
          "analysis": "“恐则气下”指过度恐惧，致使肾气失固，气陷于下的病机变化。故选E。",
          "type": "多选题"
        },
        {
          "id": 12697,
          "title": "七情内伤影响脏腑气机，导致“气结”的是",
          "options": {
            "A": "怒",
            "B": "喜",
            "C": "悲",
            "D": "思",
            "E": "恐"
          },
          "answer": "D",
          "analysis": "“思则气结”指思虑劳神过度，可伤神损脾致气机郁结。故选D。",
          "type": "多选题"
        },
        {
          "id": 12698,
          "title": "既至目外眦，又至目内眦的经脉是？",
          "options": {
            "A": "手少阳三焦经",
            "B": "足少阳胆经",
            "C": "手太阳小肠经",
            "D": "手阳明大肠经",
            "E": "足太阳膀胱经"
          },
          "answer": "C",
          "analysis": "手太阳小肠经起于小指外侧端，其分支从缺盆沿颈部上行面颊，至目外眦后，退行进入耳中，另一分支从面颊部分出，向上行于目眶下，至目内眦，交于足太阳膀胱经，故选C。",
          "type": "多选题"
        },
        {
          "id": 12699,
          "title": "分布于上肢内侧前缘的经脉为？",
          "options": {
            "A": "手太阴肺经",
            "B": "手少阴心经",
            "C": "手厥阴心包经",
            "D": "手太阳小肠经",
            "E": "手阳明大肠经"
          },
          "answer": "A",
          "analysis": "手太阴肺经起于中焦，下络大肠，还循胃口，通过膈肌，属肺，从肺系横行至胸部外上方，出腋下，沿上肢内侧前缘下行，过肘窝，入寸口，上鱼际，直出拇指桡侧端，故选A。",
          "type": "多选题"
        },
        {
          "id": 12700,
          "title": "在内踝尖上八寸以下，循行于内侧前缘的经脉是？",
          "options": {
            "A": "脾经",
            "B": "肝经",
            "C": "肾经",
            "D": "胃经",
            "E": "心包经"
          },
          "answer": "B",
          "analysis": "在下肢内侧，内踝尖上八寸以下是厥阴在前，太阴在中；内踝尖上八寸以上则太阴在前，厥阴在中。足厥阴肝经起于足大趾爪甲后丛毛处，向上沿足背至内踝前一寸处，向上沿胫骨内缘，在内踝尖上八寸处出足太阴脾经之后，故选B。",
          "type": "多选题"
        },
        {
          "id": 12701,
          "title": "“以痛为腧”指的穴是？",
          "options": {
            "A": "腧穴",
            "B": "五输穴",
            "C": "背俞穴",
            "D": "奇穴",
            "E": "阿是穴"
          },
          "answer": "E",
          "analysis": "阿是穴既无固定的名称，亦无固定的位置，而是以压痛点或病变的部位或其他反应点等作为运用针灸施术部位的腧穴，故选E。",
          "type": "多选题"
        },
        {
          "id": 12702,
          "title": "结合中医学理论来命名的腧穴是？",
          "options": {
            "A": "乳根",
            "B": "睛明",
            "C": "日月",
            "D": "伏兔",
            "E": "气海"
          },
          "answer": "E",
          "analysis": "乳根是根据所在部位命名，睛明是根据治疗作用命名，日月是利用天体地貌命名，伏兔是参照动植物命名，气海是结合中医学理论命名，故选E。",
          "type": "多选题"
        },
        {
          "id": 12703,
          "title": "主体节重痛，用于关节病变、疼痛，清热效佳的五输穴是？",
          "options": {
            "A": "井穴",
            "B": "荥穴",
            "C": "输穴",
            "D": "经穴",
            "E": "合穴"
          },
          "answer": "C",
          "analysis": "井穴开窍醒神，用于神识昏迷、心下烦闷，人事不省；荥穴清泄脏腑之热，用于热病，清热效好；输穴主体节重痛，用于关节病变、疼痛，清热效佳；经穴宣肺解表，用于寒热、喘咳、咽喉病症；合穴主腑病，用于肠胃病及六腑的病症，故选C。",
          "type": "多选题"
        },
        {
          "id": 12704,
          "title": "人体内活力很强运动不息的极精微物质是？",
          "options": {
            "A": "精",
            "B": "气",
            "C": "血",
            "D": "津",
            "E": "液"
          },
          "answer": "B",
          "analysis": "精、气、血、津液均是构成人体和维持人体生命活动的基本物质，但各自的特性有所不同。气是人体内活力很强运动不息的极精微物质，关键词是运行不息，故气性主动；精概念的关键词是生命本原；血概念的关键词是行于脉内和红色；津液概念的关键词是一切正常水液，故选B。",
          "type": "多选题"
        },
        {
          "id": 12705,
          "title": "一身之气的生成与哪组脏腑的关系最为密切？",
          "options": {
            "A": "心肝脾",
            "B": "心肺肾",
            "C": "脾肺肾",
            "D": "肝脾肾",
            "E": "心脾肾"
          },
          "answer": "C",
          "analysis": "一身之气的生成与脾肺肾关系最为密切。肺为气之主，脾为生气之源，肾为生气之根，故选C。",
          "type": "多选题"
        },
        {
          "id": 12706,
          "title": "气不能外达而闭塞于内，称为？",
          "options": {
            "A": "气滞",
            "B": "气逆",
            "C": "气闭",
            "D": "气陷",
            "E": "气脱"
          },
          "answer": "C",
          "analysis": "气滞、气逆、气闭、气陷、气脱均属于气机失调，气滞是局部阻滞不通，气逆是上升太过或下降不及，气闭指气不能外达而闭塞于内，气陷指气上升不及或下降太过，气脱是气外出太过而不能内守，故选C。",
          "type": "多选题"
        },
        {
          "id": 12707,
          "title": "具有助心行血作用的是？",
          "options": {
            "A": "宗气",
            "B": "营气",
            "C": "卫气",
            "D": "元气",
            "E": "阳气"
          },
          "answer": "A",
          "analysis": "宗气积于胸中，有上走息道（呼吸之道）以助呼吸，贯通心脉，推动血液运行的作用。由此可见，肺助心行血的作用是通过宗气来实现的，肺气有贯通心脉的作用，百脉又朝会于肺，故选A。",
          "type": "多选题"
        },
        {
          "id": 12708,
          "title": "元气流行的通道是？",
          "options": {
            "A": "命门",
            "B": "血脉",
            "C": "三焦",
            "D": "膻中",
            "E": "气海"
          },
          "answer": "C",
          "analysis": "《难经·三十八难》指出三焦“有原气之别焉，主持诸气”，是诸气上下运行之通路，故选C。",
          "type": "多选题"
        },
        {
          "id": 12709,
          "title": "水谷精气与清气相结合，关系到？",
          "options": {
            "A": "宗气的生成",
            "B": "卫气的生成",
            "C": "营气的生成",
            "D": "元气的生成",
            "E": "阳气的生成"
          },
          "answer": "A",
          "analysis": "肺吸入之清气与脾胃化生的水谷精气相结合产生宗气，故肺的呼吸功能与脾胃的运化功能正常与否，直接影响宗气的旺盛与衰少，故选A。",
          "type": "多选题"
        },
        {
          "id": 12710,
          "title": "下列选项中，气不能固摄的物质是？",
          "options": {
            "A": "血液",
            "B": "汗液",
            "C": "尿液",
            "D": "精液",
            "E": "水谷"
          },
          "answer": "E",
          "analysis": "气的固摄作用主要是指对血和津液等液态的物质，具有防止其无故流失的作用，表现为固摄血液，不使外溢，固摄汗液，固摄精液、尿液等。水谷即饮食物，是后天水谷精微的基础，水谷入胃是流动的，通降下行的，不属于需要固摄的物质，故选E。",
          "type": "多选题"
        },
        {
          "id": 12711,
          "title": "气的推动作用减弱时可以导致？",
          "options": {
            "A": "早衰",
            "B": "自汗",
            "C": "出血",
            "D": "畏寒",
            "E": "失眠"
          },
          "answer": "A",
          "analysis": "气是活力很强的精微物质，能激发和促进人体的生长发育及各脏腑经络的生理功能。因此，人体的生长发育、脏腑经络的生理活动、精血津液的生成及运行输布等等都要依靠气的推动作用。如果元气不足，推动和激发力量减弱，就会导致人体早衰。自汗、出血是气的固摄作用异常，畏寒是气的温煦作用减退，失眠是气的推动作用亢进，故选A。",
          "type": "多选题"
        },
        {
          "id": 12712,
          "title": "机体阳气不足与下列哪两个脏腑关系最密切？",
          "options": {
            "A": "心与脾",
            "B": "脾与肝",
            "C": "脾与肾",
            "D": "心与肺",
            "E": "肝与肾"
          },
          "answer": "C",
          "analysis": "临床阳气不足最常见的是脾阳虚和肾阳虚。脾阳虚表现出腹冷痛、喜温喜按，形寒肢冷，口淡不渴等；肾阳虚主要表现为腰膝痠冷，形寒肢冷，五更泄泻等，故选C。",
          "type": "多选题"
        },
        {
          "id": 12713,
          "title": "脏与脏之间主要是先后天互相资生关系的是？",
          "options": {
            "A": "心与肾",
            "B": "心与脾",
            "C": "心与肺",
            "D": "脾与肾",
            "E": "肝与脾"
          },
          "answer": "D",
          "analysis": "脾的运化水谷功能，有赖于肾气及肾阴、肾阳的资助和促进，才能健旺；肾所藏先天之精及化生的元气，也有赖于脾气运化的水谷精微的不断充养和培育，方能充盛。先天与后天，相互资生，相互促进，故选D。",
          "type": "多选题"
        },
        {
          "id": 12714,
          "title": "“肝肾同源”的主要依据是？",
          "options": {
            "A": "厥少二阴之气相通",
            "B": "相火寄于肝肾",
            "C": "肝肾同属于下焦",
            "D": "精血互生互化",
            "E": "肝肾皆赖气血荣养"
          },
          "answer": "D",
          "analysis": "肝藏血，肝血滋肾化精；肾藏精，肾精养肝化血，精血互生，故“肝肾同源”，故选D。",
          "type": "多选题"
        },
        {
          "id": 12715,
          "title": "“泌别清浊”，属于？",
          "options": {
            "A": "胃的生理功能",
            "B": "大肠的生理功能",
            "C": "小肠的生理功能",
            "D": "肾的生理功能",
            "E": "膀胱的生理功能"
          },
          "answer": "C",
          "analysis": "小肠泌别清浊的功能体现在三个方面：①是将饮食物分为水谷精微和饮食糟粕两个部分；②是吸收水谷精微并将饮食糟粕向下输送至大肠；③是在吸收水谷精微的同时吸收大量水液，故选C。",
          "type": "多选题"
        },
        {
          "id": 12716,
          "title": "在六腑中与人体排泄功能密切相关的是？",
          "options": {
            "A": "胃、胆、膀胱",
            "B": "小肠、膀胱、三焦",
            "C": "大肠、膀胱、三焦",
            "D": "胆、大肠、三焦",
            "E": "胆、大肠、小肠"
          },
          "answer": "C",
          "analysis": "大肠传导变化，形成、排泄大便；膀胱贮尿排尿、三焦为水谷之道路，与排泄二便关系密切，故选C。",
          "type": "多选题"
        },
        {
          "id": 12717,
          "title": "下列哪两个脏腑在饮食物的消化中起到重要作用？",
          "options": {
            "A": "小肠和大肠",
            "B": "胃和大肠",
            "C": "胃和胆",
            "D": "胃和膀胱",
            "E": "胃和三焦"
          },
          "answer": "C",
          "analysis": "胃受纳腐熟水谷，初步消化饮食物；胆贮存排泄胆汁，以助消化，两者与饮食物消化关系比较密切，故选C。",
          "type": "多选题"
        },
        {
          "id": 12718,
          "title": "中风的基本病理病机是？",
          "options": {
            "A": "阴阳失调、气血逆乱",
            "B": "痰浊壅盛、化火上蒙",
            "C": "脾肾虚弱、气血亏虚",
            "D": "痰血阻窍、络脉滞涩",
            "E": "以上都是"
          },
          "answer": "B",
          "analysis": "中风由于患者脏腑功能失调，气血素虚或痰浊、瘀血内生，加之劳倦内伤、忧思恼怒、饮酒饱食、用力过度、气候骤变等诱因，而致瘀血阻滞、痰热内蕴，或阳化风动、血随气逆，导致脑脉痹阻或血溢脉外，引起昏仆不遂，发为中风。其病位在脑，与心、肾、肝、脾密切相关。其病机有虚（阴虚、气虚）、火（肝火、心火）、风（肝风）、痰（风痰、湿痰）、气（气逆）、血（血瘀）六端，此六端多在一定条件下相互影响，相互作用。病性多为本虚标实，上盛下虚。在本为肝肾阴虚，气血衰少，在标为风火相煽，痰湿壅盛，瘀血阻滞，气血逆乱。而其基本病机为气血逆乱，上犯于脑，脑之神明失用。故其基本病理病机是痰浊壅盛、化火上蒙。选B。",
          "type": "多选题"
        },
        {
          "id": 12719,
          "title": "中风的病因有哪些？",
          "options": {
            "A": "积损正衰",
            "B": "劳欲过度",
            "C": "情志所伤",
            "D": "饮食不节",
            "E": "以上都是"
          },
          "answer": "E",
          "analysis": "中风由于患者脏腑功能失调，积损正衰，气血素虚或痰浊、瘀血内生，加之劳倦内伤、忧思恼怒、饮酒饱食、用力过度、气候骤变等诱因，而致瘀血阻滞、痰热内蕴，或阳化风动、血随气逆，导致脑脉痹阻或血溢脉外，引起昏仆不遂，发为中风。其病位在脑，与心、肾、肝、脾密切相关。此题四个选项都为病因，故选E。",
          "type": "多选题"
        },
        {
          "id": 12720,
          "title": "中风后多久属于后遗症期？",
          "options": {
            "A": "两周以内",
            "B": "半个月内",
            "C": "两周到半年内",
            "D": "半个月到半年内",
            "E": "半年以后"
          },
          "answer": "E",
          "analysis": "中风分期，临床上比较常用的是分为三期： 1、急性期：指发病后1-2周，主要以内科治疗为主，辅助康复治疗。因为急性期病情相对比较重，还是以内科稳定病情为主。 2、恢复期：发病后3周到半年，病情相对稳定，一般患者会从神经内科或者从ICU转到康复科。这期重点是康复治疗为主，针对患者的功能障碍进行相应的康复治疗，包括运动疗法、作业疗法，还有言语、吞咽等治疗； 3、后遗症期：主要是发病半年以上，相对已经过了康复的黄金时间，但是目前研究发现其实仍有恢复可能，所以此类患者也应该积极进行康复治疗。故此题选E。",
          "type": "多选题"
        },
        {
          "id": 12721,
          "title": "气虚血瘀型中风患者的苔脉表现为",
          "options": {
            "A": "舌瘀斑、苔薄白、脉细弱",
            "B": "舌质红、少苔、脉沉细",
            "C": "舌质紫黯、苔滑腻、脉弦滑",
            "D": "舌质黯淡、苔白或白腻、脉弦滑",
            "E": "舌质红、苔薄黄、脉弦有力"
          },
          "answer": "A",
          "analysis": "气虚血瘀型中风患者苔脉：舌瘀斑、苔薄白、脉细弱。证机：气血瘀滞、脉络瘀阻。痰瘀阻络中风患者苔脉表现：舌紫暗、苔滑腻、脉弦滑。故此题选A。",
          "type": "多选题"
        },
        {
          "id": 12722,
          "title": "患者男，58岁，原有高血压、糖尿病、高脂血症，昨夜睡眠好，但今晨起床后突然发现病人口眼歪斜，一侧上下肢瘫痪，但神志清醒。患者平素头晕头痛，口苦咽干，尿赤便干。苔脉：舌质红、苔薄黄、脉弦有力。该患者辨证为哪一型?",
          "options": {
            "A": "中经络·风痰瘀阻型",
            "B": "中经络·风火上扰型",
            "C": "中脏腑·阳闭",
            "D": "中脏腑·阴闭",
            "E": "中脏腑·脱证"
          },
          "answer": "B",
          "analysis": "中经络者,病位较浅,病情较轻,一般无神志改变,仅表现为口舌歪斜,半身不遂,语言不利;而中脏腑者,病位较深,病情较重,主要表现为神志不清,歪僻不遂。故此题患者为中经络。1.肝阳暴亢、风火上扰 证候：半身不遂、口舌歪斜，舌强语蹇或不语，偏身麻木，眩晕头痛，面红目赤，口苦咽干，心烦易怒，尿赤便干，舌质红或红绛，舌苔薄黄，脉弦有力。\n2.风痰瘀血、痹阻脉络 证候：半身不遂，口舌歪斜，舌强言蹇或不语，偏身麻木，头晕目眩、舌质暗淡，舌苔薄白或白腻，脉弦滑。\n3.痰热腑实、风痰上扰 证候：半身不遂，口舌歪斜，舌强言蹇或不语，偏身麻木，腹胀，便干便秘，头晕目眩，咳痰痰或痰多，舌质暗红或暗淡，苔黄或黄腻，脉弦滑或偏瘫侧弦滑而大。治则：化痰通腑。主方：星蒌承气汤《验方》加减。\n4.气虚血瘀 证候：半身不遂，口舌歪斜，言语蹇涩或不语，偏身麻木，面色既白，气短乏力，口流涎，自汗出，心悸便溏，手足肿胀，舌质暗淡，舌苔薄白或白腻，脉沉细，细缓或细弦。\n5.阴虚风动 证候：半身不遂，口舌歪斜，舌强言蹇或不语，偏身麻木，烦躁失眠，眩晕耳鸣，手足心热，舌质红绛或暗红，少苔或无苔，脉细弦或细弦数。故此题应选B。",
          "type": "多选题"
        },
        {
          "id": 12723,
          "title": "患者男，58岁，原有高血压、糖尿病、高脂血症，昨夜睡眠好，但今晨起床后突然发现病人口眼歪斜，一侧上下肢瘫痪，但神志清醒。患者平素头晕头痛，口苦咽干，尿赤便干。苔脉：舌质红、苔薄黄、脉弦有力。该患者饮食护理的原则是？",
          "options": {
            "A": "宜食祛风化痰通络之品",
            "B": "宜食滋养肝肾之品",
            "C": "宜食清淡甘寒化痰通络之品",
            "D": "宜食化痰祛瘀之品",
            "E": "宜食益气活血之品"
          },
          "answer": "C",
          "analysis": "该患者神志清楚病情较轻故其为中经络，痰热腑实、风痰上扰 证候：半身不遂，口舌歪斜，舌强言蹇或不语，偏身麻木，腹胀，便干便秘，头晕目眩，咳痰痰或痰多，舌质暗红或暗淡，苔黄或黄腻，脉弦滑或偏瘫侧弦滑而大。故此患者为痰热腑实、风痰上扰证，以热象显著，应化痰通腑，轻利风热，宜食宜食清淡甘寒化痰通络之品，此题故选C。",
          "type": "多选题"
        },
        {
          "id": 13159,
          "title": "既可治疗寒闭昏迷，又能治疗热闭神昏的最佳药物是？",
          "options": {
            "A": "麝香",
            "B": "苏合香",
            "C": "牛黄",
            "D": "冰片",
            "E": "石菖蒲"
          },
          "answer": "A",
          "analysis": "上述5个药物均有开窍醒神作用。苏合香辛温气烈，长于温通、辟秽，为治寒闭神昏之要药，不用于热闭神昏；牛黄化痰开窍、凉肝熄风、清热解毒，适用于治热闭神昏，非实热证不宜用；冰片开窍醒神、清热止痛，性偏寒凉，为凉开之品，虽可用治寒闭神昏，但必须配伍温开药物方可；石菖蒲开窍醒神、化湿、豁痰，多用治痰浊、痰热、湿浊蒙蔽之神昏；麝香辛温、气极香，为开窍通闭、辟秽化浊、醒脑回苏之要药，可用于各种原因所致之闭证神昏，无论寒闭、热闭皆可应用，为闭证神昏的首选药。故选A。",
          "type": "多选题"
        },
        {
          "id": 13160,
          "title": "治疗气阴两伤证，宜首选的药物是？",
          "options": {
            "A": "人参",
            "B": "党参",
            "C": "西洋参",
            "D": "太子参",
            "E": "玄参"
          },
          "answer": "C",
          "analysis": "人参、党参能补气而无补阴功效，玄参滋阴而无补气功效，因此均不是正确选项。西洋参、太子参二药气阴双补，但太子参性平力缓，故治疗气阴两伤证，应首选C项西洋参。",
          "type": "多选题"
        },
        {
          "id": 13161,
          "title": "治疗卫气不固、表虚自汗，宜选用？",
          "options": {
            "A": "西洋参",
            "B": "太子参",
            "C": "党参",
            "D": "白芍",
            "E": "黄芪"
          },
          "answer": "E",
          "analysis": "西洋参、太子参、党参虽可补气益卫，但无固表止汗功效。白芍敛阴止汗，但并非补气之品。黄芪不但长于补气益卫，而且能够固表止汗，故选E。",
          "type": "多选题"
        },
        {
          "id": 13163,
          "title": "功善去风湿、温经止痛，尤以治风寒湿痹寒邪偏盛者为宜的药物是？",
          "options": {
            "A": "狗脊",
            "B": "豨莶草",
            "C": "威灵仙",
            "D": "川乌",
            "E": "松节"
          },
          "answer": "D",
          "analysis": "备选药物中狗脊功效祛风湿、补肝肾、强腰膝；豨莶草性寒，为祛风湿热药；威灵仙与松节均能祛风湿、通络止痛；而川乌味辛、苦，性热，善于祛风湿、温经散寒、止痛，故对风湿痹证寒邪偏盛者尤宜。故选D。",
          "type": "多选题"
        },
        {
          "id": 13164,
          "title": "既能祛风湿，又能退虚热的药物是？",
          "options": {
            "A": "地骨皮",
            "B": "青蒿",
            "C": "胡黄连",
            "D": "秦艽",
            "E": "黄柏"
          },
          "answer": "D",
          "analysis": "以上五味药虽均能退虚热，以治虚热病证，但除秦艽外均无祛风湿的功效，故选D。",
          "type": "多选题"
        },
        {
          "id": 13165,
          "title": "肝肾不足所致之胎动不安，应首选？",
          "options": {
            "A": "紫苏",
            "B": "狗脊",
            "C": "黄芩",
            "D": "桑寄生",
            "E": "五加皮"
          },
          "answer": "D",
          "analysis": "紫苏、黄芩、桑寄生均能治胎动不安，但紫苏主在行气，黄芩主在清热，桑寄生能补肝肾而安胎。狗脊与五加皮虽能补肝肾，但无安胎功效，故选D。",
          "type": "多选题"
        },
        {
          "id": 13166,
          "title": "下列药物尤善治风湿顽痹的药物是？",
          "options": {
            "A": "独活",
            "B": "乌梢蛇",
            "C": "木瓜",
            "D": "川乌",
            "E": "威灵仙"
          },
          "answer": "B",
          "analysis": "备选5味药物虽均能祛风湿，用治风湿痹证，但乌梢蛇性善走窜，能搜风邪，透关节，通经络，尤善治病深日久之风湿顽痹，故选B。",
          "type": "多选题"
        },
        {
          "id": 13167,
          "title": "下列药物中，哪组药物具有回阳救逆的功效？",
          "options": {
            "A": "附子、干姜",
            "B": "干姜、肉桂",
            "C": "附子、肉桂",
            "D": "吴茱萸、附子",
            "E": "肉桂、吴茱萸"
          },
          "answer": "A",
          "analysis": "备选答案五组药物均能温里散寒，但只有附子、干姜有回阳救逆之功，用治亡阳厥逆证，并常相须为用。故选A。",
          "type": "多选题"
        },
        {
          "id": 13168,
          "title": "下列药物中，何药善治厥阴头痛？",
          "options": {
            "A": "白芷",
            "B": "藁本",
            "C": "细辛",
            "D": "吴茱萸",
            "E": "葛根"
          },
          "answer": "D",
          "analysis": "上述五药中，白芷善治阳明头痛，藁本善治巅顶头痛，细辛善治少阴头痛，吴茱萸善治厥阴头痛，葛根善治项背强痛，故选D。",
          "type": "多选题"
        },
        {
          "id": 13169,
          "title": "温里药中具有温肺化饮功效的药物是？",
          "options": {
            "A": "附子",
            "B": "干姜",
            "C": "肉桂",
            "D": "吴茱萸",
            "E": "丁香"
          },
          "answer": "B",
          "analysis": "上述五种药物均能温里散寒，但唯有干姜能温肺化饮，故选B。",
          "type": "多选题"
        },
        {
          "id": 13170,
          "title": "石膏的性味是？",
          "options": {
            "A": "辛、甘，温",
            "B": "甘、苦，温",
            "C": "苦、辛，大寒",
            "D": "甘、辛，大寒",
            "E": "甘、咸，寒"
          },
          "answer": "D",
          "analysis": "石膏是清热泻火药，性寒才能清热，故答案A、B是错误的；石膏辛寒能透热解肌，甘寒能清胃热除烦渴，故辛甘大寒才是其性味，故选D。",
          "type": "多选题"
        },
        {
          "id": 13173,
          "title": "既能清虚热，又可清泻肺热的药物是？",
          "options": {
            "A": "黄芩",
            "B": "地骨皮",
            "C": "穿心莲",
            "D": "石膏",
            "E": "鱼腥草"
          },
          "answer": "B",
          "analysis": "上述5药均有清泄肺热之作用，同可用于肺热咳喘。然只有地骨皮既能清泄肺热，又能清虚热，具有凉血除蒸，清肺降火之功效。故选B。",
          "type": "多选题"
        },
        {
          "id": 13174,
          "title": "既常用治血热吐衄，又可用治血滞经闭痛经的药物是？",
          "options": {
            "A": "玄参",
            "B": "桑叶",
            "C": "栀子",
            "D": "生地黄",
            "E": "赤芍"
          },
          "answer": "E",
          "analysis": "在备选答案中，玄参、桑叶、栀子、生地黄均有清热凉血的功效，可用治血热吐衄，但均无祛瘀止痛作用，不治血瘀经闭痛经。只有赤芍既能清热凉血以治血热吐衄，又能祛瘀止痛以治血滞经闭痛经，故选E。",
          "type": "多选题"
        },
        {
          "id": 13175,
          "title": "下列称为和法的内容哪项不属于治法的讨论范围？",
          "options": {
            "A": "和解少阳",
            "B": "调和肝脾",
            "C": "分消上下",
            "D": "调和肠胃",
            "E": "峻剂小量分服"
          },
          "answer": "E",
          "analysis": "《伤寒论》中对某些经过汗、吐、下，或自行吐利而余邪未解的病证，宜用缓剂或峻剂小量分服，使余邪尽除而不重伤其正的，亦称为和法，是属广义和法的范围，与和解、调和治法之所指含义不同，不属治法讨论之列。故选E。",
          "type": "多选题"
        },
        {
          "id": 13176,
          "title": "小承气汤变化为厚朴三物汤是属于",
          "options": {
            "A": "药味增减的变化",
            "B": "药量增减的变化",
            "C": "剂型更换的变化",
            "D": "药味、药量均有变化",
            "E": "以上都不是"
          },
          "answer": "B",
          "analysis": "两方药味相同，但厚朴、枳实用量改变，服法亦有“分二服”、“分三服”之别，故属药量增减的变化。故选B。",
          "type": "多选题"
        },
        {
          "id": 13189,
          "title": "临床上脾虚湿阻的病人可见",
          "options": {
            "A": "黑苔",
            "B": "舌体胖嫩",
            "C": "舌淡紫",
            "D": "苔白腻",
            "E": ""
          },
          "answer": "B#D",
          "analysis": "脾虚湿浸，多舌质淡白胖嫩，舌苔白腻，边有齿痕，又有裂纹。故选BD。",
          "type": "多选题"
        },
        {
          "id": 13190,
          "title": "剥苔的形成机理是：",
          "options": {
            "A": "气血两亏",
            "B": "胃气大伤",
            "C": "胃阴枯竭",
            "D": "中气下陷",
            "E": ""
          },
          "answer": "B#C",
          "analysis": "舌苔全部或部分剥落的苔质。全部剥落，而且不复生，全舌面光洁如镜，称为光剥舌，又称镜面舌、光莹舌。主阴津枯竭,胃气将绝。故选BC。",
          "type": "多选题"
        },
        {
          "id": 13192,
          "title": "语声重浊多为",
          "options": {
            "A": "外感风燥",
            "B": "外感风寒",
            "C": "外感风热",
            "D": "寒邪客肺",
            "E": ""
          },
          "answer": "B",
          "analysis": "语声重浊并伴有鼻塞流涕、咳嗽等，多属外感风寒；语声嘶哑或者失音，若新病音哑失音，多属外感风寒或风寒袭肺，久病音哑失音，多属阴虚火旺或肺肾精伤的虚证。故选B。",
          "type": "多选题"
        },
        {
          "id": 13193,
          "title": "气从胃中逆上，出咽喉而发声短频者称",
          "options": {
            "A": "呃逆",
            "B": "太息",
            "C": "干呕",
            "D": "嗳气",
            "E": ""
          },
          "answer": "A",
          "analysis": "呃逆即打嗝，指气从胃中上逆，喉间频频作声，声音急而短促。是一个生理上常见的现象。健康人也可发生一过性呃逆，多与饮食有关，特别是饮食过快、过饱，摄入很热或冷的食物饮料、饮酒等。 外界温度变化和过度吸烟亦可引起。故选A。",
          "type": "多选题"
        },
        {
          "id": 13194,
          "title": "“金实不鸣”的原因多为",
          "options": {
            "A": "气虚无力",
            "B": "邪气犯肺",
            "C": "虚火灼金",
            "D": "津枯肺损",
            "E": ""
          },
          "answer": "B",
          "analysis": "金实不鸣是邪气犯肺，肺气被郁扼导致肺气不宣的失音或者变音。故选B。",
          "type": "多选题"
        },
        {
          "id": 13195,
          "title": "患者以冷汗淋漓、汗质稀淡，手足厥冷，呼吸气弱，面色苍白，脉微欲绝为主要表现，其证候是",
          "options": {
            "A": "阳虚证",
            "B": "阴虚证",
            "C": "亡阴证",
            "D": "亡阳证",
            "E": ""
          },
          "answer": "D",
          "analysis": "亡阳证的临床表现：冷汗淋漓、汗质稀淡，神情淡漠，肌肤不温，手足厥冷，呼吸气弱，面色苍白，舌淡而润，脉微欲绝等。故D正确。",
          "type": "多选题"
        },
        {
          "id": 13196,
          "title": "音哑的主要病机是",
          "options": {
            "A": "风寒袭肺",
            "B": "热邪壅肺",
            "C": "肺肾阴虚",
            "D": "风热犯肺",
            "E": ""
          },
          "answer": "A#C#D",
          "analysis": "最主要的有风寒袭肺,风热犯肺,肺肾阴虚。如肺肾阴虚症状:声哑日久咽喉干痛,喉痒痰黏,声带微红,黏膜干燥,舌质红少苔脉细数。故选ACD。",
          "type": "多选题"
        },
        {
          "id": 13197,
          "title": "诊脉的最佳时间",
          "options": {
            "A": "平旦",
            "B": "日中",
            "C": "日夕",
            "D": "夜半",
            "E": ""
          },
          "answer": "A",
          "analysis": "《黄帝内经》中指出，脉是气血运行的反映，诊脉不但要了解整体气血循环的变化，切脉要结合视精明，察五色，观脏腑、形体强弱盛衰等各方面，特别指出，早上是诊脉的最佳时间。故选A。",
          "type": "多选题"
        },
        {
          "id": 13199,
          "title": "主虚证的脉象有",
          "options": {
            "A": "数脉",
            "B": "细脉",
            "C": "濡脉",
            "D": "代脉",
            "E": ""
          },
          "answer": "A#B#C#D",
          "analysis": "在传统脉学中,虚脉作为无力脉的代表,体现了细脉、濡脉、散脉、短脉、微脉、弱脉等脉力不足的特点。故选ABCD。",
          "type": "多选题"
        },
        {
          "id": 13200,
          "title": "按腧穴可诊断胃病的穴位有",
          "options": {
            "A": "胃俞",
            "B": "膻中",
            "C": "日月",
            "D": "足三里",
            "E": ""
          },
          "answer": "A#D",
          "analysis": "胃俞：胃，胃腑也。俞，输也。该穴名意指胃腑的湿热水气由此外输膀胱经。主治胃脘痛、呕吐、腹胀、肠鸣等脾胃疾患；足三里穴，是“足阳明胃经”的主要穴位之一，位于小腿外侧，犊鼻下3寸，犊鼻与解溪连线上，浅层布有腓肠外侧皮神经。深层有胫前动、静脉的分支或属支。主治胃肠病证，下肢痿痹，神志病，外科疾患，虚劳诸证。故选AD。",
          "type": "多选题"
        },
        {
          "id": 13202,
          "title": "下列对于寒证的认识哪项不对",
          "options": {
            "A": "寒证主要分为实寒与虚寒",
            "B": "虚寒证的本质主要是阳虚",
            "C": "寒证可由阴虚或阳虚所致",
            "D": "寒证不可能出现发热症状",
            "E": "血寒也归属于寒证的范畴"
          },
          "answer": "D",
          "analysis": "寒证，感受寒邪，或阳虚阴盛所表现的证候。寒证有外寒和内寒之分。外寒为由外界寒邪侵袭所引起的证候。外寒可侵袭肌表，也可直中脏腑。临床表现为恶寒，发热，头痛，身痛，无汗，鼻塞，咳嗽，喘息，舌淡红，苔薄白，脉浮紧；或脘腹胀痛，肢冷神靡，呕吐，泄泻。治宜解表散寒，方用麻黄汤；或温中散寒，方用理中汤、麻黄附子细辛汤等。内寒为机体阳虚阴盛所引起的证候。根据病变脏腑不同，其证候类型及临床表现多种多样。故选D。",
          "type": "多选题"
        },
        {
          "id": 13203,
          "title": "真热假寒证最主要的“假寒”表现是",
          "options": {
            "A": "脉沉迟",
            "B": "四肢凉",
            "C": "神不清",
            "D": "面色青",
            "E": "身恶寒"
          },
          "answer": "B",
          "analysis": "内热炽盛而外见寒象的证候。邪热内盛，阳气郁闭格阴于外，以四肢厥冷，恶寒甚至寒战，而兼壮热口渴，胸腹灼热，烦躁不宁，便秘尿黄，舌红苔黄，脉弦数为常见症的证候。即阳证似阴。因内热过盛，阳气闭郁不能外达所致。故选B。",
          "type": "多选题"
        },
        {
          "id": 13204,
          "title": "所谓虚的首选含义是",
          "options": {
            "A": "虚邪中人",
            "B": "邪气不盛",
            "C": "正气亏虚",
            "D": "气血亏虚",
            "E": "阴液亏虚"
          },
          "answer": "C",
          "analysis": "虚证指人体正气不足，脏腑功能衰退所表现的证候。选项中正气亏虚最符合，故选C。",
          "type": "多选题"
        },
        {
          "id": 13207,
          "title": "下列那项不是导致虚证的常见原因",
          "options": {
            "A": "先天禀赋不足",
            "B": "病中耗损过多",
            "C": "房事劳倦太过",
            "D": "情志失于调摄",
            "E": "后天生化不足"
          },
          "answer": "D",
          "analysis": "情志失调指喜、怒、忧、思、悲、恐、惊七情过度，而引起脏腑精气功能紊乱而致疾病发生或诱发的一种致病因素。非导致虚证的常见原因，故选D。",
          "type": "多选题"
        }
      ],
      "version": "1.0",
      "categories": {}
    }
  ]
};
})(); 