// ==UserScript==
// @name         摸鱼放置强化模拟器_1.63
// @namespace    http://tampermonkey.net/
// @version      1.63
// @description  支持搜索选择物品的强化模拟器
// @author       火龙果
// @match        *://*moyu-idle.com/*
// @match        *://www.moyu-idle.com/*
// @license      MIT
// @grant        GM_addStyle
// @grant        GM_getValue
// @grant        GM_setValue
// @grant        unsafeWindow
// @downloadURL https://update.greasyfork.org/scripts/542681/%E6%91%B8%E9%B1%BC%E6%94%BE%E7%BD%AE%E5%BC%BA%E5%8C%96%E6%A8%A1%E6%8B%9F%E5%99%A8_163.user.js
// @updateURL https://update.greasyfork.org/scripts/542681/%E6%91%B8%E9%B1%BC%E6%94%BE%E7%BD%AE%E5%BC%BA%E5%8C%96%E6%A8%A1%E6%8B%9F%E5%99%A8_163.meta.js
// ==/UserScript==

(function () {
    //有什么关于本脚本的意见或建议 1群内找火龙果
    'use strict';

    // 物品概率数据
    const itemProbabilities = {"丝质裁缝服":{"resId":"silkTailorClothes","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质裁缝服","星辉精华"],["丝质裁缝服","星辉精华"],["丝质裁缝服","星辉精华"],["丝质裁缝服+1","星辉精华"],["丝质裁缝服+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"虹运飘带":{"resId":"luckRainbowRibbon","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["虹运飘带","星辉精华"],["虹运飘带","星辉精华"],["虹运飘带","星辉精华"],["虹运飘带","星辉精华"],["虹运飘带","星辉精华"]],"requires":[[{"res":"丝绸布料","count":23},{"res":"彩虹碎片","count":12}],[{"res":"丝绸布料","count":23},{"res":"彩虹碎片","count":12}],[{"res":"丝绸布料","count":23},{"res":"彩虹碎片","count":12}],[{"res":"丝绸布料","count":26},{"res":"彩虹碎片","count":15}],[{"res":"丝绸布料","count":26},{"res":"彩虹碎片","count":15}]]},"羊毛紧身衣":{"resId":"woolTightsCloth","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛紧身衣","星辉精华"],["羊毛紧身衣","星辉精华"],["羊毛紧身衣","星辉精华"],["羊毛紧身衣","星辉精华"],["羊毛紧身衣","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"银护手":{"resId":"silverGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["银护手","星辉精华"],["银护手","星辉精华"],["银护手","星辉精华"],["银护手","星辉精华"],["银护手","星辉精华"],["银护手+1","星辉精华"],["银护手+2","星辉精华"],["银护手+3","星辉精华"],["银护手+4","星辉精华"],["银护手+5","星辉精华"]],"requires":[[{"res":"银锭","count":20},{"res":"羊绒布料","count":10}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":10}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":10}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":14}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":14}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":14}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":17}]]},"钢护手":{"resId":"steelGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["钢护手","星辉精华"],["钢护手","星辉精华"],["钢护手","星辉精华"],["钢护手","星辉精华"],["钢护手","星辉精华"],["钢护手+1","星辉精华"],["钢护手+2","星辉精华"],["钢护手+3","星辉精华"],["钢护手+4","星辉精华"],["钢护手+5","星辉精华"]],"requires":[[{"res":"铁","count":25},{"res":"钢","count":20}],[{"res":"铁","count":30},{"res":"钢","count":20}],[{"res":"铁","count":25},{"res":"钢","count":21}],[{"res":"铁","count":30},{"res":"钢","count":21}],[{"res":"铁","count":35},{"res":"钢","count":22}],[{"res":"铁","count":40},{"res":"钢","count":22}],[{"res":"铁","count":45},{"res":"钢","count":23}],[{"res":"铁","count":50},{"res":"钢","count":23}],[{"res":"铁","count":55},{"res":"钢","count":24}],[{"res":"铁","count":60},{"res":"钢","count":24}]]},"云绒绑带手套":{"resId":"fluffDexGloves","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["云绒绑带手套","星辉精华"],["云绒绑带手套","星辉精华"],["云绒绑带手套","星辉精华"],["云绒绑带手套","星辉精华"],["云绒绑带手套","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}]]},"丝质法师裤":{"resId":"silkMagePants","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质法师裤","星辉精华"],["丝质法师裤","星辉精华"],["丝质法师裤","星辉精华"],["丝质法师裤","星辉精华"],["丝质法师裤","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}]]},"远古鱼骨项链":{"resId":"ancientFishboneNecklace","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["远古鱼骨项链","星辉精华"],["远古鱼骨项链","星辉精华"],["远古鱼骨项链","星辉精华"],["远古鱼骨项链","星辉精华"],["远古鱼骨项链","星辉精华"]],"requires":[[{"res":"远古鱼骨","count":8},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":12},{"res":"贝壳","count":1}],[{"res":"远古鱼骨","count":8},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":12},{"res":"贝壳","count":1}],[{"res":"远古鱼骨","count":8},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":12},{"res":"贝壳","count":1}],[{"res":"远古鱼骨","count":8},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":12},{"res":"贝壳","count":1}],[{"res":"远古鱼骨","count":8},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":12},{"res":"贝壳","count":1}]]},"冰镐":{"resId":"icePickaxe","pers":[0.55,0.47,0.39,0.31,0.23],"protectes":[["冰镐","星辉精华"],["冰镐","星辉精华"],["冰镐","星辉精华"],["冰镐","星辉精华"],["冰镐","星辉精华"]],"requires":[[{"res":"冰弹","count":3},{"res":"钢","count":3},{"res":"霜之精华","count":3}],[{"res":"冰弹","count":3},{"res":"钢","count":3},{"res":"霜之精华","count":3}],[{"res":"冰弹","count":3},{"res":"钢","count":3},{"res":"霜之精华","count":3}],[{"res":"冰弹","count":5},{"res":"钢","count":5},{"res":"霜之精华","count":5}],[{"res":"冰弹","count":5},{"res":"钢","count":5},{"res":"霜之精华","count":5}]]},"铁剑":{"resId":"ironSword","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["铁剑","星辉精华"],["铁剑","星辉精华"],["铁剑","星辉精华"],["铁剑","星辉精华"],["铁剑","星辉精华"],["铁剑+1","星辉精华"],["铁剑+2","星辉精华"],["铁剑+3","星辉精华"],["铁剑+4","星辉精华"],["铁剑+5","星辉精华"]],"requires":[[{"res":"铁","count":20}],[{"res":"铁","count":25}],[{"res":"铁","count":30}],[{"res":"铁","count":35}],[{"res":"铁","count":40}],[{"res":"铁","count":45}],[{"res":"铁","count":50}],[{"res":"铁","count":55}],[{"res":"铁","count":60}],[{"res":"铁","count":65}]]},"羊毛工匠服":{"resId":"woolArtisanOutfit","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛工匠服","星辉精华"],["羊毛工匠服","星辉精华"],["羊毛工匠服","星辉精华"],["羊毛工匠服+1","星辉精华"],["羊毛工匠服+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"冰霜匕首":{"resId":"forestDagger","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["冰霜匕首","星辉精华"],["冰霜匕首","星辉精华"],["冰霜匕首","星辉精华"],["冰霜匕首","星辉精华"],["冰霜匕首","星辉精华"]],"requires":[[{"res":"冰霜凝胶","count":5},{"res":"霜之精华","count":5},{"res":"铁","count":5}],[{"res":"冰霜凝胶","count":5},{"res":"霜之精华","count":5},{"res":"铁","count":5}],[{"res":"冰霜凝胶","count":5},{"res":"霜之精华","count":5},{"res":"铁","count":5}],[{"res":"冰霜凝胶","count":8},{"res":"霜之精华","count":8},{"res":"铁","count":8}],[{"res":"冰霜凝胶","count":8},{"res":"霜之精华","count":8},{"res":"铁","count":8}]]},"钢制重锤":{"resId":"steelHammer","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["钢制重锤","星辉精华"],["钢制重锤","星辉精华"],["钢制重锤","星辉精华"],["钢制重锤","星辉精华"],["钢制重锤","星辉精华"],["钢制重锤+1","星辉精华"],["钢制重锤+2","星辉精华"],["钢制重锤+3","星辉精华"],["钢制重锤+4","星辉精华"],["钢制重锤+5","星辉精华"]],"requires":[[{"res":"钢","count":50}],[{"res":"钢","count":50}],[{"res":"钢","count":50}],[{"res":"钢","count":50}],[{"res":"钢","count":60}],[{"res":"钢","count":60}],[{"res":"钢","count":60}],[{"res":"钢","count":60}],[{"res":"钢","count":70}],[{"res":"钢","count":70}]]},"魔法书":{"resId":"magicBook","pers":[0.8,0.72,0.64,0.56,0.48],"protectes":[["魔法书","星辉精华"],["魔法书","星辉精华"],["魔法书","星辉精华"],["魔法书","星辉精华"],["魔法书","星辉精华"]],"requires":[[{"res":"纸","count":10},{"res":"魔法卷轴","count":10}],[{"res":"纸","count":10},{"res":"魔法卷轴","count":10}],[{"res":"纸","count":10},{"res":"魔法卷轴","count":10}],[{"res":"纸","count":15},{"res":"魔法卷轴","count":12}],[{"res":"纸","count":15},{"res":"魔法卷轴","count":12}]]},"统御印记":{"resId":"domination_seal","pers":[0.4,0.32,0.24,0.16,0.08],"protectes":[["统御印记","星辉精华"],["统御印记","星辉精华"],["统御印记+1","星辉精华"],["统御印记+2","星辉精华"],["统御印记+3","星辉精华"]],"requires":[[{"res":"统御印记","count":1},{"res":"破碎灵魂碎片","count":15},{"res":"恶灵精华","count":10},{"res":"三级战利品精华","count":10},{"res":"金币","count":100000.0}],[{"res":"统御印记","count":1},{"res":"破碎灵魂碎片","count":15},{"res":"恶灵精华","count":10},{"res":"三级战利品精华","count":10},{"res":"金币","count":100000.0}],[{"res":"统御印记","count":1},{"res":"破碎灵魂碎片","count":15},{"res":"恶灵精华","count":10},{"res":"三级战利品精华","count":10},{"res":"金币","count":100000.0}],[{"res":"统御印记","count":2},{"res":"破碎灵魂碎片","count":20},{"res":"恶灵精华","count":15},{"res":"三级战利品精华","count":15},{"res":"金币","count":200000.0}],[{"res":"统御印记","count":2},{"res":"破碎灵魂碎片","count":20},{"res":"恶灵精华","count":15},{"res":"三级战利品精华","count":15},{"res":"金币","count":200000.0}]]},"余量坠饰":{"resId":"leftoverPendant","pers":[0.66,0.595,0.53,0.465,0.4,0.335,0.27,0.205,0.14,0.075],"protectes":[["余量坠饰","星辉精华"],["余量坠饰","星辉精华"],["余量坠饰","星辉精华"],["余量坠饰","星辉精华"],["余量坠饰","星辉精华"],["余量坠饰+1","星辉精华"],["余量坠饰+2","星辉精华"],["余量坠饰+3","星辉精华"],["余量坠饰+4","星辉精华"],["余量坠饰+5","星辉精华"]],"requires":[[{"res":"提纯灵质","count":5},{"res":"回响石核","count":10},{"res":"悖论核","count":10},{"res":"神秘精华","count":5},{"res":"金币","count":35000.0}],[{"res":"提纯灵质","count":5},{"res":"回响石核","count":10},{"res":"悖论核","count":10},{"res":"神秘精华","count":5},{"res":"金币","count":35000.0}],[{"res":"提纯灵质","count":5},{"res":"回响石核","count":10},{"res":"悖论核","count":10},{"res":"神秘精华","count":5},{"res":"金币","count":35000.0}],[{"res":"提纯灵质","count":5},{"res":"回响石核","count":10},{"res":"悖论核","count":10},{"res":"神秘精华","count":5},{"res":"金币","count":35000.0}],[{"res":"提纯灵质","count":5},{"res":"回响石核","count":10},{"res":"悖论核","count":10},{"res":"神秘精华","count":5},{"res":"金币","count":35000.0}],[{"res":"提纯灵质","count":8},{"res":"回响石核","count":13},{"res":"悖论核","count":13},{"res":"神秘精华","count":8},{"res":"金币","count":50000.0}],[{"res":"提纯灵质","count":8},{"res":"回响石核","count":13},{"res":"悖论核","count":13},{"res":"神秘精华","count":8},{"res":"金币","count":50000.0}],[{"res":"提纯灵质","count":8},{"res":"回响石核","count":13},{"res":"悖论核","count":13},{"res":"神秘精华","count":8},{"res":"金币","count":50000.0}],[{"res":"提纯灵质","count":10},{"res":"回响石核","count":15},{"res":"悖论核","count":15},{"res":"神秘精华","count":10},{"res":"金币","count":80000.0}],[{"res":"提纯灵质","count":10},{"res":"回响石核","count":15},{"res":"悖论核","count":15},{"res":"神秘精华","count":10},{"res":"金币","count":80000.0}]]},"羊绒孤胆披风":{"resId":"cashmereSingleCloak","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊绒孤胆披风","星辉精华"],["羊绒孤胆披风","星辉精华"],["羊绒孤胆披风","星辉精华"],["羊绒孤胆披风","星辉精华"],["羊绒孤胆披风","星辉精华"]],"requires":[[{"res":"羊绒布料","count":40},{"res":"织物精华","count":6}],[{"res":"羊绒布料","count":40},{"res":"织物精华","count":6}],[{"res":"羊绒布料","count":40},{"res":"织物精华","count":6}],[{"res":"羊绒布料","count":45},{"res":"织物精华","count":8}],[{"res":"羊绒布料","count":45},{"res":"织物精华","count":8}]]},"银护腿":{"resId":"silverPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["银护腿","星辉精华"],["银护腿","星辉精华"],["银护腿","星辉精华"],["银护腿","星辉精华"],["银护腿","星辉精华"],["银护腿+1","星辉精华"],["银护腿+2","星辉精华"],["银护腿+3","星辉精华"],["银护腿+4","星辉精华"],["银护腿+5","星辉精华"]],"requires":[[{"res":"银锭","count":20},{"res":"羊绒布料","count":15}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":15}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":15}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":20}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":20}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":20}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":20}]]},"羊毛法师裤":{"resId":"woolMagePants","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛法师裤","星辉精华"],["羊毛法师裤","星辉精华"],["羊毛法师裤","星辉精华"],["羊毛法师裤","星辉精华"],["羊毛法师裤","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"可爱的衣服":{"resId":"cuteOutfit","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}]]},"钢头盔":{"resId":"steelHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["钢头盔","星辉精华"],["钢头盔","星辉精华"],["钢头盔","星辉精华"],["钢头盔","星辉精华"],["钢头盔","星辉精华"],["钢头盔+1","星辉精华"],["钢头盔+2","星辉精华"],["钢头盔+3","星辉精华"],["钢头盔+4","星辉精华"],["钢头盔+5","星辉精华"]],"requires":[[{"res":"铁","count":25},{"res":"钢","count":20}],[{"res":"铁","count":30},{"res":"钢","count":20}],[{"res":"铁","count":25},{"res":"钢","count":21}],[{"res":"铁","count":30},{"res":"钢","count":21}],[{"res":"铁","count":35},{"res":"钢","count":22}],[{"res":"铁","count":40},{"res":"钢","count":22}],[{"res":"铁","count":45},{"res":"钢","count":23}],[{"res":"铁","count":50},{"res":"钢","count":23}],[{"res":"铁","count":55},{"res":"钢","count":24}],[{"res":"铁","count":60},{"res":"钢","count":24}]]},"棱彩兽牙项链":{"resId":"genesisEssenceFangNecklace","pers":[0.4,0.32,0.24,0.16,0.08],"protectes":[["棱彩兽牙项链","星辉精华"],["棱彩兽牙项链","星辉精华"],["棱彩兽牙项链","星辉精华"],["棱彩兽牙项链","星辉精华"],["棱彩兽牙项链+1","星辉精华"]],"requires":[[{"res":"蝙蝠牙","count":30},{"res":"狼牙","count":20},{"res":"巨兽獠牙","count":10},{"res":"共振晶格","count":10},{"res":"造物精华","count":10},{"res":"金币","count":50000.0}],[{"res":"蝙蝠牙","count":30},{"res":"狼牙","count":20},{"res":"巨兽獠牙","count":10},{"res":"共振晶格","count":10},{"res":"造物精华","count":10},{"res":"金币","count":50000.0}],[{"res":"蝙蝠牙","count":30},{"res":"狼牙","count":20},{"res":"巨兽獠牙","count":10},{"res":"共振晶格","count":10},{"res":"造物精华","count":10},{"res":"金币","count":50000.0}],[{"res":"蝙蝠牙","count":40},{"res":"狼牙","count":30},{"res":"巨兽獠牙","count":20},{"res":"共振晶格","count":15},{"res":"造物精华","count":12},{"res":"金币","count":80000.0}],[{"res":"蝙蝠牙","count":40},{"res":"狼牙","count":30},{"res":"巨兽獠牙","count":20},{"res":"共振晶格","count":15},{"res":"造物精华","count":12},{"res":"金币","count":80000.0}]]},"丝质围裙":{"resId":"silkChefApron","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质围裙","星辉精华"],["丝质围裙","星辉精华"],["丝质围裙","星辉精华"],["丝质围裙+1","星辉精华"],["丝质围裙+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"星辉王冠":{"resId":"starCrown","pers":[0.35,0.27,0.19,0.11,0.0299999999999999],"protectes":[["星辉王冠","星辉精华"],["星辉王冠","星辉精华"],["星辉王冠","星辉精华"],["星辉王冠+1","星辉精华"],["星辉王冠+2","星辉精华"]],"requires":[[{"res":"星辉碎片","count":15},{"res":"星尘","count":15},{"res":"神秘精华","count":15}],[{"res":"星辉碎片","count":20},{"res":"星尘","count":20},{"res":"神秘精华","count":20}],[{"res":"星辉碎片","count":25},{"res":"星尘","count":25},{"res":"神秘精华","count":25}],[{"res":"星辉碎片","count":30},{"res":"星尘","count":30},{"res":"神秘精华","count":30}],[{"res":"星辉碎片","count":35},{"res":"星尘","count":35},{"res":"神秘精华","count":35}]]},"马鸿运的感谢之裙":{"resId":"mahongyunsCuteDress","pers":[0,0,0,0,0],"protectes":[[],[],[],[],[]],"requires":[[],[],[],[],[]]},"玄曜盾":{"resId":"onyx_shield","pers":[0.46,0.38,0.3,0.22,0.14],"protectes":[["玄曜盾","星辉精华"],["玄曜盾","星辉精华"],["玄曜盾+1","星辉精华"],["玄曜盾+2","星辉精华"],["玄曜盾+3","星辉精华"]],"requires":[[{"res":"玄曜盾碎片","count":8},{"res":"金币","count":30000.0}],[{"res":"玄曜盾碎片","count":8},{"res":"金币","count":30000.0}],[{"res":"玄曜盾碎片","count":8},{"res":"金币","count":30000.0}],[{"res":"玄曜盾碎片","count":12},{"res":"金币","count":50000.0}],[{"res":"玄曜盾碎片","count":12},{"res":"金币","count":50000.0}]]},"浊影法杖":{"resId":"murkyCrystalStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["浊影法杖","星辉精华"],["浊影法杖","星辉精华"],["浊影法杖","星辉精华"],["浊影法杖","星辉精华"],["浊影法杖","星辉精华"],["浊影法杖+1","星辉精华"],["浊影法杖+2","星辉精华"],["浊影法杖+3","星辉精华"],["浊影法杖+4","星辉精华"],["浊影法杖+5","星辉精华"]],"requires":[[{"res":"浑浊结晶","count":15},{"res":"神秘精华","count":5}],[{"res":"浑浊结晶","count":15},{"res":"神秘精华","count":5}],[{"res":"浑浊结晶","count":15},{"res":"神秘精华","count":5}],[{"res":"浑浊结晶","count":18},{"res":"神秘精华","count":6}],[{"res":"浑浊结晶","count":18},{"res":"神秘精华","count":6}],[{"res":"浑浊结晶","count":18},{"res":"神秘精华","count":6}],[{"res":"浑浊结晶","count":20},{"res":"神秘精华","count":10}],[{"res":"浑浊结晶","count":20},{"res":"神秘精华","count":10}],[{"res":"浑浊结晶","count":20},{"res":"神秘精华","count":10}],[{"res":"浑浊结晶","count":20},{"res":"神秘精华","count":10}]]},"铁锤":{"resId":"ironMachinistHammer","pers":[0.7,0.66,0.58,0.5,0.42],"protectes":[["铁锤","星辉精华"],["铁锤","星辉精华"],["铁锤","星辉精华"],["铁锤+1","星辉精华"],["铁锤+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":20},{"res":"木材","count":12}],[{"res":"铁","count":20},{"res":"木材","count":12}]]},"可爱的裙子":{"resId":"cuteDress","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}]]},"羊毛可爱手套":{"resId":"woolCuteGloves","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛可爱手套","星辉精华"],["羊毛可爱手套","星辉精华"],["羊毛可爱手套","星辉精华"],["羊毛可爱手套+1","星辉精华"],["羊毛可爱手套+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"兽牙项链":{"resId":"fangNecklace","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["兽牙项链","星辉精华"],["兽牙项链","星辉精华"],["兽牙项链","星辉精华"],["兽牙项链","星辉精华"],["兽牙项链+1","星辉精华"]],"requires":[[{"res":"蝙蝠牙","count":15},{"res":"狼牙","count":10},{"res":"巨兽獠牙","count":5}],[{"res":"蝙蝠牙","count":15},{"res":"狼牙","count":10},{"res":"巨兽獠牙","count":5}],[{"res":"蝙蝠牙","count":15},{"res":"狼牙","count":10},{"res":"巨兽獠牙","count":5}],[{"res":"蝙蝠牙","count":20},{"res":"狼牙","count":12},{"res":"巨兽獠牙","count":7}],[{"res":"蝙蝠牙","count":20},{"res":"狼牙","count":12},{"res":"巨兽獠牙","count":7}]]},"羊绒孤胆利刃披风":{"resId":"cashmereSingleDexCloak","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊绒孤胆利刃披风","星辉精华"],["羊绒孤胆利刃披风","星辉精华"],["羊绒孤胆利刃披风","星辉精华"],["羊绒孤胆利刃披风","星辉精华"],["羊绒孤胆利刃披风","星辉精华"]],"requires":[[{"res":"羊绒布料","count":40},{"res":"织物精华","count":6},{"res":"稀有利爪","count":10}],[{"res":"羊绒布料","count":40},{"res":"织物精华","count":6},{"res":"稀有利爪","count":10}],[{"res":"羊绒布料","count":40},{"res":"织物精华","count":6},{"res":"稀有利爪","count":10}],[{"res":"羊绒布料","count":45},{"res":"织物精华","count":8},{"res":"稀有利爪","count":15}],[{"res":"羊绒布料","count":45},{"res":"织物精华","count":8},{"res":"稀有利爪","count":15}]]},"棱彩时光法杖":{"resId":"timeflowCatEyeGenesisEssenceStaff","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["棱彩时光法杖","星辉精华"],["棱彩时光法杖","星辉精华"],["棱彩时光法杖","星辉精华"],["棱彩时光法杖","星辉精华"],["棱彩时光法杖","星辉精华"]],"requires":[[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10},{"res":"造物精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10},{"res":"造物精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10},{"res":"造物精华","count":10}],[{"res":"猫眼石","count":18},{"res":"神秘精华","count":14},{"res":"造物精华","count":15}],[{"res":"猫眼石","count":18},{"res":"神秘精华","count":14},{"res":"造物精华","count":15}]]},"暗影精铁剑":{"resId":"shadowSteelSword","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁剑","星辉精华"],["暗影精铁剑","星辉精华"],["暗影精铁剑","星辉精华"],["暗影精铁剑","星辉精华"],["暗影精铁剑","星辉精华"],["暗影精铁剑+1","星辉精华"],["暗影精铁剑+2","星辉精华"],["暗影精铁剑+3","星辉精华"],["暗影精铁剑+4","星辉精华"],["暗影精铁剑+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":20}],[{"res":"暗影精铁","count":20}],[{"res":"暗影精铁","count":20},{"res":"银质剑","count":1}],[{"res":"暗影精铁","count":25},{"res":"银质剑","count":1}],[{"res":"暗影精铁","count":25},{"res":"银质剑","count":1}],[{"res":"暗影精铁","count":25},{"res":"银质剑","count":1}]]},"龙鳞甲":{"resId":"dragonScaleArmor","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["龙鳞甲","星辉精华"],["龙鳞甲","星辉精华"],["龙鳞甲","星辉精华"],["龙鳞甲+1","星辉精华"],["龙鳞甲+2","星辉精华"]],"requires":[[{"res":"龙鳞","count":10}],[{"res":"龙鳞","count":12}],[{"res":"龙鳞","count":14}],[{"res":"龙鳞","count":16}],[{"res":"龙鳞","count":18}]]},"重建纪念徽章":{"resId":"reconstructionCommemorative","pers":[1,1,1,1,1,1,1,1,1,1],"protectes":[[""],[""],[""],[""],[""],[""],[""],[""],[""],[""]],"requires":[[{"res":"重建纪念徽章","count":1},{"res":"金币","count":100000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":200000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":300000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":400000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":500000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":600000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":700000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":800000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":900000.0}],[{"res":"重建纪念徽章","count":1},{"res":"金币","count":1000000.0}]]},"秘银剑":{"resId":"mithrilSword","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["秘银剑","星辉精华"],["秘银剑","星辉精华"],["秘银剑","星辉精华"],["秘银剑","星辉精华"],["秘银剑","星辉精华"],["秘银剑+1","星辉精华"],["秘银剑+2","星辉精华"],["秘银剑+3","星辉精华"],["秘银剑+4","星辉精华"],["秘银剑+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}]]},"羊毛探险背包":{"resId":"woolExplorerCatpack","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛探险背包","星辉精华"],["羊毛探险背包","星辉精华"],["羊毛探险背包","星辉精华"],["羊毛探险背包+1","星辉精华"],["羊毛探险背包+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"丝质夜行衣":{"resId":"silkTightsCloth","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质夜行衣","星辉精华"],["丝质夜行衣","星辉精华"],["丝质夜行衣","星辉精华"],["丝质夜行衣","星辉精华"],["丝质夜行衣","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}]]},"奇兆短杖":{"resId":"amberGazeOddSignStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["奇兆短杖","星辉精华"],["奇兆短杖","星辉精华"],["奇兆短杖","星辉精华"],["奇兆短杖","星辉精华"],["奇兆短杖","星辉精华"],["奇兆短杖+1","星辉精华"],["奇兆短杖+2","星辉精华"],["奇兆短杖+3","星辉精华"],["奇兆短杖+4","星辉精华"],["奇兆短杖+5","星辉精华"]],"requires":[[{"res":"琥珀瞳石","count":11},{"res":"神秘精华","count":5}],[{"res":"琥珀瞳石","count":11},{"res":"神秘精华","count":5}],[{"res":"琥珀瞳石","count":11},{"res":"神秘精华","count":5}],[{"res":"琥珀瞳石","count":12},{"res":"神秘精华","count":6}],[{"res":"琥珀瞳石","count":12},{"res":"神秘精华","count":6}],[{"res":"琥珀瞳石","count":12},{"res":"神秘精华","count":6}],[{"res":"琥珀瞳石","count":14},{"res":"神秘精华","count":10}],[{"res":"琥珀瞳石","count":14},{"res":"神秘精华","count":10}],[{"res":"琥珀瞳石","count":14},{"res":"神秘精华","count":10}],[{"res":"琥珀瞳石","count":14},{"res":"神秘精华","count":10}]]},"棱彩精铁剑":{"resId":"genesisEssenceShadowSteelSword","pers":[0.8,0.72,0.64,0.56,0.48],"protectes":[["棱彩精铁剑","星辉精华"],["棱彩精铁剑","星辉精华"],["棱彩精铁剑","星辉精华"],["棱彩精铁剑","星辉精华"],["棱彩精铁剑","星辉精华"]],"requires":[[{"res":"暗影精铁","count":15},{"res":"造物精华","count":5}],[{"res":"暗影精铁","count":15},{"res":"造物精华","count":5}],[{"res":"暗影精铁","count":15},{"res":"造物精华","count":5}],[{"res":"暗影精铁","count":20},{"res":"造物精华","count":8}],[{"res":"暗影精铁","count":20},{"res":"造物精华","count":8}]]},"鱼鳞合金护腿":{"resId":"fishscaleMineralPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["鱼鳞合金护腿","星辉精华"],["鱼鳞合金护腿","星辉精华"],["鱼鳞合金护腿","星辉精华"],["鱼鳞合金护腿","星辉精华"],["鱼鳞合金护腿","星辉精华"],["鱼鳞合金护腿+1","星辉精华"],["鱼鳞合金护腿+2","星辉精华"],["鱼鳞合金护腿+3","星辉精华"],["鱼鳞合金护腿+4","星辉精华"],["鱼鳞合金护腿+5","星辉精华"]],"requires":[[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}]]},"羊毛围裙":{"resId":"woolChefApron","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛围裙","星辉精华"],["羊毛围裙","星辉精华"],["羊毛围裙","星辉精华"],["羊毛围裙+1","星辉精华"],["羊毛围裙+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"猫猫剑":{"resId":"cuteSword","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":12},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"闪光岩","count":10}]]},"铁锅":{"resId":"ironPot","pers":[0.7,0.66,0.58,0.5,0.42],"protectes":[["铁锅","星辉精华"],["铁锅","星辉精华"],["铁锅","星辉精华"],["铁锅+1","星辉精华"],["铁锅+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":20},{"res":"木材","count":12}],[{"res":"铁","count":20},{"res":"木材","count":12}]]},"荣誓之爪":{"resId":"clawVowedRadiance","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["荣誓之爪","星辉精华"],["荣誓之爪","星辉精华"],["荣誓之爪+1","星辉精华"],["荣誓之爪+2","星辉精华"],["荣誓之爪+3","星辉精华"]],"requires":[[{"res":"王室碎爪","count":15},{"res":"纯净精华","count":3},{"res":"三级战利品精华","count":5},{"res":"金币","count":30000.0}],[{"res":"王室碎爪","count":15},{"res":"纯净精华","count":3},{"res":"三级战利品精华","count":5},{"res":"金币","count":30000.0}],[{"res":"王室碎爪","count":15},{"res":"纯净精华","count":3},{"res":"三级战利品精华","count":5},{"res":"金币","count":30000.0}],[{"res":"王室碎爪","count":20},{"res":"纯净精华","count":5},{"res":"三级战利品精华","count":8},{"res":"金币","count":50000.0}],[{"res":"王室碎爪","count":20},{"res":"纯净精华","count":5},{"res":"三级战利品精华","count":8},{"res":"金币","count":50000.0}]]},"可爱的鞋子":{"resId":"cuteShoes","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}]]},"战斗奖章":{"resId":"lv1BattleExpCollector","pers":[0.6,0.54,0.48,0.42,0.36,0.3,0.24,0.18,0.12,0.0600000000000001],"protectes":[["战斗奖章","星辉精华"],["战斗奖章","星辉精华"],["战斗奖章","星辉精华"],["战斗奖章","星辉精华"],["战斗奖章","星辉精华"],["战斗奖章+1","星辉精华"],["战斗奖章+5","星辉精华"],["战斗奖章+5","星辉精华"],["战斗奖章+5","星辉精华"],["战斗奖章+5","星辉精华"]],"requires":[[{"res":"一级战利品精华","count":25}],[{"res":"一级战利品精华","count":25}],[{"res":"一级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25},{"res":"三级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25},{"res":"三级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25},{"res":"三级战利品精华","count":25},{"res":"四级战利品精华","count":25}],[{"res":"一级战利品精华","count":25},{"res":"二级战利品精华","count":25},{"res":"三级战利品精华","count":25},{"res":"四级战利品精华","count":25}]]},"铁铲":{"resId":"ironShovel","pers":[0.7,0.66,0.58,0.5,0.42],"protectes":[["铁铲","星辉精华"],["铁铲","星辉精华"],["铁铲","星辉精华"],["铁铲+1","星辉精华"],["铁铲+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":20},{"res":"木材","count":12}],[{"res":"铁","count":20},{"res":"木材","count":12}]]},"星辰合金头盔":{"resId":"starforgedAlloyHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["星辰合金头盔","星辉精华"],["星辰合金头盔","星辉精华"],["星辰合金头盔","星辉精华"],["星辰合金头盔","星辉精华"],["星辰合金头盔","星辉精华"],["星辰合金头盔+1","星辉精华"],["星辰合金头盔+2","星辉精华"],["星辰合金头盔+3","星辉精华"],["星辰合金头盔+4","星辉精华"],["星辰合金头盔+5","星辉精华"]],"requires":[[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}]]},"猫薄荷手链":{"resId":"catPotionSilverBracelet","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["猫薄荷手链","星辉精华"],["猫薄荷手链","星辉精华"],["猫薄荷手链","星辉精华"],["猫薄荷手链","星辉精华"],["猫薄荷手链+1","星辉精华"]],"requires":[[{"res":"银锭","count":8},{"res":"猫薄荷宝石","count":4},{"res":"猫薄荷药剂","count":15}],[{"res":"银锭","count":8},{"res":"猫薄荷宝石","count":4},{"res":"猫薄荷药剂","count":15}],[{"res":"银锭","count":8},{"res":"猫薄荷宝石","count":4},{"res":"猫薄荷药剂","count":15}],[{"res":"银锭","count":10},{"res":"猫薄荷宝石","count":6},{"res":"猫薄荷药剂","count":18}],[{"res":"银锭","count":10},{"res":"猫薄荷宝石","count":6},{"res":"猫薄荷药剂","count":18}]]},"暗影精铁镰刀":{"resId":"shadowSteelScythe","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁镰刀","星辉精华"],["暗影精铁镰刀","星辉精华"],["暗影精铁镰刀","星辉精华"],["暗影精铁镰刀","星辉精华"],["暗影精铁镰刀","星辉精华"],["暗影精铁镰刀+1","星辉精华"],["暗影精铁镰刀+2","星辉精华"],["暗影精铁镰刀+3","星辉精华"],["暗影精铁镰刀+4","星辉精华"],["暗影精铁镰刀+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":50}],[{"res":"暗影精铁","count":50}],[{"res":"暗影精铁","count":50}],[{"res":"暗影精铁","count":50}],[{"res":"暗影精铁","count":55}],[{"res":"暗影精铁","count":55}],[{"res":"暗影精铁","count":55}],[{"res":"暗影精铁","count":65}],[{"res":"暗影精铁","count":65}],[{"res":"暗影精铁","count":65}]]},"时光猫眼法杖":{"resId":"timeflowCatEyeStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["时光猫眼法杖","星辉精华"],["时光猫眼法杖","星辉精华"],["时光猫眼法杖","星辉精华"],["时光猫眼法杖","星辉精华"],["时光猫眼法杖","星辉精华"],["时光猫眼法杖+1","星辉精华"],["时光猫眼法杖+2","星辉精华"],["时光猫眼法杖+3","星辉精华"],["时光猫眼法杖+4","星辉精华"],["时光猫眼法杖+5","星辉精华"]],"requires":[[{"res":"猫眼石","count":11},{"res":"神秘精华","count":5}],[{"res":"猫眼石","count":11},{"res":"神秘精华","count":5}],[{"res":"猫眼石","count":11},{"res":"神秘精华","count":5}],[{"res":"猫眼石","count":12},{"res":"神秘精华","count":6}],[{"res":"猫眼石","count":12},{"res":"神秘精华","count":6}],[{"res":"猫眼石","count":12},{"res":"神秘精华","count":6}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}]]},"喵影法杖":{"resId":"mewShadowStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["喵影法杖","星辉精华"],["喵影法杖","星辉精华"],["喵影法杖","星辉精华"],["喵影法杖","星辉精华"],["喵影法杖","星辉精华"],["喵影法杖+1","星辉精华"],["喵影法杖+2","星辉精华"],["喵影法杖+3","星辉精华"],["喵影法杖+4","星辉精华"],["喵影法杖+5","星辉精华"]],"requires":[[{"res":"猫影宝石","count":3},{"res":"神秘精华","count":5}],[{"res":"猫影宝石","count":3},{"res":"神秘精华","count":5}],[{"res":"猫影宝石","count":3},{"res":"神秘精华","count":5}],[{"res":"猫影宝石","count":4},{"res":"神秘精华","count":6}],[{"res":"猫影宝石","count":4},{"res":"神秘精华","count":6}],[{"res":"猫影宝石","count":4},{"res":"神秘精华","count":6}],[{"res":"猫影宝石","count":5},{"res":"神秘精华","count":7}],[{"res":"猫影宝石","count":5},{"res":"神秘精华","count":7}],[{"res":"猫影宝石","count":5},{"res":"神秘精华","count":7}],[{"res":"猫影宝石","count":5},{"res":"神秘精华","count":7}]]},"秘银护甲":{"resId":"mithrilCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["秘银护甲","星辉精华"],["秘银护甲","星辉精华"],["秘银护甲","星辉精华"],["秘银护甲","星辉精华"],["秘银护甲","星辉精华"],["秘银护甲+1","星辉精华"],["秘银护甲+2","星辉精华"],["秘银护甲+3","星辉精华"],["秘银护甲+4","星辉精华"],["秘银护甲+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}]]},"羊毛绑带手套":{"resId":"woolDexGloves","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛绑带手套","星辉精华"],["羊毛绑带手套","星辉精华"],["羊毛绑带手套","星辉精华"],["羊毛绑带手套","星辉精华"],["羊毛绑带手套","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"群生皮衣":{"resId":"patchworkHideGarb","pers":[0.42,0.34,0.26,0.18,0.0999999999999999],"protectes":[["群生皮衣","星辉精华"],["群生皮衣","星辉精华"],["群生皮衣+1","星辉精华"],["群生皮衣+2","星辉精华"],["群生皮衣+3","星辉精华"]],"requires":[[{"res":"静织丝线","count":15},{"res":"彩虹碎片","count":10},{"res":"丝绸布料","count":40},{"res":"羊绒布料","count":30},{"res":"狼皮","count":25},{"res":"雪狼皮","count":25},{"res":"雪兔皮","count":25},{"res":"剧毒皮毛","count":25},{"res":"巨魔兽皮","count":20},{"res":"暗影猫皮","count":20},{"res":"巨兽皮","count":20},{"res":"魔法猫头鹰羽毛","count":15},{"res":"金币","count":50000.0}],[{"res":"静织丝线","count":15},{"res":"彩虹碎片","count":10},{"res":"丝绸布料","count":40},{"res":"羊绒布料","count":30},{"res":"狼皮","count":25},{"res":"雪狼皮","count":25},{"res":"雪兔皮","count":25},{"res":"剧毒皮毛","count":25},{"res":"巨魔兽皮","count":20},{"res":"暗影猫皮","count":20},{"res":"巨兽皮","count":20},{"res":"魔法猫头鹰羽毛","count":15},{"res":"金币","count":50000.0}],[{"res":"静织丝线","count":15},{"res":"彩虹碎片","count":10},{"res":"丝绸布料","count":40},{"res":"羊绒布料","count":30},{"res":"狼皮","count":25},{"res":"雪狼皮","count":25},{"res":"雪兔皮","count":25},{"res":"剧毒皮毛","count":25},{"res":"巨魔兽皮","count":20},{"res":"暗影猫皮","count":20},{"res":"巨兽皮","count":20},{"res":"魔法猫头鹰羽毛","count":15},{"res":"金币","count":50000.0}],[{"res":"静织丝线","count":15},{"res":"彩虹碎片","count":10},{"res":"丝绸布料","count":40},{"res":"羊绒布料","count":30},{"res":"狼皮","count":25},{"res":"雪狼皮","count":25},{"res":"雪兔皮","count":25},{"res":"剧毒皮毛","count":25},{"res":"巨魔兽皮","count":20},{"res":"暗影猫皮","count":20},{"res":"巨兽皮","count":20},{"res":"魔法猫头鹰羽毛","count":15},{"res":"金币","count":50000.0}],[{"res":"静织丝线","count":15},{"res":"彩虹碎片","count":10},{"res":"丝绸布料","count":40},{"res":"羊绒布料","count":30},{"res":"狼皮","count":25},{"res":"雪狼皮","count":25},{"res":"雪兔皮","count":25},{"res":"剧毒皮毛","count":25},{"res":"巨魔兽皮","count":20},{"res":"暗影猫皮","count":20},{"res":"巨兽皮","count":20},{"res":"魔法猫头鹰羽毛","count":15},{"res":"金币","count":50000.0}]]},"斧头":{"resId":"axe","pers":[0.8,0.72,0.64,0.32,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16,0.16],"protectes":[["斧头","星辉精华"],["斧头","星辉精华"],["斧头","星辉精华"],["斧头+1","星辉精华"],["斧头+2","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"],["斧头+3","星辉精华"]],"requires":[[{"res":"木材","count":10},{"res":"矿石","count":10}],[{"res":"木材","count":10},{"res":"矿石","count":11}],[{"res":"木材","count":10},{"res":"矿石","count":12}],[{"res":"木材","count":10},{"res":"矿石","count":13}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}],[{"res":"木材","count":10},{"res":"矿石","count":14}]]},"雪狼皮披风":{"resId":"snowWolfCloak","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["雪狼皮披风","星辉精华"],["雪狼皮披风","星辉精华"],["雪狼皮披风","星辉精华"],["雪狼皮披风","星辉精华"],["雪狼皮披风","星辉精华"]],"requires":[[{"res":"羊绒布料","count":5},{"res":"狼皮","count":5},{"res":"雪狼皮","count":5},{"res":"巨兽皮","count":1},{"res":"霜之结晶","count":1}],[{"res":"羊绒布料","count":5},{"res":"狼皮","count":5},{"res":"雪狼皮","count":5},{"res":"巨兽皮","count":1},{"res":"霜之结晶","count":1}],[{"res":"羊绒布料","count":5},{"res":"狼皮","count":5},{"res":"雪狼皮","count":5},{"res":"巨兽皮","count":1},{"res":"霜之结晶","count":1}],[{"res":"羊绒布料","count":7},{"res":"狼皮","count":7},{"res":"雪狼皮","count":7},{"res":"巨兽皮","count":2},{"res":"霜之结晶","count":2}],[{"res":"羊绒布料","count":7},{"res":"狼皮","count":7},{"res":"雪狼皮","count":7},{"res":"巨兽皮","count":2},{"res":"霜之结晶","count":2}]]},"暗影精铁臂甲":{"resId":"shadowSteelGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁臂甲","星辉精华"],["暗影精铁臂甲","星辉精华"],["暗影精铁臂甲","星辉精华"],["暗影精铁臂甲","星辉精华"],["暗影精铁臂甲","星辉精华"],["暗影精铁臂甲+1","星辉精华"],["暗影精铁臂甲+2","星辉精华"],["暗影精铁臂甲+3","星辉精华"],["暗影精铁臂甲+4","星辉精华"],["暗影精铁臂甲+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":40},{"res":"银护手","count":1}],[{"res":"暗影精铁","count":40},{"res":"银护手","count":1}],[{"res":"暗影精铁","count":40},{"res":"银护手","count":1}]]},"铁头盔":{"resId":"ironHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["铁头盔","星辉精华"],["铁头盔","星辉精华"],["铁头盔","星辉精华"],["铁头盔","星辉精华"],["铁头盔","星辉精华"],["铁头盔+1","星辉精华"],["铁头盔+2","星辉精华"],["铁头盔+3","星辉精华"],["铁头盔+4","星辉精华"],["铁头盔+5","星辉精华"]],"requires":[[{"res":"铁","count":25}],[{"res":"铁","count":30}],[{"res":"铁","count":35}],[{"res":"铁","count":40}],[{"res":"铁","count":45}],[{"res":"铁","count":50}],[{"res":"铁","count":55}],[{"res":"铁","count":60}],[{"res":"铁","count":65}],[{"res":"铁","count":70}]]},"交织猫瞳杖":{"resId":"intertwinedCatEyeStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["交织猫瞳杖","星辉精华"],["交织猫瞳杖","星辉精华"],["交织猫瞳杖","星辉精华"],["交织猫瞳杖","星辉精华"],["交织猫瞳杖","星辉精华"],["交织猫瞳杖+1","星辉精华"],["交织猫瞳杖+2","星辉精华"],["交织猫瞳杖+3","星辉精华"],["交织猫瞳杖+4","星辉精华"],["交织猫瞳杖+5","星辉精华"]],"requires":[[{"res":"猫眼石","count":11},{"res":"神秘精华","count":5}],[{"res":"猫眼石","count":11},{"res":"神秘精华","count":5}],[{"res":"猫眼石","count":11},{"res":"神秘精华","count":5}],[{"res":"猫眼石","count":12},{"res":"神秘精华","count":6}],[{"res":"猫眼石","count":12},{"res":"神秘精华","count":6}],[{"res":"猫眼石","count":12},{"res":"神秘精华","count":6}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10}]]},"堕落星辰护符":{"resId":"fallenStarAmulet","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["堕落星辰护符","星辉精华"],["堕落星辰护符","星辉精华"],["堕落星辰护符","星辉精华"],["堕落星辰护符+1","星辉精华"],["堕落星辰护符+2","星辉精华"]],"requires":[[{"res":"星辉碎片","count":20},{"res":"星尘","count":20},{"res":"星辉遗物","count":20},{"res":"黑暗结晶","count":20},{"res":"虚渊脉液","count":6},{"res":"金币","count":20000.0}],[{"res":"星辉碎片","count":20},{"res":"星尘","count":20},{"res":"星辉遗物","count":20},{"res":"黑暗结晶","count":20},{"res":"虚渊脉液","count":6},{"res":"金币","count":20000.0}],[{"res":"星辉碎片","count":20},{"res":"星尘","count":20},{"res":"星辉遗物","count":20},{"res":"黑暗结晶","count":20},{"res":"虚渊脉液","count":6},{"res":"金币","count":20000.0}],[{"res":"星辉碎片","count":25},{"res":"星尘","count":25},{"res":"星辉遗物","count":25},{"res":"黑暗结晶","count":25},{"res":"虚渊脉液","count":10},{"res":"金币","count":35000.0}],[{"res":"星辉碎片","count":25},{"res":"星尘","count":25},{"res":"星辉遗物","count":25},{"res":"黑暗结晶","count":25},{"res":"虚渊脉液","count":10},{"res":"金币","count":35000.0}]]},"一级战利品收集者徽章":{"resId":"lv1EnemySpoilCollector","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["一级战利品收集者徽章","星辉精华"],["一级战利品收集者徽章","星辉精华"],["一级战利品收集者徽章","星辉精华"],["一级战利品收集者徽章","星辉精华"],["一级战利品收集者徽章","星辉精华"]],"requires":[[{"res":"一级战利品精华","count":40}],[{"res":"一级战利品精华","count":40}],[{"res":"一级战利品精华","count":40}],[{"res":"一级战利品精华","count":45}],[{"res":"一级战利品精华","count":50}]]},"棱彩飘带":{"resId":"genesisEssenceLuckRainbowRibbon","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["棱彩飘带","星辉精华"],["棱彩飘带","星辉精华"],["棱彩飘带","星辉精华"],["棱彩飘带","星辉精华"],["棱彩飘带","星辉精华"]],"requires":[[{"res":"丝绸布料","count":26},{"res":"彩虹碎片","count":15},{"res":"造物精华","count":5}],[{"res":"丝绸布料","count":26},{"res":"彩虹碎片","count":15},{"res":"造物精华","count":5}],[{"res":"丝绸布料","count":26},{"res":"彩虹碎片","count":15},{"res":"造物精华","count":5}],[{"res":"丝绸布料","count":30},{"res":"彩虹碎片","count":20},{"res":"造物精华","count":8}],[{"res":"丝绸布料","count":30},{"res":"彩虹碎片","count":20},{"res":"造物精华","count":8}]]},"银质剑":{"resId":"silverSword","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["银质剑","星辉精华"],["银质剑","星辉精华"],["银质剑","星辉精华"],["银质剑","星辉精华"],["银质剑","星辉精华"],["银质剑+1","星辉精华"],["银质剑+2","星辉精华"],["银质剑+3","星辉精华"],["银质剑+4","星辉精华"],["银质剑+5","星辉精华"]],"requires":[[{"res":"银锭","count":20}],[{"res":"银锭","count":20}],[{"res":"银锭","count":20}],[{"res":"银锭","count":20}],[{"res":"银锭","count":25}],[{"res":"银锭","count":25}],[{"res":"银锭","count":25}],[{"res":"银锭","count":25}],[{"res":"银锭","count":30}],[{"res":"银锭","count":30}]]},"蛮力巨棍":{"resId":"trollClubPlus","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["蛮力巨棍","星辉精华"],["蛮力巨棍","星辉精华"],["蛮力巨棍","星辉精华"],["蛮力巨棍+1","星辉精华"],["蛮力巨棍+2","星辉精华"]],"requires":[[{"res":"钢","count":20},{"res":"巨魔木棒","count":5}],[{"res":"钢","count":20},{"res":"巨魔木棒","count":5}],[{"res":"钢","count":20},{"res":"巨魔木棒","count":5}],[{"res":"钢","count":30},{"res":"巨魔木棒","count":10}],[{"res":"钢","count":30},{"res":"巨魔木棒","count":10}]]},"丝质法师手套":{"resId":"silkMageLongGloves","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质法师手套","星辉精华"],["丝质法师手套","星辉精华"],["丝质法师手套","星辉精华"],["丝质法师手套","星辉精华"],["丝质法师手套","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}]]},"暗影精铁盔甲":{"resId":"shadowSteelCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁盔甲","星辉精华"],["暗影精铁盔甲","星辉精华"],["暗影精铁盔甲","星辉精华"],["暗影精铁盔甲","星辉精华"],["暗影精铁盔甲","星辉精华"],["暗影精铁盔甲+1","星辉精华"],["暗影精铁盔甲+2","星辉精华"],["暗影精铁盔甲+3","星辉精华"],["暗影精铁盔甲+4","星辉精华"],["暗影精铁盔甲+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":40},{"res":"银护甲","count":1}],[{"res":"暗影精铁","count":40},{"res":"银护甲","count":1}],[{"res":"暗影精铁","count":40},{"res":"银护甲","count":1}]]},"瞬影护符":{"resId":"blinkshadowGirdle","pers":[0.46,0.38,0.3,0.22,0.14],"protectes":[["瞬影护符","星辉精华"],["瞬影护符","星辉精华"],["瞬影护符+1","星辉精华"],["瞬影护符+2","星辉精华"],["瞬影护符+3","星辉精华"]],"requires":[[{"res":"影跃束带","count":10},{"res":"胡须护符","count":10},{"res":"夜瞳宝石","count":20},{"res":"金币","count":30000.0}],[{"res":"影跃束带","count":10},{"res":"胡须护符","count":10},{"res":"夜瞳宝石","count":20},{"res":"金币","count":30000.0}],[{"res":"影跃束带","count":10},{"res":"胡须护符","count":10},{"res":"夜瞳宝石","count":20},{"res":"金币","count":30000.0}],[{"res":"影跃束带","count":15},{"res":"胡须护符","count":15},{"res":"夜瞳宝石","count":25},{"res":"金币","count":50000.0}],[{"res":"影跃束带","count":15},{"res":"胡须护符","count":15},{"res":"夜瞳宝石","count":25},{"res":"金币","count":50000.0}]]},"浊光放大镜":{"resId":"murkyShadowLens","pers":[0.8,0.73,0.66,0.59,0.52,0.45,0.38,0.31,0.24,0.17],"protectes":[["浊光放大镜","星辉精华"],["浊光放大镜","星辉精华"],["浊光放大镜","星辉精华"],["浊光放大镜","星辉精华"],["浊光放大镜","星辉精华"],["浊光放大镜+1","星辉精华"],["浊光放大镜+2","星辉精华"],["浊光放大镜+3","星辉精华"],["浊光放大镜+4","星辉精华"],["浊光放大镜+5","星辉精华"]],"requires":[[{"res":"木材","count":10},{"res":"浑浊结晶","count":15},{"res":"猫影宝石","count":15},{"res":"魔晶石","count":15},{"res":"暗影猫皮","count":1},{"res":"神秘精华","count":5}],[{"res":"木材","count":10},{"res":"浑浊结晶","count":15},{"res":"猫影宝石","count":15},{"res":"魔晶石","count":15},{"res":"暗影猫皮","count":1},{"res":"神秘精华","count":5}],[{"res":"木材","count":10},{"res":"浑浊结晶","count":15},{"res":"猫影宝石","count":15},{"res":"魔晶石","count":15},{"res":"暗影猫皮","count":1},{"res":"神秘精华","count":5}],[{"res":"木材","count":10},{"res":"浑浊结晶","count":15},{"res":"猫影宝石","count":15},{"res":"魔晶石","count":15},{"res":"暗影猫皮","count":1},{"res":"神秘精华","count":5}],[{"res":"木材","count":20},{"res":"浑浊结晶","count":20},{"res":"猫影宝石","count":20},{"res":"魔晶石","count":20},{"res":"暗影猫皮","count":2},{"res":"神秘精华","count":10}],[{"res":"木材","count":20},{"res":"浑浊结晶","count":20},{"res":"猫影宝石","count":20},{"res":"魔晶石","count":20},{"res":"暗影猫皮","count":2},{"res":"神秘精华","count":10}],[{"res":"木材","count":20},{"res":"浑浊结晶","count":20},{"res":"猫影宝石","count":20},{"res":"魔晶石","count":20},{"res":"暗影猫皮","count":2},{"res":"神秘精华","count":10}],[{"res":"木材","count":20},{"res":"浑浊结晶","count":20},{"res":"猫影宝石","count":20},{"res":"魔晶石","count":20},{"res":"暗影猫皮","count":2},{"res":"神秘精华","count":10}],[{"res":"木材","count":40},{"res":"浑浊结晶","count":25},{"res":"猫影宝石","count":25},{"res":"魔晶石","count":25},{"res":"暗影猫皮","count":4},{"res":"神秘精华","count":15}],[{"res":"木材","count":40},{"res":"浑浊结晶","count":25},{"res":"猫影宝石","count":25},{"res":"魔晶石","count":25},{"res":"暗影猫皮","count":4},{"res":"神秘精华","count":15}]]},"三级战利品收集者徽章":{"resId":"lv3EnemySpoilCollector","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["三级战利品收集者徽章","星辉精华"],["三级战利品收集者徽章","星辉精华"],["三级战利品收集者徽章","星辉精华"],["三级战利品收集者徽章","星辉精华"],["三级战利品收集者徽章","星辉精华"]],"requires":[[{"res":"三级战利品精华","count":40}],[{"res":"三级战利品精华","count":40}],[{"res":"三级战利品精华","count":40}],[{"res":"三级战利品精华","count":45}],[{"res":"三级战利品精华","count":50}]]},"秘银匕首":{"resId":"mithrilDagger","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["秘银匕首","星辉精华"],["秘银匕首","星辉精华"],["秘银匕首","星辉精华"],["秘银匕首","星辉精华"],["秘银匕首","星辉精华"],["秘银匕首+1","星辉精华"],["秘银匕首+2","星辉精华"],["秘银匕首+3","星辉精华"],["秘银匕首+4","星辉精华"],["秘银匕首+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}]]},"铁钓竿":{"resId":"ironFishingRod","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["铁钓竿","星辉精华"],["铁钓竿","星辉精华"],["铁钓竿","星辉精华"],["铁钓竿+1","星辉精华"],["铁钓竿+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"羊毛","count":1}],[{"res":"铁","count":15},{"res":"羊毛","count":1}],[{"res":"铁","count":15},{"res":"羊毛","count":1}],[{"res":"铁","count":20},{"res":"羊毛","count":2}],[{"res":"铁","count":20},{"res":"羊毛","count":2}]]},"丝质法师披肩":{"resId":"silkMageCloak","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质法师披肩","星辉精华"],["丝质法师披肩","星辉精华"],["丝质法师披肩","星辉精华"],["丝质法师披肩","星辉精华"],["丝质法师披肩","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}]]},"过载核心":{"resId":"overloadGuardianCore","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["过载核心","星辉精华"],["过载核心","星辉精华"],["过载核心","星辉精华"],["过载核心+1","星辉精华"],["过载核心+2","星辉精华"]],"requires":[[{"res":"古代齿轮","count":8},{"res":"守护者核心","count":1},{"res":"神秘精华","count":10}],[{"res":"古代齿轮","count":8},{"res":"守护者核心","count":1},{"res":"神秘精华","count":10}],[{"res":"古代齿轮","count":8},{"res":"守护者核心","count":1},{"res":"神秘精华","count":10}],[{"res":"古代齿轮","count":12},{"res":"守护者核心","count":2},{"res":"神秘精华","count":12}],[{"res":"古代齿轮","count":12},{"res":"守护者核心","count":2},{"res":"神秘精华","count":12}]]},"云绒裹头巾":{"resId":"fluffDexScarf","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["云绒裹头巾","星辉精华"],["云绒裹头巾","星辉精华"],["云绒裹头巾","星辉精华"],["云绒裹头巾","星辉精华"],["云绒裹头巾","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}]]},"魔晶法杖":{"resId":"manacrystalStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["魔晶法杖","星辉精华"],["魔晶法杖","星辉精华"],["魔晶法杖","星辉精华"],["魔晶法杖","星辉精华"],["魔晶法杖","星辉精华"],["魔晶法杖+1","星辉精华"],["魔晶法杖+2","星辉精华"],["魔晶法杖+3","星辉精华"],["魔晶法杖+4","星辉精华"],["魔晶法杖+5","星辉精华"]],"requires":[[{"res":"魔晶石","count":4},{"res":"神秘精华","count":3}],[{"res":"魔晶石","count":4},{"res":"神秘精华","count":3}],[{"res":"魔晶石","count":4},{"res":"神秘精华","count":3}],[{"res":"魔晶石","count":5},{"res":"神秘精华","count":4}],[{"res":"魔晶石","count":5},{"res":"神秘精华","count":4}],[{"res":"魔晶石","count":5},{"res":"神秘精华","count":4}],[{"res":"魔晶石","count":6},{"res":"神秘精华","count":5}],[{"res":"魔晶石","count":6},{"res":"神秘精华","count":5}],[{"res":"魔晶石","count":6},{"res":"神秘精华","count":5}],[{"res":"魔晶石","count":6},{"res":"神秘精华","count":5}]]},"空望之心":{"resId":"darkingHeart","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["空望之心","星辉精华"],["空望之心","星辉精华"],["空望之心","星辉精华"],["空望之心+1","星辉精华"],["空望之心+2","星辉精华"]],"requires":[[{"res":"星辉碎片","count":20},{"res":"史莱姆核心","count":20},{"res":"猫影宝石","count":20},{"res":"纯净精华","count":2},{"res":"虚渊脉液","count":6},{"res":"金币","count":30000.0}],[{"res":"星辉碎片","count":20},{"res":"史莱姆核心","count":20},{"res":"猫影宝石","count":20},{"res":"纯净精华","count":2},{"res":"虚渊脉液","count":6},{"res":"金币","count":30000.0}],[{"res":"星辉碎片","count":20},{"res":"史莱姆核心","count":20},{"res":"猫影宝石","count":20},{"res":"纯净精华","count":2},{"res":"虚渊脉液","count":6},{"res":"金币","count":30000.0}],[{"res":"星辉碎片","count":25},{"res":"史莱姆核心","count":25},{"res":"猫影宝石","count":25},{"res":"纯净精华","count":3},{"res":"虚渊脉液","count":8},{"res":"金币","count":30000.0}],[{"res":"星辉碎片","count":25},{"res":"史莱姆核心","count":25},{"res":"猫影宝石","count":25},{"res":"纯净精华","count":3},{"res":"虚渊脉液","count":8},{"res":"金币","count":30000.0}]]},"钢锤":{"resId":"steelMachinistHammer","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["钢锤","星辉精华"],["钢锤","星辉精华"],["钢锤","星辉精华"],["钢锤+1","星辉精华"],["钢锤+2","星辉精华"]],"requires":[[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":20},{"res":"木材","count":12}],[{"res":"钢","count":20},{"res":"木材","count":12}]]},"羊毛法师手套":{"resId":"woolMageLongGloves","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛法师手套","星辉精华"],["羊毛法师手套","星辉精华"],["羊毛法师手套","星辉精华"],["羊毛法师手套","星辉精华"],["羊毛法师手套","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"绒毛法师帽":{"resId":"fluffMageHat","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["绒毛法师帽","星辉精华"],["绒毛法师帽","星辉精华"],["绒毛法师帽","星辉精华"],["绒毛法师帽","星辉精华"],["绒毛法师帽","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}]]},"鱼鳞合金盔甲":{"resId":"fishscaleMineralCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["鱼鳞合金盔甲","星辉精华"],["鱼鳞合金盔甲","星辉精华"],["鱼鳞合金盔甲","星辉精华"],["鱼鳞合金盔甲","星辉精华"],["鱼鳞合金盔甲","星辉精华"],["鱼鳞合金盔甲+1","星辉精华"],["鱼鳞合金盔甲+2","星辉精华"],["鱼鳞合金盔甲+3","星辉精华"],["鱼鳞合金盔甲+4","星辉精华"],["鱼鳞合金盔甲+5","星辉精华"]],"requires":[[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}]]},"羊毛裹头巾":{"resId":"woolDexHeadScarf","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛裹头巾","星辉精华"],["羊毛裹头巾","星辉精华"],["羊毛裹头巾","星辉精华"],["羊毛裹头巾","星辉精华"],["羊毛裹头巾","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"闪光铁剑":{"resId":"shinyIronSword","pers":[0.4,0.4,0.4,0.4,0.4,0.4,0.4,0.4,0.4,0.4,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.35,0.25,0.25,0.25,0.25,0.25,0.25,0.25,0.25,0.25,0.25,0.15,0.15,0.15,0.15,0.15,0.1,0.1,0.1,0.1,0.05],"protectes":[["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"],["闪光铁剑","星辉精华"]],"requires":[[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":30},{"res":"钢","count":30},{"res":"闪光岩","count":8}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":60},{"res":"钢","count":60},{"res":"闪光岩","count":16}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":90},{"res":"钢","count":90},{"res":"闪光岩","count":24}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":120},{"res":"钢","count":120},{"res":"闪光岩","count":32}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}],[{"res":"铁","count":150},{"res":"钢","count":150},{"res":"闪光岩","count":40}]]},"丝质罩袍":{"resId":"silkMageBurqa","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质罩袍","星辉精华"],["丝质罩袍","星辉精华"],["丝质罩袍","星辉精华"],["丝质罩袍","星辉精华"],["丝质罩袍","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}]]},"惶恐面罩":{"resId":"dreadVisor","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["惶恐面罩","星辉精华"],["惶恐面罩","星辉精华"],["惶恐面罩","星辉精华"],["惶恐面罩+1","星辉精华"],["惶恐面罩+2","星辉精华"]],"requires":[[{"res":"恶灵精华","count":25},{"res":"幽灵精华","count":25},{"res":"剧毒皮毛","count":25},{"res":"无相薄膜","count":5},{"res":"虚渊脉液","count":5},{"res":"金币","count":20000.0}],[{"res":"恶灵精华","count":25},{"res":"幽灵精华","count":25},{"res":"剧毒皮毛","count":25},{"res":"无相薄膜","count":5},{"res":"虚渊脉液","count":5},{"res":"金币","count":20000.0}],[{"res":"恶灵精华","count":25},{"res":"幽灵精华","count":25},{"res":"剧毒皮毛","count":25},{"res":"无相薄膜","count":5},{"res":"虚渊脉液","count":5},{"res":"金币","count":20000.0}],[{"res":"恶灵精华","count":30},{"res":"幽灵精华","count":30},{"res":"剧毒皮毛","count":30},{"res":"无相薄膜","count":8},{"res":"虚渊脉液","count":8},{"res":"金币","count":35000.0}],[{"res":"恶灵精华","count":30},{"res":"幽灵精华","count":30},{"res":"剧毒皮毛","count":30},{"res":"无相薄膜","count":8},{"res":"虚渊脉液","count":8},{"res":"金币","count":35000.0}]]},"浊镜匕首":{"resId":"murkyCrystalDagger","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["浊镜匕首","星辉精华"],["浊镜匕首","星辉精华"],["浊镜匕首","星辉精华"],["浊镜匕首","星辉精华"],["浊镜匕首","星辉精华"],["浊镜匕首+1","星辉精华"],["浊镜匕首+2","星辉精华"],["浊镜匕首+3","星辉精华"],["浊镜匕首+4","星辉精华"],["浊镜匕首+5","星辉精华"]],"requires":[[{"res":"浑浊结晶","count":15},{"res":"稀有利爪","count":10}],[{"res":"浑浊结晶","count":15},{"res":"稀有利爪","count":10}],[{"res":"浑浊结晶","count":15},{"res":"稀有利爪","count":10}],[{"res":"浑浊结晶","count":18},{"res":"稀有利爪","count":12}],[{"res":"浑浊结晶","count":18},{"res":"稀有利爪","count":12}],[{"res":"浑浊结晶","count":18},{"res":"稀有利爪","count":12}],[{"res":"浑浊结晶","count":20},{"res":"稀有利爪","count":15}],[{"res":"浑浊结晶","count":20},{"res":"稀有利爪","count":15}],[{"res":"浑浊结晶","count":20},{"res":"稀有利爪","count":15}],[{"res":"浑浊结晶","count":20},{"res":"稀有利爪","count":15}]]},"丝质工匠服":{"resId":"silkArtisanOutfit","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质工匠服","星辉精华"],["丝质工匠服","星辉精华"],["丝质工匠服","星辉精华"],["丝质工匠服+1","星辉精华"],["丝质工匠服+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"羊毛法师帽":{"resId":"woolMageHat","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛法师帽","星辉精华"],["羊毛法师帽","星辉精华"],["羊毛法师帽","星辉精华"],["羊毛法师帽","星辉精华"],["羊毛法师帽","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"丝质宽松裤":{"resId":"silkTightsPants","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质宽松裤","星辉精华"],["丝质宽松裤","星辉精华"],["丝质宽松裤","星辉精华"],["丝质宽松裤","星辉精华"],["丝质宽松裤","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}]]},"群生皮靴":{"resId":"patchworkHideShoes","pers":[0.42,0.34,0.26,0.18,0.0999999999999999],"protectes":[["群生皮靴","星辉精华"],["群生皮靴","星辉精华"],["群生皮靴","星辉精华"],["群生皮靴+1","星辉精华"],["群生皮靴+2","星辉精华"]],"requires":[[{"res":"彩虹碎片","count":5},{"res":"丝绸布料","count":10},{"res":"羊绒布料","count":10},{"res":"狼皮","count":10},{"res":"雪狼皮","count":10},{"res":"雪兔皮","count":10},{"res":"剧毒皮毛","count":5},{"res":"巨魔兽皮","count":5},{"res":"暗影猫皮","count":5},{"res":"巨兽皮","count":5},{"res":"魔法猫头鹰羽毛","count":5},{"res":"金币","count":5000.0}],[{"res":"彩虹碎片","count":5},{"res":"丝绸布料","count":10},{"res":"羊绒布料","count":10},{"res":"狼皮","count":10},{"res":"雪狼皮","count":10},{"res":"雪兔皮","count":10},{"res":"剧毒皮毛","count":5},{"res":"巨魔兽皮","count":5},{"res":"暗影猫皮","count":5},{"res":"巨兽皮","count":5},{"res":"魔法猫头鹰羽毛","count":5},{"res":"金币","count":5000.0}],[{"res":"彩虹碎片","count":5},{"res":"丝绸布料","count":10},{"res":"羊绒布料","count":10},{"res":"狼皮","count":10},{"res":"雪狼皮","count":10},{"res":"雪兔皮","count":10},{"res":"剧毒皮毛","count":5},{"res":"巨魔兽皮","count":5},{"res":"暗影猫皮","count":5},{"res":"巨兽皮","count":5},{"res":"魔法猫头鹰羽毛","count":5},{"res":"金币","count":5000.0}],[{"res":"彩虹碎片","count":5},{"res":"丝绸布料","count":10},{"res":"羊绒布料","count":10},{"res":"狼皮","count":10},{"res":"雪狼皮","count":10},{"res":"雪兔皮","count":10},{"res":"剧毒皮毛","count":5},{"res":"巨魔兽皮","count":5},{"res":"暗影猫皮","count":5},{"res":"巨兽皮","count":5},{"res":"魔法猫头鹰羽毛","count":5},{"res":"金币","count":5000.0}],[{"res":"彩虹碎片","count":5},{"res":"丝绸布料","count":10},{"res":"羊绒布料","count":10},{"res":"狼皮","count":10},{"res":"雪狼皮","count":10},{"res":"雪兔皮","count":10},{"res":"剧毒皮毛","count":5},{"res":"巨魔兽皮","count":5},{"res":"暗影猫皮","count":5},{"res":"巨兽皮","count":5},{"res":"魔法猫头鹰羽毛","count":5},{"res":"金币","count":5000.0}]]},"羊毛裁缝手套":{"resId":"woolTailorGloves","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["羊毛裁缝手套","星辉精华"],["羊毛裁缝手套","星辉精华"],["羊毛裁缝手套","星辉精华"],["羊毛裁缝手套+1","星辉精华"],["羊毛裁缝手套+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":25}],[{"res":"羊绒布料","count":25}],[{"res":"羊绒布料","count":30}],[{"res":"羊绒布料","count":30}],[{"res":"羊绒布料","count":30}]]},"秘银护腿":{"resId":"mithrilPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["秘银护腿","星辉精华"],["秘银护腿","星辉精华"],["秘银护腿","星辉精华"],["秘银护腿","星辉精华"],["秘银护腿","星辉精华"],["秘银护腿+1","星辉精华"],["秘银护腿+2","星辉精华"],["秘银护腿+3","星辉精华"],["秘银护腿+4","星辉精华"],["秘银护腿+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}]]},"丝质夜行斗篷":{"resId":"silkDexCloak","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质夜行斗篷","星辉精华"],["丝质夜行斗篷","星辉精华"],["丝质夜行斗篷","星辉精华"],["丝质夜行斗篷","星辉精华"],["丝质夜行斗篷","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}]]},"丝质绑带手套":{"resId":"silkDexGloves","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质绑带手套","星辉精华"],["丝质绑带手套","星辉精华"],["丝质绑带手套","星辉精华"],["丝质绑带手套","星辉精华"],["丝质绑带手套","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}]]},"丝质隔热服":{"resId":"silkHeatInsulatingCloth","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质隔热服","星辉精华"],["丝质隔热服","星辉精华"],["丝质隔热服","星辉精华"],["丝质隔热服+1","星辉精华"],["丝质隔热服+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"钢锅":{"resId":"steelPot","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["钢锅","星辉精华"],["钢锅","星辉精华"],["钢锅","星辉精华"],["钢锅+1","星辉精华"],["钢锅+2","星辉精华"]],"requires":[[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":20},{"res":"木材","count":12}],[{"res":"钢","count":20},{"res":"木材","count":12}]]},"丝质法师帽":{"resId":"silkMageHat","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质法师帽","星辉精华"],["丝质法师帽","星辉精华"],["丝质法师帽","星辉精华"],["丝质法师帽","星辉精华"],["丝质法师帽","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":20},{"res":"神秘精华","count":4}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}],[{"res":"丝绸布料","count":25},{"res":"神秘精华","count":6}]]},"银质匕首":{"resId":"silverDagger","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["银质匕首","星辉精华"],["银质匕首","星辉精华"],["银质匕首","星辉精华"],["银质匕首","星辉精华"],["银质匕首","星辉精华"],["银质匕首+1","星辉精华"],["银质匕首+2","星辉精华"],["银质匕首+3","星辉精华"],["银质匕首+4","星辉精华"],["银质匕首+5","星辉精华"]],"requires":[[{"res":"银锭","count":20}],[{"res":"银锭","count":20}],[{"res":"银锭","count":20}],[{"res":"银锭","count":20}],[{"res":"银锭","count":25}],[{"res":"银锭","count":25}],[{"res":"银锭","count":25}],[{"res":"银锭","count":25}],[{"res":"银锭","count":30}],[{"res":"银锭","count":30}]]},"云行斗篷":{"resId":"cloudwalkerCloak","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["云行斗篷","星辉精华"],["云行斗篷","星辉精华"],["云行斗篷","星辉精华"],["云行斗篷+1","星辉精华"],["云行斗篷+2","星辉精华"]],"requires":[[{"res":"云絮","count":15},{"res":"丝绸布料","count":12},{"res":"羊绒布料","count":6}],[{"res":"云絮","count":15},{"res":"丝绸布料","count":12},{"res":"羊绒布料","count":6}],[{"res":"云絮","count":15},{"res":"丝绸布料","count":12},{"res":"羊绒布料","count":6}],[{"res":"云絮","count":18},{"res":"丝绸布料","count":15},{"res":"羊绒布料","count":8}],[{"res":"云絮","count":18},{"res":"丝绸布料","count":15},{"res":"羊绒布料","count":8}]]},"魔力共振护臂":{"resId":"arcaneResonanceBracers","pers":[0.46,0.38,0.3,0.22,0.14],"protectes":[["魔力共振护臂","星辉精华"],["魔力共振护臂","星辉精华"],["魔力共振护臂+1","星辉精华"],["魔力共振护臂+2","星辉精华"],["魔力共振护臂+3","星辉精华"]],"requires":[[{"res":"共振晶格","count":15},{"res":"秘银锭","count":20},{"res":"黑暗结晶","count":30},{"res":"金币","count":50000.0}],[{"res":"共振晶格","count":15},{"res":"秘银锭","count":20},{"res":"黑暗结晶","count":30},{"res":"金币","count":50000.0}],[{"res":"共振晶格","count":15},{"res":"秘银锭","count":20},{"res":"黑暗结晶","count":30},{"res":"金币","count":50000.0}],[{"res":"共振晶格","count":20},{"res":"秘银锭","count":30},{"res":"黑暗结晶","count":35},{"res":"金币","count":80000.0}],[{"res":"共振晶格","count":20},{"res":"秘银锭","count":30},{"res":"黑暗结晶","count":35},{"res":"金币","count":80000.0}]]},"可爱的手环":{"resId":"cuteBracelet","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}]]},"“游乐园之王”":{"resId":"loadOfamusementPark","pers":[0.35,0.27,0.19,0.11,0.0299999999999999],"protectes":[["“游乐园之王”","星辉精华"],["“游乐园之王”","星辉精华"],["“游乐园之王”","星辉精华"],["“游乐园之王”+1","星辉精华"],["“游乐园之王”+2","星辉精华"]],"requires":[[{"res":"恶灵精华","count":10},{"res":"糖果炸弹","count":10},{"res":"星辉碎片","count":10},{"res":"神秘精华","count":10}],[{"res":"恶灵精华","count":15},{"res":"糖果炸弹","count":15},{"res":"星辉碎片","count":15},{"res":"神秘精华","count":15}],[{"res":"恶灵精华","count":20},{"res":"糖果炸弹","count":20},{"res":"星辉碎片","count":20},{"res":"神秘精华","count":20}],[{"res":"恶灵精华","count":25},{"res":"糖果炸弹","count":25},{"res":"星辉碎片","count":25},{"res":"神秘精华","count":25}],[{"res":"恶灵精华","count":30},{"res":"糖果炸弹","count":30},{"res":"星辉碎片","count":30},{"res":"神秘精华","count":30}]]},"猫祖王冠":{"resId":"ancestorCrown","pers":[0.35,0.27,0.19,0.11,0.0299999999999999],"protectes":[["猫祖王冠","星辉精华"],["猫祖王冠","星辉精华"],["猫祖王冠","星辉精华"],["猫祖王冠+1","星辉精华"],["猫祖王冠+2","星辉精华"]],"requires":[[{"res":"暗影猫皮","count":10},{"res":"猫影宝石","count":10},{"res":"暗影法球","count":10},{"res":"神秘精华","count":10}],[{"res":"暗影猫皮","count":15},{"res":"猫影宝石","count":15},{"res":"暗影法球","count":15},{"res":"神秘精华","count":15}],[{"res":"暗影猫皮","count":20},{"res":"猫影宝石","count":20},{"res":"暗影法球","count":20},{"res":"神秘精华","count":20}],[{"res":"暗影猫皮","count":25},{"res":"猫影宝石","count":25},{"res":"暗影法球","count":25},{"res":"神秘精华","count":25}],[{"res":"暗影猫皮","count":30},{"res":"猫影宝石","count":30},{"res":"暗影法球","count":30},{"res":"神秘精华","count":30}]]},"鱼鳞合金头盔":{"resId":"fishscaleMineralHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["鱼鳞合金头盔","星辉精华"],["鱼鳞合金头盔","星辉精华"],["鱼鳞合金头盔","星辉精华"],["鱼鳞合金头盔","星辉精华"],["鱼鳞合金头盔","星辉精华"],["鱼鳞合金头盔+1","星辉精华"],["鱼鳞合金头盔+2","星辉精华"],["鱼鳞合金头盔+3","星辉精华"],["鱼鳞合金头盔+4","星辉精华"],["鱼鳞合金头盔+5","星辉精华"]],"requires":[[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}]]},"向导徽章":{"resId":"guideBadge","pers":[1,1,1,1,1,1,1,1,1,1],"protectes":[[""],[""],[""],[""],[""],[""],[""],[""],[""],[""]],"requires":[[{"res":"金币","count":1000000.0}],[{"res":"向导徽章","count":1}],[{"res":"向导徽章","count":1}],[{"res":"向导徽章","count":1}],[{"res":"向导徽章","count":1}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}]]},"绒毛法师裤":{"resId":"fluffMagePants","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["绒毛法师裤","星辉精华"],["绒毛法师裤","星辉精华"],["绒毛法师裤","星辉精华"],["绒毛法师裤","星辉精华"],["绒毛法师裤","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}]]},"星辰合金臂甲":{"resId":"starforgedAlloyGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["星辰合金臂甲","星辉精华"],["星辰合金臂甲","星辉精华"],["星辰合金臂甲","星辉精华"],["星辰合金臂甲","星辉精华"],["星辰合金臂甲","星辉精华"],["星辰合金臂甲+1","星辉精华"],["星辰合金臂甲+2","星辉精华"],["星辰合金臂甲+3","星辉精华"],["星辰合金臂甲+4","星辉精华"],["星辰合金臂甲+5","星辉精华"]],"requires":[[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}]]},"竹质弩":{"resId":"bambooCrossbow","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["竹质弩","星辉精华"],["竹质弩","星辉精华"],["竹质弩","星辉精华"],["竹质弩","星辉精华"],["竹质弩","星辉精华"],["竹质弩+1","星辉精华"],["竹质弩+2","星辉精华"],["竹质弩+3","星辉精华"],["竹质弩+4","星辉精华"],["竹质弩+5","星辉精华"]],"requires":[[{"res":"竹子","count":10},{"res":"羊毛","count":5}],[{"res":"竹子","count":10},{"res":"羊毛","count":5}],[{"res":"竹子","count":10},{"res":"羊毛","count":5}],[{"res":"竹子","count":13},{"res":"羊毛","count":6}],[{"res":"竹子","count":13},{"res":"羊毛","count":6}],[{"res":"竹子","count":13},{"res":"羊毛","count":6}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}]]},"铁制捕鱼笼":{"resId":"ironFishpot","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["铁制捕鱼笼","星辉精华"],["铁制捕鱼笼","星辉精华"],["铁制捕鱼笼","星辉精华"],["铁制捕鱼笼+1","星辉精华"],["铁制捕鱼笼+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"羊毛","count":15}],[{"res":"铁","count":15},{"res":"羊毛","count":15}],[{"res":"铁","count":15},{"res":"羊毛","count":15}],[{"res":"铁","count":18},{"res":"羊毛","count":18}],[{"res":"铁","count":18},{"res":"羊毛","count":18}]]},"针线包":{"resId":"needleandThread","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["针线包","星辉精华"],["针线包","星辉精华"],["针线包","星辉精华"],["针线包+1","星辉精华"],["针线包+2","星辉精华"]],"requires":[[{"res":"铁","count":3},{"res":"羊绒布料","count":4},{"res":"羊毛","count":4}],[{"res":"铁","count":3},{"res":"羊绒布料","count":4},{"res":"羊毛","count":4}],[{"res":"铁","count":3},{"res":"羊绒布料","count":4},{"res":"羊毛","count":4}],[{"res":"铁","count":4},{"res":"羊绒布料","count":6},{"res":"羊毛","count":6}],[{"res":"铁","count":4},{"res":"羊绒布料","count":6},{"res":"羊毛","count":6}]]},"钢护腿":{"resId":"steelPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["钢护腿","星辉精华"],["钢护腿","星辉精华"],["钢护腿","星辉精华"],["钢护腿","星辉精华"],["钢护腿","星辉精华"],["钢护腿+1","星辉精华"],["钢护腿+2","星辉精华"],["钢护腿+3","星辉精华"],["钢护腿+4","星辉精华"],["钢护腿+5","星辉精华"]],"requires":[[{"res":"铁","count":25},{"res":"钢","count":20}],[{"res":"铁","count":30},{"res":"钢","count":20}],[{"res":"铁","count":25},{"res":"钢","count":21}],[{"res":"铁","count":30},{"res":"钢","count":21}],[{"res":"铁","count":35},{"res":"钢","count":22}],[{"res":"铁","count":40},{"res":"钢","count":22}],[{"res":"铁","count":45},{"res":"钢","count":23}],[{"res":"铁","count":50},{"res":"钢","count":23}],[{"res":"铁","count":55},{"res":"钢","count":24}],[{"res":"铁","count":60},{"res":"钢","count":24}]]},"彩虹手链":{"resId":"rainbowBracelet","pers":[0.7,0.66,0.58,0.5,0.42],"protectes":[["彩虹手链","星辉精华"],["彩虹手链","星辉精华"],["彩虹手链","星辉精华"],["彩虹手链+1","星辉精华"],["彩虹手链+2","星辉精华"]],"requires":[[{"res":"彩虹碎片","count":15}],[{"res":"彩虹碎片","count":15}],[{"res":"彩虹碎片","count":15}],[{"res":"彩虹碎片","count":20}],[{"res":"彩虹碎片","count":20}]]},"钢甲衣":{"resId":"steelCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["钢甲衣","星辉精华"],["钢甲衣","星辉精华"],["钢甲衣","星辉精华"],["钢甲衣","星辉精华"],["钢甲衣","星辉精华"],["钢甲衣+1","星辉精华"],["钢甲衣+2","星辉精华"],["钢甲衣+3","星辉精华"],["钢甲衣+4","星辉精华"],["钢甲衣+5","星辉精华"]],"requires":[[{"res":"铁","count":25},{"res":"钢","count":20}],[{"res":"铁","count":30},{"res":"钢","count":20}],[{"res":"铁","count":25},{"res":"钢","count":21}],[{"res":"铁","count":30},{"res":"钢","count":21}],[{"res":"铁","count":35},{"res":"钢","count":22}],[{"res":"铁","count":40},{"res":"钢","count":22}],[{"res":"铁","count":45},{"res":"钢","count":23}],[{"res":"铁","count":50},{"res":"钢","count":23}],[{"res":"铁","count":55},{"res":"钢","count":24}],[{"res":"铁","count":60},{"res":"钢","count":24}]]},"月光吊坠":{"resId":"moonlightPendant","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["月光吊坠","星辉精华"],["月光吊坠","星辉精华"],["月光吊坠","星辉精华"],["月光吊坠","星辉精华"],["月光吊坠","星辉精华"]],"requires":[[{"res":"月光铃铛","count":5},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":10},{"res":"神秘精华","count":2}],[{"res":"月光铃铛","count":5},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":10},{"res":"神秘精华","count":2}],[{"res":"月光铃铛","count":5},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":10},{"res":"神秘精华","count":2}],[{"res":"月光铃铛","count":5},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":10},{"res":"神秘精华","count":2}],[{"res":"月光铃铛","count":5},{"res":"猫薄荷宝石","count":1},{"res":"猫毛球","count":10},{"res":"神秘精华","count":2}]]},"采矿收纳背篓":{"resId":"bambooMiningCatbasket","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["采矿收纳背篓","星辉精华"],["采矿收纳背篓","星辉精华"],["采矿收纳背篓","星辉精华"],["采矿收纳背篓+1","星辉精华"],["采矿收纳背篓+2","星辉精华"]],"requires":[[{"res":"竹子","count":25},{"res":"羊毛","count":5}],[{"res":"竹子","count":25},{"res":"羊毛","count":5}],[{"res":"竹子","count":25},{"res":"羊毛","count":5}],[{"res":"竹子","count":30},{"res":"羊毛","count":8}],[{"res":"竹子","count":30},{"res":"羊毛","count":8}]]},"铁钳":{"resId":"ironTongs","pers":[0.7,0.66,0.58,0.5,0.42],"protectes":[["铁钳","星辉精华"],["铁钳","星辉精华"],["铁钳","星辉精华"],["铁钳+1","星辉精华"],["铁钳+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":15},{"res":"木材","count":6}],[{"res":"铁","count":20},{"res":"木材","count":12}],[{"res":"铁","count":20},{"res":"木材","count":12}]]},"绒毛法师手套":{"resId":"fluffMageGloves","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["绒毛法师手套","星辉精华"],["绒毛法师手套","星辉精华"],["绒毛法师手套","星辉精华"],["绒毛法师手套","星辉精华"],["绒毛法师手套","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}]]},"羊毛隔热手套":{"resId":"woolHeatResistantGloves","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛隔热手套","星辉精华"],["羊毛隔热手套","星辉精华"],["羊毛隔热手套","星辉精华"],["羊毛隔热手套+1","星辉精华"],["羊毛隔热手套+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"知识冠冕":{"resId":"knowledgeCrown","pers":[0.35,0.27,0.19,0.11,0.0299999999999999],"protectes":[["知识冠冕","星辉精华"],["知识冠冕","星辉精华"],["知识冠冕+1","星辉精华"],["知识冠冕+2","星辉精华"],["知识冠冕+3","星辉精华"]],"requires":[[{"res":"记忆残页","count":5},{"res":"神秘精华","count":20},{"res":"金币","count":500000.0}],[{"res":"记忆残页","count":5},{"res":"神秘精华","count":20},{"res":"金币","count":500000.0}],[{"res":"记忆残页","count":5},{"res":"神秘精华","count":20},{"res":"金币","count":500000.0}],[{"res":"记忆残页","count":8},{"res":"神秘精华","count":25},{"res":"金币","count":700000.0}],[{"res":"记忆残页","count":8},{"res":"神秘精华","count":25},{"res":"金币","count":700000.0}]]},"秘银头盔":{"resId":"mithrilHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["秘银头盔","星辉精华"],["秘银头盔","星辉精华"],["秘银头盔","星辉精华"],["秘银头盔","星辉精华"],["秘银头盔","星辉精华"],["秘银头盔+1","星辉精华"],["秘银头盔+2","星辉精华"],["秘银头盔+3","星辉精华"],["秘银头盔+4","星辉精华"],["秘银头盔+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}]]},"潜影护符":{"resId":"lurkingShadowGirdle","pers":[0.46,0.38,0.3,0.22,0.14],"protectes":[["潜影护符","星辉精华"],["潜影护符","星辉精华"],["潜影护符+1","星辉精华"],["潜影护符+2","星辉精华"],["潜影护符+3","星辉精华"]],"requires":[[{"res":"影跃束带","count":10},{"res":"胡须护符","count":10},{"res":"夜瞳宝石","count":10},{"res":"陷阱零件","count":10},{"res":"金币","count":30000.0}],[{"res":"影跃束带","count":10},{"res":"胡须护符","count":10},{"res":"夜瞳宝石","count":10},{"res":"陷阱零件","count":10},{"res":"金币","count":30000.0}],[{"res":"影跃束带","count":10},{"res":"胡须护符","count":10},{"res":"夜瞳宝石","count":10},{"res":"陷阱零件","count":10},{"res":"金币","count":30000.0}],[{"res":"影跃束带","count":15},{"res":"胡须护符","count":15},{"res":"夜瞳宝石","count":15},{"res":"陷阱零件","count":15},{"res":"金币","count":50000.0}],[{"res":"影跃束带","count":15},{"res":"胡须护符","count":15},{"res":"夜瞳宝石","count":15},{"res":"陷阱零件","count":15},{"res":"金币","count":50000.0}]]},"余烬庇护":{"resId":"emberAegis","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["余烬庇护","星辉精华"],["余烬庇护","星辉精华"],["余烬庇护","星辉精华"],["余烬庇护+1","星辉精华"],["余烬庇护+2","星辉精华"]],"requires":[[{"res":"猫咪圣物","count":1},{"res":"熔岩之心","count":4},{"res":"神秘精华","count":4}],[{"res":"猫咪圣物","count":1},{"res":"熔岩之心","count":4},{"res":"神秘精华","count":4}],[{"res":"猫咪圣物","count":1},{"res":"熔岩之心","count":4},{"res":"神秘精华","count":4}],[{"res":"猫咪圣物","count":2},{"res":"熔岩之心","count":6},{"res":"神秘精华","count":6}],[{"res":"猫咪圣物","count":2},{"res":"熔岩之心","count":6},{"res":"神秘精华","count":6}]]},"棱彩交织法杖":{"resId":"intertwinedCatEyeGenesisEssenceStaff","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["棱彩交织法杖","星辉精华"],["棱彩交织法杖","星辉精华"],["棱彩交织法杖","星辉精华"],["棱彩交织法杖","星辉精华"],["棱彩交织法杖","星辉精华"]],"requires":[[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10},{"res":"造物精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10},{"res":"造物精华","count":10}],[{"res":"猫眼石","count":14},{"res":"神秘精华","count":10},{"res":"造物精华","count":10}],[{"res":"猫眼石","count":18},{"res":"神秘精华","count":14},{"res":"造物精华","count":15}],[{"res":"猫眼石","count":18},{"res":"神秘精华","count":14},{"res":"造物精华","count":15}]]},"可爱的娃娃":{"resId":"cuteDoll","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}]]},"暗影精铁大锤":{"resId":"shadowSteelHammer","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁大锤","星辉精华"],["暗影精铁大锤","星辉精华"],["暗影精铁大锤","星辉精华"],["暗影精铁大锤","星辉精华"],["暗影精铁大锤","星辉精华"],["暗影精铁大锤+1","星辉精华"],["暗影精铁大锤+2","星辉精华"],["暗影精铁大锤+3","星辉精华"],["暗影精铁大锤+4","星辉精华"],["暗影精铁大锤+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":60}],[{"res":"暗影精铁","count":60}],[{"res":"暗影精铁","count":60}],[{"res":"暗影精铁","count":60}],[{"res":"暗影精铁","count":65}],[{"res":"暗影精铁","count":65}],[{"res":"暗影精铁","count":65}],[{"res":"暗影精铁","count":70}],[{"res":"暗影精铁","count":70}],[{"res":"暗影精铁","count":70}]]},"王总的感谢之帽":{"resId":"wangzongsCuteHat","pers":[0,0,0,0,0],"protectes":[[],[],[],[],[]],"requires":[[],[],[],[],[]]},"永夜法杖":{"resId":"eternalNightStaff","pers":[0.66,0.595,0.53,0.465,0.4,0.335,0.27,0.205,0.14,0.075],"protectes":[["永夜法杖","星辉精华"],["永夜法杖","星辉精华"],["永夜法杖","星辉精华"],["永夜法杖","星辉精华"],["永夜法杖","星辉精华"],["永夜法杖+1","星辉精华"],["永夜法杖+2","星辉精华"],["永夜法杖+3","星辉精华"],["永夜法杖+4","星辉精华"],["永夜法杖+5","星辉精华"]],"requires":[[{"res":"永夜杖柄","count":3},{"res":"暮影须","count":10},{"res":"暗影法球","count":10},{"res":"夜瞳宝石","count":15},{"res":"金币","count":50000.0}],[{"res":"永夜杖柄","count":3},{"res":"暮影须","count":10},{"res":"暗影法球","count":10},{"res":"夜瞳宝石","count":15},{"res":"金币","count":50000.0}],[{"res":"永夜杖柄","count":3},{"res":"暮影须","count":10},{"res":"暗影法球","count":10},{"res":"夜瞳宝石","count":15},{"res":"金币","count":50000.0}],[{"res":"永夜杖柄","count":3},{"res":"暮影须","count":10},{"res":"暗影法球","count":10},{"res":"夜瞳宝石","count":15},{"res":"金币","count":50000.0}],[{"res":"永夜杖柄","count":3},{"res":"暮影须","count":10},{"res":"暗影法球","count":10},{"res":"夜瞳宝石","count":15},{"res":"金币","count":50000.0}],[{"res":"永夜杖柄","count":4},{"res":"暮影须","count":15},{"res":"暗影法球","count":15},{"res":"夜瞳宝石","count":20},{"res":"金币","count":75000.0}],[{"res":"永夜杖柄","count":4},{"res":"暮影须","count":15},{"res":"暗影法球","count":15},{"res":"夜瞳宝石","count":20},{"res":"金币","count":75000.0}],[{"res":"永夜杖柄","count":4},{"res":"暮影须","count":15},{"res":"暗影法球","count":15},{"res":"夜瞳宝石","count":20},{"res":"金币","count":75000.0}],[{"res":"永夜杖柄","count":5},{"res":"暮影须","count":20},{"res":"暗影法球","count":20},{"res":"夜瞳宝石","count":30},{"res":"金币","count":10000.0}],[{"res":"永夜杖柄","count":5},{"res":"暮影须","count":20},{"res":"暗影法球","count":20},{"res":"夜瞳宝石","count":30},{"res":"金币","count":10000.0}]]},"潜锋之爪":{"resId":"shadowTalonFang","pers":[0.66,0.595,0.53,0.465,0.4,0.335,0.27,0.205,0.14,0.075],"protectes":[["潜锋之爪","星辉精华"],["潜锋之爪","星辉精华"],["潜锋之爪","星辉精华"],["潜锋之爪","星辉精华"],["潜锋之爪","星辉精华"],["潜锋之爪+1","星辉精华"],["潜锋之爪+2","星辉精华"],["潜锋之爪+3","星辉精华"],["潜锋之爪+4","星辉精华"],["潜锋之爪+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":20},{"res":"裂阵爪锋","count":5},{"res":"稀有利爪","count":10},{"res":"金币","count":35000.0}],[{"res":"秘银锭","count":20},{"res":"裂阵爪锋","count":5},{"res":"稀有利爪","count":10},{"res":"金币","count":35000.0}],[{"res":"秘银锭","count":20},{"res":"裂阵爪锋","count":5},{"res":"稀有利爪","count":10},{"res":"金币","count":35000.0}],[{"res":"秘银锭","count":20},{"res":"裂阵爪锋","count":5},{"res":"稀有利爪","count":10},{"res":"金币","count":35000.0}],[{"res":"秘银锭","count":20},{"res":"裂阵爪锋","count":5},{"res":"稀有利爪","count":10},{"res":"金币","count":35000.0}],[{"res":"秘银锭","count":25},{"res":"裂阵爪锋","count":8},{"res":"稀有利爪","count":15},{"res":"金币","count":50000.0}],[{"res":"秘银锭","count":25},{"res":"裂阵爪锋","count":8},{"res":"稀有利爪","count":15},{"res":"金币","count":50000.0}],[{"res":"秘银锭","count":25},{"res":"裂阵爪锋","count":8},{"res":"稀有利爪","count":15},{"res":"金币","count":50000.0}],[{"res":"秘银锭","count":30},{"res":"裂阵爪锋","count":12},{"res":"稀有利爪","count":20},{"res":"金币","count":80000.0}],[{"res":"秘银锭","count":30},{"res":"裂阵爪锋","count":12},{"res":"稀有利爪","count":20},{"res":"金币","count":80000.0}]]},"云绒紧身裤":{"resId":"fluffDexPants","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["云绒紧身裤","星辉精华"],["云绒紧身裤","星辉精华"],["云绒紧身裤","星辉精华"],["云绒紧身裤","星辉精华"],["云绒紧身裤","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}]]},"智慧羽毛笔":{"resId":"owlQuillpen","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["智慧羽毛笔","星辉精华"],["智慧羽毛笔","星辉精华"],["智慧羽毛笔+1","星辉精华"],["智慧羽毛笔+2","星辉精华"],["智慧羽毛笔+3","星辉精华"]],"requires":[[{"res":"魔法猫头鹰羽毛","count":6},{"res":"知识精华","count":8},{"res":"神秘精华","count":1},{"res":"金币","count":30000.0}],[{"res":"魔法猫头鹰羽毛","count":6},{"res":"知识精华","count":8},{"res":"神秘精华","count":1},{"res":"金币","count":30000.0}],[{"res":"魔法猫头鹰羽毛","count":6},{"res":"知识精华","count":8},{"res":"神秘精华","count":1},{"res":"金币","count":30000.0}],[{"res":"魔法猫头鹰羽毛","count":6},{"res":"知识精华","count":10},{"res":"神秘精华","count":2},{"res":"金币","count":50000.0}],[{"res":"魔法猫头鹰羽毛","count":6},{"res":"知识精华","count":10},{"res":"神秘精华","count":2},{"res":"金币","count":50000.0}]]},"共时之铃":{"resId":"bell_of_2025","pers":[1,1,1,1,1,1,1,1,1,1],"protectes":[[""],[""],[""],[""],[""],[""],[""],[""],[""],[""]],"requires":[[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}],[{"res":"共时之铃","count":1},{"res":"心意点数","count":25},{"res":"金币","count":202500}]]},"铁甲衣":{"resId":"ironCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["铁甲衣","星辉精华"],["铁甲衣","星辉精华"],["铁甲衣","星辉精华"],["铁甲衣","星辉精华"],["铁甲衣","星辉精华"],["铁甲衣+1","星辉精华"],["铁甲衣+2","星辉精华"],["铁甲衣+3","星辉精华"],["铁甲衣+4","星辉精华"],["铁甲衣+5","星辉精华"]],"requires":[[{"res":"铁","count":25}],[{"res":"铁","count":30}],[{"res":"铁","count":35}],[{"res":"铁","count":40}],[{"res":"铁","count":45}],[{"res":"铁","count":50}],[{"res":"铁","count":55}],[{"res":"铁","count":60}],[{"res":"铁","count":65}],[{"res":"铁","count":70}]]},"羊毛隔热服":{"resId":"woolHeatInsulatingCloth","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛隔热服","星辉精华"],["羊毛隔热服","星辉精华"],["羊毛隔热服","星辉精华"],["羊毛隔热服+1","星辉精华"],["羊毛隔热服+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"丝质裁缝手套":{"resId":"silkTailorGloves","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质裁缝手套","星辉精华"],["丝质裁缝手套","星辉精华"],["丝质裁缝手套","星辉精华"],["丝质裁缝手套+1","星辉精华"],["丝质裁缝手套+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"暗影精铁匕首":{"resId":"shadowSteelDagger","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁匕首","星辉精华"],["暗影精铁匕首","星辉精华"],["暗影精铁匕首","星辉精华"],["暗影精铁匕首","星辉精华"],["暗影精铁匕首","星辉精华"],["暗影精铁匕首+1","星辉精华"],["暗影精铁匕首+2","星辉精华"],["暗影精铁匕首+3","星辉精华"],["暗影精铁匕首+4","星辉精华"],["暗影精铁匕首+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":15}],[{"res":"暗影精铁","count":20}],[{"res":"暗影精铁","count":20}],[{"res":"暗影精铁","count":20},{"res":"银质匕首","count":1}],[{"res":"暗影精铁","count":25},{"res":"银质匕首","count":1}],[{"res":"暗影精铁","count":25},{"res":"银质匕首","count":1}],[{"res":"暗影精铁","count":25},{"res":"银质匕首","count":1}]]},"绒毛法师披肩":{"resId":"fluffMageCloak","pers":[0.55,0.47,0.39,0.31,0.23],"protectes":[["绒毛法师披肩","星辉精华"],["绒毛法师披肩","星辉精华"],["绒毛法师披肩","星辉精华"],["绒毛法师披肩","星辉精华"],["绒毛法师披肩","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}]]},"羊毛紧身裤":{"resId":"woolTightsPants","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛紧身裤","星辉精华"],["羊毛紧身裤","星辉精华"],["羊毛紧身裤","星辉精华"],["羊毛紧身裤","星辉精华"],["羊毛紧身裤","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"四级战利品收集者徽章":{"resId":"lv4EnemySpoilCollector","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["四级战利品收集者徽章","星辉精华"],["四级战利品收集者徽章","星辉精华"],["四级战利品收集者徽章","星辉精华"],["四级战利品收集者徽章","星辉精华"],["四级战利品收集者徽章","星辉精华"]],"requires":[[{"res":"四级战利品精华","count":40}],[{"res":"四级战利品精华","count":40}],[{"res":"四级战利品精华","count":40}],[{"res":"四级战利品精华","count":45}],[{"res":"四级战利品精华","count":50}]]},"铁护手":{"resId":"ironGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["铁护手","星辉精华"],["铁护手","星辉精华"],["铁护手","星辉精华"],["铁护手","星辉精华"],["铁护手","星辉精华"],["铁护手+1","星辉精华"],["铁护手+2","星辉精华"],["铁护手+3","星辉精华"],["铁护手+4","星辉精华"],["铁护手+5","星辉精华"]],"requires":[[{"res":"铁","count":25}],[{"res":"铁","count":30}],[{"res":"铁","count":35}],[{"res":"铁","count":40}],[{"res":"铁","count":45}],[{"res":"铁","count":50}],[{"res":"铁","count":55}],[{"res":"铁","count":60}],[{"res":"铁","count":65}],[{"res":"铁","count":70}]]},"可爱的帽子":{"resId":"cuteHat","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}],[{"res":"心意点数","count":10},{"res":"造物精华","count":3}]]},"鱼鳞合金护手":{"resId":"fishscaleMineralGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["鱼鳞合金护手","星辉精华"],["鱼鳞合金护手","星辉精华"],["鱼鳞合金护手","星辉精华"],["鱼鳞合金护手","星辉精华"],["鱼鳞合金护手","星辉精华"],["鱼鳞合金护手+1","星辉精华"],["鱼鳞合金护手+2","星辉精华"],["鱼鳞合金护手+3","星辉精华"],["鱼鳞合金护手+4","星辉精华"],["鱼鳞合金护手+5","星辉精华"]],"requires":[[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":30},{"res":"猫薄荷药剂","count":5}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":35},{"res":"猫薄荷药剂","count":6}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}],[{"res":"鱼鳞合金","count":40},{"res":"猫薄荷药剂","count":8}]]},"哥布林匕首·改":{"resId":"goblinDaggerPlus","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["哥布林匕首·改","星辉精华"],["哥布林匕首·改","星辉精华"],["哥布林匕首·改","星辉精华"],["哥布林匕首·改","星辉精华"],["哥布林匕首·改","星辉精华"],["哥布林匕首·改+1","星辉精华"],["哥布林匕首·改+2","星辉精华"],["哥布林匕首·改+3","星辉精华"],["哥布林匕首·改+4","星辉精华"],["哥布林匕首·改+5","星辉精华"]],"requires":[[{"res":"哥布林匕首","count":5},{"res":"铁","count":10}],[{"res":"哥布林匕首","count":5},{"res":"铁","count":10}],[{"res":"哥布林匕首","count":10},{"res":"铁","count":15}],[{"res":"哥布林匕首","count":10},{"res":"铁","count":15}],[{"res":"哥布林匕首","count":15},{"res":"铁","count":15}],[{"res":"哥布林匕首","count":15},{"res":"铁","count":15}],[{"res":"哥布林匕首","count":20},{"res":"铁","count":20}],[{"res":"哥布林匕首","count":20},{"res":"铁","count":20}],[{"res":"哥布林匕首","count":20},{"res":"铁","count":20}],[{"res":"哥布林匕首","count":20},{"res":"铁","count":20}]]},"羊绒英雄孤胆披风":{"resId":"cashmereSingleCloakPlus","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊绒英雄孤胆披风","星辉精华"],["羊绒英雄孤胆披风","星辉精华"],["羊绒英雄孤胆披风","星辉精华"],["羊绒英雄孤胆披风","星辉精华"],["羊绒英雄孤胆披风","星辉精华"]],"requires":[[{"res":"羊绒布料","count":50},{"res":"织物精华","count":6},{"res":"熔岩之心","count":5}],[{"res":"羊绒布料","count":50},{"res":"织物精华","count":6},{"res":"熔岩之心","count":5}],[{"res":"羊绒布料","count":50},{"res":"织物精华","count":6},{"res":"熔岩之心","count":5}],[{"res":"羊绒布料","count":55},{"res":"织物精华","count":8},{"res":"熔岩之心","count":6}],[{"res":"羊绒布料","count":55},{"res":"织物精华","count":8},{"res":"熔岩之心","count":6}]]},"羊毛罩袍":{"resId":"woolBurqa","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["羊毛罩袍","星辉精华"],["羊毛罩袍","星辉精华"],["羊毛罩袍","星辉精华"],["羊毛罩袍","星辉精华"],["羊毛罩袍","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"二级战利品收集者徽章":{"resId":"lv2EnemySpoilCollector","pers":[0.45,0.37,0.29,0.21,0.13],"protectes":[["二级战利品收集者徽章","星辉精华"],["二级战利品收集者徽章","星辉精华"],["二级战利品收集者徽章","星辉精华"],["二级战利品收集者徽章","星辉精华"],["二级战利品收集者徽章","星辉精华"]],"requires":[[{"res":"二级战利品精华","count":40}],[{"res":"二级战利品精华","count":40}],[{"res":"二级战利品精华","count":40}],[{"res":"二级战利品精华","count":45}],[{"res":"二级战利品精华","count":50}]]},"绒毛法师罩袍":{"resId":"fluffMageBurqa","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["绒毛法师罩袍","星辉精华"],["绒毛法师罩袍","星辉精华"],["绒毛法师罩袍","星辉精华"],["绒毛法师罩袍","星辉精华"],["绒毛法师罩袍","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"星尘","count":4},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"星尘","count":6},{"res":"金币","count":1500}]]},"银头盔":{"resId":"silverHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["银头盔","星辉精华"],["银头盔","星辉精华"],["银头盔","星辉精华"],["银头盔","星辉精华"],["银头盔","星辉精华"],["银头盔+1","星辉精华"],["银头盔+2","星辉精华"],["银头盔+3","星辉精华"],["银头盔+4","星辉精华"],["银头盔+5","星辉精华"]],"requires":[[{"res":"银锭","count":20},{"res":"羊绒布料","count":10}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":10}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":10}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":14}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":14}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":14}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":17}]]},"引路徽章":{"resId":"pathfinderBadge","pers":[1,1,1,1,1,1,1,1,1,1],"protectes":[[""],[""],[""],[""],[""],[""],[""],[""],[""],[""]],"requires":[[{"res":"金币","count":1000000.0}],[{"res":"引路徽章","count":1}],[{"res":"引路徽章","count":1}],[{"res":"引路徽章","count":1}],[{"res":"引路徽章","count":1}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}],[{"res":"造物精华","count":5},{"res":"金币","count":1000000.0}]]},"钓鱼帽":{"resId":"fishingHat","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["钓鱼帽","星辉精华"],["钓鱼帽","星辉精华"],["钓鱼帽","星辉精华"],["钓鱼帽+1","星辉精华"],["钓鱼帽+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}],[{"res":"羊绒布料","count":15}]]},"月光法杖":{"resId":"moonlightStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["月光法杖","星辉精华"],["月光法杖","星辉精华"],["月光法杖","星辉精华"],["月光法杖","星辉精华"],["月光法杖","星辉精华"],["月光法杖+1","星辉精华"],["月光法杖+2","星辉精华"],["月光法杖+3","星辉精华"],["月光法杖+4","星辉精华"],["月光法杖+5","星辉精华"]],"requires":[[{"res":"月光铃铛","count":2},{"res":"神秘精华","count":4}],[{"res":"月光铃铛","count":2},{"res":"神秘精华","count":4}],[{"res":"月光铃铛","count":2},{"res":"神秘精华","count":4}],[{"res":"月光铃铛","count":3},{"res":"神秘精华","count":5}],[{"res":"月光铃铛","count":3},{"res":"神秘精华","count":5}],[{"res":"月光铃铛","count":3},{"res":"神秘精华","count":5}],[{"res":"月光铃铛","count":4},{"res":"神秘精华","count":6}],[{"res":"月光铃铛","count":4},{"res":"神秘精华","count":6}],[{"res":"月光铃铛","count":4},{"res":"神秘精华","count":6}],[{"res":"月光铃铛","count":5},{"res":"神秘精华","count":7}]]},"暗影精铁腿甲":{"resId":"shadowSteelPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁腿甲","星辉精华"],["暗影精铁腿甲","星辉精华"],["暗影精铁腿甲","星辉精华"],["暗影精铁腿甲","星辉精华"],["暗影精铁腿甲","星辉精华"],["暗影精铁腿甲+1","星辉精华"],["暗影精铁腿甲+2","星辉精华"],["暗影精铁腿甲+3","星辉精华"],["暗影精铁腿甲+4","星辉精华"],["暗影精铁腿甲+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":40},{"res":"银护腿","count":1}],[{"res":"暗影精铁","count":40},{"res":"银护腿","count":1}],[{"res":"暗影精铁","count":40},{"res":"银护腿","count":1}]]},"酿造搅拌器":{"resId":"fermentationStirrer","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["酿造搅拌器","星辉精华"],["酿造搅拌器","星辉精华"],["酿造搅拌器","星辉精华"],["酿造搅拌器+1","星辉精华"],["酿造搅拌器+2","星辉精华"]],"requires":[[{"res":"铁","count":10},{"res":"竹子","count":10},{"res":"玻璃瓶","count":1}],[{"res":"铁","count":10},{"res":"竹子","count":10},{"res":"玻璃瓶","count":1}],[{"res":"铁","count":10},{"res":"竹子","count":10},{"res":"玻璃瓶","count":1}],[{"res":"铁","count":15},{"res":"竹子","count":15},{"res":"玻璃瓶","count":1}],[{"res":"铁","count":15},{"res":"竹子","count":15},{"res":"玻璃瓶","count":1}]]},"采集手环":{"resId":"collectingBracelet","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["采集手环","星辉精华"],["采集手环","星辉精华"],["采集手环","星辉精华"],["采集手环+1","星辉精华"],["采集手环+2","星辉精华"]],"requires":[[{"res":"猫毛球","count":25},{"res":"羊毛","count":10}],[{"res":"猫毛球","count":25},{"res":"羊毛","count":10}],[{"res":"猫毛球","count":25},{"res":"羊毛","count":10}],[{"res":"猫毛球","count":25},{"res":"羊毛","count":10}],[{"res":"猫毛球","count":25},{"res":"羊毛","count":10}]]},"丝质隔热手套":{"resId":"silkHeatResistantGloves","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质隔热手套","星辉精华"],["丝质隔热手套","星辉精华"],["丝质隔热手套","星辉精华"],["丝质隔热手套+1","星辉精华"],["丝质隔热手套+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"秘银工匠锤":{"resId":"mithrilMachinistHammer","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["秘银工匠锤","星辉精华"],["秘银工匠锤","星辉精华"],["秘银工匠锤","星辉精华"],["秘银工匠锤+1","星辉精华"],["秘银工匠锤+2","星辉精华"]],"requires":[[{"res":"银锭","count":8},{"res":"秘银锭","count":8}],[{"res":"银锭","count":8},{"res":"秘银锭","count":8}],[{"res":"银锭","count":8},{"res":"秘银锭","count":8}],[{"res":"银锭","count":12},{"res":"秘银锭","count":12}],[{"res":"银锭","count":12},{"res":"秘银锭","count":12}]]},"可爱的护身符":{"resId":"cuteLuckyCharm","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":15}],[{"res":"心意点数","count":15}],[{"res":"心意点数","count":15}],[{"res":"心意点数","count":15},{"res":"造物精华","count":3}],[{"res":"心意点数","count":15},{"res":"造物精华","count":3}]]},"云布衣":{"resId":"fluffDexCloth","pers":[0.6,0.52,0.44,0.36,0.28],"protectes":[["云布衣","星辉精华"],["云布衣","星辉精华"],["云布衣","星辉精华"],["云布衣","星辉精华"],["云布衣","星辉精华"]],"requires":[[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":20},{"res":"云絮","count":10},{"res":"金币","count":1000.0}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}],[{"res":"绒毛布料","count":25},{"res":"云絮","count":15},{"res":"金币","count":1500}]]},"霸主王冠":{"resId":"overloadCrown","pers":[0.4,0.32,0.24,0.16,0.08],"protectes":[["霸主王冠","星辉精华"],["霸主王冠","星辉精华"],["霸主王冠+1","星辉精华"],["霸主王冠+2","星辉精华"],["霸主王冠+3","星辉精华"]],"requires":[[{"res":"破碎灵魂碎片","count":10},{"res":"锈蚀锁链","count":10},{"res":"松动齿轮","count":10},{"res":"神秘精华","count":20},{"res":"金币","count":500000.0}],[{"res":"破碎灵魂碎片","count":10},{"res":"锈蚀锁链","count":10},{"res":"松动齿轮","count":10},{"res":"神秘精华","count":20},{"res":"金币","count":500000.0}],[{"res":"破碎灵魂碎片","count":10},{"res":"锈蚀锁链","count":10},{"res":"松动齿轮","count":10},{"res":"神秘精华","count":20},{"res":"金币","count":500000.0}],[{"res":"破碎灵魂碎片","count":15},{"res":"锈蚀锁链","count":15},{"res":"松动齿轮","count":15},{"res":"神秘精华","count":25},{"res":"金币","count":700000.0}],[{"res":"破碎灵魂碎片","count":15},{"res":"锈蚀锁链","count":15},{"res":"松动齿轮","count":15},{"res":"神秘精华","count":25},{"res":"金币","count":700000.0}]]},"裁缝剪刀":{"resId":"tailorScissors","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["裁缝剪刀","星辉精华"],["裁缝剪刀","星辉精华"],["裁缝剪刀","星辉精华"],["裁缝剪刀+1","星辉精华"],["裁缝剪刀+2","星辉精华"]],"requires":[[{"res":"铁","count":10},{"res":"羊绒布料","count":3}],[{"res":"铁","count":10},{"res":"羊绒布料","count":3}],[{"res":"铁","count":10},{"res":"羊绒布料","count":3}],[{"res":"铁","count":15},{"res":"羊绒布料","count":4}],[{"res":"铁","count":15},{"res":"羊绒布料","count":4}]]},"竹质弓":{"resId":"bambooBow","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["竹质弓","星辉精华"],["竹质弓","星辉精华"],["竹质弓","星辉精华"],["竹质弓","星辉精华"],["竹质弓","星辉精华"],["竹质弓+1","星辉精华"],["竹质弓+2","星辉精华"],["竹质弓+3","星辉精华"],["竹质弓+4","星辉精华"],["竹质弓+5","星辉精华"]],"requires":[[{"res":"竹子","count":10},{"res":"羊毛","count":5}],[{"res":"竹子","count":10},{"res":"羊毛","count":5}],[{"res":"竹子","count":10},{"res":"羊毛","count":5}],[{"res":"竹子","count":13},{"res":"羊毛","count":6}],[{"res":"竹子","count":13},{"res":"羊毛","count":6}],[{"res":"竹子","count":13},{"res":"羊毛","count":6}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}],[{"res":"竹子","count":16},{"res":"羊毛","count":8}]]},"光明法典":{"resId":"lumenCodex","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["光明法典","星辉精华"],["光明法典","星辉精华"],["光明法典","星辉精华"],["光明法典","星辉精华"],["光明法典","星辉精华"]],"requires":[[{"res":"魔典残页","count":10},{"res":"纯净精华","count":1},{"res":"纸","count":10}],[{"res":"魔典残页","count":10},{"res":"纯净精华","count":1},{"res":"纸","count":10}],[{"res":"魔典残页","count":10},{"res":"纯净精华","count":1},{"res":"纸","count":10}],[{"res":"魔典残页","count":15},{"res":"纯净精华","count":2},{"res":"纸","count":20}],[{"res":"魔典残页","count":15},{"res":"纯净精华","count":2},{"res":"纸","count":20}]]},"钢剑":{"resId":"steelSword","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["钢剑","星辉精华"],["钢剑","星辉精华"],["钢剑","星辉精华"],["钢剑","星辉精华"],["钢剑","星辉精华"],["钢剑+1","星辉精华"],["钢剑+2","星辉精华"],["钢剑+3","星辉精华"],["钢剑+4","星辉精华"],["钢剑+5","星辉精华"]],"requires":[[{"res":"钢","count":20},{"res":"铁","count":10}],[{"res":"钢","count":25},{"res":"铁","count":20}],[{"res":"钢","count":20},{"res":"铁","count":11}],[{"res":"钢","count":25},{"res":"铁","count":21}],[{"res":"钢","count":20},{"res":"铁","count":12}],[{"res":"钢","count":25},{"res":"铁","count":22}],[{"res":"钢","count":20},{"res":"铁","count":13}],[{"res":"钢","count":25},{"res":"铁","count":23}],[{"res":"钢","count":20},{"res":"铁","count":14}],[{"res":"钢","count":25},{"res":"铁","count":24}]]},"殇耀之爪":{"resId":"clawFallenRadiance","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["殇耀之爪","星辉精华"],["殇耀之爪","星辉精华"],["殇耀之爪+1","星辉精华"],["殇耀之爪+2","星辉精华"],["殇耀之爪+3","星辉精华"]],"requires":[[{"res":"王室碎爪","count":15},{"res":"残影碎屑","count":15},{"res":"三级战利品精华","count":5},{"res":"金币","count":30000.0}],[{"res":"王室碎爪","count":15},{"res":"残影碎屑","count":15},{"res":"三级战利品精华","count":5},{"res":"金币","count":30000.0}],[{"res":"王室碎爪","count":15},{"res":"残影碎屑","count":15},{"res":"三级战利品精华","count":5},{"res":"金币","count":30000.0}],[{"res":"王室碎爪","count":20},{"res":"残影碎屑","count":20},{"res":"三级战利品精华","count":8},{"res":"金币","count":50000.0}],[{"res":"王室碎爪","count":20},{"res":"残影碎屑","count":20},{"res":"三级战利品精华","count":8},{"res":"金币","count":50000.0}]]},"棱彩龙鳞甲":{"resId":"dragonScaleGenesisEssencArmor","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["棱彩龙鳞甲","星辉精华"],["棱彩龙鳞甲","星辉精华"],["棱彩龙鳞甲","星辉精华"],["棱彩龙鳞甲+1","星辉精华"],["棱彩龙鳞甲+2","星辉精华"]],"requires":[[{"res":"龙鳞","count":25},{"res":"造物精华","count":10}],[{"res":"龙鳞","count":25},{"res":"造物精华","count":10}],[{"res":"龙鳞","count":25},{"res":"造物精华","count":10}],[{"res":"龙鳞","count":30},{"res":"造物精华","count":15}],[{"res":"龙鳞","count":30},{"res":"造物精华","count":15}]]},"丝质可爱手套":{"resId":"silkCuteGloves","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质可爱手套","星辉精华"],["丝质可爱手套","星辉精华"],["丝质可爱手套","星辉精华"],["丝质可爱手套+1","星辉精华"],["丝质可爱手套+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"猫猫枪":{"resId":"cuteGun","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}],[{"res":"心意点数","count":10}]]},"冰羽靴":{"resId":"iceFeatherBoots","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["冰羽靴","星辉精华"],["冰羽靴","星辉精华"],["冰羽靴","星辉精华"],["冰羽靴","星辉精华"],["冰羽靴","星辉精华"]],"requires":[[{"res":"冰蝙蝠翅膀","count":7},{"res":"雪狼皮","count":7},{"res":"霜之结晶","count":1}],[{"res":"冰蝙蝠翅膀","count":7},{"res":"雪狼皮","count":7},{"res":"霜之结晶","count":1}],[{"res":"冰蝙蝠翅膀","count":7},{"res":"雪狼皮","count":7},{"res":"霜之结晶","count":1}],[{"res":"冰蝙蝠翅膀","count":10},{"res":"雪狼皮","count":10},{"res":"霜之结晶","count":2}],[{"res":"冰蝙蝠翅膀","count":10},{"res":"雪狼皮","count":10},{"res":"霜之结晶","count":2}]]},"羊毛裁缝服":{"resId":"woolTailorClothes","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["羊毛裁缝服","星辉精华"],["羊毛裁缝服","星辉精华"],["羊毛裁缝服","星辉精华"],["羊毛裁缝服+1","星辉精华"],["羊毛裁缝服+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":30}],[{"res":"羊绒布料","count":30}],[{"res":"羊绒布料","count":35}],[{"res":"羊绒布料","count":35}],[{"res":"羊绒布料","count":35}]]},"霜之王冠":{"resId":"frostCrown","pers":[0.35,0.27,0.19,0.11,0.0299999999999999],"protectes":[["霜之王冠","星辉精华"],["霜之王冠","星辉精华"],["霜之王冠","星辉精华"],["霜之王冠+1","星辉精华"],["霜之王冠+2","星辉精华"]],"requires":[[{"res":"霜之结晶","count":10},{"res":"霜之精华","count":10},{"res":"冰霜凝胶","count":10},{"res":"神秘精华","count":10}],[{"res":"霜之结晶","count":15},{"res":"霜之精华","count":15},{"res":"冰霜凝胶","count":15},{"res":"神秘精华","count":15}],[{"res":"霜之结晶","count":20},{"res":"霜之精华","count":20},{"res":"冰霜凝胶","count":20},{"res":"神秘精华","count":20}],[{"res":"霜之结晶","count":25},{"res":"霜之精华","count":25},{"res":"冰霜凝胶","count":25},{"res":"神秘精华","count":25}],[{"res":"霜之结晶","count":30},{"res":"霜之精华","count":30},{"res":"冰霜凝胶","count":30},{"res":"神秘精华","count":30}]]},"银护甲":{"resId":"silverCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["银护甲","星辉精华"],["银护甲","星辉精华"],["银护甲","星辉精华"],["银护甲","星辉精华"],["银护甲","星辉精华"],["银护甲+1","星辉精华"],["银护甲+2","星辉精华"],["银护甲+3","星辉精华"],["银护甲+4","星辉精华"],["银护甲+5","星辉精华"]],"requires":[[{"res":"银锭","count":20},{"res":"羊绒布料","count":15}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":15}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":15}],[{"res":"银锭","count":20},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":17}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":20}],[{"res":"银锭","count":25},{"res":"羊绒布料","count":20}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":20}],[{"res":"银锭","count":30},{"res":"羊绒布料","count":20}]]},"羊毛可爱帽":{"resId":"woolCuteHat","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["羊毛可爱帽","星辉精华"],["羊毛可爱帽","星辉精华"],["羊毛可爱帽","星辉精华"],["羊毛可爱帽+1","星辉精华"],["羊毛可爱帽+2","星辉精华"]],"requires":[[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"羊绒布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"暗影精铁头盔":{"resId":"shadowSteelHat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["暗影精铁头盔","星辉精华"],["暗影精铁头盔","星辉精华"],["暗影精铁头盔","星辉精华"],["暗影精铁头盔","星辉精华"],["暗影精铁头盔","星辉精华"],["暗影精铁头盔+1","星辉精华"],["暗影精铁头盔+2","星辉精华"],["暗影精铁头盔+3","星辉精华"],["暗影精铁头盔+4","星辉精华"],["暗影精铁头盔+5","星辉精华"]],"requires":[[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":30}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":35}],[{"res":"暗影精铁","count":40},{"res":"银头盔","count":1}],[{"res":"暗影精铁","count":40},{"res":"银头盔","count":1}],[{"res":"暗影精铁","count":40},{"res":"银头盔","count":1}]]},"棱彩羽毛笔":{"resId":"genesisEssenceOwlQuillpen","pers":[0.5,0.45,0.4,0.35,0.3,0.25,0.2,0.15,0.1,0.0500000000000001],"protectes":[["棱彩羽毛笔","星辉精华"],["棱彩羽毛笔","星辉精华"],["棱彩羽毛笔","星辉精华"],["棱彩羽毛笔+1","星辉精华"],["棱彩羽毛笔+2","星辉精华"],["棱彩羽毛笔+3","星辉精华"],["棱彩羽毛笔+4","星辉精华"],["棱彩羽毛笔+5","星辉精华"],["棱彩羽毛笔+6","星辉精华"],["棱彩羽毛笔+7","星辉精华"]],"requires":[[{"res":"魔法猫头鹰羽毛","count":15},{"res":"知识精华","count":10},{"res":"造物精华","count":5},{"res":"金币","count":50000.0}],[{"res":"魔法猫头鹰羽毛","count":15},{"res":"知识精华","count":10},{"res":"造物精华","count":5},{"res":"金币","count":50000.0}],[{"res":"魔法猫头鹰羽毛","count":15},{"res":"知识精华","count":10},{"res":"造物精华","count":5},{"res":"金币","count":50000.0}],[{"res":"魔法猫头鹰羽毛","count":15},{"res":"知识精华","count":10},{"res":"造物精华","count":5},{"res":"金币","count":50000.0}],[{"res":"魔法猫头鹰羽毛","count":20},{"res":"知识精华","count":15},{"res":"造物精华","count":8},{"res":"金币","count":80000.0}],[{"res":"魔法猫头鹰羽毛","count":20},{"res":"知识精华","count":15},{"res":"造物精华","count":8},{"res":"金币","count":80000.0}],[{"res":"魔法猫头鹰羽毛","count":20},{"res":"知识精华","count":15},{"res":"造物精华","count":8},{"res":"金币","count":80000.0}],[{"res":"魔法猫头鹰羽毛","count":20},{"res":"知识精华","count":15},{"res":"造物精华","count":8},{"res":"金币","count":80000.0}],[{"res":"魔法猫头鹰羽毛","count":25},{"res":"知识精华","count":20},{"res":"造物精华","count":12},{"res":"金币","count":100000.0}],[{"res":"魔法猫头鹰羽毛","count":25},{"res":"知识精华","count":20},{"res":"造物精华","count":12},{"res":"金币","count":100000.0}]]},"黑化猫猫剑":{"resId":"darkingCuteSword","pers":[0.4,0.4,0.4,0.4,0.4],"protectes":[["心意点数"],["心意点数"],["心意点数"],["心意点数"],["心意点数"]],"requires":[[{"res":"心意点数","count":12},{"res":"黑暗结晶","count":10},{"res":"暗影法球","count":10},{"res":"暗能符片","count":10},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"黑暗结晶","count":10},{"res":"暗影法球","count":10},{"res":"暗能符片","count":10},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"黑暗结晶","count":10},{"res":"暗影法球","count":10},{"res":"暗能符片","count":10},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"黑暗结晶","count":10},{"res":"暗影法球","count":10},{"res":"暗能符片","count":10},{"res":"闪光岩","count":10}],[{"res":"心意点数","count":12},{"res":"黑暗结晶","count":10},{"res":"暗影法球","count":10},{"res":"暗能符片","count":10},{"res":"闪光岩","count":10}]]},"星辰魔法书":{"resId":"starDustMagicBook","pers":[0.65,0.57,0.49,0.41,0.33],"protectes":[["星辰魔法书","星辉精华"],["星辰魔法书","星辉精华"],["星辰魔法书","星辉精华"],["星辰魔法书+1","星辉精华"],["星辰魔法书+2","星辉精华"]],"requires":[[{"res":"纸","count":10},{"res":"星尘","count":12},{"res":"星辉遗物","count":1}],[{"res":"纸","count":10},{"res":"星尘","count":12},{"res":"星辉遗物","count":1}],[{"res":"纸","count":10},{"res":"星尘","count":12},{"res":"星辉遗物","count":1}],[{"res":"纸","count":15},{"res":"星尘","count":18},{"res":"星辉遗物","count":2}],[{"res":"纸","count":15},{"res":"星尘","count":18},{"res":"星辉遗物","count":2}]]},"木法杖":{"resId":"woodStaff","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["木法杖","星辉精华"],["木法杖","星辉精华"],["木法杖","星辉精华"],["木法杖","星辉精华"],["木法杖","星辉精华"],["木法杖+1","星辉精华"],["木法杖+2","星辉精华"],["木法杖+3","星辉精华"],["木法杖+4","星辉精华"],["木法杖+5","星辉精华"]],"requires":[[{"res":"木材","count":30},{"res":"神秘精华","count":2}],[{"res":"木材","count":35},{"res":"神秘精华","count":2}],[{"res":"木材","count":30},{"res":"神秘精华","count":3}],[{"res":"木材","count":35},{"res":"神秘精华","count":3}],[{"res":"木材","count":30},{"res":"神秘精华","count":4}],[{"res":"木材","count":35},{"res":"神秘精华","count":4}],[{"res":"木材","count":30},{"res":"神秘精华","count":5}],[{"res":"木材","count":35},{"res":"神秘精华","count":5}],[{"res":"木材","count":30},{"res":"神秘精华","count":6}],[{"res":"木材","count":35},{"res":"神秘精华","count":6}]]},"木剑":{"resId":"woodSword","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["木剑","星辉精华"],["木剑","星辉精华"],["木剑","星辉精华"],["木剑+1","星辉精华"],["木剑+2","星辉精华"]],"requires":[[{"res":"铁","count":20}],[{"res":"铁","count":25}],[{"res":"铁","count":30}],[{"res":"铁","count":35}],[{"res":"铁","count":40}]]},"丝质战斗披风":{"resId":"silkWarriorCloak","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质战斗披风","星辉精华"],["丝质战斗披风","星辉精华"],["丝质战斗披风","星辉精华"],["丝质战斗披风","星辉精华"],["丝质战斗披风","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"狼牙","count":6}],[{"res":"丝绸布料","count":20},{"res":"狼牙","count":6}],[{"res":"丝绸布料","count":25},{"res":"狼牙","count":8}],[{"res":"丝绸布料","count":25},{"res":"狼牙","count":8}],[{"res":"丝绸布料","count":25},{"res":"狼牙","count":8}]]},"铁护腿":{"resId":"ironPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["铁护腿","星辉精华"],["铁护腿","星辉精华"],["铁护腿","星辉精华"],["铁护腿","星辉精华"],["铁护腿","星辉精华"],["铁护腿+1","星辉精华"],["铁护腿+2","星辉精华"],["铁护腿+3","星辉精华"],["铁护腿+4","星辉精华"],["铁护腿+5","星辉精华"]],"requires":[[{"res":"铁","count":25}],[{"res":"铁","count":30}],[{"res":"铁","count":35}],[{"res":"铁","count":40}],[{"res":"铁","count":45}],[{"res":"铁","count":50}],[{"res":"铁","count":55}],[{"res":"铁","count":60}],[{"res":"铁","count":65}],[{"res":"铁","count":70}]]},"yixiao的感谢之帽":{"resId":"yixiaosCuteHat","pers":[0,0,0,0,0],"protectes":[[],[],[],[],[]],"requires":[[],[],[],[],[]]},"秘银手套":{"resId":"mithrilGloves","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["秘银手套","星辉精华"],["秘银手套","星辉精华"],["秘银手套","星辉精华"],["秘银手套","星辉精华"],["秘银手套","星辉精华"],["秘银手套+1","星辉精华"],["秘银手套+2","星辉精华"],["秘银手套+3","星辉精华"],["秘银手套+4","星辉精华"],["秘银手套+5","星辉精华"]],"requires":[[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":30}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":35}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}],[{"res":"秘银锭","count":40}]]},"彩虹项链":{"resId":"rainbowNecklace","pers":[0.7,0.66,0.58,0.5,0.42],"protectes":[["彩虹项链","星辉精华"],["彩虹项链","星辉精华"],["彩虹项链","星辉精华"],["彩虹项链+1","星辉精华"],["彩虹项链+2","星辉精华"]],"requires":[[{"res":"彩虹碎片","count":15}],[{"res":"彩虹碎片","count":15}],[{"res":"彩虹碎片","count":15}],[{"res":"彩虹碎片","count":20}],[{"res":"彩虹碎片","count":20}]]},"云行靴":{"resId":"cloudwalkerBoots","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["云行靴","星辉精华"],["云行靴","星辉精华"],["云行靴","星辉精华"],["云行靴+1","星辉精华"],["云行靴+2","星辉精华"]],"requires":[[{"res":"云絮","count":15},{"res":"丝绸布料","count":12},{"res":"羊绒布料","count":6}],[{"res":"云絮","count":15},{"res":"丝绸布料","count":12},{"res":"羊绒布料","count":6}],[{"res":"云絮","count":15},{"res":"丝绸布料","count":12},{"res":"羊绒布料","count":6}],[{"res":"云絮","count":18},{"res":"丝绸布料","count":15},{"res":"羊绒布料","count":8}],[{"res":"云絮","count":18},{"res":"丝绸布料","count":15},{"res":"羊绒布料","count":8}]]},"丝质活力披肩":{"resId":"silkVitalityCloak","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质活力披肩","星辉精华"],["丝质活力披肩","星辉精华"],["丝质活力披肩","星辉精华"],["丝质活力披肩","星辉精华"],["丝质活力披肩","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"猫薄荷药剂","count":4}],[{"res":"丝绸布料","count":20},{"res":"猫薄荷药剂","count":4}],[{"res":"丝绸布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"丝绸布料","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"丝绸布料","count":25},{"res":"猫薄荷药剂","count":6}]]},"星辰合金腿甲":{"resId":"starforgedAlloyPants","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["星辰合金腿甲","星辉精华"],["星辰合金腿甲","星辉精华"],["星辰合金腿甲","星辉精华"],["星辰合金腿甲","星辉精华"],["星辰合金腿甲","星辉精华"],["星辰合金腿甲+1","星辉精华"],["星辰合金腿甲+2","星辉精华"],["星辰合金腿甲+3","星辉精华"],["星辰合金腿甲+4","星辉精华"],["星辰合金腿甲+5","星辉精华"]],"requires":[[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}]]},"黑暗法典":{"resId":"umbralCodex","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["黑暗法典","星辉精华"],["黑暗法典","星辉精华"],["黑暗法典","星辉精华"],["黑暗法典","星辉精华"],["黑暗法典","星辉精华"]],"requires":[[{"res":"魔典残页","count":10},{"res":"暗影法球","count":10},{"res":"纸","count":10}],[{"res":"魔典残页","count":10},{"res":"暗影法球","count":10},{"res":"纸","count":10}],[{"res":"魔典残页","count":10},{"res":"暗影法球","count":10},{"res":"纸","count":10}],[{"res":"魔典残页","count":15},{"res":"暗影法球","count":15},{"res":"纸","count":20}],[{"res":"魔典残页","count":15},{"res":"暗影法球","count":15},{"res":"纸","count":20}]]},"铁抄网":{"resId":"ironDiddleNet","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["铁抄网","星辉精华"],["铁抄网","星辉精华"],["铁抄网","星辉精华"],["铁抄网+1","星辉精华"],["铁抄网+2","星辉精华"]],"requires":[[{"res":"铁","count":15},{"res":"羊毛","count":10}],[{"res":"铁","count":15},{"res":"羊毛","count":10}],[{"res":"铁","count":15},{"res":"羊毛","count":10}],[{"res":"铁","count":18},{"res":"羊毛","count":12}],[{"res":"铁","count":18},{"res":"羊毛","count":12}]]},"图书馆徽章":{"resId":"libraryKingBadge","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["图书馆徽章","星辉精华"],["图书馆徽章","星辉精华"],["图书馆徽章+1","星辉精华"],["图书馆徽章+2","星辉精华"],["图书馆徽章+3","星辉精华"]],"requires":[[{"res":"记忆残页","count":5},{"res":"战斗经历-智力","count":25},{"res":"金币","count":200000.0}],[{"res":"记忆残页","count":5},{"res":"战斗经历-智力","count":25},{"res":"金币","count":225000.0}],[{"res":"记忆残页","count":5},{"res":"战斗经历-智力","count":25},{"res":"金币","count":250000.0}],[{"res":"记忆残页","count":8},{"res":"战斗经历-智力","count":40},{"res":"金币","count":275000.0}],[{"res":"记忆残页","count":8},{"res":"战斗经历-智力","count":40},{"res":"金币","count":300000.0}]]},"钢铲":{"resId":"steelShovel","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["钢铲","星辉精华"],["钢铲","星辉精华"],["钢铲","星辉精华"],["钢铲+1","星辉精华"],["钢铲+2","星辉精华"]],"requires":[[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":15},{"res":"木材","count":6}],[{"res":"钢","count":20},{"res":"木材","count":12}],[{"res":"钢","count":20},{"res":"木材","count":12}]]},"丝质可爱帽":{"resId":"silkCuteHat","pers":[0.66,0.62,0.54,0.46,0.38],"protectes":[["丝质可爱帽","星辉精华"],["丝质可爱帽","星辉精华"],["丝质可爱帽","星辉精华"],["丝质可爱帽+1","星辉精华"],["丝质可爱帽+2","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":20},{"res":"羊绒布料","count":5}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}],[{"res":"丝绸布料","count":25},{"res":"羊绒布料","count":8}]]},"灵羽之弓":{"resId":"spiritfeatherBow","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["灵羽之弓","星辉精华"],["灵羽之弓","星辉精华"],["灵羽之弓","星辉精华"],["灵羽之弓","星辉精华"],["灵羽之弓","星辉精华"]],"requires":[[{"res":"魔法猫头鹰羽毛","count":10},{"res":"三级战利品精华","count":3}],[{"res":"魔法猫头鹰羽毛","count":10},{"res":"三级战利品精华","count":3}],[{"res":"魔法猫头鹰羽毛","count":10},{"res":"三级战利品精华","count":3}],[{"res":"魔法猫头鹰羽毛","count":12},{"res":"三级战利品精华","count":5}],[{"res":"魔法猫头鹰羽毛","count":12},{"res":"三级战利品精华","count":5}]]},"星辰合金盔甲":{"resId":"starforgedAlloylCoat","pers":[0.8,0.72,0.64,0.56,0.48,0.4,0.32,0.24,0.16,0.0800000000000001],"protectes":[["星辰合金盔甲","星辉精华"],["星辰合金盔甲","星辉精华"],["星辰合金盔甲","星辉精华"],["星辰合金盔甲","星辉精华"],["星辰合金盔甲","星辉精华"],["星辰合金盔甲+1","星辉精华"],["星辰合金盔甲+2","星辉精华"],["星辰合金盔甲+3","星辉精华"],["星辰合金盔甲+4","星辉精华"],["星辰合金盔甲+5","星辉精华"]],"requires":[[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":30},{"res":"矿物精华","count":5}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":35},{"res":"矿物精华","count":8}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}],[{"res":"星辰合金","count":40},{"res":"矿物精华","count":10}]]},"毛毛可爱帽":{"resId":"catFurCuteHat","pers":[0.8,0.72,0.64,0.32,0.16],"protectes":[["毛毛可爱帽","星辉精华"],["毛毛可爱帽","星辉精华"],["毛毛可爱帽","星辉精华"],["毛毛可爱帽","星辉精华"],["毛毛可爱帽"]],"requires":[[{"res":"猫毛球","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"猫毛球","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"猫毛球","count":20},{"res":"猫薄荷药剂","count":5}],[{"res":"猫毛球","count":25},{"res":"猫薄荷药剂","count":6}],[{"res":"猫毛球","count":25},{"res":"猫薄荷药剂","count":6}]]},"幽径之履":{"resId":"phantomWalkerBoots","pers":[0.5,0.42,0.34,0.26,0.18],"protectes":[["幽径之履","星辉精华"],["幽径之履","星辉精华"],["幽径之履","星辉精华"],["幽径之履+1","星辉精华"],["幽径之履+2","星辉精华"]],"requires":[[{"res":"云絮","count":30},{"res":"幽灵精华","count":15},{"res":"恶灵精华","count":15},{"res":"幻影之核","count":15},{"res":"织物精华","count":25}],[{"res":"云絮","count":30},{"res":"幽灵精华","count":15},{"res":"恶灵精华","count":15},{"res":"幻影之核","count":15},{"res":"织物精华","count":25}],[{"res":"云絮","count":30},{"res":"幽灵精华","count":15},{"res":"恶灵精华","count":15},{"res":"幻影之核","count":15},{"res":"织物精华","count":25}],[{"res":"云絮","count":45},{"res":"幽灵精华","count":20},{"res":"恶灵精华","count":20},{"res":"幻影之核","count":20},{"res":"织物精华","count":40}],[{"res":"云絮","count":45},{"res":"幽灵精华","count":20},{"res":"恶灵精华","count":20},{"res":"幻影之核","count":20},{"res":"织物精华","count":40}]]},"丝质裹头巾":{"resId":"silkDexHeadScarf","pers":[0.7,0.62,0.54,0.46,0.38],"protectes":[["丝质裹头巾","星辉精华"],["丝质裹头巾","星辉精华"],["丝质裹头巾","星辉精华"],["丝质裹头巾","星辉精华"],["丝质裹头巾","星辉精华"]],"requires":[[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":20},{"res":"月光铃铛","count":4}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}],[{"res":"丝绸布料","count":25},{"res":"月光铃铛","count":6}]]}}

    // 当前选中的物品
    let selectedItem = GM_getValue('selectedItem', "斧头");
    // 强化等级
    let enhancementLevel = parseInt(GM_getValue('enhancementLevel', 0));
    // 幸运等级
    let luckLevel = parseInt(GM_getValue('luckLevel', 0));;
    // 是否勾选强化专家
    let isEnhancementExpert = GM_getValue('isEnhancementExpert', false);
    // 物品价格 物品:价格
    let resPrices = GM_getValue('resPrices', {});
    // 保护物品 物品:{等级:物品}
    let protectedItems = GM_getValue('protectedItems', {});
    // 当前物品
    let itemInfo = itemProbabilities[selectedItem];
    // 当前使用的概率
    let currentProbabilities = itemInfo['pers'];
    let allRequireNames = new Set();

    // 拖动相关变量
    let isDragging = false;
    let offsetX, offsetY;
    let startX, startY; // 记录拖动开始位置
    let isClick = true; // 判断是否是点击事件

    // 窗口位置和状态
    let windowPosition = {
        x: GM_getValue('windowX', 20) > window.innerWidth - 40 ? window.innerWidth - 40 : GM_getValue('windowX', 20), // 默认右上角
        y: GM_getValue('windowY', 20) > window.innerHeight - 40 ? window.innerHeight - 40 : GM_getValue('windowY', 20),
        isMinimized: GM_getValue('isMinimized', false) // 默认不最小化
    };

    // 每级强化价格（金币）- 初始值
    let prices = GM_getValue("prices", [
        1,    // 0 → 1
        1,    // 1 → 2
        1,    // 2 → 3
        1,    // 3 → 4
        1,   // 4 → 5
        1,   // 5 → 6
        1,   // 6 → 7
        1,  // 7 → 8
        1,  // 8 → 9
        1   // 9 → 10
    ]);

    // 单次保护价格（金币）
    let protectPrices = GM_getValue("protectPrices", [
        0,    // 0 → 1
        0,    // 1 → 2
        0,    // 2 → 3
        0,    // 3 → 4
        0,   // 4 → 5
        0,   // 5 → 6
        0,   // 6 → 7
        0,  // 7 → 8
        0,  // 8 → 9
        0   // 9 → 10
    ]);
    // 是否使用妙妙工具
    let miaomiaoTools = false;

    // 添加完整CSS样式
    GM_addStyle(`
        #enhancement-simulator {
            position: fixed;
            right: auto;
            top: ${windowPosition.y}px;
            left: ${windowPosition.x}px;
            width: 80%;
            max-width: 1300px;
            background: rgba(30, 40, 80, 0.95);
            border-radius: 15px;
            padding: 15px;
            box-shadow: 0 10px 30px rgba(0,0,0,0.5);
            backdrop-filter: blur(10px);
            z-index: 10000;
            color: white;
            border: 1px solid #3498db;
            max-height: 90vh;
            overflow-y: auto;
            transition: transform 0.3s ease, height 0.3s ease;
            display: ${windowPosition.isMinimized ? 'none' : 'block'};
        }

        .simulator-header {
            display: flex;
            justify-content: space-between;
            align-items: center;
            margin-bottom: 25px;
            padding-bottom: 15px;
            border-bottom: 2px solid #3498db;
            cursor: move; /* 显示拖动光标 */
        }

        .simulator-title {
            font-size: 1.6rem;
            font-weight: bold;
            color: #3498db;
        }

        .toolbar {
            display: flex;
            gap: 10px;
        }

        .toolbar-btn {
            background: none;
            border: none;
            color: white;
            font-size: 1.5rem;
            cursor: pointer;
            width: 30px;
            height: 30px;
            display: flex;
            align-items: center;
            justify-content: center;
            border-radius: 50%;
            transition: background 0.2s;
        }

        .toolbar-btn:hover {
            background: rgba(255,255,255,0.1);
        }

        .minimize-btn::before {
            content: '−';
        }

        .restore-btn {
            position: fixed;
            background: rgba(30, 40, 80, 0.95);
            color: white;
            border: 1px solid #3498db;
            border-radius: 50%;
            top: ${windowPosition.y}px;
            left: ${windowPosition.x}px;
            width: 40px;
            height: 40px;
            font-size: 1.5rem;
            align-items: center;
            justify-content: center;
            cursor: pointer;
            box-shadow: 0 5px 15px rgba(0,0,0,0.3);
            transition: all 0.2s;
            z-index: 10001;
            display: ${windowPosition.isMinimized ? 'flex' : 'none'};
            cursor: move; /* 显示拖动光标 */
        }

        .restore-btn:hover {
            background: rgba(40, 50, 90, 0.95);
            transform: scale(1.05);
            zIndex:999999;
        }

        /* 拖动时的样式 */
        .simulator-header:active {
            cursor: grabbing;
        }

        /* 其他现有样式保持不变... */
        .control-group {
            margin-bottom: 15px;
        }

        .control-label {
            display: block;
            margin-bottom: 8px;
            font-size: 1rem;
            color: #bdc3c7;
        }

        /* 统一输入框高度 */
        .control-input {
            width: 100%;
            padding: 12px; /* 增加内边距，提高高度 */
            border: 1px solid #3498db;
            border-radius: 6px;
            background: rgba(255,255,255,0.1);
            color: white;
            font-size: 1.05rem;
            height: 44px; /* 统一高度 */
            box-sizing: border-box;
        }

        /* 搜索下拉框样式 */
        .search-select {
            position: relative;
            width: 100%;
        }

        .search-input {
            width: 100%;
            padding: 12px;
            border: 1px solid #3498db;
            border-radius: 6px;
            background: rgba(255,255,255,0.1);
            color: white;
            font-size: 1.05rem;
            height: 44px;
            box-sizing: border-box;
            cursor: pointer;
        }

        .search-results {
            position: absolute;
            top: 100%;
            left: 0;
            right: 0;
            max-height: 200px;
            overflow-y: auto;
            background: rgba(30, 40, 80, 0.95);
            border: 1px solid #3498db;
            border-radius: 6px;
            margin-top: 4px;
            z-index: 100;
            display: none;
        }

        .search-result-item {
            padding: 10px;
            cursor: pointer;
            transition: background 0.2s;
            autocomplete :off
        }

        .search-result-item:hover {
            background: rgba(52, 152, 219, 0.1);
        }

        .search-result-item.selected {
            background: rgba(52, 152, 219, 0.2);
        }

        .search-protected {
            position: absolute;
            top: 100%;
            left: 0;
            right: 0;
            max-height: 200px;
            overflow-y: auto;
            background: rgba(30, 40, 80, 0.95);
            border: 1px solid #3498db;
            border-radius: 6px;
            margin-top: 4px;
            z-index: 100;
            display: none;
        }

        .search-protected-item {
            padding: 10px;
            cursor: pointer;
            transition: background 0.2s;
            autocomplete :off
        }

        .search-protected-item:hover {
            background: rgba(52, 152, 219, 0.1);
        }

        .search-protected-item.selected {
            background: rgba(52, 152, 219, 0.2);
        }

        /* 下拉框样式 */
        select.control-input {
            padding: 12px; /* 增加内边距 */
            height: 44px; /* 统一高度 */
        }

        /* 下拉框选项样式 */
        select.control-input option {
            background: rgba(30, 40, 80, 0.95);
            color: white;
            border: none;
        }

        .btn-group {
            display: flex;
            gap: 15px;
            margin: 20px 0;
        }

        .simulator-btn {
            padding: 10px;
            border: none;
            border-radius: 6px;
            cursor: pointer;
            font-size: 1.05rem;
            font-weight: bold;
            transition: all 0.2s;
            min-width: 150px;
        }

        .btn-calculate {
            background: #3498db;
            color: white;
        }

        .btn-calculate:hover {
            background: #2980b9;
        }

        .result-section {
            width: 100%;
            margin: 25px 0;
            padding: 20px;
            background: rgba(255,255,255,0.05);
            border-radius: 10px;
        }

        .result-title {
            font-size: 1.2rem;
            font-weight: bold;
            margin-bottom: 15px;
            color: #3498db;
            padding-bottom: 10px;
            border-bottom: 1px solid rgba(52, 152, 219, 0.3);
        }

        .result-item {
            display: flex;
            justify-content: space-between;
            margin-bottom: 10px;
            padding: 6px 0;
        }

        .result-item span:first-child {
            color: #bdc3c7;
        }

        .result-value {
            font-weight: bold;
            color: #ecf0f1;
        }

        .table-container {
            width: 100%;
            margin: 20px 0;
            overflow-x: auto;
        }

        .res-table {
            width: 100%;
            border-collapse: collapse;
        }

        .res-th, .res-td {
            padding: 10px 15px;
            text-align: left;
            border-bottom: 1px solid #ddd;
            min-width: 140px;
            width: auto;
        }

        .res-th {
            color: #3498db;
            font-weight: bold;
            position: sticky;
            top: 0;
            z-index: 10;
        }

        .res-tr:hover {
            background-color: #f9f9f9;
        }

        .scroll-indicator {
            width: 100%;
            height: 4px;
            background-color: #f1f1f1;
            margin-top: -2px;
            border-radius: 0 0 4px 4px;
        }

        .scroll-progress {
            height: 100%;
            background-color: #4CAF50;
            width: 0%;
            border-radius: 0 0 4px 4px;
        }


        .results-table {
            width: 100%;
            border-collapse: collapse;
            margin: 15px 0;
        }

        .results-table th,
        .results-table td {
            padding: 14px;
            text-align: left;
            border-bottom: 1px solid rgba(52, 152, 219, 0.2);
        }

        .results-table th {
            background: rgba(52, 152, 219, 0.1);
            color: #3498db;
            font-weight: bold;
        }

        .results-table tr:nth-child(even) {
            background: rgba(255,255,255,0.03);
        }

        .results-table tr:hover {
            background: rgba(52, 152, 219, 0.05);
        }

        .expand-btn {
            background: none;
            border: none;
            color: #3498db;
            cursor: pointer;
            font-size: 1rem;
            text-decoration: underline;
        }

        .detail-row {
            display: none;
        }

        .detail-table {
            width: 100%;
            margin-top: 12px;
            border-collapse: collapse;
        }

        .detail-table th,
        .detail-table td {
            padding: 10px;
            border: 1px solid rgba(52, 152, 219, 0.2);
        }

        .detail-table th {
            background: rgba(52, 152, 219, 0.05);
            font-weight: normal;
            font-size: 1rem;
        }

        .enhancement-price {
            margin: 25px 0;
            padding: 20px;
            background: rgba(255,255,255,0.05);
            border-radius: 10px;
        }

        .price-item {
            display: flex;
            justify-content: space-between;
            margin-bottom: 8px;
        }

        .price-label {
            color: #bdc3c7;
            font-size: 1.05rem;
            white-space: nowrap;
        }

        .price-input {
            width: 100px;
            padding: 8px;
            border: 1px solid #3498db;
            border-radius: 5px;
            background: rgba(255,255,255,0.1);
            color: white;
            text-align: right;
            font-size: 1.05rem;
        }

        .highlight-row {
            background: rgba(46, 204, 113, 0.15) !important;
            border-left: 4px solid #2ecc71;
        }

        .flex-container {
            display: flex;
            gap: 25px;
            margin-bottom: 10px;
        }

        .flex-item {

            flex: 1;
        }

        .flex-item-large {
            flex: 2.5;
        }

        .control-group-inline {
            flex: 1;
            margin-right: 20px;
        }

        .btn-container {
            flex: 1.2;
            display: flex;
            align-items: flex-end;
        }

        #enhancement-simulator .refresh-icon {
            cursor: pointer;
            font-size: 18px;
            transition: all 0.2s ease;
            user-select: none; 
        }

        /* 点击时的样式 */
        #enhancement-simulator .refresh-icon:active {
            transform: scale(0.9); 
            opacity: 0.6; 
            filter: brightness(0.7); 
        }

        #enhancement-simulator .refresh-icon:hover {
            transform: rotate(15deg); 
        }

        /* 移动端适配 - 小于768px */
        @media (max-width: 768px) {
            /* 布局调整为垂直排列 */
            .flex-container {
                flex-direction: column;
                gap: 15px;
            }

            .btn-container {
                margin-top: 15px;
            }
            /* 输入框和按钮宽度调整 */
            .control-input,
            .simulator-btn,
            select.control-input,
            .search-input {
                width: 100% !important;
                max-width: none !important;
                border: 1px solid #3498db;
            }

            /* 表格响应式处理 */
            .table-container {
                overflow-x: auto;
            }

            .results-table, .detail-table {
                min-width: 600px;
            }

            /* 工具栏和标题样式 */
            .simulator-title {
                font-size: 1.2rem;
            }

            .toolbar-btn {
                font-size: 1.2rem;
            }

            /* 结果区域样式 */
            .result-section, .enhancement-price {
                padding: 15px;
                margin: 15px 0;
            }

            /* 隐藏详细信息，默认只显示摘要 */
            .detail-row {
                display: none !important;
            }

            /* 价格输入区域样式 */
            .price-item {
                flex-wrap: wrap;
            }

            .price-label {
                flex-basis: 100%;
                margin-bottom: 5px;
            }

            .price-input {
                width: 100% !important;
                text-align: left;
            }

            /* 保护物品选择框样式 */
            .search-protected {
                width: 100%;
                max-width: none;
            }
        }

        /* 中等屏幕适配 - 768px到1024px */
        @media (min-width: 768px) and (max-width: 1024px) {
            #enhancement-simulator {
                width: 90%;
            }

            .flex-container {
                flex-wrap: wrap;
            }

            .flex-item, .flex-item-large {
                flex-basis: 100%;
            }
        }
    `);


    // 创建UI界面
    function createUI() {
        const container = document.createElement('div');
        container.id = 'enhancement-simulator';
        container.innerHTML = `
            <div class="simulator-header">
                <div class="simulator-title">摸鱼强化模拟器</div>
                <div class="toolbar">
                    <button class="toolbar-btn minimize-btn" id="minimize-simulator"></button>
                </div>
            </div>

            <div class="flex-container">
                <div class="control-group-inline">
                    <label class="control-label">选择物品</label>
                    <div class="search-select">
                        <input type="text" class="search-input" autocomplete="off" id="itemSearch" placeholder="搜索或选择物品" value="${selectedItem}">
                        <div class="search-results" id="itemResults" >
                            ${Object.keys(itemProbabilities).map(item =>
            `<div class="search-result-item ${item === selectedItem ? 'selected' : ''}" data-item="${item}" >${item}</div>`
        ).join('')}
                        </div>
                    </div>
                </div>

                <div class="control-group-inline">
                    <label class="control-label">强化等级</label>
                    <input type="number" class="control-input" id="enhancementLevel" value="${enhancementLevel}" min="0" max="100" step="1" style="width: 75%;">
                </div>

                <div class="control-group-inline">
                    <label class="control-label">幸运等级</label>
                    <input type="number" class="control-input" id="luckLevel" value="${luckLevel}" min="0" max="100" step="1" style="width: 75%;">
                </div>

                <div class="control-group-inline">
                    <label class="control-label">强化专家</label>
                    <input type="checkbox" id="isEnhancementExpertCheckbox" ${isEnhancementExpert ? 'checked' : ''}>
                </div>

                <div class="control-group-inline">
                    <label class="control-label">目标强化等级</label>
                    <select class="control-input" id="targetLevel" style="width: 75%;">
                        ${generateTargetLevelOptions()}
                    </select>
                </div>

                <div class="control-group-inline">
                    <label class="control-label">单次强化时间</label>
                    <input type="number" class="control-input" id="enhanceTime" value="2" min="0.1" step="0.1" style="width: 75%;">
                </div>

                <div class="btn-container">
                    <button class="simulator-btn btn-calculate" id="calculate-btn" style="width: 75%;">计算</button>
                </div>
            </div>

            <div class="flex-container" style="display: flex;">
                <div class="flex-item ">
                    <div class="enhancement-price">
                        <div class="result-title">
                        <span>材料价格及保护物品</span>
                        <span id="refresh-price-btn" class="refresh-icon">🔄</span>
                        </div>
                        <div id="priceList"></div>
                    </div>
                </div>

                <div class="flex-item-large">
                    <div class="result-section">
                        <div class="result-title">强化结果统计</div>
                        <div class="table-container" style="width: 880px;">
                            <table class="results-table res-table">
                                <thead id="resultsThead">
                                    <tr class="res-tr">
                                        <th class="res-th">保护等级</th>
                                        <th class="res-th">总金币</th>
                                        <th class="res-th">总次数</th>
                                        <th class="res-th">保护次数</th>
                                        <th class="res-th" >总时间(分)</th>

                                        <th class="res-th">详情</th>
                                    </tr>
                                </thead>
                                <tbody id="resultsBody">
                                    <!-- 结果将在这里显示 -->
                                </tbody>
                            </table>
                        </div>
                        <!--
                        <div class="scroll-indicator">
                             <div id="scrollIndicator" class="scroll-progress"></div>
                        </div>
                        -->
                    </div>
                </div>
            </div>
        `;

        document.body.appendChild(container);

        // 添加还原按钮
        const restoreBtn = document.createElement('button');
        restoreBtn.className = 'restore-btn';
        restoreBtn.id = 'restore-simulator';
        restoreBtn.innerHTML = '↑';
        document.body.appendChild(restoreBtn);

        // 初始化UI
        document.getElementById('targetLevel').addEventListener('change', updatePriceList);

        // 物品搜索功能
        const itemSearch = document.getElementById('itemSearch');
        const itemResults = document.getElementById('itemResults');

        // 点击搜索框显示结果
        itemSearch.addEventListener('click', function (e) {
            e.stopPropagation();
            itemResults.style.display = 'block';
            filterItems(this.value, document.querySelectorAll('.search-result-item')); // 显示所有项目
        });

        // 输入搜索内容
        itemSearch.addEventListener('input', function () {
            filterItems(this.value, document.querySelectorAll('.search-result-item'));
        });

        // 点击选择项目
        document.querySelectorAll('.search-result-item').forEach(item => {
            item.addEventListener('click', function () {
                selectedItem = this.getAttribute('data-item');
                itemInfo = itemProbabilities[selectedItem];
                currentProbabilities = itemInfo['pers'];
                itemSearch.value = selectedItem;
                GM_setValue('selectedItem', selectedItem)

                // 更新目标等级下拉框
                const targetLevel = document.getElementById('targetLevel');
                targetLevel.innerHTML = generateTargetLevelOptions();

                // 更新价格列表
                updatePriceList();

                // 隐藏结果列表
                itemResults.style.display = 'none';

                // 更新选中状态
                document.querySelectorAll('.search-result-item').forEach(i => {
                    i.classList.remove('selected');
                });
                this.classList.add('selected');
            });
        });

        // 点击页面其他地方关闭搜索结果
        document.addEventListener('click', function () {
            itemResults.style.display = 'none';
        });

        // 防止点击结果列表时关闭
        itemResults.addEventListener('click', function (e) {
            e.stopPropagation();
        });

        // 添加强化等级输入框事件
        document.getElementById('enhancementLevel').addEventListener('input', function () {
            enhancementLevel = parseInt(this.value) || 0;
            GM_setValue('enhancementLevel', enhancementLevel);
        });

        // 添加强化等级输入框事件
        document.getElementById('luckLevel').addEventListener('input', function () {
            luckLevel = parseFloat(this.value) || 0;
            GM_setValue('luckLevel', luckLevel);
        });

        // 添加强化专家勾选框事件
        const isEnhancementExpertCheckbox = document.getElementById('isEnhancementExpertCheckbox');
        isEnhancementExpertCheckbox.addEventListener('change', function () {
            isEnhancementExpert = this.checked;
            GM_setValue('isEnhancementExpert', isEnhancementExpert);
        });

        // 添加最小化事件监听器
        const minimizeBtn = document.getElementById('minimize-simulator')
        minimizeBtn.addEventListener('click', minimizeSimulator);
        minimizeBtn.addEventListener('touchend', (e) => {
            e.preventDefault();
            e.stopPropagation();
            minimizeSimulator();
        });
        // 修改还原按钮事件，只在点击时恢复，拖动时不恢复
        document.getElementById('restore-simulator').addEventListener('click', function (e) {
            // 只有当没有发生拖动时才执行恢复操作
            if (isClick) {
                restoreSimulator();
            }
            // 重置点击状态
            isClick = true;
        });

        // 添加计算按钮事件
        document.getElementById('calculate-btn').addEventListener('click', calculateAll);

        // 初始化拖动功能
        initDrag(container);
        initRestoreBtnDrag(restoreBtn); // 初始化还原按钮拖动功能
        // 为价格输入框添加实时更新
        for (let i = 0; i < prices.length; i++) {
            const inputId = `price-${i}`;
            const input = document.getElementById(inputId);
            if (input) {
                input.addEventListener('input', function () {
                    prices[i] = parseInt(this.value) || 0;
                    GM_setValue('prices', prices);
                });
            }
        }

        // 为价格输入框添加实时更新
        for (let i = 0; i < protectPrices.length; i++) {
            const inputId = `protectPrice-${i}`;
            const input = document.getElementById(inputId);
            if (input) {
                input.addEventListener('input', function () {
                    protectPrices[i] = parseInt(this.value) || 0;
                    GM_setValue('protectPrices', protectPrices);
                }, { passive: true });
            }
        }

        document.getElementById('refresh-price-btn').addEventListener('click', function () {
            updatePriceList();
        })
        // 加载保存的设置
        loadSettings();

    }

    // 最小化模拟器
    function minimizeSimulator(e) {

        const container = document.getElementById('enhancement-simulator');
        const restoreBtn = document.getElementById('restore-simulator');
        const minimizeBtn = document.getElementById('minimize-simulator');

        // 获取最小化按钮的位置
        const minimizeBtnRect = minimizeBtn.getBoundingClientRect();

        // var width = minimizeBtnRect.left + window.scrollX - 20 > window.innerWidth? window.innerWidth - 20 : minimizeBtnRect.left + window.scrollX - 20;
        // var height = minimizeBtnRect.top + window.scrollY - 20 > window.innerHeight? window.innerHeight - 20 : minimizeBtnRect.top + window.scrollY - 20;

        // 设置还原按钮的位置为最小化按钮的位置
        restoreBtn.style.left = `${windowPosition.x}px`; // 居中调整
        restoreBtn.style.top = `${windowPosition.y}px`;  // 居中调整

        container.style.display = 'none';
        restoreBtn.style.display = 'flex';

        windowPosition.isMinimized = true;
        saveWindowState();
    }

    // 还原模拟器
    function restoreSimulator() {
        const container = document.getElementById('enhancement-simulator');
        const restoreBtn = document.getElementById('restore-simulator');

        container.style.display = 'block';
        restoreBtn.style.display = 'none';

        windowPosition.isMinimized = false;
        saveWindowState();
    }

    // 修改初始化拖动功能函数，添加触摸事件支持
    function initDrag(element) {
        const header = element.querySelector('.simulator-header');

        // 鼠标事件
        header.addEventListener('mousedown', startDrag);
        document.addEventListener('mousemove', drag);
        document.addEventListener('mouseup', stopDrag);

        // 触摸事件
        header.addEventListener('touchstart', startDrag, { passive: false });
        document.addEventListener('touchmove', drag, { passive: false });
        document.addEventListener('touchend', stopDrag);

        function startDrag(e) {
            // 阻止默认行为，防止页面滚动
            e.preventDefault();

            isDragging = true;

            // 获取触摸位置
            const touch = e.type.includes('mouse') ? e : e.touches[0];
            offsetX = touch.clientX - element.getBoundingClientRect().left;
            offsetY = touch.clientY - element.getBoundingClientRect().top;

            // 提高z-index，确保拖动时在最上层
            element.style.zIndex = 10001;
        }

        function drag(e) {
            if (!isDragging) return;

            // 阻止默认行为，防止页面滚动
            e.preventDefault();

            // 获取触摸位置
            const touch = e.type.includes('mouse') ? e : e.touches[0];

            // 计算新位置
            let newX = touch.clientX - offsetX;
            let newY = touch.clientY - offsetY;

            // 限制在视口内
            newX = Math.max(0, Math.min(newX, window.innerWidth - 40));
            newY = Math.max(0, Math.min(newY, window.innerHeight - 40));

            // 更新位置
            element.style.left = `${newX}px`;
            element.style.top = `${newY}px`;

            // 保存位置
            windowPosition.x = newX;
            windowPosition.y = newY;
        }

        function stopDrag() {
            if (!isDragging) return;

            isDragging = false;
            element.style.zIndex = 10000;

            // 保存窗口位置
            saveWindowState();
        }
    }

    // 同样修改还原按钮的拖动功能，添加触摸支持
    function initRestoreBtnDrag(element) {
        // 鼠标事件
        element.addEventListener('mousedown', startDrag);
        document.addEventListener('mousemove', drag);
        document.addEventListener('mouseup', stopDrag);

        // 触摸事件
        element.addEventListener('touchstart', startDrag, { passive: false });
        document.addEventListener('touchmove', drag, { passive: false });
        document.addEventListener('touchend', stopDrag);

        function startDrag(e) {
            // 阻止默认行为，防止页面滚动
            e.preventDefault();

            isDragging = true;

            // 获取触摸位置
            const touch = e.type.includes('mouse') ? e : e.touches[0];
            offsetX = touch.clientX - element.getBoundingClientRect().left;
            offsetY = touch.clientY - element.getBoundingClientRect().top;
            startX = touch.clientX;
            startY = touch.clientY;

            // 提高z-index，确保拖动时在最上层
            element.style.zIndex = 10002;

            // 阻止事件冒泡，防止触发点击事件
            e.stopPropagation();
        }

        function drag(e) {
            if (!isDragging) return;

            // 阻止默认行为，防止页面滚动
            e.preventDefault();

            // 获取触摸位置
            const touch = e.type.includes('mouse') ? e : e.touches[0];

            // 计算新位置
            let newX = touch.clientX - offsetX;
            let newY = touch.clientY - offsetY;

            // 限制在视口内
            newX = Math.max(0, Math.min(newX, window.innerWidth - element.offsetWidth));
            newY = Math.max(0, Math.min(newY, window.innerHeight - element.offsetHeight));

            // 更新位置
            element.style.left = `${newX}px`;
            element.style.top = `${newY}px`;
            element.style.right = 'auto'; // 清除右侧定位

            // 保存还原按钮位置
            windowPosition.restoreBtnX = newX;
            windowPosition.restoreBtnY = newY;

            // 如果拖动距离超过阈值，则认为不是点击事件
            if (Math.abs(touch.clientX - startX) > 5 || Math.abs(touch.clientY - startY) > 5) {
                isClick = false;
            }
        }

        function stopDrag() {
            if (!isDragging) return;

            isDragging = false;
            element.style.zIndex = 10001;

            // 保存还原按钮位置
            saveRestoreBtnPosition();
        }
    }

    // 原有代码...
    // 初始化还原按钮拖动功能
    function initRestoreBtnDrag(element) {
        element.addEventListener('mousedown', startDrag);
        document.addEventListener('mousemove', drag);
        document.addEventListener('mouseup', stopDrag);

        function startDrag(e) {
            isDragging = true;
            offsetX = e.clientX - element.getBoundingClientRect().left;
            offsetY = e.clientY - element.getBoundingClientRect().top;
            startX = e.clientX;
            startY = e.clientY;

            // 提高z-index，确保拖动时在最上层
            element.style.zIndex = 10002;

            // 阻止事件冒泡，防止触发点击事件
            e.stopPropagation();
        }

        function drag(e) {
            if (!isDragging) return;

            // 计算新位置
            let newX = e.clientX - offsetX;
            let newY = e.clientY - offsetY;

            // 限制在视口内
            newX = Math.max(0, Math.min(newX, window.innerWidth - element.offsetWidth));
            newY = Math.max(0, Math.min(newY, window.innerHeight - element.offsetHeight));

            // 更新位置
            element.style.left = `${newX}px`;
            element.style.top = `${newY}px`;
            element.style.right = 'auto'; // 清除右侧定位

            // 保存还原按钮位置
            windowPosition.restoreBtnX = newX;
            windowPosition.restoreBtnY = newY;

            // 如果拖动距离超过阈值，则认为不是点击事件
            if (Math.abs(e.clientX - startX) > 5 || Math.abs(e.clientY - startY) > 5) {
                isClick = false;
            }
        }

        function stopDrag() {
            if (!isDragging) return;

            isDragging = false;
            element.style.zIndex = 10001;

            // 保存还原按钮位置
            saveRestoreBtnPosition();
        }
    }

    // 保存窗口状态
    function saveWindowState() {
        GM_setValue('windowX', windowPosition.x);
        GM_setValue('windowY', windowPosition.y);
        GM_setValue('isMinimized', windowPosition.isMinimized);
    }

    // 保存还原按钮位置
    function saveRestoreBtnPosition() {
        GM_setValue('restoreBtnX', windowPosition.restoreBtnX);
        GM_setValue('restoreBtnY', windowPosition.restoreBtnY);
    }

    // 生成目标等级选项
    function generateTargetLevelOptions() {
        const maxLevel = currentProbabilities.length || 0;
        let options = '';

        // 获取当前保存的目标等级
        const savedTargetLevel = GM_getValue('targetLevel', maxLevel);
        // 确保保存的等级不超过当前物品的最大等级
        const safeTargetLevel = Math.min(savedTargetLevel, maxLevel);

        for (let i = 1; i <= maxLevel; i++) {
            options += `<option value="${i}" ${i === safeTargetLevel ? 'selected' : ''}>${i}级</option>`;
        }
        return options;
    }

    // 过滤搜索结果
    function filterItems(keyword, items) {
        const lowerKeyword = keyword?.toLowerCase() || '';

        items.forEach(item => {
            const itemText = item.textContent.toLowerCase();
            if (lowerKeyword === '' || itemText.includes(lowerKeyword)) {
                item.style.display = 'block';
            } else {
                item.style.display = 'none';
            }
        });
    }

    // 更新价格列表，只显示到目标等级
    function updatePriceList() {
        let targetLevel = parseInt(document.getElementById('targetLevel').value) || 10;
        if (!targetLevel || targetLevel > itemInfo.pers.length) {
            targetLevel = itemInfo.pers.length
        }
        const priceList = document.getElementById('priceList');
        // 当前物品信息
        itemInfo = itemProbabilities[selectedItem];
        //材料列表
        let requires = itemInfo["requires"]
        //保护物品
        let protectes = itemInfo["protectes"]

        //历史选择
        let protectedItem = protectedItems[selectedItem]
        if (!protectedItem) {
            protectedItem = {}
            for (let i = 2; i < itemInfo.pers.length; i++) {
                protectedItem[i] = protectes[i].includes('星辉精华') ? '星辉精华' : protectes[i][0]
            }
            protectedItems[selectedItem] = protectedItem
            GM_setValue("protectedItems", protectedItems)
        }

        priceList.innerHTML = '';

        // 强化材料
        allRequireNames = new Set();
        for (let i = 0; i < requires.length; i++) {
            requires[i].forEach(i => {
                if (i["res"]) {
                    allRequireNames.add(i["res"])
                }
            })
        }

        for (let protecteList of protectes) {
            for (let protecte of protecteList) {
                if (protecte) {
                    allRequireNames.add(protecte)
                }
            }
        }

        for (let requireName of allRequireNames) {
            let marketPrice = 0;

            if (miaomiaoTools) {
                marketPrice = unsafeWindow.marketPrices[unsafeWindow.itemCnEn[requireName]]?.sellOrders?.minPrice || 0
            }

            let resPrice = resPrices[requireName] || 0
            if ((marketPrice && marketPrice != resPrice) || !resPrice) {
                resPrice = marketPrice
                resPrices[requireName] = marketPrice
                GM_setValue('resPrices', resPrices);
            }
            const item = document.createElement('div');
            item.className = 'price-item';
            item.innerHTML = `
                    <span class="price-label">${requireName}</span>
                    <input type="number" class="price-input" id="require-${requireName}" data-require="${requireName}" value="${resPrice}"  min="0" step="1">
            `;
            priceList.appendChild(item);

            // 为新添加的输入框添加事件监听器
            const input = document.getElementById(`require-${requireName}`);
            input.addEventListener('input', function () {
                resPrices[requireName] = parseInt(this.value) || 0;
                GM_setValue('resPrices', resPrices);
            });

        }
        //保护物品选择 protectes
        for (let i = 2; i < targetLevel; i++) {
            const item = document.createElement('div');
            item.className = 'price-item';
            const protecteList = protectes[i]
            item.innerHTML = `
                    <span class="price-label"   >${i}→${i + 1}保护</span>
                    <div class="search-select">
                        <input type="text" class="search-input" style="width: 140px; float:right;" autocomplete="off" id="protecte-${i}" placeholder="搜索或选择物品" value="${protectedItem[i]}">
                        <div class="search-protected" id="protecteItems-${i}" >
                            ${protecteList.map(item =>
                `<div class="search-protected-item search-protected-item-${i} ${item === protectedItem[i] ? 'selected' : ''}" data-item="${item}" >${item}</div>`
            ).join('')}
                        </div>
                    </div>
            `;
            priceList.appendChild(item);

            // 物品搜索功能
            const protecteInput = document.getElementById(`protecte-${i}`);
            const protecteItems = document.getElementById(`protecteItems-${i}`);

            // 点击搜索框显示结果
            protecteInput.addEventListener('click', function (e) {
                e.stopPropagation();
                protecteItems.style.display = 'block';
                filterItems('', document.querySelectorAll(`.search-protected-item-${i}`)); // 显示所有项目
            });

            // 输入搜索内容
            protecteInput.addEventListener('input', function () {
                filterItems(this.value, document.querySelectorAll(`.search-protected-item-${i}`));
            });

            // 点击选择项目
            document.querySelectorAll(`.search-protected-item-${i}`).forEach(item => {
                item.addEventListener('click', function () {
                    const clickProtectedItem = this.getAttribute('data-item');
                    protecteInput.value = clickProtectedItem;
                    let protectedItem = protectedItems[selectedItem]
                    if (!protectedItem) {
                        protectedItem = {}
                        protectedItems[selectedItem] = protectedItem;
                    }
                    protectedItem[i] = clickProtectedItem || '';
                    GM_setValue('protectedItems', protectedItems);
                    // 隐藏结果列表
                    protecteItems.style.display = 'none';
                    // 更新选中状态
                    document.querySelectorAll(`.search-protected-item-${i}`).forEach(i => {
                        i.classList.remove('selected');
                    });

                    this.classList.add('selected');
                });
            })

            // 点击页面其他地方关闭搜索结果
            document.addEventListener('click', function () {
                protecteItems.style.display = 'none';
            });

            // 防止点击结果列表时关闭
            protecteItems.addEventListener('click', function (e) {
                e.stopPropagation();
            });
        }
    }

    // 获取考虑强化等级的实际概率
    function getActualProbabilities() {
        return currentProbabilities.map((prob, index) => {
            return Math.min(1, (prob + (luckLevel - 1) * 0.002 + enhancementLevel * 0.00125) * (isEnhancementExpert ? 1.2 : 1));
        });
    }
    // 马尔可夫链计算函数
    function calculateEnhancement(p, protectLevel, targetLevel) {
        const actualProbabilities = p;
        const n = Math.min(targetLevel, actualProbabilities.length);
        const states = n + 1; // 0到n级


        // 构建状态转移矩阵
        const transitionMatrix = Array.from({ length: states }, () => new Array(states).fill(0));

        for (let i = 0; i < n; i++) {
            if (i === 0) {
                transitionMatrix[0][1] = actualProbabilities[0]; // 0→1成功率
                transitionMatrix[0][0] = 1 - actualProbabilities[0]; // 0级失败仍为0级
            } else if (i >= protectLevel) {
                transitionMatrix[i][i + 1] = actualProbabilities[i]; // 成功i→i+1
                transitionMatrix[i][i - 1] = 1 - actualProbabilities[i]; // 保护等级：失败降一级
            } else {
                transitionMatrix[i][i + 1] = actualProbabilities[i]; // 成功i→i+1
                transitionMatrix[i][0] = 1 - actualProbabilities[i]; // 非保护：失败回0级
            }
        }
        transitionMatrix[n][n] = 1; // 目标等级是吸收态

        // 计算从每个状态开始达到目标的期望尝试次数
        const E = new Array(states).fill(0);
        E[n] = 0; // 目标等级不需要尝试

        // 使用高斯-赛德尔迭代法求解线性方程组
        let maxIterations = 1000;
        let tolerance = 1e-6;
        let iter = 0;
        let diff = 0;

        do {
            diff = 0;
            for (let i = 0; i < n; i++) {
                let newE = 1; // 本次尝试
                for (let j = 0; j < states; j++) {
                    newE += transitionMatrix[i][j] * E[j];
                }
                diff = Math.max(diff, Math.abs(newE - E[i]));
                E[i] = newE;
            }
            iter++;
        } while (diff > tolerance && iter < maxIterations);

        // 构建基本矩阵 (I - Q)，其中Q是除吸收态外的转移矩阵
        const Q = [];
        for (let i = 0; i < states - 1; i++) {
            Q[i] = [];
            for (let j = 0; j < states - 1; j++) {
                Q[i][j] = transitionMatrix[i][j];
            }
        }

        // 构建单位矩阵
        const I = Array.from({ length: states - 1 }, (_, i) =>
            Array.from({ length: states - 1 }, (_, j) => i === j ? 1 : 0)
        );

        // 计算 (I - Q)
        const IminusQ = [];
        for (let i = 0; i < states - 1; i++) {
            IminusQ[i] = [];
            for (let j = 0; j < states - 1; j++) {
                IminusQ[i][j] = I[i][j] - Q[i][j];
            }
        }

        // 矩阵求逆函数
        function matrixInverse(matrix) {
            const n = matrix.length;
            const augmented = [];

            // 创建增广矩阵 [A | I]
            for (let i = 0; i < n; i++) {
                augmented[i] = [...matrix[i]];
                for (let j = 0; j < n; j++) {
                    augmented[i][j + n] = i === j ? 1 : 0;
                }
            }

            // 高斯-约旦消元法
            for (let i = 0; i < n; i++) {
                // 寻找主元
                let maxRow = i;
                for (let k = i + 1; k < n; k++) {
                    if (Math.abs(augmented[k][i]) > Math.abs(augmented[maxRow][i])) {
                        maxRow = k;
                    }
                }

                // 交换行
                [augmented[i], augmented[maxRow]] = [augmented[maxRow], augmented[i]];

                // 检查矩阵是否可逆
                if (augmented[i][i] === 0) {
                    throw new Error("Matrix is singular and cannot be inverted.");
                }

                // 归一化主元行
                const pivot = augmented[i][i];
                for (let j = 0; j < 2 * n; j++) {
                    augmented[i][j] /= pivot;
                }

                // 消元
                for (let k = 0; k < n; k++) {
                    if (k !== i) {
                        const factor = augmented[k][i];
                        for (let j = 0; j < 2 * n; j++) {
                            augmented[k][j] -= factor * augmented[i][j];
                        }
                    }
                }
            }

            // 提取逆矩阵
            const inverse = [];
            for (let i = 0; i < n; i++) {
                inverse[i] = augmented[i].slice(n);
            }

            return inverse;
        }

        // 计算基本矩阵的逆 (I - Q)^-1
        const N = matrixInverse(IminusQ);

        // 计算状态访问次数
        const visits = new Array(states).fill(0);
        for (let i = 0; i < states - 1; i++) {
            visits[i] = N[0][i]; // 第一行表示从状态0开始的访问次数
        }

        // 计算各阶段统计数据
        const stats = [];
        let totalAttempts = 0;
        let protectedAttempts = 0;
        let totalCost = 0;
        resPrices
        protectedItems

        const requiresMap = {}
        for (let i = 0; i < n; i++) {
            // 尝试次数 = 状态i的访问次数 × 从状态i转移出去的总概率
            let attempts;
            if (i === 0) {
                // 对于0级，直接使用访问次数作为尝试次数
                attempts = visits[i];
            } else {
                // 对于其他级别，使用原公式
                attempts = visits[i] / (1 - transitionMatrix[i][i]);
            }
            const successes = visits[i] * transitionMatrix[i][i + 1];
            const failures = visits[i] * (1 - transitionMatrix[i][i + 1]);

            // 计算包含保护价格的成本
            const isProtected = i >= protectLevel;
            if (i >= protectLevel) {
                let protectName = protectedItems[selectedItem][i]
                let protectNum = requiresMap[protectName] || 0
                requiresMap[protectName] = protectNum + attempts
            }
            //材料个数
            let requires = itemInfo['requires'][i]
            for (let require of requires) {
                let requireName = require['res']
                let requireNum = requiresMap[requireName] || 0
                requiresMap[requireName] = requireNum + require['count'] * attempts
            }

            stats.push({
                stage: `${i}→${i + 1}`,
                attempts: attempts,
                successes: successes,
                failures: failures,
                successRate: transitionMatrix[i][i + 1] * 100,
                isProtected: isProtected
            });

            totalAttempts += attempts;

            // 计算保护等级以上的尝试次数
            if (i >= protectLevel) {
                protectedAttempts += attempts;
            }
        }

        // 计算材料个数 价格
        Object.entries(requiresMap).forEach(([key, value]) => {
            totalCost += resPrices[key] * value;
        });

        return {
            expectedValue: E[0],
            stats: stats,
            totalAttempts: totalAttempts,
            protectedAttempts: protectedAttempts,
            requiresMap: requiresMap,
            totalCost: totalCost
        };
    }

    // 计算所有保护等级
    function calculateAll() {
        const enhanceTime = parseFloat(document.getElementById('enhanceTime').value) || 2;
        const targetLevel = parseInt(document.getElementById('targetLevel').value) || 10;
        const resultsBody = document.getElementById('resultsBody');
        const resultsThead = document.getElementById('resultsThead');
        resultsBody.innerHTML = '';

        // 保存设置
        saveSettings(enhanceTime, targetLevel);

        let minCost = Infinity;
        let minCostProtectLevel = -1;
        const results = [];

        const p = getActualProbabilities()
        // 先计算所有结果以找到最小消耗
        for (let protectLevel = 2; protectLevel <= targetLevel; protectLevel++) {
            const result = calculateEnhancement(p, protectLevel, targetLevel);
            results.push({ protectLevel, result });

            if (result.totalCost < minCost) {
                minCost = result.totalCost;
                minCostProtectLevel = protectLevel;
            }

        }

        //头加材料
        const tempTh = document.querySelectorAll('.temp-th')
        tempTh.forEach(th => th.remove())
        for (let require of allRequireNames) {
            const row = document.createElement('td');
            row.classList.add('res-th');
            row.classList.add('temp-th');
            row.textContent = require;
            resultsThead.firstElementChild.appendChild(row);
        }

        // 显示结果并高亮最小消耗
        results.forEach(({ protectLevel, result }) => {
            // 计算总时间（分钟）
            const totalTime = (result.totalAttempts * enhanceTime) / 60;

            const row = document.createElement('tr');
            row.className = protectLevel === minCostProtectLevel ? 'highlight-row' : '';
            row.innerHTML = `
                <td class="res-td">${protectLevel === targetLevel ? `${targetLevel}级（不保护）` : protectLevel + '级'}</td>
                <td class="res-td">${Math.round(result.totalCost).toLocaleString()}</td>
                <td class="res-td">${result.totalAttempts.toFixed(2)}</td>
                <td class="res-td">${result.protectedAttempts.toFixed(2)}</td>
                <td class="res-td">${totalTime.toFixed(2)}</td>
                <td class="res-td"><button class="expand-btn" data-protect="${protectLevel}">查看详情</button></td>
                    ${[...allRequireNames].map(item =>
                `<td class="res-td">${(result['requiresMap'][item] || 0).toFixed(2)}</td>`
            ).join('')}
            `;
            resultsBody.appendChild(row);

            // 添加详情行
            const detailRow = document.createElement('tr');
            detailRow.className = 'detail-row';
            detailRow.id = `detail-${protectLevel}`;
            detailRow.innerHTML = `
                <td colspan="6">
                    <div class="detail-table-container">
                        <table class="detail-table">
                            <thead>
                                <tr>
                                    <th>强化阶段</th>
                                    <th>尝试次数</th>
                                    <th>保护</th>
                                    <th>成功次数</th>
                                    <th>失败次数</th>
                                    <th>成功率(%)</th>
                                </tr>
                            </thead>
                            <tbody id="detail-body-${protectLevel}">
                                <!-- 详细数据将在这里显示 -->
                            </tbody>
                        </table>
                    </div>
                </td>
            </tr>
            `;
            resultsBody.appendChild(detailRow);

            // 填充详细数据
            const detailBody = document.getElementById(`detail-body-${protectLevel}`);
            result.stats.forEach(stat => {
                const detailRow = document.createElement('tr');
                detailRow.innerHTML = `
                    <td>${stat.stage}</td>
                    <td>${stat.attempts.toFixed(2)}</td>
                    <td>${stat.isProtected ? '是' : '否'}</td>
                    <td>${stat.successes.toFixed(2)}</td>
                    <td>${stat.failures.toFixed(2)}</td>
                    <td>${stat.successRate.toFixed(2)}</td>
                `;
                detailBody.appendChild(detailRow);
            });

            //updateScrollIndicator()
        });

        // 添加展开/收起事件
        document.querySelectorAll('.expand-btn').forEach(btn => {
            btn.addEventListener('click', function () {
                const protectLevel = this.getAttribute('data-protect');
                const detailRow = document.getElementById(`detail-${protectLevel}`);
                const isExpanded = detailRow.style.display === 'table-row';

                detailRow.style.display = isExpanded ? 'none' : 'table-row';
                this.textContent = isExpanded ? '查看详情' : '收起详情';
            });
        });

        // 获取表格容器和滚动指示器
        const tableContainer = document.querySelector('.table-container');
        const scrollIndicator = document.getElementById('scrollIndicator');
        // 监听滚动事件
        //tableContainer.addEventListener('scroll', updateScrollIndicator);
        // 初始化
        //();
    }

    // 保存设置
    function saveSettings(enhanceTime, targetLevel) {
        GM_setValue('enhanceTime', enhanceTime);
        GM_setValue('targetLevel', targetLevel);
        GM_setValue('prices', prices);
        GM_setValue('selectedItem', selectedItem);
        GM_setValue('enhancementLevel', enhancementLevel);
    }

    // 加载设置
    function loadSettings() {
        miaomiaoTools = unsafeWindow.marketPrices && unsafeWindow.itemCnEn
        console.log(`强化模拟器${miaomiaoTools ? '已' : '未'}加载妙妙工具`)

        const enhanceTime = GM_getValue('enhanceTime', 2);
        const targetLevel = GM_getValue('targetLevel', 10);
        const savedPrices = GM_getValue('prices', null);
        const savedItem = GM_getValue('selectedItem', null);
        const savedEnhancementLevel = GM_getValue('enhancementLevel', null);

        document.getElementById('enhanceTime').value = enhanceTime;
        document.getElementById('targetLevel').value = targetLevel;
        document.getElementById('enhancementLevel').value = savedEnhancementLevel !== null ? savedEnhancementLevel : enhancementLevel;

        // 更新强化等级
        enhancementLevel = savedEnhancementLevel !== null ? savedEnhancementLevel : enhancementLevel;

        // 恢复保存的物品选择
        if (savedItem && itemProbabilities[savedItem]) {
            selectedItem = savedItem;
            itemInfo = itemProbabilities[selectedItem];
            currentProbabilities = itemInfo['pers'];
            document.getElementById('itemSearch').value = selectedItem;

            // 更新选中状态
            document.querySelectorAll('.search-result-item').forEach(item => {
                if (item.getAttribute('data-item') === selectedItem) {
                    item.classList.add('selected');
                } else {
                    item.classList.remove('selected');
                }
            });
        }

        // 恢复保存的价格
        if (savedPrices && savedPrices.length === prices.length) {
            prices = savedPrices;
        }

        // 更新价格列表显示
        updatePriceList();

        // 恢复还原按钮位置
        const restoreBtn = document.getElementById('restore-simulator');
        const restoreBtnX = GM_getValue('restoreBtnX', null);
        const restoreBtnY = GM_getValue('restoreBtnY', null);

        if (restoreBtnX !== null && restoreBtnY !== null) {
            restoreBtn.style.left = `${restoreBtnX}px`;
            restoreBtn.style.top = `${restoreBtnY}px`;
            restoreBtn.style.right = 'auto'; // 清除右侧定位
        }
    }

    // 页面加载完成后创建UI
    window.addEventListener('load', function () {
        // 延迟创建以确保页面完全加载
        setTimeout(createUI, 1000);
    });
})();
