// ==UserScript==
// @name           SL-lexicon
// @name:ru        СЛ-лексикон
// @namespace      Reshpekt Fund Russia
// @author         Reshpekt Fund Russia (based on erosman's script)
// @description    Edits out or highlights bad words
// @description:ru Вымарывает слова из текста (мат и проч.) или, наоборот, их подсвечивает
// @version        0.6
// @include        http://smart-lab.ru/*
// @include        https://smart-lab.ru/*
// @exclude        http://smart-lab.ru/uploads/*
// @grant          GM_registerMenuCommand
// @grant          GM_setValue
// @grant          GM_getValue
// @noframes
// @downloadURL https://update.greasyfork.org/scripts/8535/SL-lexicon.user.js
// @updateURL https://update.greasyfork.org/scripts/8535/SL-lexicon.meta.js
// ==/UserScript==

(function () {

if (!document.querySelectorAll('div.content').length || !document.querySelector('#content')) {
    return;
}

var w = [
     'абасц|авотхуй|акуе|амербыдл|амерзи|америкос|амерукробыдло|анал |анал.|анальн|анус|асерикос|ахуе|ах@е|ах.е|'
    ,'бандеров|бандер|бендеров|безмозгл|белоленточн|белолентошн|бзд|блеа|блева|блевот|блять|блядь|бляд|бля|бл@|бл.|бл*|бл…|'
    ,'болван|ботокс|бредятин|быдло|быдл|бэндеров|'
    ,'вагин|вальцман|ватник|ватн|вата|вате |ватой|ватот|вату |ваты|вахуе|вздрюч|взъеб|взъёб|вонюта|вонюч|воня|впадлу|'
    ,'выбляд|выёб|выеб|выкормыш|выродк|выродо|высра|высер|вышеват|вышиват|вьеб|въеб|вьёб|въёб|'
    ,'гавн|гадёныш|гадин|галим|гамасек|гамася|гандон|геев|гейроп|гейевроп|гейвроп|гей |геи|геляк|геям|героям сал|'
    ,'гидн|гиляк|гнид|гниль|гной|гнус|говен|говён|говно|говн|г@вн|голим|гомик|гомопед|гомосек|гомося|гондон|гопот|госдеп|гос деп|гребан|грёбан|гуано|гусск|гэбн|гэбух|гэбэшн|'
    ,'даунбас|даун |дауна|дауне|дауно|дауну|дауны|дебил|дегенера|дерьм|дибил|длбб|доеба|докуя|долбаёб|долбаеб|долбан|долбоёб|долбоеб|долбо|долпаеп|долпоеп|долпоёп|домбабв|'
    ,'донбабв|допиз|дохуя|дох*|дроч|дурач|дурень|дурилк|дурик|дурни|дуроч|дурынд|'
    ,'еблан|ебли|ебл|ебну|ёбну|ебан|ебаш|еба|ебе|ебё|еби|ебт|ебу|еб@|е@а|ёба|еб.|еб…|ёб|еб |едробот|едр|елд|епт|ёпт|еп |ёп |'
    ,'жепп|жидо-бандер|жидо–бандер|жидобандер|жидо-бендер|жидо–бендер|жидобендер|жидомас|жида|жидв|жиде|жидов|жидо|жиды|жид |жид.|жид,|жополиз|жоп|журнашлю|'
    ,'задниц|задолб|задрач|задрот|заеб|заёб|з@еб|зае*|за*б|за.б|задро|заеп|заёп|зазомби|залупн|залуп|запутин|засир|заср|засс|захуя|за яйц|злоебуч|зомбир|зомби|зомб|'
    ,'идинах|идиёт|идиот|изнасил|изьебн|изъебн|имбец|имбиц|ипан|ипат|ипет|ипёт|иплан|испражн|ихн|йобан|йоб|йоп|'
    ,'кагтав|казл|какл|какол|капец|карател|кацап|кизд|колорад|кончены|конченны|кремлебля|кремлебот|кремлежул|кремляд|кретин|крымнаш|куев|куесос|куйн|куйл|кули |кую|куя|'
    ,'лашар|либераст|либерас|либераш|либересн|либерой|либерос|лосейник|лохам|лохов|лох |лохи |лоху |лошар|лошо|лошк|лошь|лугандон|'
    ,'майдани|майданут|майдаун|мандавош|манда|манду|маскал|маразмати|медвепут|мерзав|мерзк|мерзост|мерзо|млеат|мля|москал|москол|мраз|мразот|мудак|мудач|муде|мудо|мудил|мудн|мудо|муйн|мурло|муфл|'
    ,'наглосакс|наебка|наёбка|наеб|наёб|наеп|наёп|нае.|нае@|нае*|наё.|наё@|наговн|наипа|наипу|накер|накуа|накуй|на куй|напизд|насилов|насилуе|насилую|насра|насс|настоеб|'
    ,'насца|нахер|нахрен|нахуй|нахую|нахуя|наXYй|на*уй|на@уй|н@х|нах |нах.|нах,|нах*|нацист|нацик|нацык|нашист|невъеб|невьеб|недобзд|недоеб|недоёб|недонос|недоумк|недоумок|неип|нехрен|неху|нех |нех.|нихуя|них*|новоотсос|'
    ,'обасц|обиженк|обконч|обосра|обоср|обосс|обосц|обсер|обсёр|обсир|обсос|оккупант|окуе|олигофр|ольгин|онани|опущенн|остопизд|отдроч|отпид|отпизд|отреб|отродье|отсос|отхуя|отъеб|охуе|охуи|ох@е|ох.е|ох*е|'
    ,'падлюк|падл|парашенк|параша|параше|параши|парашк|парашн|парашу|пархат|паскуд|пацреот|педарас|педерас|педик|педри|пездец|пезд|пёзд|пенди|пендос|пендо|перд|перееб|перемог|перебзд|перзи|перни|пёрни|перну|пёрну|песд|песту|петуш|печеньк|пздц|'
    ,'пидар|пидер|пидор|пид.р|пид*р|пид@р|пиздец|пиздабол|пизд|пи.д|пи@д|пиз.|пиз@|пи.дец|пилять|пиндос|пипец|писец|писд|писта|писте|пистой|писту|пистош|письк|пля |плят|плятск|'
    ,'пнх|подлец|поган|подлос|подон|подпиндос|подстилк|подьёб|подъёб|подьеб|подъеб|подьёп|подъёп|подъёп|подьеп|подпёзд|поеб|полудур|пополче|попочлен|порашенк|пороженк|поросенк|поросн|портян|посса|потрах|потрош|похер|похна|похрен|похуй|похуи|поXY|пох.|пох,|пох |поцреот|поцриот|'
    ,'правосек|праститут|предател|придур|приеба|припизд|прихвост|пробандер|пробендер|пробля|проеб|проёб|проеп|проёп|промайдан|промудо|пропагандон|пропагандо|пропендос|пропиндос|пропогандо|просра|просре|просрё|просри|просру|пр@ср|проститу|профашист|прошманд|псин|пскак|птнхло|птнхуйл|пуй|пукн|пука|'
    ,'пукин|пук |путен|путивизор|путикантроп|путиниз|путинис|путинои|путинолиз|путлер|путло|путлу|путяр|пшнх|пшлнх|пшлнхй|пэрэмог|'
    ,'разъеб|разъёб|распизд|расхерач|расхуя|рашист|рашка|рашкой|рашку|рашоватн|роисс|руззк|руина|руине|руину|руиной|русопенд|русофобопендо|русофопендо|русофоб|рюззк|'
    ,'садоми|сало урон|салобот|салоед|сасн|сбляд|свидоми|сведом|свидом|свиней|свино|свинь|сволоч|сдрис|сдрыс|скотин|скрымзд|содоми|сортире|сортир |соса|сосни|соснул|'
    ,'сперм|спизд|спизж|спижж|списд|спист|спыжж|срал|сранкци|сран|срак|срат|срачлаб|срач-лаб|срач|срет|срёт|срут|срыг|ссан|сса|ссык|ссыт|ссы |ссыс|ссыш|ссыщ|ссуч|ссу|стекловат|'
    ,'сука|суке|суки|сурковск|сучк|сучар|сучен|сучён|сучь|схуя|сцук|сыкл|сьеб|съёб|сьеп|съёп|сьяп|съяп'
    ,'тварь|твари|тваре|тваря|терпил|титуш|трочев|трочи|трупчин|туповат|тупа|тупе|тупиц|тупо|тупы|'
    ,'ублюд|уеб|уёб|укражоп|укроамергей|укроп|укров|укрожоп|укрозомб|укры |укры.|укры,|укробот|укротрол|укрофаш|упизд|упоро|упыр|урин|уркаин|уродин|уроды|урод|уруин|усира|усраин|усруи|усри|усса|уссы|USраин|USруин|ушлеп|ушлёп|'
    ,'фашист|фаши|фуфел|фуфл|'
    ,'херн|хероям сал|херач|херо|херчик|херли|хер |хитрожоп|хню|холу|хохлобаран|хохлобля|хохлобот|хохлосрач|хохло|хохлянд|хохля|хохл|хуепл|хуесос|хуе|хуё|хуи|хуйло|хуй|х.й|х.я|х*й|*уй|хуя|XYй|XУЙ|хую|хули |хуле|хунт|хутинуй|хутин|хэроям сал|хэр|'
    ,'целка|целке|целкой|целку|'
    ,'чепуши|членосос|чмартлаб|чмар|чмо|чмыр|чухан|'
    ,'шавк|шакал|швал|шизоид|шизофрен|шизик|шиз|шлаковат|шлюх|шлюшк|шмар|шпротн|шпрото|шпрот |шушер|'
    ,'явахуе|яиценюх|яйценюх'
].join('');

w = w.replace(/[-\/\\^$*+?.()[\]{}]/g, '\\$&');

var p = new RegExp('(^|\\s|"|«|-|–|\\.|\\+|&|\\*|@|#|\\/|\\()(' + w + ')', 'gi'),
    k = null;

function P(v, d, m, p) {
    GM_registerMenuCommand(m, function () {
        var val = prompt(p, GM_getValue(v, d));
        if (!val) return;
        GM_setValue(v, val);
        location.reload();
    });
}

P('SL-Lexicon-style',
    '1',
    'СЛ-лексикон - настройка стиля',
    'Стили, введите число:\r\n\r\n' +
     '1 - размытый (по умолчанию)\r\n' +
     '2 - подчёркнутый\r\n' +
     '3 - прозрачный\r\n' +
     '4 - чёрный\r\n' +
     '5 - красный\r\n' +
     '6 - точки (безвозвратно)'
);

var st,
    s1 = '.Lexicon{color:transparent;cursor:default;text-shadow:0px 0px 7px rgba(0,0,0,0.8);' +
         'cursor:default}.Lexicon:hover{text-shadow:none;color:#101010}',
    s2 = '.Lexicon{display:inline-block;position:relative;top:-4px;color:transparent;' +
         'border-bottom:1px solid #000;cursor:default}.Lexicon:hover{color:#000;' +
         'border-bottom:1px solid transparent;top:0px}',
    s3 = '.Lexicon{padding:0 2px 1px;color:transparent;border-radius:5px;border:1px solid #ccc;' +
         'cursor:default}.Lexicon:hover{color:#000}',
    s4 = '.Lexicon{padding:0 2px 1px;color:#262626;background-color:#262626;border-radius:5px;' +
         'box-shadow:0px 0px 2px rgba(200,200,200,0.4);cursor:default}.Lexicon:hover{color:#ccc}',
    s5 = '.Lexicon{padding:0 2px 1px;color:#fff;background-color:darkred;border-radius:5px;' +
         'box-shadow:0px 0px 2px rgba(200,200,200,0.4)}',
    s6 = '.Lexicon{color:red;}';

switch (GM_getValue('SL-Lexicon-style')) {
    case '1':
        st = s1; break;
    case '2':
        st = s2; break;
    case '3':
        st = s3; break;
    case '4':
        st = s4; break;
    case '5':
        st = s5; break;
    case '6':
        st = s6; k = 1; break;
    default:
        st = s1;
  }

(function (st) {
    try {
        var h = document.getElementsByTagName('head')[0],
            s = document.createElement('style');
        s.type = 'text/css';
        h.appendChild(s);
        s.innerHTML = st;
    } catch (e) {
        if (!document.styleSheets.length) {
            document.createStyleSheet();
        }
        document.styleSheets[0].cssText += st;
    }
})(st);

var t = document.querySelector('div.comments');

if (t) {
    var observer = new MutationObserver(function (mutations) {
        mutations.forEach(function (mutation) {
            for (var i = 0; i < mutation.addedNodes.length; ++i) {
                if (mutation.addedNodes[i].nodeType == 1 &&
                    mutation.addedNodes[i].className.indexOf === 'comment ') {
                        F(mutation.addedNodes[i]);
                }
            }
        });
    });
    observer.observe(t, {childList: true, subtree: true});
}

function F(el) {
    if (!el) return;
    var s  = document.createElement('span'),
        sE = document.evaluate(
          ['.//text()[normalize-space() != "" ',
           'and not(ancestor::style) ',
           'and not(ancestor::script) ',
           'and not(ancestor::iframe) ',
           'and not(ancestor::textarea) ',
           'and not(ancestor::code) ',
           'and not(ancestor::a) ',
           'and not(ancestor::h1) ',
           'and not(ancestor::input) ',
           'and not(ancestor::pre) ',
           'and not(ancestor::div[attribute::class="info"]) ',
           'and not(ancestor::ul[attribute::class="action"]) ',
           'and not(ancestor::ul[attribute::class="tags"]) ',
           'and not(ancestor::div[attribute::class="header"]) ',
           'and not(ancestor::div[attribute::id="pagination"])]'
          ].join(''), el, null, XPathResult.UNORDERED_NODE_SNAPSHOT_TYPE, null);
    if (!sE.snapshotItem(0)) return;
    for (var i = 0, len = sE.snapshotLength; i < len; ++i) {
        var n = sE.snapshotItem(i),
            t = n.nodeValue,
            sp;
        if (p.test(t)) {
            if (n.className != 'Lexicon' && n.parentNode.className != 'Lexicon') {
                sp = s.cloneNode(true);
                sp.innerHTML = (k ? t.replace(p, R) : t.replace(p, '$1<span class="Lexicon">$2</span>'));
                n.parentNode.replaceChild(sp, n);
            }
        }
    }
}

function R(s, p1, p2) {
    return (p1 + p2.charAt(0) + '<span class="Lexicon">' + 
      p2.substr(1).replace(/./g, '.') + '</span>');
}

F(document.querySelector('#content'));

})();